{
  "copyright_text": "Standard YouTube License",
  "description": "In this talk I would show how I used open source tools like Moloch, Wireshark, Bokeh and Jupyter to analyse my home network data for the day. Not just the volume of data generated daily, but how interesting it is to leverage data tools to discover when your network is experiencing downtime which could be as a result of packet loss, poorly placed Access points or just proximity away from your rout\n\n**Abstract**\n\nFor every button on the webpage that is clicked , for every picture uploaded; There is a tremendous amount of data that goes over every network from users data via phones , tablets or even computers accessing a youtube or netflix Data center, to sending larger traffic between different Virtual Machines. But how does one actually analyze this volume of data sent.\n\nNetwork data analysis can go a long way in helping users find out the inefficiencies in their network. Understanding Networks makes for a very strong foundation on what everything else is built upon.\n\nIn this talk I will cover the basics of :\n\n- An IP Packet data analysis: the basic and most fundamental thing everything on a network builds upon. A packet can carry a lot of information and interesting details about behavioural habits of a user or even attributes of a device. Understanding the nature of the IP packet data leads to a larger understanding of Networks when analysed on a scale. And like the data rule of thumb the more data over a period of time you’re able to learn from the better, and more accurate your intelligence become.\n- Evaluating your local network using visualisation tools like IPython Notebook and Bokeh.\n- Gathering insights from the data to answer questions like How much data on an average do I generate on a daily basis? Why is my network slow ? Am I really getting what was promised from my Service Provider ?, what applications do I spend the most of my bandwidth on ? Why is my network experiencing down time? How can I automate the process of analysing my network data and much more.\n\n",
  "duration": 1800,
  "language": "eng",
  "recorded": "2017-06-30",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/berlin2017/schedule/"
    }
  ],
  "speakers": [
    "Aisha Bello"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ibNmVzaMRdM/maxresdefault.jpg",
  "title": "Spying on my Network for a Day: Data Analysis for Networks",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ibNmVzaMRdM"
    }
  ]
}
