{
  "copyright_text": "Standard YouTube License",
  "description": "Wikidata is a Knowledge Base where anybody can add new information. Unfortunately, it is targeted by vandals, who put inaccurate or offensive information there. To fight them, Wikidata employs moderators, who manually inspect each suggested edit. In this talk we will look into how we can use Machine Learning to automatically detect vandalic revisions and help the moderators.\n\n**Abstract**\n\nKnowledge bases are an important source of information for many AI system: they rely on the bases for enriching the information they process to make better user experience. Obtaining such Knowledge Bases is difficult, and which is why this process is crowd-sourced. One of such bases is Wikidata: they allow everybody on the Internet to edit the content and add new information.\n\nUnfortunately, Wikidata is often targeted by vandals, who misuse the system and put false or offensive information there. This may lead to incorrect behaviour of the AI systems. To keep the base clean, Wikidata employs moderators who manually inspect each revision and revert vandalic ones.\n\nTo help moderators fight vandals, the organizers of WSDM Cup 2017 challenged the participants to build a Machine Learning model which automatically detects if an edit should be rolled back. In this talk we will discuss the second place solution to the Cup: how to process half of terabyte of revisions, extract meaningful features and create a production ready model that scales to a large number of testing examples.\n\n",
  "duration": 1928,
  "language": "eng",
  "recorded": "2017-06-30",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/berlin2017/schedule/"
    }
  ],
  "speakers": [
    "Alexey Grigorev"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/iOJRFsG3r9k/maxresdefault.jpg",
  "title": "Large Scale Vandalism Detection in Knowledge Bases",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iOJRFsG3r9k"
    }
  ]
}
