{
  "copyright_text": "Standard YouTube License",
  "description": "Barbara Plank is tenured Assistant Professor in Natural Language Processing at the University of Groningen, The Netherlands.\n\nHer research focuses on cross-domain and cross-language NLP. She is interested in robust language technology, learning under sample selection bias (domain adaptation, transfer learning), annotation bias (embracing annotator disagreements in learning), and generally, semi-supervised and weakly-supervised machine learning for a variety of NLP tasks and applications, including syntactic processing, opinion mining, information and relation extraction and personality prediction.\n\nNatural Language Processing: Challenges and Next Frontiers\n\nDespite many advances of Natural Language Processing (NLP) in recent years, largely due to the advent of deep learning approaches, there are still many challenges ahead to build successful NLP models. In this talk I will outline what makes NLP so challenging. Besides ambiguity, one major challenges is variability. In NLP, we typically deal with data from a variety of sources, like data from different domains, languages and media, while assuming that our models work well on a range of tasks, from classification to structured prediction. Data variability is an issue that affects all NLP models. I will then delineate one possible way to go about it, by combining recent success in deep multi-task learning with fortuitous data sources, which allows learning from distinct views and distinct sources. This will be one step towards one of the next frontiers: learning under limited (or absence) of annotated resources, for a variety of NLP tasks.\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 1857,
  "language": "eng",
  "recorded": "2017-07-26",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/berlin2017/schedule/"
    }
  ],
  "speakers": [
    "Barbara Plank"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/JtiCdsESuT0/maxresdefault.jpg",
  "title": "Natural Language Processing: Challenges and Next Frontiers. Q&A",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JtiCdsESuT0"
    }
  ]
}
