{
  "copyright_text": "Standard YouTube License",
  "description": "https://github.com/bhargavvader/personal/tree/master/notebooks/text_analysis_tutorial\n\nThis tutorial will guide you through the process of analysing your textual data through topic modelling - from finding and cleaning your data, pre-processing using spaCy, applying topic modelling algorithms using gensim - before moving on to more advanced textual analysis techniques.\n\n**Abstract**\n\nTopic Modelling is a great way to analyse completely unstructured textual data - and with the python NLP framework Gensim, it's very, very easy to do this. The purpose of this tutorial is to guide one through the whole process of topic modelling - right from pre-processing your raw textual data, creating your topic models, evaluating the topic models, to visualising them. Advanced topic modelling techniques will also be covered in this tutorial, such as Dynamic Topic Modelling, Topic Coherence, Document Word Coloring, and LSI/HDP.\n\nThe python packages used during the tutorial will be spaCy (for pre-processing), gensim (for topic modelling), and pyLDAvis (for visualisation). The interface for the tutorial will be an Jupyter notebook.\n\nThe takeaway from the tutorial would be the participants ability to get their hands dirty with analysing their own textual data, through the entire lifecycle of cleaning raw data to visualising topics.\n\n",
  "duration": 2905,
  "language": "eng",
  "recorded": "2017-06-30",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/berlin2017/schedule/"
    },
    {
      "label": "tutorial material",
      "url": "https://github.com/bhargavvader/personal/tree/master/notebooks/text_analysis_tutorial"
    }
  ],
  "speakers": [
    "Bhargav Srinivasa Desikan"
  ],
  "tags": [
    "tutorial"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ZkAFJwi-G98/maxresdefault.jpg",
  "title": "Topic Modelling (and more) with NLP framework Gensim",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZkAFJwi-G98"
    }
  ]
}
