{
  "copyright_text": "Standard YouTube License",
  "description": "Advances in AI are happening at a tremendous pace, and especially Machine Learning systems are hastily deployed in settings that span as wide as social media, search engines, advertising, military use, and legal systems. At first sight results are often promising, but more and more \"outliers\" are becoming visible as well. Systemic bias in culture, language, or business practices often become intensified: From the Tay-chatbot turning racist, to both Google and Flickr classifying images of African-Americans as \"monkeys\", to discrimination and sexism encoded in language models used for everything from translation, to court sentencing decision. Luckily, initiatives that address some of these concerns is happening through more interpretable models, new privacy regulations, novel privacy-preserving learning algorithms, and researchers and engineers standing up for more just and transparent machine learning models and methods.\n\nThe panel aims to debate these themes with speakers, and the audience, and go beyond the usual \"AI hype\" and discuss both the amazing progress, as well as the setbacks, in making societies better, more humane, and ready for the future!\n\nSpeaking at the panel will be:\n\n- Roelof Pieters, Panel Host, Co-founder at creative.ai\n- Marek Rosa, CEO/CTO at GoodAI\n- Françoise Provencher, Data Team Lead at Shopify\n- Hendrik Heuer, Researcher at Institute for Information Management (ifib) at the University of Bremen\n- Andreas Dewes, Founder at 7scientists\n- Katharine Jarmul, Founder at kjamistan\n\nLink to Q&A: https://youtu.be/uOKhB1_vyAw (Second pyvideo tab)\n\n",
  "duration": 3356,
  "language": "eng",
  "recorded": "2017-06-30",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/berlin2017/schedule/"
    }
  ],
  "speakers": [
    "Roelof Pieters",
    "Marek Rosa",
    "Françoise Provencher",
    "Hendrik Heuer",
    "Andreas Dewes",
    "Katharine Jarmul"
  ],
  "tags": [
    "panel",
    "ethics",
    "machine learning"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/kIsU2bUihwQ/maxresdefault.jpg",
  "title": "Ethics in Machine Learning Panel",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kIsU2bUihwQ"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uOKhB1_vyAw"
    }
  ]
}
