{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "H2O.ai is focused on bringing AI to businesses through software. Its flagship product is H2O, the leading open source platform that makes it easy for financial services, insurance and healthcare companies to deploy machine learning and predictive analytics to solve complex problems.\n\nThis tutorial aims to demonstrate the basic usage of H2O with worked examples in Python.\n\n**Abstract**\n\nAbout H2O.ai\n\nH2O.ai is focused on bringing AI to businesses through software. Its flagship product is H2O, the leading open source platform that makes it easy for financial services, insurance and healthcare companies to deploy machine learning and predictive analytics to solve complex problems. More than 8,500+ organizations and 75,000+ data scientists depend on H2O for critical applications like predictive maintenance and operational intelligence. The company accelerates business transformation for 107 Fortune 500 enterprises, 8 of the world’s 12 largest banks, 7 of the 10 largest auto insurance companies and all 5 major telecommunications providers. Notable customers include Capital One, Progressive Insurance, Transamerica, Comcast, Nielsen Catalina Solutions, Macy's, Walgreens, Kaiser Permanente, and Aetna.\n\nThis tutorial aims to demonstrate the basic usage of H2O with worked examples in Python. Code and data for the worked examples will be provided.\n\nLearning Objectives\nBy the end of the tutorial, participants will be able to:\n\n- Start and connect to a local H2O cluster from Python.\n- Start and connect to H2O cluster(s) on the cloud (e.g. AWS) (i.e. straight-forward distributed machine learning)\n- Import data from Python data frames, local files or web.\n- Perform basic data transformation and exploration.\n- Train classification and regression models using H2O machine learning algorithms.\n- Evaluate model performance and make predictions.\n\nAgenda\n\n- About H2O.ai\n- H2O machine learning platform & algorithms\n- H2O + Python API\n- Basic Extract, Transform and Load (ETL) procedures\n- Worked examples: classification and regression\n\n",
  "duration": 4226,
  "language": "eng",
  "recorded": "2017-06-30",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/berlin2017/schedule/"
    }
  ],
  "speakers": [
    "Jo-fai Chow"
  ],
  "tags": [
    "tutorial"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/yjqmVHA2cFM/maxresdefault.jpg",
  "title": "Introduction to Machine Learning with H2O and Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yjqmVHA2cFM"
    }
  ]
}
