{
  "copyright_text": "Standard YouTube License",
  "description": "In this talk I will present how we use Python, PySpark and AWS as our preferred data science stack for the Internet of Things, which allows us to efficiently develop and deploy smart data applications on top of IoT sensor data. We use these technologies to analyse and model IoT timeseries data, as well as to build automated and scalable data pipelines for smart IoT data applications in the cloud.\n\n**Abstract**\n\nThe Internet of Things and Industry 4.0 are here, bringing along a vast amount of connected devices and sensors producing even more data.\n\nIn order to build smart applications on top of IoT sensor data we need to deal with the challenges that come along time-series data from a large amount of devices.\n\nAt WATTx we build data application prototypes in the field of smart homes, smart buildings, and smart climate, which involves making use of data coming from many IoT sensors measuring -- amongst others -- temperature, humidity, motion, and luminance.\n\nThe purpose of this talk is to present how we use Python and Spark to effectively analyse and model IoT data. In particular I will introduce how we use Python to process and model data from multiple IoT sensors, build machine learning models on top of it, and use Spark to scale and deploy our models in automated data pipelines in the cloud as smart IoT applications.\n\nI will use the development of predictive models for smart building applications as a real-world example to demonstrate this setup.\n\nI hope that this talk will give valuable insights on how Python and PySpark in conjunction with AWS are powerful tools to work with time-series sensor data from the Internet of Things and build data products on top of it.\n\n",
  "duration": 2341,
  "language": "eng",
  "recorded": "2017-06-30",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/berlin2017/schedule/"
    }
  ],
  "speakers": [
    "Rafael Schultze-Kraft"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/XkBbAymUDEo/maxresdefault.jpg",
  "title": "Building smart IoT applications with Python and Spark",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XkBbAymUDEo"
    }
  ]
}
