{
  "copyright_text": "Standard YouTube License",
  "description": "Cookiecutter is a command-line utility that generates projects from templates. You can use Cookiecutter to create new Python projects and to generate the initial code for different types of applications. In this talk, I will give an introduction to Cookiecutter, how to install it from PyPI, how to use it in the CLI, and finally how to author your own template.\n\n**Abstract**\n\nWriting a Python script from scratch is fairly straightforward if you have some experience working in Python. You can usually get by with very little boilerplate code. Starting a new Python project, however, can be tiring if you decide to stick to best practices and plan on submitting it to PyPI later on. It requires great diligence and occasionally gets pretty cumbersome when if you're creating new tools on a regular basis.\n\nSo why not use a template for your projects?\n\nCookiecutter is a command-line utility that creates projects from templates. It is free and open-source software distributed under the terms of a permissive BSD-3 license. With around 150 individual contributors, more than 1000 public templates on GitHub, and multiple talks at conferences, it is fair to say that there is a solid community around it.\n\nIn this talk, I will give an introduction on Cookiecutter, how to install it, how to use it in the CLI, and finally how to author your own template. You can use Cookiecutter for all sorts of projects: command-line scripts, Django webapps, and even non-Python projects.\n\nThe community has authored and published several templates for Data Science projects, for instance widget-cookiecutter. I will demonstrate how to use Cookiecutter to create a custom Jupyter widget using that template.\n\nThe goal of this talk is to teach how to integrate Cookiecutter into your own workflow and share learnings in the form of templates with your team at work and the open source community.\n\n",
  "duration": 1708,
  "language": "eng",
  "recorded": "2017-06-30",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/berlin2017/schedule/"
    },
    {
      "label": "slides",
      "url": "https://speakerdeck.com/hackebrot/cookiecutter-pydata-berlin-2017"
    },
    {
      "label": "cookiecutter package",
      "url": "https://pypi.org/project/cookiecutter/1.5.1/"
    },
    {
      "label": "cookiecutter repository",
      "url": "https://github.com/audreyr/cookiecutter"
    },
    {
      "label": "cookiecutter documentation",
      "url": "https://cookiecutter.readthedocs.io/"
    }
  ],
  "speakers": [
    "Raphael Pierzina"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/nExL0SgKsDY/maxresdefault.jpg",
  "title": "Kickstarting projects with Cookiecutter",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nExL0SgKsDY"
    }
  ]
}
