{
  "copyright_text": "Standard YouTube License",
  "description": "Description\nThis talk describes the various ways in which emerging blockchain technologies can be helpful for machine learning / artificial intelligence work, from audit trails on data to decentralized model exchanges.\n\nAbstract\nIn recent years, big data has transformed AI, to an almost unreasonable level. Now, blockchain technology could transform AI too, in its own particular ways. Some applications of blockchains to AI are mundane yet useful, like audit trails on AI models. Some appear almost unreasonable, like AI that can own itself — AI DAOs (decentralized autonomous organizations) leading to the first AI millionaires. All of them are opportunities. Blockchain technologies — especially planet-scale ones — can help realize some long-standing dreams of AI and data folks. This talk will explore these applications.\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 4984,
  "language": "eng",
  "recorded": "2017-07-26",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/berlin2017/schedule/"
    }
  ],
  "speakers": [
    "Trent McConaghy"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/N7NqzwlK-SQ/maxresdefault.jpg",
  "title": "Blockchains for Artificial Intelligence",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=N7NqzwlK-SQ"
    }
  ]
}
