{
  "copyright_text": "Standard YouTube License",
  "description": "The talk will give an overview about the current state of Open Data in Germany including recent legislative changes that might lead to more Open Data. Leaving behind the basics, the talk will show the implications to the existing Open Data community. Three very different examples of current projects from the Code for Germany community will be presented showing you the bright side of Open Data.\n\n**Abstract**\n\nOpen Data is the availability of (administrative) data to the public while there are no restrictions in analyzing or editing the data. The current stage of data availability depends largely on the the German states. In 2017, Open Data will regain importance and attention as the German Open Data Law has been passed in the German parliament in spring. Recently, Germany has also joint the Open Government Partnership. As many Open Data activists have been demanding better access to data in the past, how satisfactory are those changes on the government side? Those changes will be briefly discussed regarding their mean for our society and for those who have made use of Open Data already.\n\nIn the second part, I will explain how Open Data can be quite awesome already and what obstacles we have been dealing with in the past by showing 3 different, exciting and very active projects: Measuring air quality (Luftdaten), making election data more accessible (Wahlsalons) and collaboratively collecting and sharing data in a huge database (Wikidata). Open Data does not only need coders. It needs those that lobby for it, those that manage the projects, those that spread the word and most importantly: those who use the applications built upon Open Data. Will it be you, too?\n\n",
  "duration": 2681,
  "language": "eng",
  "recorded": "2017-06-30",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/berlin2017/schedule/"
    }
  ],
  "speakers": [
    "Ulrike Thalheim"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/kNT-MaVWJmM/maxresdefault.jpg",
  "title": "Open Data Use Cases",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kNT-MaVWJmM"
    }
  ]
}
