{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Verónica Valeros is a hacker, researcher and intelligence analyst from Argentina. Her research has a strong focus on helping people and involves different areas from wireless and bluetooth privacy issues to malware, botnets and intrusion analysis. She has presented her research on international conferences such as BlackHat, EkoParty, Botconf and others. She is the co-founder of the MatesLab hackerspace based in Argentina. Since 2013 she is part of the Cognitive Threat Analytics team (Cisco Systems) where she specialises on malware network traffic analysis and threats’ categorisation at big scale. She is also part of the core team of Security Without Borders, a collective of cyber security professionals who volunteer assisting people at risk and NGOs on cyber security issues.\n\nThe Future of Cybersecurity Needs You, Here is Why.\n\nIn the last decade we have observed a shift in cybersecurity. Cyber threats started to impact more and more our daily lives, even to the point of threatening our physical safety. We learnt that attackers are well aware of our weaknesses and limitations, that they take advantage of this knowledge and that for being successful they need to be just a little better than us. As defendants, we struggle. We perfected existing solutions to protect our environments with some degree of success but still today we fall behind adversaries more often than not. We got really good at collecting data until the point of not being able to use it in its full extent. This lead us to ask ourselves, Is this it? Is this all we can do? The future of cybersecurity needs you, join me on this talk to find out why.\n\nLink to Q&A: https://youtu.be/Ln0wxTTpOvs (Second pyvideo tab)\n\n",
  "duration": 3284,
  "language": "eng",
  "recorded": "2017-06-30",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/berlin2017/schedule/"
    }
  ],
  "speakers": [
    "Verónica Valeros"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/MgrQfHXXi1c/maxresdefault.jpg",
  "title": "The Future of Cybersecurity Needs You, Here is Why.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MgrQfHXXi1c"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ln0wxTTpOvs"
    }
  ]
}
