{
  "copyright_text": "Standard YouTube License",
  "description": "In this talk I will explain how I built a service that generates Pokemon names. You'd be surprised how hard it is to do this properly and how easy it is to do it practically.\n\n**Abstract**\n\nTNaaS - Tech Names as a Service Deploying a Random Generator that's Phonetically Pokemon\n\nThere is a striking phonetic similarity between big data technology and pokemon names. This has caused some hilarious conversations with recruiters on linkedin: https://www.linkedin.com/in/vincentwarmerdam/ but it also made me wonder. Can I create a service that generates strings that sound like potential pokemon names and what might be the simplest possible way to make that into a service? Also, would it be possible to generate pokemon names that start with three random characters and end with 'base' (KREBASE, MONBASE would be appropriate but IEYBASE would not be).\n\nTurns out that this is an interesting problem from a ML standpoint and that it is rediculously easy to build in the cloud. In my talk I will explain the ML behind it;\n\n- markov chains\n- probibalistic graphs\n- rnn/lstm\n- bidirectional lstm\n\nDuring the talk I will also do a deep dive on the pros and cons of these methods.\n\nI currently have a 101 version of the service live here: https://dyccxmwpz9.execute-api.eu-west-1.amazonaws.com/pokemon/poke-names/v2\n\nBy the time of the conference it will have a proper front end and I have already bought the domain name of tnaas.com.\n\nI've talked about a similar topic in the past: https://youtu.be/TkHT3sLwtkY?t=22m10s. The goal of this talk is to spend more time explaining how I actually built the service; both from a coding perspective as well as a deployment perspective.\n\nLet me know if there are any questions. I am submitting multiple talks that I think are interesting and relevant to the PyData crowd, I'll gladly leave it to the committee which (or if any) of them are relevant to the local community.\n\n",
  "duration": 2386,
  "language": "eng",
  "recorded": "2017-06-30",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/berlin2017/schedule/"
    },
    {
      "label": "Linkedin: Vincent D. Warmerdam Pokemon Master at GoDataDriven",
      "url": "https://www.linkedin.com/in/vincentwarmerdam/"
    },
    {
      "label": "Pokemon names as an amazon service",
      "url": "https://dyccxmwpz9.execute-api.eu-west-1.amazonaws.com/pokemon/poke-names/v2"
    },
    {
      "label": "similar talk",
      "url": "https://youtu.be/TkHT3sLwtkY?t=22m10s"
    }
  ],
  "speakers": [
    "Vincent D. Warmerdam"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/0hR4peP9V4A/maxresdefault.jpg",
  "title": "TNaaS - Tech Names as a Service",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0hR4peP9V4A"
    }
  ]
}
