{
  "copyright_text": null,
  "description": "Speaker: Godfrey Akpojotor\n\nI have been teaching undergraduate computational physics for more than a decade in my university. Adopting Python as our programming language has really helped because of its unique qualities which made it easily accessible and easy to teach/learn. However, providing enough computing devices to the increasing number of students has been a serious challenge. This is even more frustrating when one require to involve online classroom submission/evaluation of assignments. I have overcome this challenge by adopting QPython in smartphones which are rapidly penetrating Africa. With a built-in math library and possibility to install Numpy, QPython in smartphones has made the teaching/learning to more students more efficient especially as they can now engage in learning programming anywhere, anytime and anyhow. The success made me extend it to one of our current projects under the Python African Computational Science and Engineering Tour (PACSETPro) on teaching Python to students, new beginners as well as expert programmers in science and engineering (S & E).   In this talk, I gave a captivating account on how to use QPython to teach computational approaches in S & E in a manner that advancing to normal computing systems is straightforward. Highly excited by the success so far, our outlook is having both Matplotlib  and QVPython in smartphones. This will be a boon for teaching/learning computational approaches anywhere, anytime and anyhow.\n\nSlides can be found at: https://speakerdeck.com/pycon2019 and https://github.com/PyCon/2019-slides",
  "duration": 1702,
  "language": "eng",
  "recorded": "2019-05-04",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2019/schedule/talks/"
    },
    {
      "label": "https://speakerdeck.com/pycon2019",
      "url": "https://speakerdeck.com/pycon2019"
    },
    {
      "label": "https://github.com/PyCon/2019-slides",
      "url": "https://github.com/PyCon/2019-slides"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education Summit",
    "Godfrey Akpojotor",
    "coding",
    "pycon",
    "python",
    "tutorial"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/4SpeUQjMex4/maxresdefault.jpg",
  "title": "Adopting QPython in smartphones for teaching/learning  computational science and engineering",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4SpeUQjMex4"
    }
  ]
}
