{
  "copyright_text": null,
  "description": "Feature flags can be powerful tools in mitigating risk in your\ndevelopment cycle — *if you use them correctly*. Failing to do so can\nhave enormous consequences for yourself and your business. In 2012 one\nimproperly deployed feature flag sent a $365 million company into\nbankruptcy in 45 minutes. So let’s talk about feature flags,\nspecifically in how they can help us with intentional deployment.\nFeature flags give us a high degree of control over the features we\nrelease — but what ensures we have a high degree of control over our\nfeature flags?\n\n    In this talk, I’ll go over the best practices which will make your\nfeature flagging program a success. The humble Feature Flag can\ntransform into many different things: release toggle, experiment, kill\nswitch, permissioning and more. I’ll talk briefly about the\npossibilities Feature Flags open up, and then describe how to use best\npractices of visibility and accountability to align those different\nflags into a cohesive feature flagging system.\n\n    After this talk, you’ll know what best practices make a successful\nfeature flagging program, and be able to implement them into your\ncurrent solution to deploy faster and with less risk.\n",
  "duration": 1705,
  "language": "eng",
  "recorded": "2019-05-04T11:30:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2019/schedule/talks/"
    },
    {
      "label": "Conference slides (github)",
      "url": "https://github.com/PyCon/2019-slides"
    },
    {
      "label": "Conference slides (speakerdeck)",
      "url": "https://speakerdeck.com/pycon2019"
    },
    {
      "label": "Talk schedule",
      "url": "https://us.pycon.org/2019/schedule/presentation/183/"
    }
  ],
  "speakers": [
    "Caitlin Rubin"
  ],
  "tags": [
    "talk"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/HhxNaPYpYiU/maxresdefault.jpg",
  "title": "Intentional Deployment: Best Practices for Feature Flag Management",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HhxNaPYpYiU"
    }
  ]
}
