{
  "copyright_text": null,
  "description": "Speaker: Daniel Chen\n\nData Science and Machine learning have been synonymous with languages like Python.\nLibraries like Numpy and Pandas have become the de facto standard when working with data.\nThe DataFrame object provided by Pandas gives us the ability to work with heterogeneous unstructured data that is commonly used in \"\"real world\"\" data.\n\nNew learners are often drawn to Python and Pandas because of all the different and exciting types of models\nand insights the language can do and provide,\nbut are awestruck when faced with the initial learning curve.\n\nThis tutorial aims to guide the learner from using spreadsheets to using the Pandas DataFrame.\nNot only does moving to a programming language allow the user to have a more reproducible workflow,\nbut as datasets get larger, some cannot even be opened in a spreadsheet program.\nThe goal is to have an absolute beginner proficient enough with Pandas that they can start working with data in Python.\n\nWe will cover how to load and view our data\nand introduce what Dr. Hadley Wickham has coined \"\"tidy data\"\".\nTidy data is an important concept because the process of tidying data will fix a host of data problems\nthat are needed to perform analytics.\nWe then cover functions and applying methods to our data with a focus on data cleaning,\nand how we can use the concept of split-apply-combine (groupby) to summarize or reduce our data.\n\nFinally, we cover the role of Pandas in analysis packages such as scikit learn.\nThe tutorial will end with a fitted model.\n\nThe goal is to get people familiar with Python and Pandas so they can learn and explore many other parts of the Python ecosystem (e.g., scikit learn, dask, seaborn, etc).\n\nSlides can be found at: https://speakerdeck.com/pycon2019 and https://github.com/PyCon/2019-slides",
  "duration": 11979,
  "language": "eng",
  "recorded": "2019-05-02",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2019/schedule/talks/"
    },
    {
      "label": "https://speakerdeck.com/pycon2019",
      "url": "https://speakerdeck.com/pycon2019"
    },
    {
      "label": "https://github.com/PyCon/2019-slides",
      "url": "https://github.com/PyCon/2019-slides"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Daniel Chen",
    "coding",
    "pycon",
    "python",
    "tutorial"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/OnSEj1v-iJo/hqdefault.jpg",
  "title": "Daniel Chen - Pandas is for Everyone - PyCon 2019",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OnSEj1v-iJo"
    }
  ]
}
