{
  "copyright_text": null,
  "description": "Speaker: David Beazley\n\nThese days, programming style guides are all the rage.  However, what if your style guide was so restrictive that it only gave you single-argument functions and nothing else?  No modules, no classes, no control flow, no data structures, and not even any primitives like integers or regular expressions.  Just functions.  Could you actually program anything at all?    Surprisingly, the answer is yes.   In this tutorial,  you'll learn how as you work through a ground-up derivation of the lambda calculus in Python.\n\nYou will learn nothing practically useful in this tutorial. No packaging. No tools. No libraries. No deployment. No magic Python programming techniques. And certainly learn nothing you would ever want to apply to a real project.  You will, on the other hand, have a lot of fun, be completely amazed, and learn some foundational computer science that is a jumping off point for further explorations of functional programming, type theory, programming languages, and more.\n\n\n\n\nSlides can be found at: https://speakerdeck.com/pycon2019 and https://github.com/PyCon/2019-slides",
  "duration": 12394,
  "language": "eng",
  "recorded": "2019-05-02",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2019/schedule/talks/"
    },
    {
      "label": "https://speakerdeck.com/pycon2019",
      "url": "https://speakerdeck.com/pycon2019"
    },
    {
      "label": "https://github.com/PyCon/2019-slides",
      "url": "https://github.com/PyCon/2019-slides"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "David Beazley",
    "coding",
    "pycon",
    "python",
    "tutorial"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/pkCLMl0e_0k/maxresdefault.jpg",
  "title": "David Beazley - Lambda Calculus from the Ground Up - PyCon 2019",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pkCLMl0e_0k"
    }
  ]
}
