{
  "copyright_text": null,
  "description": "Starting a few years ago, Capital One has committed to go all-in on\npublic cloud and open source software for many of our core business\noperations, processes, and machine learning models. To support this\ntransformation, we embarked on a multi-year journey to build a Python\ncommunity with critical mass of users, and scale adoption of Python in\nour business analyst and data analyst workforces.\n\nPython has been envisioned since its early days as a programming\nlanguage which can be used to \"create better, easier to use tools for\nprogram development and analysis\", as well as \"build a user community\naround all of the above, encouraging feedback and self-help\". [1] In our\nexperience scaling Python adoption amongst analyst communities within a\nFortune 500 company, we have found the aforementioned visions true to\nform - not only is Python a great first programming language for our\nanalysts to learn, it also comes with \"batteries included\" and contains\nmany of the data-related tools and libraries which allows our analysts\nto get productive very quickly.\n\nThis talk will highlight our multi-pronged approaches to overcome\norganizational inertia to build a community of Python users, provide\nPython and OSS training, and encourage Python adoption (with mixed\nsuccess). We'll share what (we think) best practices are out there, and\nlessons learned along the way.\n\nReference: [1] Computer Programming for Everybody\n(http://www.python.org/doc/essays/cp4e.html)\n",
  "duration": 2701,
  "language": "eng",
  "recorded": "2019-05-03T16:15:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2019/schedule/talks/"
    },
    {
      "label": "http://www.python.org/doc/essays/cp4e.html",
      "url": "http://www.python.org/doc/essays/cp4e.html"
    },
    {
      "label": "Conference slides (github)",
      "url": "https://github.com/PyCon/2019-slides"
    },
    {
      "label": "Conference slides (speakerdeck)",
      "url": "https://speakerdeck.com/pycon2019"
    },
    {
      "label": "Talk schedule",
      "url": "https://us.pycon.org/2019/schedule/presentation/220/"
    }
  ],
  "speakers": [
    "I-Kang Ding",
    "Ariel M'ndange-Pfupfu",
    "Marina Sergeeva"
  ],
  "tags": [
    "talk"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/JcPwf4Ej12M/maxresdefault.jpg",
  "title": "Lessons learned from building a community of Python users among thousands of analysts",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JcPwf4Ej12M"
    }
  ]
}
