{
  "copyright_text": null,
  "description": "Security incident response is an intense, high stress, high skill job\nthat relies heavily on human judgement. Despite that, for reasons that\nwe can't begin to understand, a big part of an incident responder's job\nseems to be opening numerous browser tabs and copy-pasting bits of text\nfrom one system to another. The hard parts of incident response can't be\nautomated, but there are entire classes of busy-work that we can\neliminate with a few web hooks and some artisanal Python.\n\nIn this talk we're going to discuss how to use Python to automate\nsecurity incident response team (SIRT) operations. We'll give an\noverview of what a typical SecOps/SIRT infrastructure looks like, how\nand where automation fits in, and dive into some code. We'll walk\nthrough a simple example, with screenshots and code, of automating a\nSecOps process. We want to show that  getting started with security\nautomation doesn't have to be difficult or expensive (though vendors\nwill happily take your money). Just a little bit of Python can make some\ngreat quality of life improvements for incident responders.\n",
  "duration": 1807,
  "language": "eng",
  "recorded": "2019-05-03T11:30:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2019/schedule/talks/"
    },
    {
      "label": "Conference slides (github)",
      "url": "https://github.com/PyCon/2019-slides"
    },
    {
      "label": "Conference slides (speakerdeck)",
      "url": "https://speakerdeck.com/pycon2019"
    },
    {
      "label": "Talk schedule",
      "url": "https://us.pycon.org/2019/schedule/presentation/153/"
    }
  ],
  "speakers": [
    "Moses Schwartz",
    "Andy Culler"
  ],
  "tags": [
    "talk"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Nzcw9xolvow/maxresdefault.jpg",
  "title": "A Snake in the Bits: Security Automation with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Nzcw9xolvow"
    }
  ]
}
