{
  "copyright_text": null,
  "description": "Speakers: Neha Gupta, Jessica Jahnke\n\nWe teach Python to 5th-12th grade girls, aiming to build community, build self-confidence, and help bridge the gender gap in tech. This talk offers solutions to common challenges in motivating students and community organizing.\n\nWe will share methods to increase student engagement and aid the transition to Python. We used “Unplugged” activities that complement programming fundamentals, “block-based” logic in Scratch, and the drag-to-text Python platform in Codesters. We will also share examples of leading discussions that build girls’ curiosity about technology fields, including learning about role models of top women in the industry, and learning about emerging areas in technology.\n\nAdditionally, organizing clubs for students from diverse backgrounds, with varying technical educations, can involve bridging gaps and encouraging community involvement. We’ll discuss methods of reaching families and local communities, such as open presentations, celebrations, and share some do's and don'ts from our experiences. We’ll also share ways to encourage participants to develop communication skills about their technical work and teamwork.\n\nWomen’s rights and community activism are gathering national attention, and we believe that anyone can effectively run an ongoing coding club to positively impact girls' education in their communities.\n\nSlides can be found at: https://speakerdeck.com/pycon2019 and https://github.com/PyCon/2019-slides",
  "duration": 1174,
  "language": "eng",
  "recorded": "2019-05-04",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2019/schedule/talks/"
    },
    {
      "label": "https://speakerdeck.com/pycon2019",
      "url": "https://speakerdeck.com/pycon2019"
    },
    {
      "label": "https://github.com/PyCon/2019-slides",
      "url": "https://github.com/PyCon/2019-slides"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education Summit",
    "Neha Gupta",
    "coding",
    "pycon",
    "python",
    "tutorial"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/NMCWe1Vwn5U/maxresdefault.jpg",
  "title": "Neha Gupta, Jessica Jahnke - Building a Community for Girls with Python - PyCon 2019",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NMCWe1Vwn5U"
    }
  ]
}
