{
  "copyright_text": null,
  "description": "According to the always trustworthy Wikipedia, there are approximately\n360 million native English speakers in the world. We, as developers, are\nso used to write code and documentation in English that we may not\nrealize that this number only represents 4.67% of the world population.\nIt is very useful to have a common language for the communication\nbetween developers, but this doesn’t mean that the user shouldn’t feel a\nlittle bit more comfortable when using your product.\n\nTranslation of terms is only one step in the whole Internationalization\n(i18n) and Localization (l10n) process. It also entails number, date and\ntime formatting, currency conversion, sorting, legal requirements, among\nother issues. This talk will go through the definition of i18n and l10n\nas well as show the main tools available for developers to support\nmultiple languages and regional related preferences in their Python\nprogram. We will also see how one can enable local support for their\nwebsite in Django. Finally, this presentation will discuss how we can\nmanage Internationalization and Localization for a bigger product\nrunning in different platforms (front and back end) and how to\nincorporate i18n and l10n into our current development and deploy\nprocesses.\n\nOh, and by the way, “eita!” is a Brazilian interjection to show yourself\nsurprised with something. 🙂\n",
  "duration": 2635,
  "language": "eng",
  "recorded": "2019-05-04T15:15:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2019/schedule/talks/"
    },
    {
      "label": "Conference slides (github)",
      "url": "https://github.com/PyCon/2019-slides"
    },
    {
      "label": "Conference slides (speakerdeck)",
      "url": "https://speakerdeck.com/pycon2019"
    },
    {
      "label": "Talk schedule",
      "url": "https://us.pycon.org/2019/schedule/presentation/192/"
    }
  ],
  "speakers": [
    "Nicolle Cysneiros"
  ],
  "tags": [
    "talk"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/2eF_MhgplQ8/maxresdefault.jpg",
  "title": "Eita! Why Internationalization and Localization matter",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2eF_MhgplQ8"
    }
  ]
}
