{
  "copyright_text": null,
  "description": "One of the reasons why programming in Python is very straightforward and\nsimple is that we do not have to worry about the lifetime of our\nobjects. That is, once it ceases to be necessary, a variable disappears\nfrom the memory \"magically\". The fact that this happens automatically\ncan erroneously lead us to believe that it is not required to worry\nabout what happens behind the scenes.\n\nNothing is further from reality: knowing how Python manages memory is\nfundamental in specific scenarios, and not knowing what is happening can\nhave consequences as significant as unpleasant. For example, if our\nprograms manage a large amount of data at the same time or launch\nmultiple processes in parallel, this ceases to be a theoretical issue\nand becomes something that we, logical minds, also care.\n\nAlthough these concepts tend to be considered advanced and difficult to\nunderstand, we will see that this is not the case. This topic is not a\npurely theoretical matter nor is it difficult to find its practical\napplications. In this talk, we will explain why it is something that\nshould matter to us, and we will talk about how to apply the knowledge\nwe have gained to specific problems.\n",
  "duration": 2771,
  "language": "eng",
  "recorded": "2019-05-04T13:40:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2019/schedule/talks/"
    },
    {
      "label": "Conference slides (github)",
      "url": "https://github.com/PyCon/2019-slides"
    },
    {
      "label": "Conference slides (speakerdeck)",
      "url": "https://speakerdeck.com/pycon2019"
    },
    {
      "label": "Talk schedule",
      "url": "https://us.pycon.org/2019/schedule/presentation/202/"
    }
  ],
  "speakers": [
    "Pablo Galindo Salgado"
  ],
  "tags": [
    "talk"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/CLW5Lyc1FN8/maxresdefault.jpg",
  "title": "Time to take out the rubbish: garbage collector",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CLW5Lyc1FN8"
    }
  ]
}
