{
  "copyright_text": null,
  "description": "Every programmer should learn to use solvers, tools that reason directly\nfrom a description of a problem to its solution.\n\nTools like AlphaZero can formulate winning strategies for games given\nonly a description of the rules of the game. For certain classes of\nproblems, we really can just let the computer do the work.\n\nIn this talk, we learn principles, techniques, and multiple examples for\nthree solvers available in Python.\n\nThe first tool is a generic puzzle-solving framework that employs tree\nsearch strategies. We apply it to a simple sequencing problem and then\nto a harder sliding-block puzzle. Next, we'll look at the solver code to\nlearn how it works. I'll also show an essential optimization technique\nand how to humanize the output. We demonstrate our skills by solving\nanother famous puzzle.\n\nThe second tool is called a SAT solver. It is one of the miracles of the\n21st century. From first principles, I'll show you what problems it\nsolves and the way problems need to be described for modules like\n*PycoSAT*. I'll provide helper functions to humanize our interactions\nwith this great tool. Then, we'll demonstrate our skills by creating a\nSudoku solver and a readable logic problem solver.\n\nThe third tool is the \"multi-armed bandit\". It is a generic\nreinforcement learning algorithm that is easy to learn, powerful, and\napplicable to a broad class of problems. We apply it to winning\nrock-paper-scissors using pattern recognition.\n\nLastly, I'll summarize DeepMind's paper on AlphaZero which was published\nin the December 2018 edition of *Science*. This gives us hints at the\nfull potential of these techniques.\n\nPure Python source code and examples are provided for all of the tools.\n",
  "duration": 2834,
  "language": "eng",
  "recorded": "2019-05-03T12:10:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2019/schedule/talks/"
    },
    {
      "label": "Conference slides (github)",
      "url": "https://github.com/PyCon/2019-slides"
    },
    {
      "label": "Conference slides (speakerdeck)",
      "url": "https://speakerdeck.com/pycon2019"
    },
    {
      "label": "Talk schedule",
      "url": "https://us.pycon.org/2019/schedule/presentation/149/"
    }
  ],
  "speakers": [
    "Raymond Hettinger"
  ],
  "tags": [
    "talk"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/_GP9OpZPUYc/maxresdefault.jpg",
  "title": "Modern solvers: Problems well-defined are problems solved",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_GP9OpZPUYc"
    }
  ]
}
