{
  "copyright_text": null,
  "description": "Have you ever thought about what open source software or hardware could\nachieve? What if it could help improve people's lives by solving some of\ntheir health problems?\n\nAfter the medical tech industry kept promising a system to help\nautomatically manage insulin for type 1 diabetic people and never\ndelivering, some people got together to find ways to do it with the tech\nthey already had. Over the past few years, a \"closed-loop\" system has\nbeen developed to algorithmically regulate people's blood sugars. After\nreverse engineering bluetooth sensors and 915 MHz insulin pumps, the\nsystem became possible. As a diabetic, I also built this system and saw\nmy sugar values stabilize much more than I could ever achieve doing it\nmanually myself. Now I'm working on contributing back to the projects as\nwell.\n\nI want to talk about this system, from a technical side as well as a\npersonal side. I'll talk about OpenAPS (the open artificial pancreas\nsystem) and how it works, what problems it solves, and its safety and\nsecurity concerns. I also want to show how it's helped me, and what this\nmeans for my health now and in the future. I ultimately want to show how\nwe, as software developers, can change people's lives through the code\nwe write.\n",
  "duration": 1633,
  "language": "eng",
  "recorded": "2019-05-04T14:35:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2019/schedule/talks/"
    },
    {
      "label": "Conference slides (github)",
      "url": "https://github.com/PyCon/2019-slides"
    },
    {
      "label": "Conference slides (speakerdeck)",
      "url": "https://speakerdeck.com/pycon2019"
    },
    {
      "label": "Talk schedule",
      "url": "https://us.pycon.org/2019/schedule/presentation/155/"
    }
  ],
  "speakers": [
    "Sarah Withee"
  ],
  "tags": [
    "talk"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/1kT1VoX7VAs/maxresdefault.jpg",
  "title": "Building an Open Source Artificial Pancreas",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1kT1VoX7VAs"
    }
  ]
}
