{
  "copyright_text": null,
  "description": "Speakers: Tracy Teal, Dr. Kari L. Jordan\n\nHow we teach, rather than what we teach, often has the most impact on who participates and on learning outcomes. This presentation covers trends in computational teaching, and focuses on how these trends relate to diversity, inclusion, equity, and access to computational training. Through the lens of The Carpentries, an organization dedicated to teaching foundational coding and data science skills worldwide, we present best practices and opportunities for improvement in computational teaching pedagogy. Evidence-based teaching practices, “train-the-trainer” programs, and mentoring are three strategies we outline that support inclusive pedagogy in computational teaching. We describe and discuss effective teaching practices that promote inclusive pedagogy in computational teaching, including formative assessment, collaborative note taking, a strong commitment to a Code of Conduct, and creating a welcoming environment for learners.\n\nSlides can be found at: https://speakerdeck.com/pycon2019 and https://github.com/PyCon/2019-slides",
  "duration": 1230,
  "language": "eng",
  "recorded": "2019-05-04",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2019/schedule/talks/"
    },
    {
      "label": "https://speakerdeck.com/pycon2019",
      "url": "https://speakerdeck.com/pycon2019"
    },
    {
      "label": "https://github.com/PyCon/2019-slides",
      "url": "https://github.com/PyCon/2019-slides"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Dr. Kari L. Jordan",
    "Education Summit",
    "Tracy Teal",
    "coding",
    "pycon",
    "python",
    "tutorial"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/IYADM3-0QSM/maxresdefault.jpg",
  "title": "Tracy Teal, Dr. Kari L. Jordan - Inclusive pedagogy to support computational teaching - PyCon 2019",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IYADM3-0QSM"
    }
  ]
}
