{
  "alias": "video/3741/vagrant-packer-et-ruby-pour-automatiser-des-buil",
  "category": "PyCon FR 2013",
  "copyright_text": "",
  "description": "",
  "duration": 1903,
  "id": 3741,
  "language": "fra",
  "quality_notes": "",
  "recorded": "2013-11-30",
  "slug": "vagrant-packer-et-ruby-pour-automatiser-des-buil",
  "speakers": [
    "David Cournapeau"
  ],
  "summary": "Vagrant, packer et un peu de ruby pour automatiser des builds complexes.\n\nIntroduction\n\nTout le monde n'a pas la chance de ne dépendre que de paquets 100 %\npython. Python est devenu un outil de choix pour le calcul numérique,\nmais des paquets tels que numpy, scipy ou scikit-learn dépendent de\nlibrairies C, C++ et même Fortran qui dépendent fortement des\nplateformes.\n\nJ'aimerais présenter les outils packer et vagrant comme une solution\npour produire des builds 100 % reproductibles. S'appuyant sur la\nvirtualisation, ils permettent d'appliquer les principes de reproduction\nnon seulement pour unix, mais aussi os x et même windows.\n\nLe concept de provisionnement, et son application au problème de\n\"packaging\"\n\nCette section présentera tout d'abord la nécessité de reproduction pour\nla compilation, et justifiera pourquoi les VM sont les outils les plus\nadéquats aujourd'hui si l'on veut supporter toutes les plateformes\nusuelles, en particulier windows:\n\n-  architectures \"3-tier\" pour le provisionnement\n-  outils disponibles pour chacune des 3 couches\n-  présentation de vagrant et packer\n\nvagrant, un outil simple pour la réutilisation de VM\n\nCette section commencera par illustrer les problèmes usuels du partage\ndes VM entre développeurs, et montrera comment vagrant peut résoudre ces\nproblèmes:\n\n-  le provisionnement comme solution au manque de transparence usuel\n   avec les VMs\n-  flexibilité et traçabilité grâce à la combinaison chef/puppet/salt +\n   vagrant\n\npacker, un complément à vagrant\n\nVagrant suppose l'existence de 'base box', qui sont des images d'OS avec\njuste ce qu'il faut pour \"bootstrapper\" la suite du provisionnement.\nPacker est un outil qui permet de créer ses propres images:\n\n-  illustration du fonctionnement de packer\n-  cibler plusieurs technologies de virtualisation à partir d' un même\n   template: virtualbox, vmware, mais aussi ec2.\n\nExample pour la compilation de paquets 'wheel' pour numpy/scipy\n\nCette partie sera plus didactique, et basé sur un exemple réel pour\ncompiler un wheel de numpy et scipy sur windows. L'exemple utilisera à\nla fois vagrant, packer et chef.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/iTU5CRuY96I/maxresdefault.jpg",
  "title": "Vagrant, packer et ruby pour automatiser des builds complexes",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iTU5CRuY96I"
    }
  ]
}