{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": 1903, "video_ogv_download_only": false, "category": "PyCon FR 2013", "speakers": ["David Cournapeau"], "title": "Vagrant, packer et ruby pour automatiser des builds complexes", "quality_notes": "", "video_flv_length": null, "recorded": "2013-11-30", "video_mp4_length": null, "description": "", "video_mp4_url": null, "tags": [], "copyright_text": "", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=iTU5CRuY96I", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "French", "video_webm_length": null, "summary": "Vagrant, packer et un peu de ruby pour automatiser des builds complexes.\n\nIntroduction\n\nTout le monde n'a pas la chance de ne dépendre que de paquets 100 % python. Python est devenu un outil de choix pour le calcul numérique, mais des paquets tels que numpy, scipy ou scikit-learn dépendent de librairies C, C++ et même Fortran qui dépendent fortement des plateformes.\n\nJ'aimerais présenter les outils packer et vagrant comme une solution pour produire des builds 100 % reproductibles. S'appuyant sur la virtualisation, ils permettent d'appliquer les principes de reproduction non seulement pour unix, mais aussi os x et même windows.\n\nLe concept de provisionnement, et son application au problème de \"packaging\"\n\nCette section présentera tout d'abord la nécessité de reproduction pour la compilation, et justifiera pourquoi les VM sont les outils les plus adéquats aujourd'hui si l'on veut supporter toutes les plateformes usuelles, en particulier windows:\n\n- architectures \"3-tier\" pour le provisionnement\n- outils disponibles pour chacune des 3 couches\n- présentation de vagrant et packer\n\nvagrant, un outil simple pour la réutilisation de VM\n\nCette section commencera par illustrer les problèmes usuels du partage des VM entre développeurs, et montrera comment vagrant peut résoudre ces problèmes:\n\n- le provisionnement comme solution au manque de transparence usuel avec les VMs\n- flexibilité et traçabilité grâce à la combinaison chef/puppet/salt + vagrant\n\npacker, un complément à vagrant\n\nVagrant suppose l'existence de 'base box', qui sont des images d'OS avec juste ce qu'il faut pour \"bootstrapper\" la suite du provisionnement. Packer est un outil qui permet de créer ses propres images:\n\n- illustration du fonctionnement de packer\n- cibler plusieurs technologies de virtualisation à partir d' un même template: virtualbox, vmware, mais aussi ec2.\n\nExample pour la compilation de paquets 'wheel' pour numpy/scipy\n\nCette partie sera plus didactique, et basé sur un exemple réel pour compiler un wheel de numpy et scipy sur windows. L'exemple utilisera à la fois vagrant, packer et chef.", "thumbnail_url": "https://i.ytimg.com/vi/iTU5CRuY96I/maxresdefault.jpg", "video_flv_url": null}