{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Madrid 2016\n\nMost of the talks and workshop tutorials can be found here: https://github.com/PyDataMadrid2016/Conference-Info\n\nThe popularity of Python for data science has rocketed in recent years. Its ease of use, a great developer and user community and a solid core of scientific libraries, has attracted many users that were previously using other languages, commercial solutions, or had never wrote a line of code. In this talk, we will explore data science, the state of the Python ecosystem and how to get started. Data science is an interdisciplinary field concerned with extracting valuable insights from data. But, even before the term data science existed, many fields, such as statistics, science, and business intelligence, had already been dealing with data, and using it to discover interesting patterns. Data science is about bringing those communities together and Python has made the conversation easier by providing a common language. Our open source community has created awesome libraries that make the life of anyone searching for answers in data much easier. They have democratized knowledge extraction from data. The interest in the Python community for data science libraries has also caused the proliferation of many open source projects, making it hard for the novice to get their head around all the names and functionality. This talk is a “getting started” guide to the entire ecosystem, to help those struggling with navigating the waters. After the talk, attendees will be comfortable exploring on their own all the possibilities the community has to offer them. Each data science journey is different, the possibilities are infinite, figuring out which one is yours is on you. Follow your path, but get a map. This talk will be your start.",
  "duration": 2294,
  "language": "eng",
  "recorded": "2016-04-28",
  "related_urls": [
    "https://github.com/PyDataMadrid2016/Conference-Info"
  ],
  "speakers": [
    "Christine Doig"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/u3JJsoBpRYk/maxresdefault.jpg",
  "title": "A Hitchhiker's Guide to Data Science",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=u3JJsoBpRYk"
    }
  ]
}
