{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Madrid 2016\n\nMost of the talks and workshop tutorials can be found here: https://github.com/PyDataMadrid2016/Conference-Info\n\nNo machine learning algorithm dominates in every domain, but random forests are usually tough to beat by much. And they have some advantages compared to other models. No much input preparation needed, implicit feature selection, fast to train, and ability to visualize the model. While it is easy to get started with random forests, a good understanding of the model is key to get the most of them.\n\nThis talk will cover decision trees from theory, to their implementation in scikit-learn. An overview of ensemble methods and bagging will follow, to end up explaining and implementing random forests and see how they compare to other state-of-the-art models.\n\nThe talk will have a very practical approach, using examples and real cases to illustrate how to use both decision trees and random forests.\n\nWe will see how the simplicity of decision trees, is a key advantage compared to other methods. Unlike black-box methods, or methods tough to represent in multivariate cases, decision trees can easily be visualized, analyzed, and debugged, until we see that our model is behaving as expected. This exercise can increase our understanding of the data and the problem, while making our model perform in the best possible way.\n\nRandom Forests can randomize and ensemble decision trees to increase its predictive power, while keeping most of their properties.\n\nThe main topics covered will include:\n\n* What are decision trees?\n* How decision trees are trained?\n* Understanding and debugging decision trees\n* Ensemble methods\n* Bagging\n* Random Forests\n* When decision trees and random forests should be used?\n* Python implementation with scikit-learn\n* Analysis of performance",
  "duration": 2635,
  "language": "eng",
  "recorded": "2016-04-28",
  "related_urls": [
    "https://github.com/PyDataMadrid2016/Conference-Info/blob/master/talks_materials/20160409_1015_Understanding_Random_Forests/Understanding_Random_Forests.pdf",
    "https://github.com/PyDataMadrid2016/Conference-Info"
  ],
  "source_url": "https://www.youtube.com/watch?v=mtIePLVqVhA",
  "speakers": [
    "Marc García"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/mtIePLVqVhA/maxresdefault.jpg",
  "title": "Understanding Random Forests",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mtIePLVqVhA"
    }
  ]
}