{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Madrid 2016\n\nMost of the talks and workshop tutorials can be found here: https://github.com/PyDataMadrid2016/Conference-Info\n\nThe concept of inverse problem (IP) in science and engineering (as opposed to the direct problem) is introduced and put into context within the broader field of data analysis by comparing it with complementary approaches like regression analysis, machine learning or bayesian inference. The two main applications of the solution of IP is explained: model verification and parameters extraction.\n\nDifferent techniques to solve the IP are briefly presented including brute force and Gradient Descent (GD) approaches. Then we focus on GD techniques including stochastic GD, variable step GD and the application to constrained problems. The critical elements in the application of GD approaches is discussed in detail: the selection of the initial guess, the definition of the cost function, the selection of the step, the problem of local minima, and the evaluation of the error of the final estimation by using stochastic approaches. In addition, some more advanced techniques to deal with large-dimensions problems and to learn from the path followed by different algorithms to find the solution of the IP are introduced.\n\nThese elements are presented along with some examples using time and frequency domain data: chirps, gravitational waves and resonant ultrasonic spectroscopy (RUS), and the results obtained using a simple implementation of the GD method in Python 2.7. Gravitational wave data are obtained from the LIGO project (https://losc.ligo.org/s/events/GW150914/GW150914_tutorial.html), while RUS data are obtained from https://us-biomat.com/. For these examples the possibility to use the IP solution to both parameter extraction and model confirmation is discussed",
  "duration": 2193,
  "language": "eng",
  "recorded": "2016-04-28",
  "related_urls": [
    "https://github.com/PyDataMadrid2016/Conference-Info/tree/master/talks_materials/20160409_1530_The_solution_of_inverse_problems",
    "https://github.com/PyDataMadrid2016/Conference-Info",
    "https://losc.ligo.org/s/events/GW150914/GW150914_tutorial.html",
    "https://us-biomat.com/"
  ],
  "source_url": "https://www.youtube.com/watch?v=Nppjvghc2NY",
  "speakers": [
    "Tomás Gómez Álvarez-Arenas"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Nppjvghc2NY/maxresdefault.jpg",
  "title": "The solution of inverse problems",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Nppjvghc2NY"
    }
  ]
}