{
  "description": "Presented by Natalie O'Shea\r\n\r\nWorking in the high-touch world of consulting, our team needed to develop a reporting system that was flexible enough to be tailored to the specific needs of any given partner while still reducing the highly manual nature of populating client-ready slide decks with various metrics and data visualizations. Utilizing the extensive resources developed by the R user community, I was able to create a flexible, scalable reporting system that allows users to populate templated Google slide decks with metrics and professional-grade visualizations using data pulled directly from our database at the time of query. This streamlined approach enables our consultants to spend less time copy-pasting data from one channel to another and instead focus on what they do best: surfacing business-relevant insights and recommendations for our partners.\r\n\r\nBy sharing my approach to customizable self-serve reporting in Shiny, I hope attendees will walk away with new ideas about how to combine parameterized reporting and dashboard development to get the best of both worlds. Additionally, I hope to end by sharing how this project was pivotal in making the business case for procuring Posit products for my broader organization.\r\n\r\nPresented at Posit Conference, between Sept 19-20 2023,\r\nLearn more at posit.co/conference.\r\n\r\nTalk Track: Bridging the gap between data scientists and decision makers.\r\nSession Code: TALK-1075",
  "duration": 1179,
  "language": "eng",
  "recorded": "2023-09-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230902080800/https://posit.co/conference"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/CoAsWA9_X2Y/maxresdefault.webp",
  "title": "Building a Flexible, Scaleable Self-Serve Reporting System with Shiny - posit::conf(2023)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CoAsWA9_X2Y"
    }
  ]
}
