{
  "description": "Presented by Angie Reed\r\n\r\nThe spirit of Penobscot Nation's work to protect the health of their relative, the Penobscot River, is embodied in the Penobscot water song which says \"\"Water, we love you, thank you so much water, we respect you.\"\" Because the Penobscot River is not a natural resource - she is a relative, family - this song describes the foundation of our efforts to protect her health and well-being. The identity of Penobscot people cannot be disconnected from the river, and protecting this traditional lifeway is at the heart of our work. \r\n\r\nFor over a decade we have used R to manage, transform, analyze, and visualize data, and the free, open-source Posit products help us leave a legacy of good data management and the ability to share results with Penobscot Nation citizens. You will learn more about how our use of R has helped us achieve more stringent protections for the Penobscot River and how we engage young people in every step of this work. We are also part of a larger network of tribal environmental professionals, working together to learn R and share data and insights. We will give you information about how you can volunteer to help expand the network of folks providing technical assistance on any R and RStudio related topics.\r\n\r\nPresented at Posit Conference, between Sept 19-20 2023,\r\nLearn more at posit.co/conference.\r\n\r\nTalk Track: End-to-end data science with real-world impact.\r\nSession Code: TALK-1144",
  "duration": 1219,
  "language": "eng",
  "recorded": "2023-09-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230902080800/https://posit.co/conference"
    }
  ],
  "speakers": [
    "Angie Reed"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/2PjOSBHRm74/maxresdefault.jpg",
  "title": "Using Data to Protect Traditional Lifeways",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2PjOSBHRm74"
    }
  ]
}
