{
  "description": "[EuroPython 2024 — Terrace 2B on 2024-07-10]\n\n\rAccelerating Python with Rust: The PyO3 Revolution by Roshan R Chandar\n\rhttps://ep2024.europython.eu/session/accelerating-python-with-rust-the-pyo3-revolution\n\n\rAre you curious about integrating the high-performance and memory efficiency of Rust into your Python applications? Rust can significantly enhance the speed and efficiency of Python programs, and this integration is made seamless with PyO3.\n\n\rThis presentation will delve into the capabilities of PyO3, a tool that allows the creation of native Python modules using Rust. With PyO3, importing Rust code as a Python module is straightforward. It offers seamless type conversion between Python and Rust and includes macros that simplify the process of exposing Rust functions to Python.\n\n\rMoreover, with the growing trend towards asynchronous programming, PyO3-asyncio emerges as a vital tool for those working with async functions in Python or looking to generate Python bindings for an async Rust library. It streamlines the task of translating async functions between Python and Rust. Furthermore, PyO3 facilitates easy implementation of parallelism within Rust code, enhancing performance and efficiency.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1651,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/accelerating-python-with-rust-the-pyo3-revolution",
      "url": "https://ep2024.europython.eu/session/accelerating-python-with-rust-the-pyo3-revolution"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Roshan R Chandar"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/_33zs20Sy0k/maxresdefault.jpg",
  "title": "Accelerating Python with Rust: The PyO3 Revolution",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_33zs20Sy0k"
    }
  ]
}
