{
  "description": "[EuroPython 2024 — South Hall 2B on 2024-07-10]\n\n\r... and justice for AIl by Martina Guttau-Zielke\n\rhttps://ep2024.europython.eu/session/and-justice-for-ail\n\n\r„Everything’s science fiction until someone makes it science fact.“ - Marie Lu, Warcross\n\n\rWe live in times that have quite a lot of those science facts- even if hoverboards sadly are not part of them- and now have to deal with this new world and all it’s changes for better or for worse. \n\rThere are unsettling deepfakes, stunning Cap-Set-Problem-solving language models and the question of artificial conscience. Developers might be able to navigate the turbulences of AI evolution, but are you brave enough to take on the quest of untangling the nebulous scriptures of law that are known to the chaotic neutral wordwizards of the council of Europa as the „AI Act“?\n\n\rAccompany me on a journey through the valleys of risk-based AI categories, over the sea of subsectional articles and to the top of mount ethic, as we strive to understand the possibilities the AI Act gives our bold heroes to defy the boundaries of innovation, protect the villagers of the EU and construct (legally) safe software.\n\n\rThe Proposal for the European Artificial Intelligence Act takes 224 Pages of legalese to work through. \n\rThis talk will give a short overview of what the European AI Act is and about the purpose and necessity of a globally harmonised legal system. \n\rHopefully it will give an understanding about the main goals of the act, which are, spoiler alert, ensuring AI safety, the protection of fundamental rights, and legal clarity for businesses and developers (which is probably you).\n\rLet us discuss, how developers can shield fundamental rights by writing ethical AI Systems whilst navigating the regulatory landscape and staying tuned with legal development as well.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2889,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2024.europython.eu/session/and-justice-for-ail",
      "url": "https://ep2024.europython.eu/session/and-justice-for-ail"
    }
  ],
  "speakers": [
    "Martina Guttau-Zielke"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/4dUoprrMMk4/maxresdefault.jpg",
  "title": "... and justice for AIl",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4dUoprrMMk4"
    }
  ]
}
