{
  "description": "[EuroPython 2024 — South Hall 2B on 2024-07-10]\n\n\rAnimations from first principles by Rodrigo Girão Serrão\n\rhttps://ep2024.europython.eu/session/animations-from-first-principles\n\n\rHow do you create an animation?\n\n\rWhat if you want to morph a circle into a figure eight?\n\n\rAs it turns out, all you need is two or three functions and a loop!\n\n\rIn this live-coded talk, we'll go over the basic concepts and code needed to create an animation _from first principles_.\n\n\rBecause the talk presents the ideas and the code from first principles, you will be able to take the key concepts and build your own animations after!\n\n\rWe'll start simple and build from there:\n\n\r - How can you draw a circle if all you can do is colour single pixels?\n\r - How can you animate the process of drawing a circle?\n\r - How can you animate the process of drawing something other than a circle?\n\r - How can you animate the process of morphing two figures?\n\r - How do you add colour to your animations?\n\n\rThis visually appealing talk will show you all of the code without skipping a single line and by the time we're done you'll be jumping in your seat to create your own animations!\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2474,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/animations-from-first-principles",
      "url": "https://ep2024.europython.eu/session/animations-from-first-principles"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/X6fJjFSMLEs/maxresdefault.jpg",
  "title": "Animations from first principles — Rodrigo Girão Serrão",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=X6fJjFSMLEs"
    }
  ]
}
