{
  "description": "[EuroPython 2024 — Terrace 2B on 2024-07-11]\n\n\rBest practices for securely consuming open source in Python by Ciara Carey\n\rhttps://ep2024.europython.eu/session/best-practices-for-securely-consuming-open-source-in-python\n\n\rThe Python development landscape thrives on the extensive use of open-source libraries and frameworks. However, the growing prevalence of attacks targeting OSS underscores the need for robust security measures to consume open source. \n\n\rIn this talk, we'll examine how the Secure Supply Chain Consumption Framework (S2C2F) can guide organizations in securely consuming Python OSS, utilizing tools such as pip, artifact managment, sboms and Dependabot. \n\n\rThe S2C2F Framework was developed by Microsoft and later donated to the Open Source Security Foundation (OpenSSF). It provides a structured approach to enhancing the security of OSS consumption. \n\n\rWe'll provide an overview of its core principles and maturity levels and discuss practical strategies for implementing S2C2F principles within Python projects, including dependency management with pip, artifact management, sboms, signatures, deny rules, forking policies and automated security updates with Dependabot.\n\n\rThe S2C2F is a pragmatic approach to securing how you consume OSS.\n\r It emphasizes the fundamental principles of knowing your OSS, preventing the introduction of vulnerable packages, and maintaining robust patch management.\n\n\rYou will come away from this talk with practical tips and best practices on how to securely consume open source in python.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1972,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/best-practices-for-securely-consuming-open-source-in-python",
      "url": "https://ep2024.europython.eu/session/best-practices-for-securely-consuming-open-source-in-python"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/TUH_nI9XrxM/maxresdefault.jpg",
  "title": "Best practices for securely consuming open source in Python — Ciara Carey",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TUH_nI9XrxM"
    }
  ]
}
