{
  "description": "[EuroPython 2024 — Terrace 2B on 2024-07-12]\n\n\rBuilding Event-Driven Python service using FastStream and AsyncAPI by Abhinand C\n\rhttps://ep2024.europython.eu/session/building-event-driven-python-service-using-faststream-and-asyncapi\n\n\rIn this talk, we dive into the world of Event Driven Architecture and Message Streaming, using Python and FastStream. \n\n\rYou'll learn to integrate FastStream, a python framework, into your projects and leverage AsyncAPI to define contracts for asynchronous communication and event streaming. Through practical examples and insights, you'll discover the art of building scalable, responsive Python applications that thrive in real-time environments.\n\n\n\r#### About AsyncAPI\n\rAsyncAPI is an open standard/specification and growing set of open-source tools to help developers define, build, and maintain asynchronous APIs and Event-Driven Architectures. It describes message-driven APIs in a machine-readable format, and is protocol-agnostic.\n\n\r#### About FastStream\n\rFastStream is a powerful and easy-to-use Python framework for building asynchronous services interacting with event streams such as Apache Kafka, RabbitMQ, NATS and Redis. FastStream simplifies the process of writing producers and consumers for message queues, handling all the parsing, networking and documentation generation automatically. FastStream provides unified API across multiple brokers, built-in Pydantic validations, automatic AsyncAPI documentation, FastAPI like Dependency Injection System, built-in support for test and extensions.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1735,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/building-event-driven-python-service-using-faststream-and-asyncapi",
      "url": "https://ep2024.europython.eu/session/building-event-driven-python-service-using-faststream-and-asyncapi"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/5UL71U3NcCg/maxresdefault.jpg",
  "title": "Building Event-Driven Python service using FastStream and AsyncAPI — Abhinand C",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5UL71U3NcCg"
    }
  ]
}
