{
  "description": "[EuroPython 2024 — North Hall on 2024-07-10]\n\n\rBuilding Scalable Multimodal Search Applications with Python by Zain Hasan\n\rhttps://ep2024.europython.eu/session/building-scalable-multimodal-search-applications-with-python\n\n\rMany real-world problems are inherently multimodal, from the communicative modalities humans use such as spoken language and gestures to the force, sensory, and visual sensors used in robotics. For machine learning models to address these problems and interact more naturally and wholistically with the world around them and ultimately be more general and powerful reasoning engines, we need them to understand data across all of its corresponding images, video, text, audio, and tactile representations.\n\n\rIn this talk, Zain Hasan will discuss how we can use open-source multimodal embedding models in conjunction with large generative multimodal models that can that can see, hear, read, and feel data(!), to perform cross-modal search(searching audio with images, videos with text etc.) and multimodal retrieval augmented generation (MM-RAG) at the billion-object scale with the help of open source vector databases. I will also demonstrate, with live code demos, how being able to perform this cross-modal retrieval in real-time can enables users to use LLMs that can reason over their enterprise multimodal data. This talk will revolve around how we can scale the usage of multimodal embedding and generative models in production.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1511,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/building-scalable-multimodal-search-applications-with-python",
      "url": "https://ep2024.europython.eu/session/building-scalable-multimodal-search-applications-with-python"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/LQHyyOsT61k/maxresdefault.jpg",
  "title": "Building Scalable Multimodal Search Applications with Python — Zain Hasan",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LQHyyOsT61k"
    }
  ]
}
