{
  "description": "[EuroPython 2024 — South Hall 2A on 2024-07-11]\n\n\rContainerize your Python apps like it's 2024 by Jan Smitka\n\rhttps://ep2024.europython.eu/session/containerize-your-python-apps-like-it-s-2024\n\n\rThere are a lot of resources on containerizing Python applications with Docker, but most are basic and outdated. Following them results in slow builds and potentially insecure applications. Let's see how we can build better containers using recent Docker features!\n\n\rThis talk will show how to speed up your builds and make your images smaller and more secure. We'll use features such as multi-stage builds or cache mounts to build containers with Python apps. We will also discuss how to improve the security of your container.\n\n\rTips from the talk are valid for applications of all sizes and kinds: from hobby projects to enterprises, from CLI tools to web applications and APIs. You will be able to apply them immediately after the talk.\n\n\rBasic knowledge of Docker and its key concepts (images, layers, Dockerfile commands) is required. You'll learn something new even if you have used Docker for some time.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1785,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/containerize-your-python-apps-like-it-s-2024",
      "url": "https://ep2024.europython.eu/session/containerize-your-python-apps-like-it-s-2024"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/pgqAKd_nOHw/maxresdefault.jpg",
  "title": "Containerize your Python apps like it's 2024 — Jan Smitka",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pgqAKd_nOHw"
    }
  ]
}
