{
  "description": "[EuroPython 2024 — Terrace 2B on 2024-07-11]\n\n\rCounting down for CRA - updates and expectations by Cheuk Ting Ho, Deb Nicholson\n\rhttps://ep2024.europython.eu/session/counting-down-for-cra-updates-and-expectations\n\n\rThe EU Commission is likely to vote on the Cyber Resilience Act (CRA) later this year. The CRA is an ambitious step towards protecting consumers from software security issues by creating a new list of responsibilities for software developers and providers. The Act also creates a new category of actor known as an “Open Source Steward” which we think makes important allowances for public open source repositories like CPython and Python Package Index (PyPI.) Once the dust settles, everyone who makes software will need to consider the CRA’s mandates in their security roadmaps. \n\n\rIn this talk we will look at the timeline for the new legislation, any critical discussions happening around implementation and most importantly, the new responsibilities outlined by the CRA. We’ll also discuss what the PSF is doing for CPython and for PyPI and what each of us in the Python ecosystem might want to do to get ready for a new era of increased certainty – and liability – around security. \n\n\r## Target audience\n\n\rDevelopers and maintainers whose project or product may be affected by the CRA. European legislation won’t just affect the European market, it will affect the software industry and the open source community globally as it is very hard to segregate one project or product from the EU market. So, this is for everyone in the Python community who shares their code with the world. \n\n\r## Goal\n\n\rTo educate the general public about CRA - how it can affect us and how to get ready for it. We also want to provide more information for the Python community about what has been done by the PSF regarding the CRA to reassure them that the Python community is aware and getting prepared for the CRA.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1823,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/counting-down-for-cra-updates-and-expectations",
      "url": "https://ep2024.europython.eu/session/counting-down-for-cra-updates-and-expectations"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ZyC7c5fxr3A/maxresdefault.jpg",
  "title": "Counting down for CRA - updates and expectations — Cheuk Ting Ho, Deb Nicholson",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZyC7c5fxr3A"
    }
  ]
}
