{
  "description": "[EuroPython 2024 — Terrace 2A on 2024-07-11]\n\n\rCreating Your Own Extensions for JupyterLab by Daniel Goldfarb\n\rhttps://ep2024.europython.eu/session/creating-your-own-extensions-for-jupyterlab\n\n\rHave you ever wished for a feature in Jupyter Notebooks or JupyterLab that wasn't already there?  Or perhaps you've found yourself doing complex or repetitive tasks and realized that you, and others, could benefit from integrating those tasks into JupyterLab?  This is your chance to learn how to add that feature, or integrate that task, yourself.\n\n\rJupyterLab enables you to work with Jupyter notebooks, text editors, terminals, and custom components in a flexible, integrated, and extensible manner.\n\n\rThis talk presents a practical tutorial about how to extend JupyterLab.  We focus on understanding the underlying extension support infrastructure, as we walk through a step-by-step example of creating an app in JupyterLab.  We will learn, among other things, how to launch that app from different places within JupyterLab, how to style our app, and how to pass parameters to our app to modify its behavior.\n\n\rPrerequisites:\n\r- Attendees should have some familiarity with Jupyter Notebooks and/or JupyterLab.\n\r- Attendees must have solid experience with _any_ typical object-oriented programming language (i.e. a good understanding of classes, objects, and inheritance).\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2492,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/creating-your-own-extensions-for-jupyterlab",
      "url": "https://ep2024.europython.eu/session/creating-your-own-extensions-for-jupyterlab"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/WPg9S8o9kBI/maxresdefault.jpg",
  "title": "Creating Your Own Extensions for JupyterLab — Daniel Goldfarb",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WPg9S8o9kBI"
    }
  ]
}
