{
  "description": "[EuroPython 2024 — North Hall on 2024-07-11]\n\n\rDBT & Python - How to write reusable and testable pipelines by Florian Stefan\n\rhttps://ep2024.europython.eu/session/dbt-python-how-to-write-reusable-and-testable-pipelines\n\n\rThe \"data build tool\" (DBT) was designed to unlock software engineering best practices for SQL-based data pipelines: pipelines as version controlled directed acyclic graphs (DAGs) consisting of testable and reusable nodes. With the increasing number of cloud data warehouses and data lakehouses that allow the native execution of Python code, DBT also added support for Python models.\n\rIn this talk, I will explain how Flatiron Health uses DBT to improve and extend lives by learning from the experience of every person with cancer. We will discuss an example project setup that uses SQL as well as Python models. I will share our experiences with unit and data testing as well as with writing a reusable variable library.\n\rThe talk is well-suited for anyone with prior data warehouse or data lakehouse experience who is curious how they can leverage DBT to write test-driven and reusable data piplines. The example project will use SQL, Python and Snowflake.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1837,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2024.europython.eu/session/dbt-python-how-to-write-reusable-and-testable-pipelines",
      "url": "https://ep2024.europython.eu/session/dbt-python-how-to-write-reusable-and-testable-pipelines"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/DUX-bEW1_bU/maxresdefault.jpg",
  "title": "DBT & Python - How to write reusable and testable pipelines — Florian Stefan",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DUX-bEW1_bU"
    }
  ]
}
