{
  "description": "[EuroPython 2024 — Terrace 2A on 2024-07-10]\n\n\rDesigning Config Files: The Conflicting Needs of Programmers and Users by Steven Pool\n\rhttps://ep2024.europython.eu/session/designing-config-files-the-conflicting-needs-of-programmers-and-users\n\n\rWhen your programs are configuration driven and used by PM/PO/Scientists etc you have to think slightly differently about how configuration files are used in your projects. For example, users may want to change/create configs on the fly and they may want to see all settings in one file without having to go through layers of indirection and library “configs” to see what their experiment/program will do.\n\n\rRather than discussing config file formats (I’ll assume toml but it’s applicable for other formats), this talk will focus more on my ideas/tips on: how to structure config files, how to allow non technical people to contribute to config files, how to minimise potentially explosive number of config files, how to expose more control in config files, tools for testing these configs and checking if values are actually used, hints for good practices to make debugging problems easier.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1726,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/designing-config-files-the-conflicting-needs-of-programmers-and-users",
      "url": "https://ep2024.europython.eu/session/designing-config-files-the-conflicting-needs-of-programmers-and-users"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/rC22kQXNbwo/maxresdefault.jpg",
  "title": "Designing Config Files: The Conflicting Needs of Programmers and Users — Steven Pool",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rC22kQXNbwo"
    }
  ]
}
