{
  "description": "[EuroPython 2024 — South Hall 2A on 2024-07-10]\n\n\rDFD(Documentation-First Development) with FastAPI by Taehyun Lee\n\rhttps://ep2024.europython.eu/session/dfd-documentation-first-development-with-fastapi\n\n\rMany software engineers, particularly web developers, recognize the critical importance of documentation for efficient collaboration. Yet, the challenge of maintaining up-to-date documentation remains a pervasive issue, often due to human errors such as failing to update documentation after changes in the codebase.\n\n\rThis presentation introduces the philosophy of Documentation-First Development (DFD), a methodology I advocate for that leverages the code-based OpenAPI documentation generation capabilities of the FastAPI framework. I will discuss methods to embody this philosophy, including the use of a sub-application pattern to segregate API documents and the application of generic types for crafting reusable custom response models. Additionally, I will address the limitations of traditional approaches to API documentation and demonstrate how FastAPI, in conjunction with Pydantic, offers a more effective solution by automatically keeping documentation synchronized with the code.\n\n\rThis presentation aims to enlighten attendees on the benefits of the FastAPI framework and provide practical insights into creating precise and well-maintained API documentation. It is designed for audiences interested in enhancing their documentation practices and those curious about the advantages of employing FastAPI for web development projects.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2242,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2024.europython.eu/session/dfd-documentation-first-development-with-fastapi",
      "url": "https://ep2024.europython.eu/session/dfd-documentation-first-development-with-fastapi"
    }
  ],
  "speakers": [
    "Taehyun Lee"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/HKDbnpWsjv0/maxresdefault.jpg",
  "title": "DFD(Documentation-First Development) with FastAPI",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HKDbnpWsjv0"
    }
  ]
}
