{
  "description": "[EuroPython 2024 — North Hall on 2024-07-11]\n\n\rDon't fix bad data, do this instead by Martina Ivanicova\n\rhttps://ep2024.europython.eu/session/don-t-fix-bad-data-do-this-instead\n\n\rIn a time where GenAI is quickly growing in popularity, along with prescriptive analytics and online ML models, the question is raised whether we still need to care about data quality? We strongly believe that the answer is yes, and even more so than before! \n\n\rOur expectations of data are high, and this often leads to frustrations when reality does not meet these expectations. \n\n\rIn the pursuit of data quality, expectations must be grounded in reality. It is often the case that a gap exists between anticipated outcomes and the actual data reality, which leads to frustration and mistrust. \n\n\rThis talk delves into pragmatic strategies that can be employed to bridge this gap.  The talk  will discuss both the technical  (hard) and cultural  (soft) measures implemented to uphold these standards.\n\n\rKey Takeaways:\n\r1. Integration tests serve as a proactive barrier, preempting the violation of data contracts, unlike reactive data quality checks.\n\r2. Prioritisation is crucial; a product-centric mindset is key when evaluating the balance between resource investment and potential gain.\n\r3. Data quality management is requiring both hard and soft measures\n\n\n\rAre you a data scientist, software engineer, product manager, or data engineer? Join us in this discussion; data quality concerns us all.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1501,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/don-t-fix-bad-data-do-this-instead",
      "url": "https://ep2024.europython.eu/session/don-t-fix-bad-data-do-this-instead"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Vk1GHgBxdBY/maxresdefault.jpg",
  "title": "Don't fix bad data, do this instead — Martina Ivanicova",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Vk1GHgBxdBY"
    }
  ]
}
