{
  "description": "[EuroPython 2024 — North Hall on 2024-07-11]\n\n\rEarth Observation through Large Vision Models by Mayank Khanduja\n\rhttps://ep2024.europython.eu/session/earth-observation-through-large-vision-models\n\n\rEver wondered how location planning is done to build city infrastructure? Or when there is a disaster, how do we determine the possible affected areas and send reinforcements there? We require overhead imagery for that, which we mainly obtain from satellites.\n\rEuropean Space Agency has sent various satellites however, the dataset from these satellites is huge and may even contain multiple bands from the electromagnetic spectrum. Large AI models have a huge potential in this domain, if they are developed to work well with this dataset.\n\rThere are a lot of pre-trained Generative & Large Vision models on platforms like HuggingFace, Kaggle, etc., but these models do not integrate well with a specific domain like satellite datasets, hence the need to train or fine-tune them. In this talk, we are going to see from where we can access open satellite datasets, fine-tune various Vision Models and Multimodals on it, and examine the following applications:\n\n\r- Perform Zero-Shot classification and object detection on satellite images with human language input using Multimodal models.\n\r- Image-to-image translation on satellite imagery using generative vision models.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2171,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2024.europython.eu/session/earth-observation-through-large-vision-models",
      "url": "https://ep2024.europython.eu/session/earth-observation-through-large-vision-models"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/M-T7CnuQdVk/maxresdefault.jpg",
  "title": "Earth Observation through Large Vision Models — Mayank Khanduja",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=M-T7CnuQdVk"
    }
  ]
}
