{
  "description": "[EuroPython 2024 — Terrace 2B on 2024-07-12]\n\n\rEffective Strategies for Disability Inclusion in Open Source Communities by Brayan Kai Mwanyumba\n\rhttps://ep2024.europython.eu/session/effective-strategies-for-disability-inclusion-in-open-source-communities\n\n\rIn today's world, where disability affects a significant percentage of the population, it is crucial for open-source communities to address the challenges faced by persons with disabilities (PWDs) and work towards their inclusion. This talk will delve into practical measures such as referral programs, internal disability disclosures, and integrating disability into existing agendas rather than treating it as a separate issue. We will dive into disability mainstreaming with a focus on its role in promoting universal design and inclusivity. Attendees will gain insights into establishing disability mainstreaming committees, formulating action plans, implementing best practices, and monitoring and evaluating progress.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1260,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/effective-strategies-for-disability-inclusion-in-open-source-communities",
      "url": "https://ep2024.europython.eu/session/effective-strategies-for-disability-inclusion-in-open-source-communities"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/v6QBk1MDmPI/maxresdefault.jpg",
  "title": "Effective Strategies for Disability Inclusion in Open Source Communities — Brayan Kai Mwanyumba",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=v6QBk1MDmPI"
    }
  ]
}
