{
  "description": "[EuroPython 2024 — Terrace 2B on 2024-07-10]\n\n\rEnterprise Python: Software That Lives Long And Prosper by Alvaro Duran\n\rhttps://ep2024.europython.eu/session/enterprise-python-software-that-lives-long-and-prosper\n\n\rEvery day, as software continues to “eat the world”, applications increasingly grow in complexity. \n\rNowhere else is this phenomenon more prevalent than in big organizations, which over time have hired more people to develop and maintain more features. There, it is no longer possible to have a complete mental model of what is going on.\n\rEnterprise software, when unchecked, bloats and becomes brittle.\n\rParadoxically, engineers build software to  keep complexity at bay, not to create it. When writing code, the goal is to make processes less labor intensive and more reliable. Yet, enterprise software has become a black hole for man-hours.\n\rPython disrupted Java to become the de facto programming language for enterprises precisely because it tackled this problem in a way that Java, or any other programming language, could not.\n\rHow is that so? This talk will dive deep into this exact question. What does Python offer that radically changed how software gets built in organizations, both big and small?. And why is it that newer languages that have come along, such as Go and Rust, haven’t been able to put a dent on its dominions, and have been forced to recede into niche use cases.\n\rThis talk is for engineers who want to understand and leverage Python to its maximum maintainability potential. They intuitively understand that Python is a great tool for that, but are unsure as to how to do it.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1473,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/enterprise-python-software-that-lives-long-and-prosper",
      "url": "https://ep2024.europython.eu/session/enterprise-python-software-that-lives-long-and-prosper"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/YFVJxMjp5iA/maxresdefault.jpg",
  "title": "Enterprise Python: Software That Lives Long And Prosper — Alvaro Duran",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YFVJxMjp5iA"
    }
  ]
}
