{
  "description": "[EuroPython 2024 — Terrace 2A on 2024-07-12]\n\n\rExploring Apache Iceberg: A Modern Data Lake Stack by Gowthami Bhogireddy\n\rhttps://ep2024.europython.eu/session/exploring-apache-iceberg-a-modern-data-lake-stack\n\n\rBloomberg is a leading provider of financial data, with information spanning multiple decades. Handling and organizing these huge datasets can be challenging, with typical concerns including sluggish query performance, high storage costs, and data consistency problems.\n\rThis talk will describe how Apache Iceberg is revolutionizing big data management, offering ACID transactions, time travel, and seamless schema evolution that enable lightning-fast query performance and robust data consistency for even our largest workloads.\n\rThe session will introduce Apache Iceberg, an open-source table format that enables incremental updates, versioning, and schema evolution. The discussion will focus on how these features address common big data management challenges, improve query performance, and reduce storage costs. Finally, the session will outline how our Enterprise Data Lake Applications engineering team has harnessed the capabilities of Apache Iceberg (especially PyIceberg) to revolutionize our data management and analytical processing workflows.\n\rAttendees will be able to apply the best practices discussed in the talk to build better infrastructure for their growing data demands and spur innovation within their organization.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1724,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/exploring-apache-iceberg-a-modern-data-lake-stack",
      "url": "https://ep2024.europython.eu/session/exploring-apache-iceberg-a-modern-data-lake-stack"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/GT6mb0043Xk/maxresdefault.jpg",
  "title": "Exploring Apache Iceberg: A Modern Data Lake Stack — Gowthami Bhogireddy",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GT6mb0043Xk"
    }
  ]
}
