{
  "description": "[EuroPython 2024 — Forum Hall on 2024-07-11]\n\n\rFastUI - panacea or pipe dream? by Samuel Colvin\n\rhttps://ep2024.europython.eu/session/fastui-panacea-or-pipe-dream\n\n\rAre web interfaces defined in Python a genius idea, a complete folly, or (like most technologies) a good fit for some use cases but not all?\n\n\rI'll give a brief tour of packages that let you build web interfaces by writing only Python, including Streamlit, Gradio, NiceGUI, reflex, Solara, dominate, ReactPy and FastUI (recently released by the Pydantic team).\n\n\rThe main three questions I'll be asking are:\n\n\r1. Is building a web UI in Python really a good idea at all?\n\r2. What fundamental trade-offs are required to make such a tool successful?\n\r3. If someone can answer point 1 and 2, when's the right time to use these tools? \n\n\rOver the last couple of years, lots of different libraries have emerged to let you develop web interfaces without getting your hands dirty with HTML, CSS, the JS ecosystem; but so far none have got as popular as \"traditional\" template rendering (Jinja, Django) or modern SPA frameworks like React.\n\n\rSo are we at the dawn of a new way era — and one of these frameworks will become ubiquitous. Or is the whole idea that you can build such an interface without engaging with the fundamental technologies that power them mistaken?\n\n\rOne important question is \"what kind of interface are we aiming at?\" If we are trying to give complete control over the browser, allowing Python developers to do everything raw JavaScript can do; our solution will look very different to something that is \"just\" trying to allow Python developers to plug common components together to build 80% of UIs with 20% of the effort.\n\n\rLooking at the question through this lens will help explain the design choices of the above libraries, and might even allow us to guess at which approaches will be most\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1761,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/fastui-panacea-or-pipe-dream",
      "url": "https://ep2024.europython.eu/session/fastui-panacea-or-pipe-dream"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Samuel Colvin"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/CNYXGVAEPxY/maxresdefault.jpg",
  "title": "FastUI - panacea or pipe dream?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CNYXGVAEPxY"
    }
  ]
}
