{
  "description": "[EuroPython 2024 — Terrace 2A on 2024-07-10]\n\n\rFrom built-in concurrency primitives to large scale distributed computing by Jakub Urban\n\rhttps://ep2024.europython.eu/session/from-built-in-concurrency-primitives-to-large-scale-distributed-computing\n\n\rThis talk is specifically designed for Python developers and data practitioners who wish to deepen their skills in asynchronous code execution, from single CPU applications to complex distributed systems with thousands of cores. We'll provide a detailed exploration and explanation of Python's asynchronous execution models and concurrency primitives, focusing on `Future` and `Executor` interfaces within the `concurrent.futures` module, and the event-driven architecture of `asyncio`. Special attention will be given to the processing of large datasets, a common challenge in data science and engineering.\n\n\rWe will start with the fundamental concepts and then explore how they apply to large scale, distributed execution frameworks like Dask or Ray. On step-by-step examples, we aim to demonstrate simple function executions and map-reduce operations. We will illustrate efficient collaboration between different concurrency models. The session will cover the transition to large-scale, distributed execution frameworks, offering practical guidelines for scaling your computations effectively and addressing common hurdles like data serialization in distributed environments.\n\n\rAttendees will leave with a solid understanding of asynchronous code execution underpinnings. This talk will empower you to make informed practical decisions about applying concurrency in your data processing workflows. You will be able to seamlessly integrate new libraries or frameworks into your projects, ensuring optimal development lifecycle, performance and scalability.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2413,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/from-built-in-concurrency-primitives-to-large-scale-distributed-computing",
      "url": "https://ep2024.europython.eu/session/from-built-in-concurrency-primitives-to-large-scale-distributed-computing"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/_2kQcmrYSA0/maxresdefault.jpg",
  "title": "From built-in concurrency primitives to large scale distributed computing — Jakub Urban",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_2kQcmrYSA0"
    }
  ]
}
