{
  "description": "[EuroPython 2024 — Terrace 2A on 2024-07-10]\n\n\rGeoPandas 1.0 and beyond by Martin Fleischmann\n\rhttps://ep2024.europython.eu/session/geopandas-1-0-and-beyond\n\n\rGeoPandas is one of the core packages in the Python ecosystem to work with geospatial vector data. By combining the power of several open source geo tools (GEOS/Shapely, GDAL/pyogrio, PROJ/pyproj) and extending the pandas data analysis library to work with geographic objects, it is designed to make working with geospatial data in Python easier. Recently, the development that started more than ten years ago resulted in version 1.0.\n\n\rThis talk will give an overview of what is new in GeoPandas 1.0 and of recent developments in the broader ecosystem of packages on which GeoPandas depends, or that extend GeoPandas. We will highlight some changes and new features in GeoPandas 1.0, such as the new default IO based on pyogrio, closer integration of Shapely 2.0 leading to a range of new methods, and the removal of other geometry engines and consequences of that. We will look at the journey of the GeoPandas from its start at SciPy 2013 to the current 1.0 and discuss the plans moving forward, covering support of spherical geometries, native support for GeoArrow, and more. You will get a sense of what is coming in future, where to help the development and how to prepare your code for upcoming changes.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1549,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2024.europython.eu/session/geopandas-1-0-and-beyond",
      "url": "https://ep2024.europython.eu/session/geopandas-1-0-and-beyond"
    }
  ],
  "speakers": [
    "Martin Fleischmann"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/SgQA_ac2AZk/maxresdefault.jpg",
  "title": "GeoPandas 1.0 and beyond",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SgQA_ac2AZk"
    }
  ]
}
