{
  "description": "[EuroPython 2024 — South Hall 2A on 2024-07-10]\n\n\rHow to sell a big refactor or rewrite to the business? by Ivett Ördög\n\rhttps://ep2024.europython.eu/session/how-to-sell-a-big-refactor-or-rewrite-to-the-business\n\n\rIn the world of software development, dealing with legacy code is often a necessary evil, especially for successful, fast-growing companies. The design stamina hypothesis suggests that legacy code is a sign of success, not failure. But how do we tackle this challenge smartly? This talk delves into the often-misunderstood realm of large-scale refactoring and rewrites, presenting a nuanced approach that contrasts with the traditional 'never rewrite' dogma.\n\n\rWe'll delve into real-world case studies where companies have successfully navigated their technical debt, uncovering crucial insights. Specifically, we will identify two key properties of these successful rewrites that can make or break your efforts. Understanding these properties enables us to strategically manage technical debt without losing our competitive edge. This session is not just a theoretical discussion but a practical guide, concluding with a decision-making quadrant to help determine the most effective approach for your team's refactor or rewrite projects. Whether you're leading a team through growth or coaching developers on best practices, this talk will equip you with a deeper understanding and actionable insights into one of the most critical aspects of software development.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2540,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/how-to-sell-a-big-refactor-or-rewrite-to-the-business",
      "url": "https://ep2024.europython.eu/session/how-to-sell-a-big-refactor-or-rewrite-to-the-business"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/XLwZVRTSRGY/maxresdefault.jpg",
  "title": "How to sell a big refactor or rewrite to the business? — Ivett Ördög",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XLwZVRTSRGY"
    }
  ]
}
