{
  "description": "[EuroPython 2024 — Forum Hall on 2024-07-10]\n\n\rHow to deliver 3x faster with effective API design by Michal Cyprian\n\rhttps://ep2024.europython.eu/session/how-to-deliver-3x-faster-with-effective-api-design\n\n\rIn today's fast-paced world, the ability to deliver new features quickly is crucial for product-oriented companies. In this talk, we'll dive into architectural patterns that optimize the delivery of multiple client implementations in complex client-server architectures.\n\n\rThe advent of the mobile age has dramatically altered the landscape of typical client-server models. Delivering a new feature on multiple platforms is complicated and time-consuming because it requires several engineering teams to communicate extensively and separately code and test the same feature in different languages for each platform. Let's see how architectural patterns known as Backend for Frontend (BFF) and Server-driven UI can help with solving these challenges and what the limitations are. We'll explore Python optimizations, caching strategies, and SQLAlchemy preloading techniques, which were crucial to the success of the case study I will share.\n\n\rThis talk aims to provide you with an overview of useful architectural patterns, insights on how to implement and optimize them in Python, and strategies to make your product managers happy by shortening your time to production.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1757,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/how-to-deliver-3x-faster-with-effective-api-design",
      "url": "https://ep2024.europython.eu/session/how-to-deliver-3x-faster-with-effective-api-design"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Michal Cyprian"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/yLaz5k89De4/maxresdefault.jpg",
  "title": "How to deliver 3x faster with effective API design",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yLaz5k89De4"
    }
  ]
}
