{
  "description": "[EuroPython 2024 — North Hall on 2024-07-10]\n\n\rImpersonation in Data Engineering: No More Credentials in Your Code! by Marian Špilka\n\rhttps://ep2024.europython.eu/session/impersonation-in-data-engineering-no-more-credentials-in-your-code\n\n\rImagine stepping into your dream job as a python data developer, ready to dive into coding and show your talent, only to run into missing database credentials that leave you idle for days due to slow interdepartmental communications and permission issues. Frustrating, right?\n\n\rIn my talk, I'll showcase how we can make this whole process much easier. I’ll explain how using something called “Identity and Access Management” (IAM) lets everyone in a company, including machines, get to work without these annoying holdups. \n\n\rSurprised to hear that a machine like Airflow can have its own identity? I'll explain how we use something known as Workload Identity as a crucial part in this ecosystem integrating Airflow within our infrastructure.\n\n\rA central pillar of the discussion will be the role of impersonation in our setup - how it ties together various elements to enable a harmonious, secure, and maintainable infrastructure. The resulting architecture not only fosters an improved developer experience, faster project delivery, increased productivity and transparency, but also serves as a foundation for more advanced concepts such as data mesh implementation.\n\n\rJoin me in this talk to discover the synergy of IAM, Workload Identity, and impersonation. Let's equip you with a model that promotes easy team onboarding, transparent access management, and a secure, frustration-free workspace focused on delivery.\n\n\r  And for those interested in having their code perform consistently, whether on a local machine or in the cloud, I will share a small but powerful Docker hack to achieve things consistently no matter where your code is running.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1461,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/impersonation-in-data-engineering-no-more-credentials-in-your-code",
      "url": "https://ep2024.europython.eu/session/impersonation-in-data-engineering-no-more-credentials-in-your-code"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Marian Špilka"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/PRp_ycnQV_o/maxresdefault.jpg",
  "title": "Impersonation in Data Engineering: No More Credentials in Your Code!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PRp_ycnQV_o"
    }
  ]
}
