{
  "description": "[EuroPython 2024 — South Hall 2B on 2024-07-12]\n\n\rIt’s happening: TUF joins PyPI (Warehouse) by Kairo de Araujo, Lukas Pühringer\n\rhttps://ep2024.europython.eu/session/its-happening-tuf-joins-pypi-warehouse\n\n\rThe Update Framework (TUF) has been a prime reference for secure package delivery and updates for many years. Despite its popularity, integrating with existing package managers remains challenging.\n\n\rPEP 458 is a very good example of some of the related challenges. Authored a decade ago, it aims to protect the freshness, consistency, and integrity of packages in the Python Packaging Index (PyPI) and provide compromise resilience. Even though these goals remain largely unaddressed, PEP 458 has not made its way into production yet!\n\n\rWith Repository Service For TUF (RSTUF), a new tool has emerged, which makes implementing and maintaining a TUF-powered package repository a black box to the repository maintainers and which has become mature enough to kick off an incremental integration in Warehouse and RubyGems.\n\n\rIn this talk, Kairo, RSTUF's tech lead, and Lukas, TUF project maintainer, will show how RSTUF has evolved and allowed us to take a big leap towards adopting TUF in Warehouse and elsewhere. Primers on TUF, PEP 458, and Warehouse will be included.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1520,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/its-happening-tuf-joins-pypi-warehouse",
      "url": "https://ep2024.europython.eu/session/its-happening-tuf-joins-pypi-warehouse"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ZKcxa6Ch6mY/maxresdefault.jpg",
  "title": "It’s happening: TUF joins PyPI (Warehouse) — Kairo de Araujo, Lukas Pühringer",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZKcxa6Ch6mY"
    }
  ]
}
