{
  "description": "[EuroPython 2024 — Terrace 2B on 2024-07-11]\n\n\rlogger.info(f\"Don't Give all your {secrets} away\") by Tamar Galer\n\rhttps://ep2024.europython.eu/session/logger-info-f-don-t-give-all-your-secrets-away\n\n\rIn my seven years as a software developer, I've primarily worked in teams composed solely of developers. However, my recent transition to a team of security researchers has opened my eyes to a crucial aspect that often goes unnoticed: log safety in applications.\n\n\rMy exposure to the application security ecosystem and real-life security breach analysis has opened my eyes to recognize code security issues, including the prevalence of sensitive information, tokens,  passwords, and payment details, in plaintext logs. This may lead to severe data breaches, financial losses, and all kinds of catastrophes.\n\n\rThis talk will dive into the fatal mistakes developers often make that can result in the disclosure of sensitive information in logs. We'll explore the types of sensitive data in logs.\n\n\rI'll share my personal experiences as a developer on a security research team and shed light on the often-overlooked consequences of insecure logging practices. We'll discuss practical patterns to safeguard sensitive information in Python applications, including identifying and redacting sensitive data before it reaches log files, and implementing secure logging practices.\n\n\rBy the end of this talk, developers will be equipped with the knowledge and tools to protect sensitive data from accidental disclosure and safeguard their applications from the perils of sensitive data exposure. Embrace the journey towards log safety and ensure your code remains secure and confidential.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1462,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2024.europython.eu/session/logger-info-f-don-t-give-all-your-secrets-away",
      "url": "https://ep2024.europython.eu/session/logger-info-f-don-t-give-all-your-secrets-away"
    }
  ],
  "speakers": [
    "Tamar Galer"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/4uci2RiTsyw/maxresdefault.jpg",
  "title": "logger.info(f\"Don't Give all your {secrets} away\")",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4uci2RiTsyw"
    }
  ]
}
