{
  "description": "[EuroPython 2024 — Terrace 2A on 2024-07-11]\n\n\rMastering Design Patterns: Crafting Elegant Solutions with a Confidence by Petr Balogh\n\rhttps://ep2024.europython.eu/session/mastering-design-patterns-crafting-elegant-solutions-with-a-confidence\n\n\rJoin us for an illuminating 30-minute journey into the world of design patterns at EuroPython 2024. Design patterns aren't just abstract concepts; they are the architectural blueprints that empower developers to create elegant and maintainable software solutions. In this session, we bridge the gap between theory and practice, offering practical insights for developers of all levels.\n\n\rWe'll delve into a curated selection of design patterns, from foundational creational patterns to advanced behavioral patterns, showcasing their real-world applications and transformative impact on Python development. Through a blend of theory and practice, attendees will gain a comprehensive understanding of how to identify common design problems and apply appropriate patterns to solve them efficiently.\n\n\rUsing engaging examples and hands-on exercises, we'll equip attendees with the knowledge and skills needed to architect cleaner, more maintainable codebases. Whether you're a seasoned veteran or a curious novice, this presentation offers a comprehensive roadmap for mastering Python design patterns and architecting software solutions with grace.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1676,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/mastering-design-patterns-crafting-elegant-solutions-with-a-confidence",
      "url": "https://ep2024.europython.eu/session/mastering-design-patterns-crafting-elegant-solutions-with-a-confidence"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Petr Balogh"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/t5HlKbKo-Lo/maxresdefault.jpg",
  "title": "Mastering Design Patterns: Crafting Elegant Solutions with a Confidence",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=t5HlKbKo-Lo"
    }
  ]
}
