{
  "description": "[EuroPython 2024 — South Hall 2B on 2024-07-12]\n\n\rNavigating Tech Leadership: Challenges and Strategies by Çağıl Uluşahin Sönmez\n\rhttps://ep2024.europython.eu/session/navigating-tech-leadership-challenges-and-strategies\n\n\rJoin us for a discussion on navigating tech leadership roles in the dynamic world of technology. \n\n\rIn this talk, we will explore the essence of managerial roles in the tech industry, examining the unique challenges faced by leaders at different levels. We'll discuss the critical decision every developer must make regarding balancing or giving up hands-on expertise with management responsibilities, as well as the challenges of transitioning from a primarily technical role to a managerial position.\n\n\rAdditionally, we'll explore the challenges that managees may face when led by managers and tech leads who may lack management training or experience. We'll also discuss strategies for fostering a more inclusive and supportive engineering culture overall.\n\n\rLet's talk about management in tech from the perspective of a tech lead that identifies as a woman.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2086,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/navigating-tech-leadership-challenges-and-strategies",
      "url": "https://ep2024.europython.eu/session/navigating-tech-leadership-challenges-and-strategies"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Çağil Uluşahin Sönmez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/JYO2DlrzRbA/maxresdefault.jpg",
  "title": "Navigating Tech Leadership: Challenges and Strategies",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JYO2DlrzRbA"
    }
  ]
}
