{
  "description": "[EuroPython 2024 — North Hall on 2024-07-10]\n\n\rOne analysis a day keeps anomalies away! by Madalina Ciortan\n\rhttps://ep2024.europython.eu/session/one-analysis-a-day-keeps-anomalies-away\n\n\rEver felt like you’re navigating a data jungle, battling to survive the unexpected production problems that throw you off track? Well, you’re not alone. Staying on top of your data's health is not just smart – it's crucial. In this talk, I will share some Python tricks (methods and libraries) that you can use to defend from those wild data problems. Because let's face it, being able to effectively monitor your data, spot sneaky anomalies, and get to the bottom of them is the key to unlocking a buried treasure.\n\n\rFirst, I'll take you through the ins and outs of observability, highlighting its importance for managing both the inputs and outputs of machine learning models, as well as for overall data quality. We'll explore a range of techniques to detect anomalies, with a focus on multivariate time series data. We'll also cover how we can keep this process as computationally efficient as possible.\n\n\rBut we won't stop at just finding these anomalies: we're on a mission to chase them down to their lair! The second part of the talk will equip you with the detective skills to perform root cause analysis and extract as much insights as possible. These discoveries can be an eye opener and the first step towards new projects and strategies. Next, we will also tackle distinguishing real anomalies from data evolution (or drift) and set up effective monitoring strategies to keep your data clean and insightful.\n\n\rIf your interests lie in machine learning or you're simply keen on data quality, join me as we set off to unravel the mysteries of data observability. Let's learn how to keep data problems in check and when life gives you anomalies, turn them into business opportunities!\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1685,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/one-analysis-a-day-keeps-anomalies-away",
      "url": "https://ep2024.europython.eu/session/one-analysis-a-day-keeps-anomalies-away"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Madalina Ciortan"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/rvGgYMotoH0/maxresdefault.jpg",
  "title": "One analysis a day keeps anomalies away!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rvGgYMotoH0"
    }
  ]
}
