{
  "description": "[EuroPython 2024 — Terrace 2B on 2024-07-12]\n\n\rPEP 683: Immortal Objects - A new approach for memory managing by Vinícius Gubiani Ferreira\n\rhttps://ep2024.europython.eu/session/pep-683-immortal-objects-a-new-approach-for-memory-managing\n\n\rFor most people that use Python, worrying about memory is not an issue. But that's not the case when you have to handle a lot of requests on a large scale. So how do you reduce memory consumption without affecting the CPU?\n\n\rIn this presentation I'll discuss about memory management in Python from the basics, where the necessity for PEP 683 came from, and the changes introduced by it. I also intend to discuss why this PEP is so important for the language, and what we'll be able to achieve with it in the future, such as changes to the GIL and true parallelism.\n\n\rThe talk is targeted for folks who are intermediate/advanced pythonistas. People who are just starting with Python (maybe less than 1.5 years) may feel a bit lost. Even so, curious learners are more than welcome to join, and I'll try my best to make it easy for all audiences on this advanced topic.\n\rAfter this presentation, participants will learn a bit more about how memory management works under the hood in python, and how it may change in the next couple of years.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1701,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2024.europython.eu/session/pep-683-immortal-objects-a-new-approach-for-memory-managing",
      "url": "https://ep2024.europython.eu/session/pep-683-immortal-objects-a-new-approach-for-memory-managing"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/so9bklb1KPA/maxresdefault.jpg",
  "title": "PEP 683: Immortal Objects - A new approach for memory managing — Vinícius Gubiani Ferreira",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=so9bklb1KPA"
    }
  ]
}
