{
  "description": "[EuroPython 2024 — North Hall on 2024-07-12]\n\n\rPytest Design Patterns by Miloslav Pojman\n\rhttps://ep2024.europython.eu/session/pytest-design-patterns\n\n\rProper testing of your Python application doesn't require a rewrite into hexagonal architecture (whatever it means 🤷). In this session, we'll explore battle-tested techniques to enhance the maintainability of your test suite.\n\n\r- *Embracing Well-Known Patterns:* The test client or transaction-bound tests are well-established patterns originating from Django. We will explore how to extend these foundational practices within pytest.\n\r- *Employing Fixture Factories:* How to ensure that our test data clearly cover the intended scenarios? Unpack the utility of fixture factories, streamlining the setup process.\n\r- *Mocking without Monkey Patching:* Learn effective mocking, steering clear of the problematic practice of monkey patching. We'll explore strategies to achieve accurate testing using favorite frameworks and libraries.\n\r- *Covering More with Parametrized Fixtures:* Many developers are familiar with pytest fixtures and parametrized tests, but may not be aware of the power of their combination: parametrized fixtures. Discover how to easily build more comprehensive tests.\n\r- *Rethinking Test Categorization:* The traditional division into unit and integration tests often falls short in practical application. We'll check an alternative approach that can better align with real-world scenarios.\n\n\rThe goal is not merely to report higher coverage but to have tests that can be trusted. By incorporating established patterns, you'll be empowered to focus on what truly matters.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1794,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2024.europython.eu/session/pytest-design-patterns",
      "url": "https://ep2024.europython.eu/session/pytest-design-patterns"
    }
  ],
  "speakers": [
    "Miloslav Pojman"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Q21AFc0QjSs/maxresdefault.jpg",
  "title": "Pytest Design Patterns",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Q21AFc0QjSs"
    }
  ]
}
