{
  "description": "[EuroPython 2024 — North Hall on 2024-07-11]\n\n\rPython’s Journey: From Upstream to Enterprise by Lumír Balhar\n\rhttps://ep2024.europython.eu/session/pythons-journey-from-upstream-to-enterprise\n\n\rHave you ever wondered how Python gets from the first alpha version upstream to years of stability in your enterprise Linux systems? And what products and useful components are created for you along the way?\n\n\rIn this talk, Lumír will take you through the incredible journey of Python delivery from the first alpha version shipped to Fedora Linux a couple of days after the official upstream release, through containers developers can use for testing with many old and new Python releases in their CI, to Red Hat Enterprise Linux and its main and alternative Python application streams and containers with various Python versions ready to be deployed to production environments with years of required stability.\n\n\rIn this talk, Lumír will talk about:\n\r* Python maintainers’ focus on speed of delivery in Fedora and stability and reliability in RHEL.\n\r* How to use containers based on Fedora for early adoption of new Pythons in CI/CD pipelines.\n\r* What challenges do we face during ten years of maintenance of old Python interpreters.\n\n\rCome and learn how you can benefit from our efforts, use a modern development environment, and deploy your apps with guaranteed stability.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1720,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/pythons-journey-from-upstream-to-enterprise",
      "url": "https://ep2024.europython.eu/session/pythons-journey-from-upstream-to-enterprise"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/2OWW5IMFkBM/maxresdefault.jpg",
  "title": "Python’s Journey: From Upstream to Enterprise — Lumír Balhar",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2OWW5IMFkBM"
    }
  ]
}
