{
  "description": "[EuroPython 2024 — North Hall on 2024-07-12]\n\n\rPython Observability Perfected: Advanced Techniques with OpenTelemetry by Anton Caceres\n\rhttps://ep2024.europython.eu/session/python-observability-perfected-advanced-techniques-with-opentelemetry\n\n\rIn the evolving landscape of serverless and cloud technologies, Python stands out as a key player for building microservices. Yet, as these systems grow, tracking their performance and catching bugs become increasingly complex.\n\n\rThis presentation introduces OpenTelemetry, a rising standard that equips us with tools to monitor not just Python code but also vital components like databases and message queues. It's designed to blend seamlessly with Python, offering a unified method to collect, process, and share telemetry data across different parts of a distributed system.\n\n\rThis talk starts by discussing the importance of observability in modern distributed environments. Then, we'll dive into OpenTelemetry, focusing on its Python SDK's basics. We'll walk through a hands-on example, showing how to integrate OpenTelemetry into a Python project for automated and manual tracking.\n\n\rFinally, we'll explore how to leverage the insights gained from OpenTelemetry for more effective system monitoring, ensuring smoother operation and easier troubleshooting.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1910,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/python-observability-perfected-advanced-techniques-with-opentelemetry",
      "url": "https://ep2024.europython.eu/session/python-observability-perfected-advanced-techniques-with-opentelemetry"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Anton Caceres"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/BUTo0YClH-8/maxresdefault.jpg",
  "title": "Python Observability Perfected: Advanced Techniques with OpenTelemetry",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BUTo0YClH-8"
    }
  ]
}
