{
  "description": "[EuroPython 2024 — Terrace 2A on 2024-07-12]\n\n\rRepresentation is King: The Journey to Quality Dialog Embeddings by Adam Zíka\n\rhttps://ep2024.europython.eu/session/representation-is-king-the-journey-to-quality-dialog-embeddings\n\n\rIn natural language processing, embeddings are crucial for understanding textual data. In this talk, we’ll explore sentence embeddings and their application in dialog systems. We'll focus on a use case involving the classification of dialogs.\n\n\rWe'll demonstrate the necessity of sentence transformers for this problem, specifically utilizing one of the top-performing small-sized sentence transformers. We will show how to fine-tune this model with both labeled and unlabeled dialog data, using the SentenceTransformers Python framework.\n\n\rThis talk is practical, packed with easy-to-follow examples, and aimed at building intuition around this topic. While some basic knowledge of Transformers would be beneficial, it is not required. Newcomers are also welcome.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1634,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/representation-is-king-the-journey-to-quality-dialog-embeddings",
      "url": "https://ep2024.europython.eu/session/representation-is-king-the-journey-to-quality-dialog-embeddings"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Adam Zíka"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/gE2LFy7yKlQ/maxresdefault.jpg",
  "title": "Representation is King: The Journey to Quality Dialog Embeddings",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gE2LFy7yKlQ"
    }
  ]
}
