{
  "description": "[EuroPython 2024 — Forum Hall on 2024-07-11]\n\n\rShipping ready-to-run Python apps without the need to install Python by Marc-André Lemburg\n\rhttps://ep2024.europython.eu/session/shipping-ready-to-run-python-apps-without-the-need-to-install-python\n\n\rHave you ever wanted to ship a script or application to a friend or client, without requiring a specific Python installation or providing complex installation instructions ? Or you want to squeeze out that last bit of juice from your Docker Python image to speed up deployment. Then eGenix PyRun is for you.\n\n\rPyRun is an open source, Apache-licensed, compressed, single file Python compatible run-time, which fits into merely 5 MB on disk.\n\n\rIt can be used to ship pure Python products as a single file on Unix platforms, create Python Docker images with very small footprint to speed up deployment, or as a neat venv replacement, truly isolating applications from any OS or other Python installations, giving you a predictable target for Python applications across Unix platforms.\n\n\rWe have been using PyRun internally at eGenix for many years and open sourced it back in 2012. This year, we are moving the project to Github and relaunching it, in order to present it to the wider open source and Python community.\n\n\rThe talk will go into details on how PyRun is built from the Python source tree, how to create your own single file Python apps, where it can be put to good use, the roadmap we have for PyRun and what its limitations are.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1635,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/shipping-ready-to-run-python-apps-without-the-need-to-install-python",
      "url": "https://ep2024.europython.eu/session/shipping-ready-to-run-python-apps-without-the-need-to-install-python"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/cje1EmmeNLQ/maxresdefault.jpg",
  "title": "Shipping ready-to-run Python apps without the need to install Python — Marc-André Lemburg",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cje1EmmeNLQ"
    }
  ]
}
