{
  "description": "[EuroPython 2024 — Terrace 2A on 2024-07-10]\n\n\rThe role of C++ in the Python ecosystem: the case of the Qt framework by Cristián Maureira-Fredes\n\rhttps://ep2024.europython.eu/session/the-role-of-c-in-the-python-ecosystem-the-case-of-the-qt-framework\n\n\rWith the recent popularity of new programming languages that are improving the Python ecosystem, one cannot dismiss the role of \"old\" languages like C++, and how the new versions might stay relevant.                                                                          \n\r                                                                                                         \n\rWith these ideas in mind, how do you bring a huge project, as old as Python,  written in C++ to Python?\n\rIf you are thinking: «...just create some bindings and call it a day» you will be surprised.                                                                                 \n\r                                                                                                         \n\rOn this talk, we will dive directly into the internals on how the Qt for Python project brought one of the most popular C++ frameworks into Python - but not only with 1-to1 bindings. \n\n\rWe will discuss about build systems, packaging, limited API, interpreters support, Platform and API compatibility, Python and C++ types, ecosystem awareness, CPython code generation, communities, documentation, and many more challenging aspects of maintaining and developing a C++ library in Python.\n\n\rAfter this talk, you will not only understand why exposing an existing library from one language to another is much more than just binding them together, but also you will be able to start developing Python applications with Qt.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1903,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/the-role-of-c-in-the-python-ecosystem-the-case-of-the-qt-framework",
      "url": "https://ep2024.europython.eu/session/the-role-of-c-in-the-python-ecosystem-the-case-of-the-qt-framework"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/1xMnoLn5cWA/maxresdefault.jpg",
  "title": "The role of C++ in the Python ecosystem: the case of the Qt framework — Cristián Maureira-Fredes",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1xMnoLn5cWA"
    }
  ]
}
