{
  "description": "[EuroPython 2024 — South Hall 2B on 2024-07-11]\n\n\rWhy communication is the best skill you can develop as a programmer by Miriam Forner\n\rhttps://ep2024.europython.eu/session/why-communication-is-the-best-skill-you-can-develop-as-a-programmer\n\n\rAs engineers, aspiring or experienced, we can become so focused on growing our technical skills that we forget about the basics. The ability to communicate well can be seen as a skill needed by leaders, managers or client-facing colleagues, but in reality it forms the basis of the quality of our work. From understanding client requirements, to code reviews and even naming variables, communication is a fundamental part of our profession and something we could all benefit from being more conscious of.\n\n\rIn this open-to-all-levels talk we’ll discuss in what situations we should pay closer attention to our style of communication, explore the role of empathy in writing and reviewing code and cover tips and tricks for both making yourself understood and better understanding others.\n\n\n\r---\n\rThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License: https://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1819,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2024.europython.eu/"
    },
    {
      "label": "https://ep2024.europython.eu/session/why-communication-is-the-best-skill-you-can-develop-as-a-programmer",
      "url": "https://ep2024.europython.eu/session/why-communication-is-the-best-skill-you-can-develop-as-a-programmer"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/-Gjb4vpD_oM/maxresdefault.jpg",
  "title": "Why communication is the best skill you can develop as a programmer — Miriam Forner",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-Gjb4vpD_oM"
    }
  ]
}
