{
  "id": 515, 
  "category": "PyOhio 2010", 
  "slug": "pyohio-2010--implementation-of-a-numerical-simula", 
  "title": "PyOhio 2010: Implementation of a Numerical Simulation in Python", 
  "summary": "", 
  "description": "Implementation of a Numerical Simulation in Python\n\nPresented by Jeffrey B. Armstrong\n\nThe Python programming language is well suited for numerical computation under\na variety of circumstances. Python offers advantages over competing free and\ncommercial technologies, including price, functionality, and maintainability.\nSpecifically, the combination of mature numerical libraries and liberal\nlicensing allow complex simulations to be coded with ease and to be made\navailable to nearly all interested parties. !NumPy/!SciPy, database access,\nnetworking, and optimization techniques are examined in detail with respect to\nnumerical computation. A practical example involving an aerothermal commercial\nturbofan aircraft engine simulation showcases these advantages. An aircraft\nengine is broken down into discrete stages, including compressors, turbines,\nand other flow-related components. Commonalities between components, such as\nrotation and the presence of inlet and exit conditions, map cleanly to the\nobject-oriented nature of Python. Based on simulation needs and hardware\navailability, Python allows for the parallel computation of simulations\nwithout the expense and complexity of commercial parallelization packages.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/Pyohio-ImplementationOfANumericalSimulationInPython272.png", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pyohio-2010/515_pyohio-2010-implementation-of-a-numerical-simulation-in-python.flv", 
      "length": null, 
      "type": "flv"
    }
  ], 
  "source_url": "", 
  "tags": [
    "database", 
    "networking", 
    "numpy", 
    "optimization", 
    "pyohio", 
    "pyohio2010", 
    "scipy", 
    "simulation"
  ], 
  "speakers": [
    "Jeffrey Armstrong"
  ], 
  "recorded": null
}