{
  "copyright_text": "",
  "description": "Speaker: Jim De la Hunt\nLightning Talk: Global domain names and email addresses, or, email me at जिम@डाटामेल.भारत . Alerting people that non-ASCII domain names are in use and spreading. Our code should be able to handle them. Python tools and online resources to get domain names and email right.\n\nSpeaker: Wes Lord\nLightning Talk: The surprising alternative to git rebase (it's git reset)\n\nSpeaker: Sam Edwardes\nLightning Talk: How to do \"everything\" with Pydantic. I want walk the audience through using Pydantic to do a few really cool things including: (1) parsing JSON into python objects, (2) validating data, (3) refactoring your code, (4) talking to a SQL database\n\nSpeaker: Tony Fast\nLightning Talk: Important digital accessibility language, standards, and tools for designing inclusive technology . Attendees will learn community and industry standards for auditing and understanding web content accessibility guidelines.\n\nSpeaker: Mariatta Wijaya\nLightning Talk: PyCon US 2023: the 20 years celebration special. I will tell attendees about info about PyCon US 2023: registration, schedule, venue, etc. While this year's travel grant application has closed, it's still worth knowing that it exists and I will share how attendees can stay updated on PyCon US news so they can apply for next year's travel grants. I'll also share how attending PyCon has impacted my personal growth and career and opens up opportunities, and I would love for more people to have the same experience by attending PyCon US.\n\nSpeaker: Robin Reynolds-Haertle\nLightning Talk: Yellowstone Codera - Python programming puzzles with a Yellowstone theme\n\nSpeaker: Santiago Soler\nLightning Talk: During this lightning talk I'll present Pooch, an open-source Python library for downloading and catching data files from the web. It provides easy ways to download data files from different protocols, cache it locally, check their integrity through checksums, and more. It also provides tools for downloading collections of files, useful for managing sample datasets for scientific and data-processing Python packages. Currently Pooch is being used by well-known libraries like SciPy, scikit-learn, Xarray and scikit-image, amongst others.\n\nSpeaker: Andres Pineda\nLightning Talk: Invite to Pycon Latam",
  "duration": 2317,
  "language": "eng",
  "recorded": "2023-03-19",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2023.pycascades.com/program/talks/"
    },
    {
      "label": "Full playlist",
      "url": "https://www.youtube.com/playlist?list=PLcNrB7gPa-NedACvFYa9iVUIhnku_EBSz"
    }
  ],
  "speakers": [
    "Jim De la Hunt",
    "Wes Lord",
    "Sam Edwardes",
    "Tony Fast",
    "Mariatta",
    "Robin Reynolds-Haertle",
    "Santiago Soler",
    "Andres Pineda"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/i-EHx0WSsBM/maxresdefault.webp",
  "title": "Lightning Talks (PyCascades 2023)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=i-EHx0WSsBM"
    }
  ]
}
