{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "ChiPy", "speakers": ["Asma Mehjabeen", "Isaac Adorno"], "title": "November 2014 Chipy Talks", "quality_notes": "", "video_flv_length": null, "recorded": null, "video_mp4_length": null, "description": "### Hidden Markov Models to improve activity recognition in patients with spinal cord injury  \r\nBy: Asma Mehjabeen\r\n\r\nFitness tracking is great for calories and steps, but similar sensors are capable of reporting much more about how we move throughout the day. This is especially important in assessing the quality of movement for those with limited mobility. Doctors often want to know more detail about patient behavior after therapy to select and adjust the appropriate intervention. Using machine learning on wearable accelerometer signals, we estimate the activities patients with incomplete spinal cord injury are performing. By combining windowed classifier estimates over time using a hidden markov model, we show how error rates can be significantly decreased, which brings more detailed assessments of patient activity closer to a clinical reality.\r\n\r\n### Innate learning: training the brain before the eyes open  \r\nBy: Isaac Adorno\r\n\r\nAmorphous, blob-like patterns of neural activity form and move over the eye during visual development in animals. Why do such patterns exist? We show that these patterns are this way to better prepare the visual system for natural vision. Essentially, these are movies played in the eyes to refine the visual system before the eyes even open. We use python to model the developing visual system, produce an efficient code based on those patterns, and show how that code matches what is seen biologically. In this way, we show that during your early development you are learning from innately generated patterns - a unique twist in the debates of nature and nurture.", "video_mp4_url": "", "tags": [], "copyright_text": "youtube standard license", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=EEwufSsx4O8", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "Talks from the November 2014 meeting. Hidden Markov Models to improve activity recognition in patients with spinal cord injury and Innate learning: training the brain before the eyes open.", "thumbnail_url": "", "video_flv_url": ""}