{
  "id": 586, 
  "category": "ChiPy", 
  "slug": "python-for-scientific-and-high-performance-compu2", 
  "title": "Python for Scientific and High Performance Computing (1 of 4)", 
  "summary": "This tutorial provides an introduction to Python focused on HPC and scientific\ncomputing. Throughout, we provide concrete examples, hands-on examples, and\nlinks to additional sources of information. The result will be a clear sense\nof possibilities and best practices using Python in HPC environments.\n\n", 
  "description": "Python, a high-level portable multi-paradigm interpreted programming language\nis becoming increasingly popular with the scientific and HPC communities due\nto ease of use, large collection of modules, adaptability, and strong support\nfrom vendors and community alike. This tutorial provides an introduction to\nPython focused on HPC and scientific computing. Throughout, we provide\nconcrete examples, hands-on examples, and links to additional sources of\ninformation. The result will be a clear sense of possibilities and best\npractices using Python in HPC environments. We will cover several key\nconcepts: language basics, NumPy and SciPy, parallel programming, performance\nissues, integrating C and Fortran, basic visualization, large production\ncodes, and finding resources. While it is impossible to address all libraries\nand application domains, at the end participants should be able to write a\nsimple application making use of parallel programming techniques, visualize\nthe output, and know how to confidently proceed with future projects with\nPython.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/CarlFK-PythonForScientificAndHighPerformanceComputing1Of4136.png", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/chipy/586_python-for-scientific-and-high-performance-computing-1-of-4.flv", 
      "length": null, 
      "type": "flv"
    }
  ], 
  "source_url": "", 
  "tags": [
    "chipy", 
    "numpy", 
    "scipy"
  ], 
  "speakers": [], 
  "recorded": "2009-11-12"
}