{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Con los grandes volúmenes de datos disponibles hoy en día, encontrar patrones en los datos es una tarea que tiene gran importancia. Con los nuevos dispositivos móviles disponibles poco a poco la recomendación se está imponiendo sobre la búsqueda. Y también hoy en día podemos encontrar un problema de predicción multiclase en cada esquina.\n\nEstos son sólo tres ejemplos para los cuales las reglas de asociación son muy válidas. Las reglas de asociación son un sistema de aprendizaje automático que tiene unas características que las hacen muy especiales: son muy intuitivas y sencillas de trabajar con ellas, y no son complicadas de programar. El resultado de esta técnica por lo general puede resumirse en “si pasa esto, entonces esto otro”, de ahí su fácil implementación. Además, en general ofrecen unos resultados que habitualmente son bastante buenos.\n\nEn la charla revisaremos los conceptos básicos de las reglas de asociación: items, antecedentes, consecuentes, soporte, confianza y lift y cómo programar un sistema de reglas sencillo en Python.\n\nFinalmente se muestran ejemplos de aplicación de los sistemas basados en reglas: patrones, recomendación y predicción.\n\nMaterial de la charla disponible en https://github.com/intiveda/pyreglasasociacion\n\n\nhttp://2016.es.pycon.org/",
  "duration": 2220,
  "language": "spa",
  "recorded": "2016-10-09",
  "related_urls": [
    "https://github.com/intiveda/pyreglasasociacion",
    "http://2016.es.pycon.org/"
  ],
  "speakers": [
    "Claudia Guirao",
    "Miquel Camprodon"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/azdPyVMUi98/maxresdefault.jpg",
  "title": "py - reglas de asociación",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=azdPyVMUi98"
    }
  ]
}
