{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Probablemente empezaste creando una aplicación de Django que podía presumir de \"limpia\". Tus modelos tienen un par de métodos añadidos, con lógica sencilla. Tus vistas hacen consultas simples y devuelven templates con un contexto razonable.\n\nCon el tiempo, los modelos empiezan a cambiar, necesitas hacer vistas que devuelven contextos con datos más complejos, aumenta la cantidad de métodos en los modelos, las vistas empiezan a implementar lógica y, ahora que lo piensas, puedes reutilizar esa función, así que la sacas a un módulo de utilidades, quizá lo decides bautizar como controlador.\n\nDespués de todas esas fantásticas nuevas features que has conseguido implementar, tienes modelos de cientos de líneas, lógica desparramada en varios ¨controladores\" que importas en tantos módulos que, cada vez que creas uno nuevo, optas por copiar y pegar los import de siempre. Ah, y cada vista tienen más lógica que tu trabajo fin de carrera. ¿En cual de los \"controladores\" estaba esa función que te da una lista de ids y nombres de usuarios con datos sobres sus vehículos y sus casas? ¿En el controlador de usuarios, el de vehículos, el de casas o el controlador de controladores?\n\nNo te preocupes, hay varias soluciones. Nosotros te proponemos la que utilizamos en StyleSage, basada en una clara división de responsabilidades entre modelos, proxy models, managers y vistas. Verás como lo encuentras todo a la primera, ¡Y sin dependencias circulares!\n\nPresentación disponible en http://slides.com/hectorpablos/adelgazando-modelos-django\n\n\nhttp://2016.es.pycon.org/",
  "duration": 1102,
  "language": "spa",
  "recorded": "2016-10-08",
  "related_urls": [
    "http://2016.es.pycon.org/",
    "http://slides.com/hectorpablos/adelgazando-modelos-django"
  ],
  "speakers": [
    "Héctor Pablos López"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ScAKGnGWq-E/maxresdefault.jpg",
  "title": "Adelgazando los modelos de Django",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ScAKGnGWq-E"
    }
  ]
}
