{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "En su momento ya el buscador Google hizo un antes y un después en la navegación de los usuarios. En 2009 John Matherly creo Shodan que hizo un antes y un después en los expertos en seguridad y delincuentes que se aprovechan de esta tecnología para atacar infraestructuras y servidores informáticos.\n\nMi objetivo de esta charla es enseñar lo fácil que es gestionar un ataque dirigido teniendo una base de datos llena de información sobre posibles servicios vulnerables.\n\nPor último explico como crear una lanzadera de exploits para automatizar los ataques masivos a esas posibles máquinas vulnerables.\n\n¿Cómo funciona Shodan? Al igual que Google dispone de un ejército de crawlers, sin embargo la diferencia es que no indexa webs sino la información de los puertos y servicios que disponen cada una de las direcciones IPv4.\n\nSabiendo esta información de cómo funciona, ¿por qué no creamos nuestro propio Shodan? La charla de 30 minutos comprende en varias fases:\n\n1. Explicación del funcionamiento de Shodan.\n2. ¿Qué es Shodita? (Python, mongoDB)\n3. Cómo crear un Bot en Python.\n4. Datos y resultados de servidores vulnerables por zona.\n5. Crear lanzadera de exploits con Python.\n\nPresentación disponible en https://www.slideshare.net/quantikacatorce/cmo-crear-tu-propio-shodan-con-python\n\n\nhttp://2016.es.pycon.org/",
  "duration": 2704,
  "language": "spa",
  "recorded": "2016-10-09",
  "related_urls": [
    "https://www.slideshare.net/quantikacatorce/cmo-crear-tu-propio-shodan-con-python",
    "http://2016.es.pycon.org/"
  ],
  "speakers": [
    "Jorge Coronado"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/PmgF1--hR4w/maxresdefault.jpg",
  "title": "Cómo crear tu propio Shodan de casa",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PmgF1--hR4w"
    }
  ]
}
