{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Es una charla que pretende resolver una cuestión que suele surgir en todos los nuevos programadores que se acercan a PyQt y que es la curva de aprendizaje, dado que no es simple comenzar a usar PyQt para quienes recién comienzan. A diferencia de otros proyectos Python o de Software Libre, PyQt tiene una documentación a veces un poco críptica o muy técnica que es prohibitiva para los usuarios novatos, y que aleja a mucha gente de este interesantísimo framework gráfico multiplataforma. La documentación de los bindings suele estar basada en los ejemplos de C++ de Qt que suelen ser difíciles de comprender para programadores Python novatos. Veremos cómo trabajar con los widgets básicos, algunos de sus métodos principales, y también desarrollaremos algunas aplicaciones simples pero representativas, tales como un visor de imágenes CLI, una aplicación para simplificar tareas en entornos comerciales y algunos otros ejemplos más que incluyan interacción con bases de datos SQL. Nos basaremos en la última versión del framework PyQt, que tiene sintaxis diferente, en algunas partes, respecto de versiones anteriores, que son las que - en general - son tratadas en los pocos libros que hay del tema. La charla pretenderá ser una buena introducción, que le dará al público los elementos necesarios para poder continuar, luego de esta completa introducción, a conceptos más complejos de PyQt.\n\n\nhttp://2016.es.pycon.org/",
  "duration": 1660,
  "language": "spa",
  "recorded": "2016-10-09",
  "related_urls": [
    "http://2016.es.pycon.org/"
  ],
  "speakers": [
    "Juan Rodríguez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/fepmBpDjfNg/maxresdefault.jpg",
  "title": "Introducción a PyQt - PyConES 2016",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fepmBpDjfNg"
    }
  ]
}
