{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "La simulación y optimización de procesos han experimentado un crecimiento considerable durante los últimos años. Con el avance, abaratamiento de arquitecturas y mejora de software para procesamiento en paralelo, muchas industrias apuestan por algoritmos estocásticos para mejorar la producción, reducir los costes o disminuir el impacto medioambiental.\n\nDebido a la complejidad de la multitud de procesos industriales, es habitual hacer uso de simuladores donde existe un flujo de datos con los que se opera en módulos o bloques de forma secuencial. Sin embargo, con respecto a la optimización, los simuladores no han alcanzado un grado de desarrollo o robustez deseada —no existe aún un botón mágico en los simuladores que “optimice”, por ejemplo, el número de equipos y/o las condiciones de operación.\n\nEn esta charla, sin embargo, mostraremos con código Python como algoritmos del tipo PSO (Particle Swarm Optimization) pueden ser acoplados fácilmente con simuladores de procesos para resolver problemas de optimización. Recientemente en Python han aparecido librerías especializadas en algoritmos libres de derivadas (OpenMDAO-NASA, PyGMO-ESA o PySwarm, entre otras). Éstas, junto al uso de simuladores (propietarios o libres) pueden ser muy interesantes en un gran número de aplicaciones como herramientas de optimización de caja negra.\n\nPor ejemplo, en el ámbito de la ingeniería de procesos químicos, los simuladores secuenciales modulares (como Aspen Hysys, Aspen Plus, Pro/II, ChemCAD…) son ampliamente utilizados para el diseño refinerías, plantas químicas y/o tratamiento de aguas. Estos paquetes de software incluyen bibliotecas termodinámicas y modelos numéricos que conducen a predicciones precisas de los procesos implementados. Por ello y a modo de aplicación real, combinaremos finalmente estos simuladores con Python, lo que nos permitirá obtener un ahorro económico significativo en el diseño final de una planta de procesos químicos.\n\nEsta charla será impartida por investigadores de ingeniería química de la Universidad de Alicante miembros de CAChemE y su estructura será la siguiente:\n\n- Introducción a la problemática en la optimización matemática (5 min). Se realizará una introducción visual a conceptos de optimización determinista, así como a las ventajas e inconvenientes que presentan los algoritmos estocásticos.\n\n- Implementación del algoritmo PSO (15 min). Se verán ejemplos sencillos de optimización con Python y se explicará de manera breve cómo acelerar su tiempo de ejecución.\n\n- Serie de ejemplos de problemas de optimización en ingeniería (10 min), con especial hincapié en ejemplos reales en la industria e ingeniería química.\n\nMaterial de la charla disponible en https://github.com/CAChemE/stochastic-optimization\n\nPresentación disponible en https://github.com/CAChemE/stochastic-optimization/raw/master/Slides%20-%20PyconES%202016%20-%20Simulation-Based%20Optimization%20Using%20PSO.pdf\n\n\nhttp://2016.es.pycon.org/",
  "duration": 1811,
  "language": "spa",
  "recorded": "2016-10-08",
  "related_urls": [
    "https://github.com/CAChemE/stochastic-optimization",
    "http://2016.es.pycon.org/",
    "https://github.com/CAChemE/stochastic-optimization/raw/master/Slides%20-%20PyconES%202016%20-%20Simulation-Based%20Optimization%20Using%20PSO.pdf",
    "https://es.wikipedia.org/wiki/Optimizaci%C3%B3n_por_enjambre_de_part%C3%ADculas",
    "https://en.wikipedia.org/wiki/Derivative-free_optimization",
    "https://en.wikipedia.org/wiki/OpenMDAO",
    "http://esa.github.io/pygmo/",
    "http://pythonhosted.org/pyswarm/",
    "https://en.wikipedia.org/wiki/List_of_chemical_process_simulators",
    "http://cacheme.org/"
  ],
  "speakers": [
    "Juan Javaloyes",
    "Francisco Navarro"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/FByXobXC64U/maxresdefault.jpg",
  "title": "Aprendiendo magia negra con Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FByXobXC64U"
    }
  ]
}
