{
  "id": 1451, 
  "category": "PyCon DE 2012", 
  "slug": "beziehungen-nein-danke-agiledatenbankentwickl", 
  "title": "Beziehungen? Nein danke! - Agile Datenbankentwicklung mit schemafreien Datenbanken und Python", 
  "summary": "Python-Projekte haben immer häufiger alternative Datenbanken aus der nosql\n/newsql-Familie in ihrem Stack, seien es Graphendatenbanken wie Neo4j, Key-\nValue-Stores wie Redis oder dokumentenorientierte Datenbanken wie MongoDB.\n\nSo verschiedenartig diese Datenbanken auch sind, gemeinsam ist ihnen, dass sie\nnicht das relationale Datenmodell implementieren, Daten nicht in miteinander\nin Beziehung stehenden Entitäten ablegen. Während Nicht-Normalisirung bei\nrelationalen Datenbanken meist als Anti-Pattern angesehen wird, ist es bei\nschemafreien Datenbanken Prinzip, das schnelles und agiles Entwickeln und\nDeployen fördert.\n\nDieser Talk zeigt an Hand eines konkreten Use-Cases, welche Auswirkungen die\nVerwendung einer nicht-relationalen Datenbank auf den Entwicklungsprozess hat,\nzeigt wie Daten modelliert werden können und auch, wie Veränderungen am\nDatenbankmodell implementiert werden können, wenn es kein \"Alter table\" mehr\ngibt.\n\nDiskutiert werden sollen dabei auch die Pros und Kontras der verschiedenen\nDatenmodelle hinsichtlich ihrer Query-Möglichkeiten, der Query-Performance,\nAnforderungen an Plattenplatz und Auswirkungen auf die Client/Anwendungsseite.\n\n", 
  "description": "", 
  "quality_notes": "", 
  "language": "German", 
  "copyright_text": "", 
  "thumbnail_url": "http://i1.ytimg.com/vi/0re7PgM9Duc/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://s3.us.archive.org/nextdayvideo/pyconde/pyconde2012/Vortrag_Beziehungen_Nein_danke.mp4?Signature=GwcLq3LbRvmkwcwlWe3K%2FBqDsnE%3D&Expires=1351856279&AWSAccessKeyId=FEWGReWX3QbNk0h3", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "https://www.youtube.com/watch?v=0re7PgM9Duc", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=0re7PgM9Duc", 
  "tags": [
    " agile softwareentwicklung", 
    " datenbank", 
    " datenmodellierung", 
    " nosql", 
    "orm", 
    " python"
  ], 
  "speakers": [
    "Martin Schönert"
  ], 
  "recorded": "2012-11-01"
}