{
  "id": 1449, 
  "category": "PyCon DE 2012", 
  "slug": "gr-einuniverselles-framework-f-r-visualisierung", 
  "title": "GR - ein universelles Framework für Visualisierungsanwendungen", 
  "summary": "Zur Erstellung von Visualisierungsprogrammen existiert eine Vielzahl freier\nund kommerzieller Tools und Bibliotheken. In einem heterogenen Rechnerumfeld\nzeigt sich aber, dass es keine durchgängig einsetzbare Lösung gibt, welche die\nspeziellen Anforderungen in einem wissenschaftlichen Umfeld abdeckt.\n\nGR ist ein universell einsetzbares Framework für plattformübergreifende\nVisualisierungsanwendungen. Es bietet Entwicklern eine kompakte, portable und\neinheitliche Grafik-Bibliothek für ihre Anwendungen. Das Anwendungsspektrum\nreicht von der Erzeugung publikationsreifer 2D-Diagramme bis hin zur\nDarstellung komplexer 3D-Szenen.\n\nDer Vortrag beschreibt zunächst die Funktionalität des GR-Frameworks, welches\nim wesentlichen auf einer Implementierung des graphischen Kernsystems (GKS)\nsowie der Programmierschnittstelle OpenGL basiert. Es wird aufgezeigt, wie GR\nals geschlossenes System schnell und einfach in vorhandene Anwendungen – z.B.\nmit dem ctypes-Mechanismus in Python - integriert werden kann. Neben dem\nEinsatz in imperativ programmierten Systemen ist auch eine Integration in\nmoderne objektorientierte Systeme, die auf GUI Toolkits aufbauen, vorgesehen.\nDarüber hinaus werden die Stärken des GR-Frameworks in Bezug auf die\nInteroperabilität mit aktuellen Web-Technologien und mobilen Geräten\nherausgestellt.\n\n", 
  "description": "", 
  "quality_notes": "", 
  "language": "German", 
  "copyright_text": "", 
  "thumbnail_url": "http://i2.ytimg.com/vi/EhLPAEUI4l0/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://s3.us.archive.org/nextdayvideo/pyconde/pyconde2012/GR_ein_universelles_Framework_.mp4?Signature=F%2FTVlB6yIBeHaxr3Dr7b%2B2O19%2Fc%3D&Expires=1351856085&AWSAccessKeyId=FEWGReWX3QbNk0h3", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "https://www.youtube.com/watch?v=EhLPAEUI4l0", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=EhLPAEUI4l0", 
  "tags": [
    "frameworks", 
    " opengl", 
    " visualisierung"
  ], 
  "speakers": [
    "Josef Heinen"
  ], 
  "recorded": "2012-10-31"
}