{
  "id": 1437, 
  "category": "PyCon DE 2012", 
  "slug": "white-box-debugging-debugger-f-r-unittests-nut", 
  "title": "\"White Box Debugging\" - Debugger für Unittests nutzen", 
  "summary": "\"White Box Testing\" ist das Testen von internen Zuständen zur Laufzeit,\nwährend ubliche Unittests in der Regel nur Funktionen rufen. Man kann aber\nmittels eines Debuggers White Box Testing durchführen - ein Pythonskript\nerlaubt dies fur Python mit pdb wie auch für C/C++ - Programme mit gdb.\n\nUnittests sind ohne Frage unerlässlich, aber oft aufwändig zu programmieren\nund beschränkt aussagefähig, da in der Regel nur einzelne Funktionen oder\nModule als Black Box getestet werden können. Nicht selten ist sogar\ngesonderter Code notwendig, um sinnvolle Tests zu ermöglichen.\n\nAussagekräftiger und naheliegender wären Tests auf Werte mitten im Code, doch\nsolch eine Funktionalität bietet bisher nur die assert-Anweisung, die bei\nFehlern mit einem wenig aussagekräftigen Abbruch endet.\n\nDie Idee des Python-Skripts \"wbd\" (\"white box debugging\") ist, aus Kommentaren\nim Quelltext Konfigurationsfiles für Debugger zu erzeugen, so dass an\nbedingten Breakpoints Tests stattfinden. Beim Fehler landet man gleich im\nDebugger und kann die Umgebung analysieren.\n\nDas funktioniert derzeit für Pythonskripte und C/C++-Programme und ist auch\ngut als Hilfsmittel beim Debuggen selbst einzusetzen.\n\n", 
  "description": "", 
  "quality_notes": "", 
  "language": "German", 
  "copyright_text": "", 
  "thumbnail_url": "http://i3.ytimg.com/vi/26tmYQk2vI8/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://s3.us.archive.org/nextdayvideo/pyconde/pyconde2012/Vortrag_White_Box_Debugging_De.mp4?Signature=LgR%2Fs9%2F5Hgh37jNYY7RjN1YCORE%3D&Expires=1351851790&AWSAccessKeyId=FEWGReWX3QbNk0h3", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "https://www.youtube.com/watch?v=26tmYQk2vI8", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=26tmYQk2vI8", 
  "tags": [], 
  "speakers": [
    "Reinhard Wobst"
  ], 
  "recorded": "2012-10-31"
}