{
  "title": "Confidentialité d’un point de vue des bases de données médicales confidentielles grâce au package synthcity",
  "description": "La confidentialité des bases de données est une préoccupation médicale et réglementaire majeure. Dans le cadre de l’analyse des résultats en recherche clinique, les données ne contiennent plus les identités du patient, mais ces données restent sensibles car on peut potentiellement réidentifier les patients. L’idée est donc de créer des données de synthèse, à la fois fidèles (proches des données initiales) et anonymes (pour lesquelles les données de synthèse ne permettent pas de réidentifier les patients de la base de données). Des données anonymisées sont très peu réglementées et peuvent être cédées ou échangées librement. Pour mesurer les indicateurs de fidélité et d’anonynimisation, nous utilisons [le package synthcity](https://arxiv.org/abs/2301.07573). Ce package permet de synthétiser des données à l’aide d’algorithme tels que CT-GAN (conditional tabular-generative adversarial networks), TVAE (tabular variational auto-encoder). J’ai implémenté l’algorithme Avatar, qui synthétise des données avec une finalité de confidentialité. J’ai testé le package sur des données tabulaires et de survie, relatives à la pharmacologie de la transplantation.",
  "duration": 1892,
  "language": "fra",
  "recorded": "2024-11-03",
  "speakers": [
    "Clément Benoist"
  ],
  "videos": [
    {
      "type": "mp4",
      "url": "https://dl.afpy.org/pycon-fr-24/confidentialite_dun_point_de_vue_des_bases_de_donnees_medicales_confidentielles_grace_au_package_synthcity.mp4",
      "size": 277283918
    },
    {
      "type": "peertube",
      "url": "https://indymotion.fr/videos/watch/0be947c8-4afc-4efc-855b-cd24cabd4c7d"
    }
  ],
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.fr/2024/fr/schedule.html"
    }
  ],
  "thumbnail_url": "https://indymotion.fr/lazy-static/thumbnails/98914491-9d15-4aa3-a022-d8f97fa91daa.jpg"
}