{
  "title": "DBnomics : un agrégateur de données économiques en Python",
  "description": "Découvrez le projet DBnomics, un agrégateur de données économiques publiques provenant d’une centaine de fournisseurs dans le monde (INSEE, Banque Mondiale, FMI, etc.) développé entièrement en Python et sous licence libre (AGPLv3+).\r\n\r\nDBnomics permet aux économistes, étudiants, chercheurs, data-journalistes, etc. d’accéder à des données publiques très facilement, sans avoir à gérer les formats propres au différents fournisseurs. En effet, les données arrivent directement sous forme de DataFrame Pandas grâce au client Python.\r\n\r\nPour cela DBnomics dispose d’un système de data fetchers, des programmes Python correspondant chacun à un fournisseur de données, et d’un système de pipelines pour les faire tourner quotidiennement.\r\n\r\nDBnomics distribue ses données via son API publique, utilisée par les modules clients disponibles entre-autres en Python et R, et permet de sous-tendre le développement d’applications utilisant des données macroéconomiques (e.g. dashboards).\r\n\r\nCette conférence présente le projet DBnomics, plonge au cœur de son architecture technique, et montre comment réaliser un dashboard en utilisant le client DBnomics en Python avec Streamlit.",
  "duration": 1501,
  "language": "fra",
  "recorded": "2024-11-03",
  "speakers": [
    "Christophe Benz"
  ],
  "videos": [
    {
      "type": "mp4",
      "url": "https://dl.afpy.org/pycon-fr-24/dbnomics_un_agregateur_de_donnees_economiques_en_python.mp4",
      "size": 147560057
    },
    {
      "type": "peertube",
      "url": "https://indymotion.fr/videos/watch/d87532b1-29e9-4294-b6e0-92bf53192398"
    }
  ],
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.fr/2024/fr/schedule.html"
    }
  ],
  "thumbnail_url": "https://indymotion.fr/lazy-static/thumbnails/3b9bd86b-1992-4a8d-9a8f-cc7b9a9df5ce.jpg"
}