{
  "title": "Il n'est jamais trop tard pour redevenir junior",
  "description": "Je suis développeur en Entreprise de Service Numérique (ESN) depuis 6 ans. Je suis sûr de moi et de mes compétences. Pour moi, le Domain-Driven Design (DDD) et l’architecture hexagonale ne sont que des buzzwords, un effet de mode que mes amis junior développeur.euse.s utilisent. On me demande en entretien de justifier l’intérêt de découpler l’infrastructure du code métier et si je pratique le Test-Driven Development (TDD). Je me fais ramasser, c’est la première fois que ça m’arrive. Je suis complètement perdu et découvre un nouvel océan de bonnes pratiques : le Software craft.\r\n\r\nComment se relever après une expérience comme celle-ci ? Comment sortir de sa zone de confort pour réinventer sa façon de travailler ? Comment mettre l'égo de côté pour apprendre de développeur.euse.s plus jeunes et/ou avec moins d'années d'expérience que nous ?\r\n\r\nIl n'est jamais trop tard pour repartir de zéro ! À travers mon expérience, je vais vous donner les étapes simples qui m’ont permis de changer mes pratiques rapidement :\r\n* comment j’ai utilisé une méthode d'amélioration continue pour facilement mettre en place et suivre l’évolution de mes pratiques,\r\n* comment trier et sélectionner des ressources efficacement,\r\n* comment se mettre dans une position pour apprendre de tout le monde,\r\n* comment valoriser l’expérience précédemment accumulée.",
  "duration": 1558,
  "language": "fra",
  "recorded": "2024-11-02",
  "speakers": [
    "Yann Bouvet"
  ],
  "videos": [
    {
      "type": "mp4",
      "url": "https://dl.afpy.org/pycon-fr-24/il_n_est_jamais_trop_tard_pour_redevenir_junior.mp4",
      "size": 197354571
    },
    {
      "type": "peertube",
      "url": "https://indymotion.fr/videos/watch/d5f8a8c6-b0b9-477d-8e6c-5584f4587685"
    }
  ],
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.fr/2024/fr/schedule.html"
    }
  ],
  "thumbnail_url": "https://indymotion.fr/lazy-static/thumbnails/c0878cdb-1629-409a-bfd7-979833caf0d3.jpg"
}