{
  "title": "Les gens ne savent pas ce qu'ils font, la plupart du temps !",
  "description": "Quand on est enfant, on pense que nos parents savent tout, voient tout, peuvent tout ! Et puis on grandit et finalement on se rend compte qu'ils sont humains : parfois faillibles, parfois débordés, ou même fatigués !\r\n\r\nDans le monde de la technologie, j'ai été confrontée à la même illusion - l'idée que tout le monde maîtrise parfaitement son domaine. Cependant, comme pour mes parents, la réalité m'a rattrapée, et je me suis demandée, dans la colère de la desillusion, si tout le monde est fondamentalement incompétent.\r\n\r\n\r\nSuite à cette prise de conscience, j'ai réalisé que non, les gens ne sont pas fondamentalement incompétents, mais beaucoup dissimulent leurs difficultés par peur.  Peur d'échouer, peur d'être jugé, peur pour son emploi, ou simplement peur d'avoir l'air bête. Cette peur entrave leur progression individuelle et celle du groupe. C'est là que j'ai découvert la sécurité psychologique - créer un environnement où chacun se sent à l'aise pour échouer et apprendre de ses erreurs.\r\n\r\nDans ma présentation, je partagerai des méthodes concrètes pour mettre en œuvre la sécurité psychologique, que ce soit au sein des équipes ou au niveau des entreprises, en utilisant des exemples tirés de mes expériences. \r\nVenez voir comment accueillir les échecs et les erreurs peut stimuler la créativité, favoriser l'inclusivité et augmenter la productivité.",
  "duration": 3039,
  "language": "fra",
  "recorded": "2024-11-03",
  "speakers": [
    "Léa Coston"
  ],
  "videos": [
    {
      "type": "mp4",
      "url": "https://dl.afpy.org/pycon-fr-24/les_gens_ne_savent_pas_ce_qu_ils_font_la_plupart_du_temps.mp4",
      "size": 334596116
    },
    {
      "type": "peertube",
      "url": "https://indymotion.fr/videos/watch/cbd6868a-e94c-406d-81e3-41250ab2f805"
    }
  ],
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.fr/2024/fr/schedule.html"
    }
  ],
  "thumbnail_url": "https://indymotion.fr/lazy-static/thumbnails/74d7601c-0940-4169-960d-2352c1ee3350.jpg"
}