{
  "description": "Dominik Janzing\nAmazon Research, Germany\n\nTitle:\nAll causal DAGs are wrong but some are useful\n\nAbstract:\nWhile the quote “all models are wrong but some are useful” is widely known in statistics, discussions around causal DAGs and causal discovery seem to assume the existence of a “true DAG”. This assumption is problematic as it often results in causal graphs that are less useful. But first we should ask: useful for which purpose? I try to give an incomplete list of more than 5 different tasks for which causal DAGs may help. As not all of these tasks require ground truth from interventions (after all, interventions are often not only impossible, but even ill-defined), I propose that causal discovery should be benchmarked against them. This way, I hope that causal discovery research can gain new momentum after an honest assessment of the current state-of-the-art, using well-defined performance metrics on real data. Further, I hope that these tasks shed some light on the meaning of causality.\n\nSome related work:\n1) Faller, Vankadara, Mastakouri, Locatello, Janzing: Self-compatibility: Evaluating causal discovery without ground truth, AISTATS 2024\n2) Gresele, Von Kügelgen, Kübler, Kirschbaum, Schölkopf, Janzing: Causal inference thorugh the causal marginal problem. ICML 2022.\n3) Janzing, Faller, Vankadara: Reinterpreting causal discovery as the task of predicting unobserved joint statistics, arxiv:2305.06894\n4) Janzing, Garrido-Mejia: A phenomenological account for causality in terms of elementary actions. Journal of Causal Inference 2024.\n5) Schölkopf, Janzing, Peters, Sgouritsa, Zhang, Mooij: Causal and anticausal learning, ICML 2012.\n6) Okati, Garrido-Mejia, Orchard, Blöbaum, Janzing: Root Cause Analysis of Outliers with Missing Structural Knowledge, arxiv:2406.05014",
  "duration": 3684,
  "language": "eng",
  "recorded": "2024-07-15",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.auai.org/uai2024/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/eP0_axDmVUA/maxresdefault.webp",
  "title": "UAI 2024 Keynote Talk 2: Dominik Janzing",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eP0_axDmVUA"
    }
  ]
}
