{
  "description": "Viacheslav Borovitskiy, Alexander Terenin\n\nIn applications from drug design to robotics, recent advances in geometric deep learning have demonstrated the value of having specialized methods beyond R^d. Since deep learning tends to require a lot of data, and makes it non-trivial to quantify uncertainty in a way that leads to efficient decision-making, this motivates a need for complementary technical capabilities. In this tutorial, we describe geometric counterparts of data-efficient probabilistic modeling techniques, which are effective in small-data settings, and enable uncertainty to be quantified in a geometry-compatible way. We focus mainly on Gaussian processes and related techniques like Bayesian neural networks. These methods can be used to power automated decision-making systems such as Bayesian optimization, which are used in important applications such as molecular optimization and robotic policy tuning---areas where data-efficiency is key, and geometric properties such as symmetries play a fundamental role. This research area has been rapidly developing, and is starting to become mature enough that comprehensive software packages are becoming available---we will therefore cover both the theory and practical implementation of these methods through software demonstrations, and conclude by showcasing a number of emerging applications.\n\nSlides:\nhttps://vab.im/download/2024-07-15-Geometric-Probabilistic-Models-Tutorial/",
  "duration": 9090,
  "language": "eng",
  "recorded": "2024-07-15",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.auai.org/uai2024/"
    },
    {
      "label": "https://vab.im/download/2024-07-15-Geometric-Probabilistic-Models-Tutorial/",
      "url": "https://vab.im/download/2024-07-15-Geometric-Probabilistic-Models-Tutorial/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/EpMAkczF34Y/maxresdefault.webp",
  "title": "UAI 2024 Tutorial 4: Geometric Probabilistic Models",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EpMAkczF34Y"
    }
  ]
}
