{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon APAC 2014", "speakers": ["Liang Bo Wang"], "title": "Handy Parallel (Distributed) Computing in Python", "quality_notes": "", "video_flv_length": null, "recorded": "2014-06-27", "video_mp4_length": null, "description": "We all start our programming with single process in mind. But parallelization from scratch is a real headache. Things get worse when it comes to writing a spaghetti code in both short time and high performance, which is often the case doing data analysis.\r\n\r\nIn fact, cases like computation under different conditions, programs can be easily parallelized (distributed) with a few modifications using existed library like multiprocessing, IPython Parallel, and Celery.\r\n\r\nThis talk makes you not afraid of parallel or distributed computing and provides ways for different level of parallelization from single machine, cluster, to cluster with task queue. I will only talk about the basic scenario, which should be easier for newbies to try on and understand how powerful these tools can be.\r\n\r\nA machine learning example will be given in the end to compare performance and possible issues with different implementations. \r\n\r\n\r\nAbout the speaker\r\n\r\n呆呆電雞生，喜歡寫 R / Python，喜歡統計與生物資訊。目前為 Taiwan R Users Group 工作人員及 Taipei.py 常客。\r\n\r\nBioinfo / Stat / R / Python, master student of NTU BEBI. Co-organizer of Taiwan R Users Group and freq attendee of Taipei.py.", "video_mp4_url": "", "tags": [], "copyright_text": "youtube", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=IsyhAJRkETY", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/IsyhAJRkETY/hqdefault.jpg", "video_flv_url": ""}