{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon APAC 2014", "speakers": ["Nie Shuyue", "Song Kai", "Wu Chenmu"], "title": "HiPy - Python for High School Students", "quality_notes": "", "video_flv_length": null, "recorded": "2014-08-13", "video_mp4_length": null, "description": "The ever progressing technology is no doubt beneficial to mankind. However, the current inventions derived from new technology is not thorough enough to cover the needs of more focused groups. More importantly, students often find themselves hard to go beyond passively receiving information and stretch their own ability to become active drivers of positive change by channeling curriculum to real life. This is where innovation and creation of tailored applications set in. This talk, by a group of three students from Dunman High School, Singapore, serves to allow people to better understand the needs of high school students and how Python can be used to benefit them. Examples based on the authors' personal observations and experiences together with illustration of procedures and real-time demonstration will be presented to show how Python can be thoughtfully utilized as an inventive computational thinking and practical problem solving tool to enrich the lives of students. Through our sharing, we would like to inspire more ideas on developing Python applications of close relevance to students and hopefully, encourage more students to use Python to actively improve their school experience.\r\n\r\n\r\nAbout the speaker\r\n\r\nNie Shuyue:\r\nNew learner of Programming. \r\nStudying for Python since 2013 and learned a bit of Java and HTML. \r\nHad some hands on projects using mainly Python and tried using Python with Google App Engine and Pygame.\r\nIt is fun to learn Python. :)\r\n \r\nWu Chenmu:\r\n2005 -2007 Learning BASIC\r\n2012 - Learning Python, C++ and Java\r\nStudy art for 4 years, good at graphic design, web design and UI design.\r\nHas experience in both competitive programming and mobile application development.\r\n\r\nSong Kai:\r\n2006 - 2007 Learning BASIC\r\n2008 - 2011 Learning PASCAL\r\n2012 -          Learning C++\r\n2013 -          Learning Python\r\nHas experience in both competitive programming (algorithm based) and application development. \r\nHopes to make good combination of both aspects of coding to bring more convenience to people’s daily life.\r\nSome Python projects done:\r\nhttp://elijahsk.pythonanywhere.com/    (Flask based)\r\nhttps://play.google.com/store/apps/details?id=dessert.program  (Pygame based, in collaboration with Shuyue)\r\nhttp://dhstreasurerkit.appspot.com (GAE based)\r\n\r\n\r\nOthers:\r\nWe have one female presenter Shuyue and through this presentation, we would like to encourage more female students to try Python and bravely voice out their own experiences.\r\nAll three of us are Year 6 (Grade 12) students from Dunman High School, Singapore. Last year we have been through Project Work where systematic report and interactive oral presentation are the main focus of learning. We are confident that we can give the audience an engaging presentation experience.\r\nWe have good ability to converse in Mandarin, hence are able to reach out to a broader / more local audience.", "video_mp4_url": "", "tags": [], "copyright_text": "creativeCommon", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=X4wjcy5sqwY", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/X4wjcy5sqwY/hqdefault.jpg", "video_flv_url": ""}