{
  "alias": "video/3266/hipy-python-for-high-school-students-pycon-apa",
  "category": "PyCon APAC 2014",
  "copyright_text": "creativeCommon",
  "description": "The ever progressing technology is no doubt beneficial to mankind.\nHowever, the current inventions derived from new technology is not\nthorough enough to cover the needs of more focused groups. More\nimportantly, students often find themselves hard to go beyond passively\nreceiving information and stretch their own ability to become active\ndrivers of positive change by channeling curriculum to real life. This\nis where innovation and creation of tailored applications set in. This\ntalk, by a group of three students from Dunman High School, Singapore,\nserves to allow people to better understand the needs of high school\nstudents and how Python can be used to benefit them. Examples based on\nthe authors' personal observations and experiences together with\nillustration of procedures and real-time demonstration will be presented\nto show how Python can be thoughtfully utilized as an inventive\ncomputational thinking and practical problem solving tool to enrich the\nlives of students. Through our sharing, we would like to inspire more\nideas on developing Python applications of close relevance to students\nand hopefully, encourage more students to use Python to actively improve\ntheir school experience.\n\nAbout the speaker\n\nNie Shuyue: New learner of Programming. Studying for Python since 2013\nand learned a bit of Java and HTML. Had some hands on projects using\nmainly Python and tried using Python with Google App Engine and Pygame.\nIt is fun to learn Python. :)\n\nWu Chenmu: 2005 -2007 Learning BASIC 2012 - Learning Python, C++ and\nJava Study art for 4 years, good at graphic design, web design and UI\ndesign. Has experience in both competitive programming and mobile\napplication development.\n\nSong Kai: 2006 - 2007 Learning BASIC 2008 - 2011 Learning PASCAL 2012 -\nLearning C++ 2013 - Learning Python Has experience in both competitive\nprogramming (algorithm based) and application development. Hopes to make\ngood combination of both aspects of coding to bring more convenience to\npeople’s daily life. Some Python projects done:\nhttp://elijahsk.pythonanywhere.com/ (Flask based)\nhttps://play.google.com/store/apps/details?id=dessert.program (Pygame\nbased, in collaboration with Shuyue) http://dhstreasurerkit.appspot.com\n(GAE based)\n\nOthers: We have one female presenter Shuyue and through this\npresentation, we would like to encourage more female students to try\nPython and bravely voice out their own experiences. All three of us are\nYear 6 (Grade 12) students from Dunman High School, Singapore. Last year\nwe have been through Project Work where systematic report and\ninteractive oral presentation are the main focus of learning. We are\nconfident that we can give the audience an engaging presentation\nexperience. We have good ability to converse in Mandarin, hence are able\nto reach out to a broader / more local audience.\n",
  "duration": null,
  "id": 3266,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-08-13",
  "related_urls": [
    "http://dhstreasurerkit.appspot.com",
    "http://elijahsk.pythonanywhere.com/",
    "https://play.google.com/store/apps/details?id=dessert.program"
  ],
  "slug": "hipy-python-for-high-school-students-pycon-apa",
  "speakers": [
    "Nie Shuyue",
    "Song Kai",
    "Wu Chenmu"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/X4wjcy5sqwY/hqdefault.jpg",
  "title": "HiPy - Python for High School Students",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=X4wjcy5sqwY"
    }
  ]
}