{
  "alias": "video/3269/open-source-and-open-science-pycon-apac-2014",
  "category": "PyCon APAC 2014",
  "copyright_text": "creativeCommon",
  "description": "I will discuss the intersection of Open Source and scientific research,\nfocusing on the positive impact that Open Source tools and ideas, and\nthe Python community in particular, have had on the world of science.\nScientific research is at a crossroads, under increasing pressure to\njustify itself to society at large and with very real questions being\nasked about the reproducibility of scientific results and access to the\nproducts of science. The Open Source community have created both\ntechnical and cultural solutions to similar problems that we as\nscientists can learn from. The Python language has also made major\ninroads into research and education, helping foster a culture of better\ncomputational research and opening up a space for a lot of creativity at\nthe intersection of science and computing.\n\nAbout the speaker\n\nFernando Pérez is a research scientist at UC Berkeley, working at the\nintersection of high-level scientific computing with open tools and\nbrain imaging. He started the IPython project in 2001, while a graduate\nstudent in Physics at CU Boulder. He continues to lead a talented team\n(who do all the hard work) to develop IPython as the interface between\nthe humans at the keyboard and the bits in the machine.\n\nHe is a founding member of NumFOCUS, a PSF member, and received the 2012\nAward for the Advancement of Free Software for IPython and his\ncontributions to scientific Python. He is a founding investigator of the\nBerkeley Institute for Data Science, created in 2013.\n\nWhen he can get away from a computer, Fernando tries to enjoy the\nmountains and the outdoors hiking, backpacking and climbing. For more\ninformation, see http://fperez.org.\n",
  "duration": null,
  "id": 3269,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-08-08",
  "related_urls": [
    "http://fperez.org."
  ],
  "slug": "open-source-and-open-science-pycon-apac-2014",
  "source_url": "https://www.youtube.com/watch?v=ZD5n9s8PGtI",
  "speakers": [
    "Fernando Pérez"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ZD5n9s8PGtI/hqdefault.jpg",
  "title": "Open Source and Open Science: how Python and its community made me a better scientist ",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZD5n9s8PGtI"
    }
  ]
}