{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon APAC 2014", "speakers": ["Fernando Pérez"], "title": "Open Source and Open Science: how Python and its community made me a better scientist ", "quality_notes": "", "video_flv_length": null, "recorded": "2014-08-08", "video_mp4_length": null, "description": "I will discuss the intersection of Open Source and scientific research, focusing on the positive impact that Open Source tools and ideas, and the Python community in particular, have had on the world of science. Scientific research is at a crossroads, under increasing pressure to justify itself to society at large and with very real questions being asked about the reproducibility of scientific results and access to the products of science. The Open Source community have created both technical and cultural solutions to similar problems that we as scientists can learn from. The Python language has also made major inroads into research and education, helping foster a culture of better computational research and opening up a space for a lot of creativity at the intersection of science and computing.\r\n\r\n\r\nAbout the speaker\r\n\r\nFernando Pérez is a research scientist at UC Berkeley, working at the intersection of high-level scientific computing with open tools and brain imaging. He started the IPython project in 2001, while a graduate student in Physics at CU Boulder. He continues to lead a talented team (who do all the hard work) to develop IPython as the interface between the humans at the keyboard and the bits in the machine.\r\n\r\nHe is a founding member of NumFOCUS, a PSF member, and received the 2012 Award for the Advancement of Free Software for IPython and his contributions to scientific Python. He is a founding investigator of the Berkeley Institute for Data Science, created in 2013.\r\n\r\nWhen he can get away from a computer, Fernando tries to enjoy the mountains and the outdoors hiking, backpacking and climbing. For more information, see <http://fperez.org>.", "video_mp4_url": "", "tags": [], "copyright_text": "creativeCommon", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=ZD5n9s8PGtI", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/ZD5n9s8PGtI/hqdefault.jpg", "video_flv_url": ""}