{
  "alias": "video/3272/python-under-the-sea-in-space-and-back-home-p",
  "category": "PyCon APAC 2014",
  "copyright_text": "creativeCommon",
  "description": "About the speaker\n\nJessica McKellar is an entrepreneur, software engineer, and open source\ndeveloper from Cambridge, Massachusetts, USA. She is a Director for the\nPython Software Foundation and an organizer for the largest Python user\ngroup in the world. With that group she runs the Boston Python Workshop\n-- an introductory programming pipeline that has brought hundreds of\nwomen into the local Python community and is being replicated in cities\nacross the US. Jessica is a veteran open source contributor and a\nmaintainer for several open source projects, including OpenHatch and the\nTwisted event-driven networking engine; she wrote a chapter on Twisted\nfor The Architecture of Open Source Applications Volume II and the\nsecond edition of O’Reilly’s Twisted Networking Essentials.\n\nIn a PyCon US 2014 keynote, Jessica McKellar outlined the\nprogramming-education problem that exists in US high schools, but she\nalso highlighted some steps the community could take to help fix it.\nBesides, the Python Software Foundation is ready to help, including\nlooking to fund grant proposals for Python-education-related projects.\nHere's her challenge for the community: by next year's PyCon, we would\nlike to see every folk does one thing to further the cause of the next\ngeneration of Python programmers.\n",
  "duration": null,
  "id": 3272,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-08-07",
  "slug": "python-under-the-sea-in-space-and-back-home-p",
  "speakers": [
    "Jessica McKellar"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/eGwSC6UnYTg/hqdefault.jpg",
  "title": "Python: under the sea, in space, and back home",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eGwSC6UnYTg"
    }
  ]
}