{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon APAC 2014", "speakers": ["Jessica McKellar"], "title": "Python: under the sea, in space, and back home", "quality_notes": "", "video_flv_length": null, "recorded": "2014-08-07", "video_mp4_length": null, "description": "About the speaker\r\n\r\nJessica McKellar is an entrepreneur, software engineer, and open source developer from Cambridge, Massachusetts, USA. She is a Director for the Python Software Foundation and an organizer for the largest Python user group in the world. With that group she runs the Boston Python Workshop -- an introductory programming pipeline that has brought hundreds of women into the local Python community and is being replicated in cities across the US. Jessica is a veteran open source contributor and a maintainer for several open source projects, including OpenHatch and the Twisted event-driven networking engine; she wrote a chapter on Twisted for The Architecture of Open Source Applications Volume II and the second edition of O’Reilly’s Twisted Networking Essentials.\r\n\r\nIn a PyCon US 2014 keynote, Jessica McKellar outlined the programming-education problem that exists in US high schools, but she also highlighted some steps the community could take to help fix it. Besides, the Python Software Foundation is ready to help, including looking to fund grant proposals for Python-education-related projects. Here's her challenge for the community: by next year's PyCon, we would like to see every folk does one thing to further the cause of the next generation of Python programmers.", "video_mp4_url": "", "tags": [], "copyright_text": "creativeCommon", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=eGwSC6UnYTg", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/eGwSC6UnYTg/hqdefault.jpg", "video_flv_url": ""}