{
  "alias": "video/3252/real-time-visualization-with-python-and-d3js-py",
  "category": "PyCon APAC 2014",
  "copyright_text": "creativeCommon",
  "description": "Pyhton has great power in scrapping and analyzing data, and D3.js is a\ngreat tool for building visual interface. In the first part of the talk,\nI will demonstrate how to set up D3.js as an interactive layer on top of\nPython. In the second part of the talk, I will show what it can achieve,\nby using the \"Taiwan Vegetable Auction\" dataset (past 10 years\ntransaction data of 127 kinds of vegetable, 1GB).\n\nThe dataset is too large for human to see through, a machine learning\nalgorithm will be able to fit a regression model on the dataset, but it\ncan't make sense of it. For example, in the following graph:\n\nYou can see the average price of green onion in different markets for\nthe past 20 years, the fluctuation between different markets are\nsimilar, yet since 2010, there is a perfectly horizontal blue line:\nwhile price in the other markets have changes, price in \"Taitung\" has\nremained exactly the same, suggesting a possible case of monopoly. One\ncan then asks the system to detect other cases of monopoly. This process\nof exploratory data analysis can only be possible with both machine and\nhuman.\n\nFrom a technical perspective, this talk can benefit front-end\ndeveloper/data scientist to set up such a system. Yet a more profound\nvalue of the talk will be to explore how machine and human can work\ntogether.\n\nAbout the speaker\n\nMuyueh Lee (李慕約) is a programmer focus on Data Visualization, for\nprofit and for fun, he hosts \"Visualization Lighting Talk\", a gathering\nfor programmers doing data visualization work in Taiwan, and has been\nteaching Visualization in the graduate school of Journalism at National\nTaiwan University, in the DataScience Program by CfT and SYSTEX, and\nheld various workshop in Guangzhou and Hong Kong. A list of his work can\nbe found at http://muyueh.com/1314/\n",
  "duration": null,
  "id": 3252,
  "language": "English",
  "quality_notes": "",
  "recorded": "2014-06-27",
  "slug": "real-time-visualization-with-python-and-d3js-py",
  "source_url": "https://www.youtube.com/watch?v=Bzl-Rgmg7vQ",
  "speakers": [
    "Muyueh Lee"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Bzl-Rgmg7vQ/hqdefault.jpg",
  "title": "Real-time visualization with Python and d3.js",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Bzl-Rgmg7vQ"
    }
  ]
}