{
  "id": 3258,
  "category": "PyCon APAC 2014",
  "slug": "vapoursynth-comes-does-it-indicate-that-avisynth",
  "title": "VapourSynth comes, does it indicate that AviSynth will shutdown?",
  "alias": "video/3258/vapoursynth-comes-does-it-indicate-that-avisynth",
  "summary": "",
  "description": "VapourSynth is a powerful tool for video post-production. In contrast to\nvideo editing tools with GUI interface, it parses expressions and\nstatements from Python script, builds corresponding filter graph, and\ncheats output video as regular uncompressed RGB/YUV AVI stream file.\nThus, everyone can view video editing result just by playing Python\nscript as a regular AVI file.\n\nThe concept of VapourSynth is based on AviSynth, the most famous script\nbased video editing tools. However, AviSynth is too old, inefficient,\nhas disorder filter set, and there are many limitations in its specific\nscript language (lack of for/while loop). That is why project holder\nintroduces many advantages into VapourSynth, such as better resource\nusage, frame level concurrent processing, simplified filter set, and\ndescribes video processing flow with Python!\n\nWill VapourSynth be the future of script based video editing? Let's make\nsome simple VapourSynth scripts and realize what VapourSynth can do!\n\nAbout the speaker\n\nSource: A little programmer from animation studio. He joins or hosts\ndevelopment of many utilities for animation staff in studio. He is very\nfamiliar with AviSynth, and has embedded it into production or\nexhibition application.\n\nFaith: Loves the style of functional programming language, but always\nuses imperative and object-oriented coding style for real life problem.\nBelieves voxel based rendering is the future, but always works on\nrendering module with polygon based rendering. Asks friends to own a car\nwith Hybrid Synergy Drive, but drives a car with 4-speed automatic\ntransmission plus inefficient torque converter inside.\n\nIn another words, lip-service technology geek.\n",
  "quality_notes": "",
  "language": "Chinese",
  "copyright_text": "youtube",
  "thumbnail_url": "https://i.ytimg.com/vi/JAAxfAKQeEg/hqdefault.jpg",
  "duration": null,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=JAAxfAKQeEg",
      "type": "youtube",
      "length": 0
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=JAAxfAKQeEg",
  "tags": [],
  "speakers": [
    "Hsueh-Tsung Kuo"
  ],
  "recorded": "2014-06-27"
}