{
  "copyright_text": "Standard YouTube License",
  "description": "Speaker : Michael Amy / cocoade\nSlide : https://github.com/pythonkr/pyconapac-2016-files/raw/master/20160813-105-25-MichaelAmy.pdf\n\nDescription :\n\"Neural networks\" is the name of a machine learning technique that takes inspiration from biological brain cells.\n\n\"Deep learning\" is a term used to describe various 'deep' (many layered) networks that are capable of more sophisticated processing than the classic three-layer perceptrons.\n\nRecent advances in deep learning, especially the use of convolutional networks and the use of GPUs to process them instead of CPUs, have led to breakthroughs in performance on machine vision, natural language processing, and other tasks.\n\nVarious frameworks have been introduced that facilitate easy experimentation with deep learning networks, amongst others, there are examples such as: Caffe, Theano, and recently Google's Tensorflow.\n\nKeras is a Python framework that uses Theano or Tensorflow as a backend.  It makes the building and testing of such networks much easier, as this session will demonstrate.\n\nThis session will explain the concepts involved and go through some examples that will enable an intermediate-level python programmer to develop, train and validate their own deep learning networks to perform visual recognition tasks using deep convolutional networks.\n\nIt will describe how to plan the basic network topology and will also highlight some common pitfalls and steps that can be taken to avoid them.\n\nNote: It will not explain how to set up a machine for these tasks, which is a job in itself. Nor will it explain detailed aspects of neural networks such as specifics of activation functions, optimizers or back propagation. There is just not enough time in the session. I will try to provide some useful links instead.",
  "duration": 2724,
  "language": "eng",
  "recorded": "2016-08-26",
  "related_urls": [
    "https://github.com/pythonkr/pyconapac-2016-files/raw/master/20160813-105-25-MichaelAmy.pdf"
  ],
  "speakers": [
    "Michael Amy"
  ],
  "tags": [
    "deep learning"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ho5Nd1Y9aLU/maxresdefault.jpg",
  "title": "Introduction to deep learning for machine vision tasks using Keras",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ho5Nd1Y9aLU"
    }
  ]
}
