{
  "copyright_text": "Standard YouTube License",
  "description": "Project Jupyter provides building blocks for interactive and exploratory computing. These building blocks make science and data science reproducible across over 40 programming language (Python, Julia, R, etc.). Central to the project is the Jupyter Notebook, a web-based interactive computing platform that allows users to author data- and code-driven narratives - computational narratives - that combine live code, equations, narrative text, visualizations, interactive dashboards and other media.\n\nWhile the Jupyter Notebook has proved to be an incredibly productive way of working with code and data interactively, it is helpful to decompose notebooks into more primitive building blocks: kernels for code execution, input areas for typing code, markdown cells for composing narrative content, output areas for showing results, terminals, etc. The fundamental idea of JupyterLab is to offer a user interface that allows users to assemble these building blocks in different ways to support interactive workflows that include, but go far beyond, Jupyter Notebooks.\n\nJupyterLab accomplishes this by providing a modular and extensible user interface that exposes these building blocks in the context of a powerful work space. Users can arrange multiple notebooks, text editors, terminals, output areas, etc. on a single page with multiple panels, tabs, splitters, and collapsible sidebars with a file browser, command palette and integrated help system. The codebase and UI of JupyterLab is based on a flexible plugin system that makes it easy to extend with new components.\n\nIn this talk, we will demonstrate the JupyterLab interface, its codebase, and describe how it fits within the overall roadmap of the project.",
  "duration": 1770,
  "id": 5341,
  "language": "eng",
  "recorded": "2016-07-15",
  "related_urls": [],
  "slug": "jupyterlab-building-blocks-for-interactive-computing-scipy-2016-brian-granger",
  "speakers": [
    "Brian Granger",
    "Jason Grout"
  ],
  "tags": [
    "SciPy 2016",
    "jupyter",
    "jupyterlab",
    "jupyter notebook"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Ejh0ftSjk6g/maxresdefault.jpg",
  "title": "JupyterLab: Building Blocks for Interactive Computing",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ejh0ftSjk6g"
    }
  ]
}
