{
  "copyright_text": "Standard YouTube License",
  "description": "MDAnalysis (http://mdanalysis.org) is an object-oriented library for structural and temporal analysis of molecular dynamics (MD) simulation trajectories and individual protein structures. MD simulations of biological molecules have become an important tool to elucidate the relationship between molecular structure and physiological function. Simulations are performed with highly optimized software packages on HPC resources but most codes generate output trajectories in their own formats so that the development of new trajectory analysis algorithms is confined to specific user communities and widespread adoption and further development is delayed. The MDAnalysis library addresses this problem by abstracting access to the raw simulation data and presenting a uniform object-oriented Python interface to the user. It thus enables users to rapidly write code that is portable and immediately usable in virtually all biomolecular simulation communities. The user interface and modular design work equally well in complex scripted workflows, as foundations for other packages, and for interactive and rapid prototyping work in IPython/Jupyter notebooks, especially together with molecular visualization provided by nglview [1] and time series analysis with pandas [2]. MDAnalysis is written in Python and Cython and uses NumPy arrays for easy interoperability with the wider scientific Python ecosystem. It is widely used and forms the foundation for more specialized biomolecular simulation tools. MDAnalysis is available under the GNU General Public License v2.\n\n[1] https://github.com/arose/nglview\n\n[2] http://pandas.pydata.org/",
  "duration": 1577,
  "id": 5350,
  "language": "eng",
  "recorded": "2016-07-14",
  "related_urls": [
    "http://mdanalysis.org",
    "http://mdanalysis.org)",
    "http://pandas.pydata.org/",
    "https://github.com/arose/nglview"
  ],
  "slug": "mdanalysis-a-python-package-for-the-rapid-analysis-of-molecular-dynamics-simulations-scipy-2016",
  "speakers": [
    "Oliver Beckstein",
    "Richard Gowers",
    "Max Linke",
    "Jonathan Barnoud",
    "Tyler Reddy",
    "Manuel Melo",
    "Sean Seyler",
    "Jan Dománski",
    "David Dotson",
    "Sébastien Buchoux",
    "Ian Kenney"
  ],
  "tags": [
    "mdanalysis",
    "biomolecular",
    "biomedicine"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/zVQGFysYDew/maxresdefault.jpg",
  "title": "MDAnalysis: A Python Package for the Rapid Analysis of Molecular Dynamics Simulations",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zVQGFysYDew"
    }
  ]
}
