{
  "alias": "video/3111/caching-a-trip-down-the-rabbit-hole-by-tom-eastm",
  "category": "PyCon AU 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "The question: How do I make my website fast?\n\nIf that sounds like a loaded question to you: good, we're on the same\npage.\n\nIn this talk I will give you a full overview of one of the most powerful\nand headache-inducing tools in the web-developer's kit: caching.\n\nThis is a talk for all experience levels, from beginner to seriously\nbrain-melty. The code and scenarios we'll be exploring are within the\ncontext of a Django project, but the principles are applicable to all of\nweb development.\n\nWe'll begin our journey in the light, warm land of web browser caches:\nlearning how you can make your users' web browsers do all the work for\nyou. Making your site feel rocket-fast and responsive with little more\nthan some finely crafted HTTP response headers.\n\nFrom there, we'll begin our descent into the underworld of server-level\ncaching, using reverse-proxies such as Varnish or Nginx that shield the\napplication code from having to do any work. What they do, how they can\nhelp, and more important -- when do they *not* help, and when do you\nhave to go deeper.\n\nFinally we'll explore the dark art of application-level caching. Whether\nit's caching whole responses, partial responses, preventing repetitive\nSQL queries or expensive API response serialization calls. And, if our\nbrains haven't exploded yet, we might throw in some asynchronous\ncached-view-generation just for good measure.\n\nWhether you're a hobbyist or a grizzled veteran, you should come out of\nthis talk with a few new tricks up your sleeve for making all your sites\ndo more with less work.\n\nExpect references from -- depending on mood -- Alice in Wonderland, The\nMatrix, or Dante Alighieri's \"Inferno\".\n",
  "duration": null,
  "id": 3111,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-08-11",
  "slug": "caching-a-trip-down-the-rabbit-hole-by-tom-eastm",
  "speakers": [
    "Tom Eastman"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/bIWnQ3F1eLA/hqdefault.jpg",
  "title": "Caching: A trip down the rabbit hole by Tom Eastman",
  "videos": [
    {
      "type": "ogv",
      "url": "http://mirror.linux.org.au/pub/pycon-au/pyconau2014/28-out.ogv"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bIWnQ3F1eLA"
    }
  ]
}
