{
  "alias": "video/3132/graphs-networks-and-python-the-power-of-interc",
  "category": "PyCon AU 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "Graph and network structures are everywhere and can be found in social,\nbiological and technological networks that impact us on a daily basis.\nUnderstanding, and exploiting, graphical structures creates\nopportunities for obtaining new analytic insights, implementing new\ncomputational paradigms, and better defining the relationship between\nobjects of any sort.\n\nPython provides access to these graph and network structures using the\nfantastic NetworkX library (http://networkx.github.io/) . In this\npresentation we will give an introduction to the NetworkX library,\nshowing how easy it is to build and exploit simple graphical and network\nstructures.\n\nFrom that starting point we will then discuss a number of more\ncomplicated, real world examples of how the NetworkX library can be used\nto: - Analyse social networks to extract valuable information about\npeople / entities within those networks. - Implement reconfigurable\nprocessing pipelines (something we refer to as computational graphs) for\ndata capture, processing and analytics. - Easily track the relationship\nbetween Python objects in a variety of other interesting and useful\nscenarios.\n\nThis presentation will be targeted at intermediate developers and no\nprior experience with graphs, networks or NetworkX is required. This\npresentation will offer an easy introduction to the world of networks\nand graphs in Python and will illustrate real world uses of this\npowerful and useful paradigm.\n",
  "duration": null,
  "id": 3132,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-08-09",
  "related_urls": [
    "http://networkx.github.io/)"
  ],
  "slug": "graphs-networks-and-python-the-power-of-interc",
  "speakers": [
    "Lachlan Blackhall"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/1q7FBxy1Rds/hqdefault.jpg",
  "title": "Graphs, Networks and Python:  The Power of Interconnection by Lachlan Blackhall",
  "videos": [
    {
      "type": "ogv",
      "url": "http://mirror.linux.org.au/pub/pycon-au/pyconau2014/29-out.ogv"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1q7FBxy1Rds"
    }
  ]
}
