{
  "alias": "video/3090/science-miniconf-monte-carlo-business-case-analy",
  "category": "PyCon AU 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Pandas is increasingly becoming a standard tool in scientific computing.\nCould it also have a role in the CFO's office?\n\nCFOs regularly need to analyse the impact of different projects or\nbusiness cases, and they almost universally do this using spreadsheets.\nSpreadsheets have many advantages - they have a low barrier to entry and\nare easy for most people to understand. However as they get more\ncomplicated, disadvantages start to appear; in particular, they can be\ninflexible and highly error-prone.\n\nIn this talk I will explain how business case analysis can be done using\npython and pandas. The python version has several advantages over\nspreadsheets: it is more flexible as the business structure changes;\nformulas only need to be changed in a single place, reducing the chance\nof error; and report-ready plots are quick to produce. I'll go through a\nway of structuring the problem for some simple business logic, and ways\nto visualise the results.\n\nThe example I’ll discuss is made more interesting and useful by being\n“Monte Carlo” analysis. Traditional business case analysis takes single\npoint estimates of sales, costs and prices, and calculates a single\nprofit forecast. Everybody knows the profit will not turn out to be\nexactly equal to the forecast. But it is not clear what the range of\nprofits might be, or how likely a loss is. \"Monte Carlo\" analysis solves\nthis problem by allowing ranges or distributions on the assumptions; the\nforecast is then a range of outcomes.\n\nIn short, I’ll demonstrate how you can use pandas to analyse high-impact\nbusiness decisions, and dodge many of the problems of using\nspreadsheets.\n",
  "duration": null,
  "id": 3090,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-08-11",
  "slug": "science-miniconf-monte-carlo-business-case-analy",
  "speakers": [
    "Arthur Street"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/KcMaO2f7ww4/hqdefault.jpg",
  "title": "Science MiniConf: Monte Carlo Business Case Analysis with pandas by Arthur Street",
  "videos": [
    {
      "type": "ogv",
      "url": "http://mirror.linux.org.au/pub/pycon-au/pyconau2014/98-out.ogv"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KcMaO2f7ww4"
    }
  ]
}
