{
  "alias": "video/3092/software-carpentry-in-australia-current-activity",
  "category": "PyCon AU 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Software Carpentry is a volunteer organisation that teaches basic\nsoftware skills to researchers in science, engineering and medicine.\nSupported by the Mozilla Science Lab, it runs two-day bootcamps all over\nthe world, provides open access material for self-paced instruction, and\nruns a training program for aspiring instructors. The core two-day\ncurriculum includes the Unix shell (and how to automate repetitive\ntasks); Python or R (and how to grow a program in a modular, testable\nway); Git and GitHub (and how to track and share work efficiently); and\nSQL (and the difference between structured and unstructured data).\n\nWhile the organisation has been around for over a decade, it had a\nbreakout year in 2013. The number of qualified instructors swelled to\nover 100 and collectively they ran over 100 events for over 4300\nresearchers in a dozen countries. To kick things off in Australia, the\nfounder of Software Carpentry (Dr. Greg Wilson) visited Sydney and\nMelbourne in February 2013 to host the first ever bootcamps outside of\nEurope and North America. Since that visit five local instructors have\nbeen trained up and have delivered an additional ten bootcamps around\nthe country.\n\nThis presentation will review the first year of Software Carpentry\nactivities in Australia, with a particular focus on the key lessons\nlearned in teaching computational best practices to the research\ncommunity. Future plans and directions will also be outlined, including\nan overview of an innovative new project called the Research Bazaar.\nCoordinated out of The University of Melbourne, this project has started\noffering regular bootcamps to researchers in the Melbourne area and\nlooks set to inspire widespread institutional support for bootcamp\ndelivery. The Software Carpentry teaching materials are also undergoing\nrapid development, with work on an advanced curriculum and new lessons\non “data carpentry” already underway. There are very few examples of\nopen, collaborative lesson development in the education sector, so the\napplication of routine software development practices in this space\n(e.g. version control, pull requests, and the progressive release of new\nversions) is somewhat ground breaking.\n",
  "duration": null,
  "id": 3092,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-08-11",
  "slug": "software-carpentry-in-australia-current-activity",
  "speakers": [
    "Damien Irving"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/sQ12NmsLfsg/hqdefault.jpg",
  "title": "Software Carpentry in Australia: current activity and future directions by Damien Irving",
  "videos": [
    {
      "type": "ogv",
      "url": "http://mirror.linux.org.au/pub/pycon-au/pyconau2014/43-out.ogv"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sQ12NmsLfsg"
    }
  ]
}
