{
  "alias": "video/3114/verification-truth-in-statistics-by-tennessee-le",
  "category": "PyCon AU 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "Come to this talk if you want to learn a few basic techniques for\nputting numerical data in context. If you've ever predicted anything, or\ntried to work out whether some number was \"good enough\", you'll probably\nget something out of this presentation. All techniques and tools\ndemonstrated using Python.\n\nEvery day, decisions both big and small are made on the basis of the\ninformation published by the Bureau of Meteorology. These include simple\ndecisions such as taking an umbrella or planning a barbecue. Our\nforecasts also inform Australia's emergency services on where extreme\nweather events may have occurred, to help with planning and preparation.\n\nUnderstanding and communicating our strengths and weaknesses is very\nimportant, both as an organisation and also internally within the\nEnvironment and Research division. This presentation will focus on the\nstatistical methods and systems used to evaluate the objective,\nscientific performance of our forecast systems. The name for this area\nof study is \"Verification\". While the concepts have come from the\nresearch environment, they are widely applicable and can help anyone who\nis assessing the performance of any system.\n\nThis presentation will include: -- An overview of the major ideas of\nverification -- How to create a 'skill score' -- The application of\nthese concepts to thunderstorm forecasting -- How to use Python tools\nfor verification analyses -- Tips on how to apply these ideas easily in\nother contexts\n\nObtaining relevant thunderstorm observational data can be particularly\nchallenging, particularly pertaining to severe and damaging aspects:\nlightning, hail, heavy rain and very strong wind gusts. In order achieve\na stronger footing, some new methods of analysis are under development.\nIt is necessary to establish the scientific validity of the verification\nmetrics at the same time as constructing the systems to support the data\nanalysis.\n\nA prototype web-based tool written in Python (and under active\ndevelopment by the presenter) will be demonstrated. This tool can run\nlocally to provide an enhanced lab environment for assessing case study\ndata, or be set up as a server for continuous monitoring and reporting.\n\nNo pre-existing knowledge of Python or statistics is assumed. The talk\nwill include several technical aspects, such as working at different\ncomputing scales, usability and user experience, working with\nstatistical algorithms, data visualisation for both web and journal\npublications, and the architectural challenges of a complex application.\n",
  "duration": null,
  "id": 3114,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-08-09",
  "slug": "verification-truth-in-statistics-by-tennessee-le",
  "speakers": [
    "Tennessee J Leeuwenburg"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "http://i.ytimg.com/vi/c0DE_UfRiXE/hqdefault.jpg",
  "title": "Verification: Truth in Statistics by Tennessee Leeuwenburg",
  "videos": [
    {
      "length": null,
      "type": "ogv",
      "url": "http://mirror.linux.org.au/pub/pycon-au/pyconau2014/27-out.ogv"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "http://www.youtube.com/watch?v=c0DE_UfRiXE"
    }
  ]
}
