{
  "description": "Video courtesy of our meeting host, LinkedIn.\n1. Automate AWS With Python - Moshe Zadka\nAWS is one of the best-known cloud vendors. Using the Web UI is fine when starting out, but automating cloud operations is important. Boto3 provides a great Pythonic API to AWS, but using it correctly can be subtle.\nThe talk will cover how to automate AMI builds, building Cloud Formation Templates and automating S3 bucket management.\nSpeaker Bio\nMoshe has been involved with Python since 1998, when he helped obsolete math-related modules. Since then, he made some contributions that were not just deleting code to core Python, and has been a contributor on the Twisted project since its inception.\nAbstract\n2. Yes, It's Time to Learn Regular Expressions - Al Sweigart\nRegular expressions have a reputation as opaque and inscrutable. However, the basic concepts behind \"regex\" and text pattern recognition are simple to grasp. This talk is for any programmer who isn't familiar with Python's re module and its best practices. Stop putting it off, it's time to learn regular expressions!\nSpeaker Bio\nAl Sweigart is a software developer and the author of Automate the Boring Stuff with Python, Invent Your Own Computer Games with Python, Making Games with Python & Pygame, and Hacking Secret Ciphers with Python. These books are freely available under a Creative Commons license at http://inventwithpython.com.\nAl enjoys haunting coffee shops, writing educational materials, cat whispering, and making useful software. He lives in San Francisco.\n3. Type uWSGI; press enter; what happens? - Asheesh Laroia and Philip James\nYou're a pretty knowledgeable Python web application developer, but how does that web application get served to the world? For many of us, uWSGI is the magic that makes our application available, and in this talk we'll look at how uWSGI works with the OS and the networking stack to make the magic happen.\nSpeaker Bios\nAsheesh Laroia\nBy day, Asheesh Laroia is a member of the technical staff at Sandstorm in Palo Alto. By night, he is volunteer President at OpenHatch, helping create workshops that teach students how to get involved in open source. His technical background touches machine learning, security, and linguistics. He helped start the Boston Python Workshop for women and their friends, has been teaching Python to newcomers since 2004, including at Noisebridge and the EFF, and has advised user groups on how to make their events more newcomer-friendly and gender-diverse.\nPhilip James\nPhilip James is a Software Engineer at Stripe, a Civic Technologist and a Director for the City of Alameda Democratic Club and the East Bay Young Democrats. In his free time he builds ContactOtter, a smart address book you can share.",
  "language": "eng",
  "recorded": "2017-04-27",
  "speakers": [
    "Moshe Zadka",
    "Al Sweigart"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/MksyISonCws/hqdefault.jpg",
  "title": "BayPIGgies April 2017 talk: Annual PyCon Preview",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MksyISonCws"
    }
  ]
}
