{
  "description": "Speaker: Shannon -jj Behrens\nTopic: Best Practices for Software Engineers\nBroadcast Time: Thursday 5/22 at 7:30pm\nLocation: LinkedIn, Mountain View\n\nSummary:\nBeing a software engineer requires a lot more than knowing how to write good code.\n\nThis class covers a wide variety of topics such as making code reviews useful and effective, how to deal with team conflicts, networking in real life, and planning for your career. The goal is to help you not only be a solid asset for your team, but also to be the type of software engineer that others really enjoy working with.\n \nDuration:\n 1:00 hour\n \nObjectives:\n- Learn how to gather requirements and design your code while still favoring agility\n- Write the right code for today without shooting yourself in the foot for tomorrow\n- Write code that optimizes for readability\n- Refactor your code so that it stays fresh and healthy\n- Write useful tests without devolving into religious arguments on the best approaches to testing\n- Write the documentation that need to be written and skip the documentation that's just busy work\n- Be an effective code reviewer\n- Communicate effectively and deal with conflict gracefully\n- Plan for your career and grow a strong network\n- Be the kind of software engineer that others really enjoy working with\n \nAudience:\nAll software engineers\n \nSpeaker: \nShannon -jj Behrens is a Staff Software Engineer at Twitter working in\nInfrastructure and Operations. He lives in Concord, California with his\nlovely wife and 7 lovely children. He's well known for his impeccable\nsense of modesty, world-renowned taste in T-shirts, and poor sense of\nhumor. He blogs at jjinux.blogspot.com on a wide variety of topics such as Python, Ruby, Dart, Linux, open source software, the Web, and lesser-known programming languages",
  "language": "eng",
  "recorded": "2014-05-22",
  "speakers": [
    "Shannon -jj Behrens"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/jzQmQDIii14/hqdefault.jpg",
  "title": "Best Practices for Software Engineers (May 2014)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jzQmQDIii14"
    }
  ]
}
