{
  "description": "Speaker: Peter Farrell\nTopic: Learning Math and Science Using Python\nDate: Dec-19-2013\nLocation: LinkedIn, Mtn. View\n\nAbstract:\nIn 1980 Seymour Papert's Mindstorms suggested that everything meaningful in math education could be done using a computer. Mathematics teaching has yet to take full advantage of modern technology.\n\nPython should be in the toolbox of every student right from the beginning of algebra, not only because it makes arithmetic trivial but because it can facilitate deeper exploration of topics ranging from algebra to calculus.\n\nIn this presentation we'll see how Python can be used to clarify difficult topics high school students are faced with in math and science.\n\nUnlike outdated skills like factoring polynomials, working with functions is more valuable than ever thanks to computers and Python in particular because (forgive my oversimplification) in Python \"everything is a function.\"\n\nHigh school math and physics courses also demand a knowledge of vectors, so more teachers should take advantage of the 3-D possibilities of Visual Python to model situations using vectors. It will be shown how physical situations otherwise involving disheartening differential equations can be modeled and easily solved in VPython. Furthermore, conjectures which were previously difficult to prove in physics can be easily created and visually proven by high school students with a little Python.\n\nSpeaker: \nPeter Farrell has been a high school math teacher and tutor on the East Coast and the West Coast and even on the Equator. He's currently a STEM Instructor at four Summit Charter High Schools in the Bay Area through Learningtech.org",
  "language": "eng",
  "recorded": "2013-12-19",
  "speakers": [
    "Peter Farrell"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/HfvQ6O7Di0g/hqdefault.jpg",
  "title": "Learning Math and Science Using Python (December 2013)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HfvQ6O7Di0g"
    }
  ]
}
