{
    "description": "Day 1,  13:05-13:35\n\nAbstract\n\nCyber forensics is a field that deals with the investigation of digital crimes by analyzing, examining, identifying, and recovering digital evidence from electronic devices and producing them in the court of law. The talk begins with an introduction to digital forensics, the process of investigation, and the collection of evidence. Next, I will cover the various python modules and built-in functions required to build your first cyber forensic application. The modules covered in the discussion are pyscreenshot, Whoosh, PIL, hashlib, mutagen, pyPDF2, and pefile. Finally, I will demonstrate creating small cyber forensic applications using bulit-in modules and functions that are already to known to most of the Python programmers.\n\n\nSlides not uploaded by the speaker.\nHackMD: https://hackmd.io/@pycontw/2021/%2F%40pycontw%2FByfYqeKGt\n\nSpeaker: Gajendra Deshpande\n\nMr. Gajendra Deshpande holds a masters degree in Computer Science and Engineering and working as Assistant Professor at the Department of Computer Science and Engineering, KLS Gogte Institute of Technology, Belagavi, Karnataka, India. He has a teaching experience of 12 years and a Linux and Network Administration experience of one year. Under his mentor-ship teams have won Smart India Hackathon 2018 and Smart India Hackathon 2019. He is the Technical Director for Sestoauto Networks Pvt. Ltd. and Founder of Thingsvalley. His areas of Interest include Programming, Web Designing, Cyber Security, Artificial Intelligence, Machine Learning, Brain-Computer Interface, Internet of Things, and Virtual Reality. He has presented papers at NIT Goa, Scipy India 2017 IIT Bombay, JuliaCon 2018 London, Scipy India 2018 IIT Bombay, Scipy 2019 USA, and PyCon FR 2019, Bordeaux, France.",
    "speakers": [
        "Gajendra Deshpande"
    ],
    "recorded": "2021-10-02",
    "title": "Build Your First Cyber Forensic Application using Python – Gajendra Deshpande (PyCon Taiwan 2021)",
    "thumbnail_url": "https://i.ytimg.com/vi/nQWOwItvlDo/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=nQWOwItvlDo"
        }
    ]
}