{
    "description": "Day 2, 10:35-11:20\n\nAbstract\n\nNowadays data is the key to solving challenges in most of the fields say astronomy, applied maths, health care, or even sports. Data is everywhere and it is super beneficial to leverage these data to build models for making sense out of these data and tell stories. The field of sports science, especially football (soccer), is enriched by data analysis that makes us understand the game better and predict outcomes. Many people want to delve deep into football (soccer) data analysis and get their hands dirty. This talk is to help them do so by pedagogically introducing them to the introductory analytical methodologies to overcome the initial barriers of the field and start working with football data analyses and visualizations.\n\nDescription\n\nThis talk introduces the following concepts on football data analysis:\n\nI will start my talk addressing how to get open access football event data using the statsbomb API using Python,\n\nThe next thing I will talk about is drawing a football pitch using the mplsoccer Python module, so that we can start making most of our football data visualizations on this pitch,\n\nI will then talk about simple data visualizations like drawing shot maps, pass maps and their corresponding heat maps,\n\nNext I will teach how to visualize a pass network on this pitch of a particular team during a particular game. We will further advance our knowledge by analyzing this pass network using the NetworkX python module that is usually used in complex network analysis in mathematics. We will learn how to calculate pass degree distributions of each player, find out which player was the most central in that pass network by calculating \"centrality\" of each player node, and so on,\n\nAfter that, I will teach how to implement computational geometric concepts like Convex Hulls, Voronoi diagrams and Delaunay triangulations using the Python package scipy.spatial and mplsoccer on open access football tracking data so that we can analyze how many passes were available to a player at a particular instance of a game, or how a group of players broke down space on the pitch at a particular instance, etc., and\n\nFinally I will talk about how to analyze Expected Goals (xG) using open data from statsbomb.\n\nI will end my talk guiding the audience to the references I used for starting with football (soccer) data analysis.\n\nOne use-case for soccer data analysis is, for example, using network analysis to find out the central player from a particular team who has been performing constantly in last few matches. This player can be considered as one of the backbones for that team and are recommended to be deployed in future games.\n\nSlides not uploaded by the speaker.\nHackMD: https://hackmd.io/@pycontw/2021/%2F%40pycontw%2FBkElAGqft\n\nSpeaker: Indranil Ghosh\n\nI am a first-year Ph.D. student in applied mathematics from the School of Fundamental Sciences, Massey University. My research is on dynamical systems and robust chaos. I have a master's in Physics from Jadavpur University. I am mostly interested in dynamical systems, computational mathematics, optimization, quantum computing, etc. I am much fascinated with open source software development and write codes mostly in Python and R, and sometimes Fortran. I have developed the R package \"QGameTheory\", which is an open-source R tool to work with the basics of quantum computing and game theory simulations. I love presenting my learnings on national/international platforms and have presented in conferences on Python, R, Open source software, etc. Website: https://indrag49.github.io/",
    "speakers": [
        "Indranil Ghosh"
    ],
    "recorded": "2021-10-03",
    "title": "Football (soccer) data analysis: A Pedagogic introduction – Indranil Ghosh (PyCon Taiwan 2021)",
    "thumbnail_url": "https://i.ytimg.com/vi/KBWXAWtwpcM/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=KBWXAWtwpcM"
        }
    ]
}