{
    "description": "Day 1, 08:55 ~ 09:55\n\nFirst you learn to code, then you code to learn.\n\nTen years ago, before the era of PyCon Taiwan. It was rare to teach Python in the programming courses. At that time, people who coded in Python were almost self-taught. PyCon and many Python communities were established for growing the community of Python programmers as well as for meeting and exchanging experiences with Python enthusiasts around the world.\n\nTen years later now, deep learning is becoming popular and Python is also the major programming language while PyTorch, TensorFlow, Numpy, SciPy, Scikit-* are becoming basic vocabularies.\nDo we still need a place to promote Python and exchange our thoughts when so many people know how to code in Python?\n\nExcept for promoting Python, advancing and sharing the knowledge in Python skills, my original intention on promoting Python to communities was to make Python as a basic skill and tool for everyone to do exploration, learning, and creating ideas. In this talk, I will share some of my thoughts and experiences involving Python not only at work but also in my everyday life.\n\nSlides not uploaded by the speaker.\nHackMD: https://hackmd.io/@pycontw/2021/%2F%40pycontw%2FBJY8P0_fY\n\nSpeaker: Tze-Jen Wei\n\nDr. Tze-Jen Wei is currently an associate professor at National Yang Ming Chiao Tung University’s School of AI, chief mathematician at iiNumbers, Inc., Google Developer Expert (GDE) in machine learning, Educate Cloud Ambassador at AWS, Hualien.Py organizer, Google Developer Groups Hualien initiator. Holding a master degree in mathematics, Dr. Wei had lectured in the Department of Applied Mathematics at Tung-Hwa University. Moreover, he also tutored Taiwan’s representatives in the Internal Mathematical Olympiad. Dr. Wei is an enthusiast in solving mysteries and challenging problems. He has been coding and playing math for more than 35 years. He also learns Chinese chess and magic. Moreover, he believes the perfect activity during leisure time is to read a book while drinking a cup of tea.",
    "speakers": [
        "Tze-Jen Wei"
    ],
    "recorded": "2021-10-02",
    "title": "Keynote: When everyone knows how to code in Python – 魏澤人 (PyCon Taiwan 2021)",
    "thumbnail_url": "https://i.ytimg.com/vi/gkLyO47-6oM/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=gkLyO47-6oM"
        }
    ]
}