{
    "description": "Day 2, 10:00-11:20\n\nAbstract\n\nStoring data in a tabular format is not always ideal. Taking advantage of strong data in knowledge graphs can make handling complex data structure possible and data visualization easier. In this workshop, you will get all the basics to start modelling data in the terms of triples and building schemas of a knowledge graph.\n\nDescription\n\nShort Format of your Workshop\n\nOverview-5 min, Lecture - 30 mins, Breaks- 10 minutes, Hands-on training - 40 mins, Closing - 5 mins\n\nCourse Benefits\n\nYou will have learnt a new skill set that may assist you in your project in data science or research. You will have a new tool that you can better model your data and collaborate with others. Also, you gain all the prerequisites to use WOQL - a query language for knowledge graph and the TerminusDB Python client to manage, manipulate and visualize data in your knowledge graph.\n\nWhat is required from attendees\n\nA computer with stable internet connection; TerminusDB Desktop App or Docker image (a.k.a TerminusDB Bootstrap) which you can download from https://terminusdb.com/hub/download (FREE); Python client for TerminusDB (require Python equal or larger than 3.6); An opened mind and ready to learn something new\n\nSlides: https://terminusdb.com/blog/\nHackMD: https://hackmd.io/@pycontw/2021/%2F%40pycontw%2FBkR6iXczF\n\nSpeaker: Cheuk Ting Ho\n\nCheuk has been a Data Scientist in various companies which demands high numerical and programmatical skills, especially in Python. To follow her passion for the tech community, now Cheuk is the Developer Relations Lead at TerminusDB - an open-source graph database. Cheuk maintains its Python client and engages with its user community daily. Besides her work, Cheuk enjoys talking about Python in personal streaming platform and MidMeetPy podcast. Cheuk has also been a guest speaker at Universities and various conferences. On top of speaking at conferences, Cheuk also participates as organizers. Conferences that Cheuk has organized include EuroPython(which she is a board member of), PyData Global and Pyjamas Conf. Believing in gender equality, Cheuk constantly organizes workshops and mentored sprints to support Tech Diversity and Inclusion.",
    "speakers": [
        "Cheuk Ting Ho"
    ],
    "recorded": "2021-10-03",
    "title": "Knowledge graph data modelling with TerminusDB – Cheuk Ting Ho (PyCon Taiwan 2021)",
    "thumbnail_url": "https://i.ytimg.com/vi/2agT-LLKVYw/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=2agT-LLKVYw"
        }
    ]
}