{
    "description": "Day 1, 13:05-13:35\n\nAbstract\n\nThe game engine, Ren'Py, is an open source engine used to make countless interactive fiction games, also known as visual novels (VNs). These include commercial hits with VN elements such as Persona 5, to viral works such as Doki Doki Literature Club (2mil+ downloads as of Jan 2018). I learned to program in Python using this engine, and have released my commercial game with it after working for a few years on it during weekends, selling 10K+ copies in 8 months. In the daytime, I work as a principal data scientist in fintech. Outcome: The audience will understand the independent gaming industry and how they can use Python to break into the industry, as I share my journey. There will also be components of source code walkthrough, but will be more of an overview than a step by step tutorial due to the scope of the talk.\n\nDescription\n\nThe game engine, Ren'Py, is an open source engine used to make countless interactive fiction games, also known as visual novels (VNs). These include commercial hits with VN elements such as Persona 5, to viral works such as Doki Doki Literature Club (2mil+ downloads as of Jan 2018).\n\nI learned to program in Python using this engine, and have released my commercial game with it after working for a few years on it during weekends, selling 10k+ copies in 8 months. In the daytime, I work as a principal data scientist in fintech.\n\nAnyhow, the talk will dig into the source code of the engine, https://github.com/renpy/renpy, such as:\n\nGame animations, menu Classes, cross-platform saves, and so on.\n\nOutcome: The audience will understand the independent gaming industry and how they can use Python to break into the industry, as I share my journey. There will also be components of code walkthrough, but will be more of an overview than a step by step tutorial due to the scope of the talk.\n\nSlides not uploaded by the speaker.\nHackMD: https://hackmd.io/@pycontw/2021/%2F%40pycontw%2FSJQsugtft\n\nSpeaker: Susan Shu Chang\n\nSusan is a Principal Data Scientist at Clearbanc, a fintech company providing growth capital for online businesses. She is a committee member of Aggregate Intellect, a machine learning platform with 13k+ YouTube subscribers. She is also the founder and sole developer of Quill Game Studios. You can find Susan speaking at conferences such as PyCons, TMLS, and events like this one!",
    "speakers": [
        "Susan Shu Chang"
    ],
    "recorded": "2021-10-02",
    "title": "Narrative focused video games development with RenPyan – Susan Shu Chang (PyCon Taiwan 2021)",
    "thumbnail_url": "https://i.ytimg.com/vi/D0jdg6TxWDg/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=D0jdg6TxWDg"
        }
    ]
}