{
    "description": "Day 1, 13:40-13:55\n\nAbstract\n\n我們通常會使用NumPy和SciPy來計算並建造模型，但這樣會很難渲染出真實和漂亮的模型。Blender是一個基於python的簡單使用者介面，是一個專門用來建模和做動畫的軟件。並且Blender是一個開源軟件，因此有著入手難度並不高，有著大量教學影片，和可以使用python的編碼來建模的優點。 本演講會的目的是展示如何使用簡單的Python編碼來構建簡單的分子和2D材料，講述我對demo的一些設計想法，然後對它作一些操作(例如:如何旋轉它們或改變它們的顏色，材質之類)。接下來會展示一下Blender的物理性質模擬(施加對模型作用的力，然後展示出它的變化)。\n\nDescription\n\nScientists are usually very good at using computers to calculate and simulate complex structures and materials. However they are often required to rely on expensive commercial software to produce images of their results and these have limited flexibility.\n\nBlender is a free and open-source 3D computer graphics, animation and rendering software toolset which is run via python scripting and a python-based GUI. It is already easy to use, and there is a wealth of on-line help material available in videos, forums, and a Stack Exchange site of its own.\n\nMany python programmers and scientists are not aware of Blender and how easy it is to use, so I will give short demonstrations and walk through example scripts so that viewers will be much more likely to go ahead, download Blender and get started with Python scripting right away.\n\nMy demo will show the input specified parameters (such as: how many layers, is a hexagonal or a honeycomb , what is the lattice constant, the size of the particles, how much strain is applied, etc.) to construct the required 2D material model\n\nSlides not uploaded by the speaker.\nHackMD: https://hackmd.io/@pycontw/2021/%2F%40pycontw%2Fr1TISbFGF\n\nSpeaker: 李嘉穎\n\npython 入門者",
    "speakers": [
        "李嘉穎"
    ],
    "recorded": "2021-10-02",
    "title": "如何使用blender簡單建造金屬原子/2D材料模型 – 李嘉穎 (PyCon Taiwan 2021)",
    "thumbnail_url": "https://i.ytimg.com/vi/uw80G8JD9pI/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=uw80G8JD9pI"
        }
    ]
}