{
    "description": "Title: Supercharging your Jupyter and Machine Learning Workflow with PrimeHub – Chia-liang Kao \n\nDay 2, 10:35-11:20\n\nAbstract\n\nJupyter has become a critical component of the machine learning life cycle. However scaled enterprise deployments and making the Data Science Experience frictionless remain challenging. We address a few common issues with PrimeHub, an open-source enterprise offering based on JupyterHub, with the capability to work with popular ML tooling like mlflow, labelstudio, and streamlit. This talk also investigates the MLOps trends adjacent to the Jupyter ecosystem.\n\nDescription\n\nThis talk is intended for audience interested in larger scale Jupyter environment deployment in their organisation, particularly for machine learning applications.\n\nPrimeHub is an open-source enterprise offering based on JupyterHub, which also allows orchestrating tools like mlflow, labelstudio, and streamlit, to assemble your own end-to-end ML toolbox for your team. We address a few common hurdles:\n\nadvanced resource scheduling for heterogenous GPU clusters\nmulti-tenancy and project isolations\ncustomizable and consistent ML environments per project\nmanaging jupyterlab extensions for teams\nhybrid development environment such as vscode and ssh within notebook instances\nauthorization and data access management\nusage reporting: allocation and utilization\nWe also investigate a few trends adjacent to the day-to-day jupyter environment used by data scientists and data engineers, where the roles become more cross functional in the age of MLOps:\n\nWorking with job schedulers from within Notebook\nManaging ML model deployments, CI/CD integration\nModel monitoring and retraining\n\nSlides not uploaded by the speaker.\nHackMD: https://hackmd.io/@pycontw/2021/%2F%40pycontw%2Frk-phz9zF\n\nSpeaker: Chia-liang Kao\n\nclkao (Chia-liang Kao) has been an open source software developer since 2000. He believes that good collaboration model and tools drive innovation. In 2013, he created SVK, a distributed version control system that helps developers collaborate. He co-founded the g0v.tw community in 2012, advocating information transparency and digital-activism through open source model. g0v.tw was awarded as \"Digital Communities: Award of Distinction\" by Prix Ars Electronica 2018. He started InfuseAI in 2018 to enable data scientists to thrive, and to help wider adoption of AI across industries.",
    "speakers": [
        "Chia-liang Kao"
    ],
    "recorded": "2021-10-03",
    "title": "Supercharging your Jupyter and ML Workflow with PrimeHub – Chia-liang Kao (PyCon Taiwan 2021)",
    "thumbnail_url": "https://i.ytimg.com/vi/qf0U1JIgCFY/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=qf0U1JIgCFY"
        }
    ]
}