{
    "description": "Day 2, 11:30-12:00\n\nAbstract\n\nThe talk will introduce TronGisPy using two use cases, Crop Farmland Classification and Forest Tree Types Classification. TronGisPy is an image preprocessing tool for machine learning and developed to master GIS imagery’s peculiarities. Often, the enormous size of images and inconsistency of datatype or bands (e.g. float or 16-bit integer) are primary challenges; yet, data scarcity (e.g. one per week) remains as the major limitation. This highlights TronGisPy’s capability to process the GIS images for general ML models. The popular functions used in both use cases will be introduced such as plotting, cliping, mapping, proojection, spliting and terrain analysis functions. For more functions in TronGisPy, please refer to: https://github.com/thinktron/TronGisPy.\n\nSlides not uploaded by the speaker.\nHackMD: https://hackmd.io/@pycontw/2021/%2F%40pycontw%2FS1JfO75GF\n\nSpeaker: 王選仲\n\nInnovative and motivated AI engineer with strong integration and problem-solving skills. Focusing on computer vision & time-series machine learning research and implementation, especially in the GIS & remote sensing field, for 3 years. 2+ years’ industry experience in helping enterprises import AI functions in their business flow. Enterprises include CPC corporation Taiwan(台灣中油), Chinese Society Of Photogrammetry & Remote Sensing(中華航測學會), New Taipei City Fire Department(新北消防局), Taiwan Forestry Bureau Aerial Survey Office(台灣農航所) and Sinotech Engineering Consultants (中興工程顧問社) Bachelor’s degree experience in public finance and 5+ years’ experience in debate club. In addition, proficient in business process flows, in logical thinking and in oral presentation.",
    "speakers": [
        "王選仲"
    ],
    "recorded": "2021-10-03",
    "title": "TronGisPy: Open Sourced Geo-Image Preprocessing Tool for Machine Learning – 王選仲 (PyCon Taiwan 2021)",
    "thumbnail_url": "https://i.ytimg.com/vi/Nv02_FMfn1Y/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=Nv02_FMfn1Y"
        }
    ]
}