{
    "description": "Title: Using Python with Network Analysis to understand corruption in government procurement - Albert 'bash' Yumol\n\nDay 1, 13:05-13:35\n\nAbstract\n\nProcessing and analyzing procurement data is one method to characterize government transactions, identify gaps, gatekeep from anomalies and aid in regulations. The move of the Philippine government to open procurement data is a huge step for transparency and for the public to be involved in citizen data science actively promoting social responsibilities. This talk will show how Python and data science methodologies can be used for social good and impact.\n\nDescription\n\nWith 20 years worth of open procurement data in the Philippines, we use Python libraries like networkx and analyze/visualize government transactions.\n\nThrough basic network analysis we will understand and create metrics to quantify government spending health and highlight anomalies to hopefully aide offices enabling them for making data-driven decisions and encourage citizen science for collaborative innovation through open data and data literacy.\n\nWe will also explore other possible use cases of these methodologies like community detection for fake news and contract tracing in our pandemic context.\n\nSlides: https://docs.google.com/presentation/d/10-sYZ24azdfclhtyH3FtnEv8SKIYV1nB0Yx4Or9O9N8/edit#slide=id.gc3bcf96dca_2_67\nHackMD: https://hackmd.io/@pycontw/2021/%2F%40pycontw%2FHkeu9-tfF\n\nSpeaker: Albert 'bash' Yumol\n\n$bash is a machine learning engineer and a data solutions practitioner based in the Philippines promoting data driven and evidence based solutions to various industries and companies. He has 8++ years experience with Data Science with Python both in academic research and industry applications. He is an advocate for using technology to promote social development and nationalism and also teaches data science and its applications focusing on human centered design and data ethics.",
    "speakers": [
        "Albert 'bash' Yumol"
    ],
    "recorded": "2021-10-02",
    "title": "Using Python with Network Analysis to understand corruption in government ... - Albert 'bash' Yumol",
    "thumbnail_url": "https://i.ytimg.com/vi/VmbXuMAc4XM/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=VmbXuMAc4XM"
        }
    ]
}