{
  "description": "The Pandas soon realized there's no way they are going to survive the\nordeals and hardships of this world, if they didn't finally and without\nthe blink of an eye of hesitation pull themselves together, stop being\nthe lazy fluffy beings, they have long been known for and start\nreorganizing their lives ASAP. They needed a fresh view over the world\nand its intrinsic mechanisms, light had to be shed upon the information\nthey possessed about survival, in a few words, they had to start over.\nThis is how in the midst of the forest a high performative library was\ncoming to life, whose powerful toolkit would enable them a long lasting\nlife of happiness and joy. This long-dreamed library should import the\ninformation they have been gathering about the world for long gone\ncenturies and help them look at it through different eyes. They wanted\nto structure their world views and beliefs into sensible types and\ncategories, remove from their genes their procrastinative behavioural\npatterns, drop them altogether. After laborious efforts of dealing with\nmissing data about their surroundings, grouping and counting the\nmeaningful rest, filtering the nonsensical superstitions, they could\nfinally and, without doubt, point out with precision, where the bamboo\nsprouts were freshest, most succulent, fiber rich, absolutely\nscrumptious and the moment of the year, dictated by the moon calendar,\nwhen they are fluffiest, cosiest, most willing and irresistibly fall for\none another and cuddle up. They put all this secret survival kit into\neasily understandable pictures and graphs for the dreamers out of them,\nwho weren't prepared to put in all the effort of learning all those\ncomplicated symbols, just in order to survive and just wanted to admire\nthe sky goddess, the moon. But wait, they didn't have a name for their\ngrandiose library, so they just wanted to make a statement of being the\nmost diligent creature of them all and called it, simply and\nunmistakably, pandas!\n",
  "duration": 1542,
  "published_at": "2019-08-06T12:18:06.000Z",
  "recorded": "2019-03-24",
  "speakers": [
    "Ingrid Budau"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/WCeJpJ9yT7Y/hqdefault.jpg",
  "title": "The Apprentice's Enthusiastic Guide to pandas (or how to look at the world through the gentle eyes of one)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WCeJpJ9yT7Y"
    }
  ]
}
