{
  "description": "We can't expect Machine Learning experts to be both domain experts\nacross various fields and also true experts in ML, it is crucial to\nrethink how we build tools so that we can provide Machine Learning\ncapabilities to experts in various disciplines that are not necessarily\nsavvy in machine learning, but are experts in their own domains, so that\nthey can too become participants of the data science community.\n\nThis talk is divided into three sections:\n\nThe first one, dives into the importance of democratizing Machine\nLearning, its objective is to demonstrate why now this is a crucial\nissue to be solved and to show the risks and problems that present\nthemselves when Machine Learning Engineers take in the responsibility of\nbuilding predictive technologies in domains that are not necessarily\nwhere they are the most experts on.\n\nThe second part of this talk focuses on some solutions and approaches to\nchallenges of democratizing Machine Learning, as well as the journey and\nresults we have seen at MindsDB while at this endeavor as well as what\nwould be new ways that the ML community can think of the next generation\nof tools being built.\n\nThe third and most extensive section of this talk, focuses on the new\nissues that are born once machine Learning capabilities are on the hands\nof not ML experts, more importantly, the implications of delegating the\nMachine Learning machinery to a system, and what is important in order\nto trust those systems. Which leads to the importance in further\ndeveloping our understanding of explainability, interpretability, and\nrobustness of ML.\n",
  "duration": 1225,
  "language": "eng",
  "published_at": "2019-06-14T13:00:20.000Z",
  "recorded": "2019-03-22",
  "speakers": [
    "Jorge Torres"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/cBM6V--LKj4/hqdefault.jpg",
  "title": "Machine Learning Democratization",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cBM6V--LKj4"
    }
  ]
}
