{
  "description": "V marci 2017 dostali žiaci Strednej priemyselnej školy technickej v\nMartine (SPŠT) prvýkrát príležitosť absolvovať prax v Dudley College vo\nVeľkej Británii. Vďaka úspešnému projektu Erasmus+ „Turiec do Európy,\nEurópa do Turca“, ktorý pripravila K. A. B. A. Slovensko, sa tu\nzoznámili s programovacím jazykom Python. Projekt bol úspešný aj v\nškolskom roku 2017/2018. Dudley College sa tak stala na dva marcové\ntýždne školou pre desiatich tretiakov technického lýcea SPŠT. Odborný\nprogram bol zameraný na tvorbu efektívnych algoritmov, rozvoj logického\nmyslenia, grafiku a nástroj pre vytváranie 3D animácií v reálnom čase -\nVPython. Svoje nadobudnuté vedomosti a praktické zručnosti odovzdali\núčastníci mobility aj ďalej. Učitelia informatiky SPŠT a Gymnázia\nViliama Paulínyho Tótha (GVPT) v Martine nadviazali na úspešnú\nspoluprácu z minulého roka, opäť spojili svoje sily a pripravili druhý\nročník odbornej konferencie PYTHON DAYS 2.0. V dňoch 31.5 - 1.6.2018\nodzneli na GVPT zaujímavé prednášky, robilo sa veľa workshopov. Na\njednom z nich sme predstavili gymnazistom VPython a vývojové prostredie\nGlowScript. Výstupy z mobility Erasmus+ tak neostali len doma, na SPŠT,\nale nadobudli oveľa širší rozmer. Na konferencii PyCON SK 2019\npredstavíme toto prostredie, jeho nástroje a ukážeme práce, ktoré sme\nvytvorili.\n",
  "duration": 1637,
  "published_at": "2019-06-27T15:02:57.000Z",
  "recorded": "2019-03-22",
  "speakers": [
    "Miroslava Šturmová",
    "Marek Višňovec",
    "Róbert Junas"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/R0e71gM8Xhw/hqdefault.jpg",
  "title": "Objavovanie VPythonu v Dudley College",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=R0e71gM8Xhw"
    }
  ]
}
