{
  "description": "Software development is often seen as a young person's game. But what if, as you get older, you want to keep at the keyboard? Thoughts from a (now) veteran developer on building your career in software development for the long-haul.\n\nThis is a community talk. My favourite topics from DjangoConEU 2017 were the non-technical talks. The most interesting (on-topic) conversations I had were about the non-programming aspects of working in software. I wanted to give a talk on that line. \n\n*Prima facie* I'm not the best place person to talk about diversity (white, male, etc), but, having been freelance since 2006, with four young children, and now slightly greying hair, I am in a position to talk about how to build a career in software development for the long-haul. Hiring in tech is massively ageist. I want to discuss strategies to handle that. \n\nMy target audience is individual programmers (whether freelance or employed) as well as software managers, looking to build **and retain** a team. (The message for managers is simply that they need to facilitate their employees' careers. This seems obvious but it **is** worth bringing out.) \n\nThe core point of my talk is around the idea that a career is very much a marathon rather than a sprint, and that it needs to be approached in that spirit. (Again, this may seem obvious but it **is** worth bringing out.)\n\nThere are two aspects of this. The one is **pace**. That to work on software day-in, day-out for 10, 20, 30, 40 years (or more) we need to pace ourselves, to manage our reserves, and to have fun. \n\nThe other is that there is noting to be scared of. That expertise which now may seem intimidating is, yes, available to us too. That with 5, 10, 15 years of continued effort we too (yes, us) can be as experienced as whomever, in the speciality we choose. \n\nI bring this out with three points. That we need to: \n\n* **Be disciplined**: The key point is to keep going. We each need to find patterns that work for us and develop them into habits that we build into a routine. The great thing is it doesn't have to be 100 hour weeks. As long as we keep doing it, whatever we do builds up over time. Despite the impression to the contrary, time is on our side. Which leads to...\n\n* **Be prolific**: Do lots, and put it out there. This one seems scary. \"I'll never do as much as ...\" — but it's an illusion. Do one thing. Put that out there. Do something else. Repeat. Again, the work builds up over time, and (seemingly) all of a sudden, you're in a position of being the expert. Finally...\n\n* **Be social**: And I don't necessarily mean Facebook (unless Facebook is your thing). In whatever environment or medium suits you get out there meet people. (Stretch your comfort zones a bit here.) Share what you've done. Relish in what others have done. Be part of the community. Help build the community. \n\nAll three of these are essential. As you get older — all the more as you get older — they allow you to build a sustainable career writing software.\n\nThis tale is brought out with stories on finding work, and on choosing clients, and employers, financial planning and job security, on family and free-time, and on the importance self-care. It's part inspiration, part battle-plan.\n",
  "duration": 2707,
  "language": "eng",
  "recorded": "2018-05-24",
  "speakers": [
    "Carlton Gibson"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/7WUFWmyk-HY/hqdefault.jpg",
  "title": "Growing old gracefully: on being a career programmer.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7WUFWmyk-HY"
    }
  ]
}
