{
  "description": "If your hometown can benefit from a free, friendly environment where women can learn to program, it’s time to bring Django Girls to your city. You’ll learn what it takes to run a successful event while hearing tales from the trenches from a seasoned Django Girls organizer.\n\nEver heard of Django Girls and thought, “Gee, if only that would come to my city, I’d love to be involved!” Django Girls is a fantastic, free weekend-long workshop that teaches women how to code through a comprehensive, Django-based tutorial. Encouraging more women to strive for programming careers benefits the tech community at large, and spearheading a Django Girls event in your city is a positive, actionable way for you to personally become involved.\n\n##But I’m a Developer - Not an Event Planner!\nSo you’re sold that Django Girls is a great idea, but maybe you’re not confident you can execute on it. You don’t need a degree in event planning to plan a great event - developers specialize in problem solving, and running a workshop involves just that. All it takes is a little passion. And sponsors. And a great venue with impeccable WiFi. And a team full of mentors, volunteers and organizers dedicated willing to follow you into the battlefield… Okay, okay. It’s a lot of hard work, but it’s incredibly rewarding to yourself and your community, and I’m ready to share my years of wisdom to help your event run smoothly.\n\n##Learn From My Mistakes\nFrom avoiding volunteer burnout to preventing mutiny from your attendees because the caterer was a flop, I’ll share my insights on what’s worked and what hasn’t over the past three years - and how I intend to improve upon the past two years to make my next event my best yet. I’ll cover logistics, and how to make the event memorable and enjoyable for everyone involved, including recruiting attendees, mentors, sponsors, and other organizers; how to find a great location; what small details are illogically important; and how to communicate effectively within your role as you transform from developer into a community leader.\n\nSara Heins",
  "duration": 1182,
  "language": "eng",
  "recorded": "2018-05-25",
  "speakers": [
    "Sara Heins"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/vJI-mP-Vu-4/hqdefault.jpg",
  "title": "Want More Women in Tech? Start with Django Girls",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vJI-mP-Vu-4"
    }
  ]
}
