{
  "description": "Accessibility is an afterthought to many, but to those with issues navigating the web it's very important. We will go over examples of accessibility on the web, short and long term solutions, and talk about why accessibility matters to a variety of users. The audience should leave with the ability to spot some accessibility issues and the knowledge of how to fix them.\n\nAccessibility is a huge topic that is often acknowledged as important...by the people who already care about it. This talk is meant to help the entire audience start thinking about accessibility and realize how easy it is to at least put some accessibility into a site (or avoid adding blatantly inaccessible content).\n\nTen to fifteen percent of the EU has a disability, according to the EU Labour Force Survey, which is a large potential audience for any site. There are various laws that factor into the amount of web accessibility a country must have, and the consequences a business can face because of that. Accessible web development also tends to lead to better UX and a happier user base. And, another plus: It will save devs time and frustration when they’re working with the code, since good HTML is enforced.\n\nThis talk will start with a broad introduction to accessibility, how to break different concerns down into categories for consideration, and touch on some laws around web accessibility. The second part will go through examples of good and bad accessibility and what to look out for, as well as ways to improve accessibility (including \"easy wins\" that they could implement quickly to drastically improve their sites). The final section will include resources for finding accessibility standards and also browser extensions and the like for people to check on their own.\n\nThe audience will be expected to have working knowledge of the internet, webpages, and using webpages.\n\nLindsey Dragun",
  "duration": 1746,
  "language": "eng",
  "recorded": "2018-05-23",
  "speakers": [
    "Lindsey Dragun"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Uh_b_7-g4ug/hqdefault.jpg",
  "title": "Accessibility Matters: Creating a Better Web",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Uh_b_7-g4ug"
    }
  ]
}
