{
  "description": "Bokor est un logiciel libre (GPL v3) développé par la SCOP Bearstech en\npartenariat avec la société de distribution de films Cinego. Bokor est\nun framework permettant la distribution de fichiers sur un parc\nhétérogène de machines. L'architecture est hybride, un maître coordonne\nun ensemble d'esclaves qui vont partager des fichiers en point à point,\navec le protocole BitTorrent. Pour le distributeur, la bande passante\nest optimisée, et la résiliance du système maitrisée. La participation\nautoritaire aux échanges BitTorrent garantie des latences optimisées. Il\nest en production avec aujourd'hui 400 cinémas connectés, 10 super\nseeders en datacenter et 400 films, bandes-annonces et courts-métrages\npartagés.\n\nBokor utilise Rtorrent (avec des corrections pour Cygwin) et OpenTracker\n(avec quelques patchs), pour la partie BitTorrent. Pour la partie\ncoordination, Python est utilisé, essentiellement pour des appels de\nfonctions dynamiques. Nous allons vous présenter la partie \"Appel de\nprocédure distante\" (RPC en VO) de Bokor. Le système de RPC de Bokor a\ndû être conçu de manière extensible, la liste des fonctionnalités\nrequises n'étant pas connue à l'avance. Nous avons choisi une approche\nminimaliste, pour ne pas avoir de soucis de portabilité, et pour limiter\nau maximum la consommation en CPU et bande-passante, qui seront utilisés\npar les très gourmands échanges BitTorrent.\n\nL'utilisation des bibliothèques tiers a été réduite au maximum, seul\npy-curl a survécu, préférant l'approche \"fourni avec des piles\" de\nPython. Par contre, l'introspection de python a été poussée dans ces\nderniers retranchements : décorateurs de classes, de fonctions,\nmodifications à chaud de classes, d'objets, méthodes abstraites...\n",
  "duration": 1182,
  "language": "fra",
  "recorded": "2015-10-17",
  "speakers": [
    "Olivier André"
  ],
  "summary": "Bokor est un logiciel libre (GPL v3) développé par la SCOP Bearstech en\npartenariat avec la société de distribution de films Cinego. Bokor est\nun framework permettant la distribution de fichiers sur un parc\nhétérogène de machines. L'architecture est hybride, un maître coordonne\nun ensemble d'esclaves qui vont partager des fichiers en point à point,\navec le protocole BitTorrent.\n",
  "thumbnail_url": "http://video-pyconfr2015.paulla.asso.fr/205%20-%20Olivier%20Andr%C3%A9%20-%20Bokor:%20distribution%20de%20films%20en%20BitTorrent%20et%20hacking%20python.mp4.jpg",
  "title": "Bokor: distribution de films en BitTorrent et hacking python",
  "videos": [
    {
      "type": "ogv",
      "url": "http://video-pyconfr2015.paulla.asso.fr/205%20-%20Olivier%20Andr%C3%A9%20-%20Bokor:%20distribution%20de%20films%20en%20BitTorrent%20et%20hacking%20python.ogv"
    },
    {
      "type": "mp4",
      "url": "http://video-pyconfr2015.paulla.asso.fr/205%20-%20Olivier%20Andr%C3%A9%20-%20Bokor:%20distribution%20de%20films%20en%20BitTorrent%20et%20hacking%20python.mp4"
    },
    {
      "type": "webm",
      "url": "http://video-pyconfr2015.paulla.asso.fr/205%20-%20Olivier%20Andr%C3%A9%20-%20Bokor:%20distribution%20de%20films%20en%20BitTorrent%20et%20hacking%20python.webm"
    }
  ]
}
