{
  "description": "Depuis 2 ans, le mot containeur a remplacé cloud sur les buzzometres de\nla presse informatique. néanmoins, le vrai changement ne viens pas des\ncontaineurs eux mêmes (qui datent facile d'il y a 10 ans ou plus), mais\nde l'impact sur le déploiement des applications et la facilitation des\narchitectures à base de microservices.\n\nAvec la popularisation de Docker est venu le besoin de combler tout les\nmanques du logiciel notamment en terme de déploiement et\nd'orchestration, via des outils comme kubernetes, mesos, fig ou\natomic-app. Cette présentation parleras donc des concepts sous jacents,\nde l'impact pour les admins et les codeurs python de tout type, et dans\nquel cas est ce que fait sens de mettre en place ce genre de\ndéploiement.\n\nLes exemples tourneront surtout autour de la pile\ndocker/kubernetes/origin /atomic-app mais les alternatives ne seront pas\noubliés et présentés aussi.\n",
  "duration": 1388,
  "language": "fra",
  "recorded": "2015-10-17",
  "speakers": [
    "Michael Scherer"
  ],
  "summary": "Durant cette présentation, nous verrons comment la montée en popularité\ndes containeurs (comme Docker, RunC, Rkt, Warden, etc) change le\nfonctionnement des services de PaaS via l'intégration de orchestrateurs\ncomme Kubernetes ou Mesos, et l'impact pour les développeurs python\naussi bien que les administrateurs systèmes ayant déployé ce genre de\nsystémes chez eux.\n",
  "thumbnail_url": "http://dl.afpy.org/pycon-fr-15/208%20-%20Michael%20Scherer%20-%20D%C3%A9ploiement%20d'applications%20python%20dans%20un%20monde%20post-docker.mp4.jpg",
  "title": "Déploiement d'applications python dans un monde post-docker",
  "videos": [
    {
      "type": "ogv",
      "url": "http://dl.afpy.org/pycon-fr-15/208%20-%20Michael%20Scherer%20-%20D%C3%A9ploiement%20d'applications%20python%20dans%20un%20monde%20post-docker.ogv"
    },
    {
      "type": "mp4",
      "url": "http://dl.afpy.org/pycon-fr-15/208%20-%20Michael%20Scherer%20-%20D%C3%A9ploiement%20d'applications%20python%20dans%20un%20monde%20post-docker.mp4"
    },
    {
      "type": "webm",
      "url": "http://dl.afpy.org/pycon-fr-15/208%20-%20Michael%20Scherer%20-%20D%C3%A9ploiement%20d'applications%20python%20dans%20un%20monde%20post-docker.webm"
    }
  ]
}
