{
  "description": "Il est courant de vouloir générer des pages à la fois dynamiques pour le\nnavigateur et statiques imprimables pour l’archivage ou l’impression au\nsein d’une même application web. Que ce soit pour des diaporamas, des\nfactures ou de longs rapports par exemple, on aimerait pouvoir profiter\nde l’interactivité sans sacrifier une pagination intelligente nécessaire\naux documents imprimables de qualité.\n\nPython offre d’innombrables outils pour réaliser la génération de pages\net de documents. Le plus dur est aujourd’hui de choisir parmi ces outils\npour produire les documents qui seront exploités au maximum, d’un côté\npar les navigateurs (liens, animations, adaptation aux supports,\ninteractivité, etc.) et de l’autre par les clients PDF et l’impression\n(typographie avancée, en- têtes, pieds de page, pagination, etc).\n",
  "duration": 1334,
  "language": "fra",
  "recorded": "2015-10-17",
  "speakers": [
    "Guillaume Ayoub"
  ],
  "summary": "Sur de nombreux sites Internet, il est courant de vouloir générer à la\nfois des pages dynamiques pour le navigateur et des documents statiques\nimprimables pour l’archivage ou l’impression. Avec une utilisation\nastucieuse de certains formats et d’outils adéquats (en Python), il est\npossible d’obtenir un résultat de qualité pour de multiples\nutilisations.\n",
  "thumbnail_url": "http://video-pyconfr2015.paulla.asso.fr/010%20-%20Guillaume%20Ayoub%20-%20Du%20site%20dynamique%20au%20document%20imprimable%20en%20Python.mp4.jpg",
  "title": "Du site dynamique au document imprimable en Python",
  "videos": [
    {
      "type": "ogv",
      "url": "http://video-pyconfr2015.paulla.asso.fr/010%20-%20Guillaume%20Ayoub%20-%20Du%20site%20dynamique%20au%20document%20imprimable%20en%20Python.ogv"
    },
    {
      "type": "mp4",
      "url": "http://video-pyconfr2015.paulla.asso.fr/010%20-%20Guillaume%20Ayoub%20-%20Du%20site%20dynamique%20au%20document%20imprimable%20en%20Python.mp4"
    },
    {
      "type": "webm",
      "url": "http://video-pyconfr2015.paulla.asso.fr/010%20-%20Guillaume%20Ayoub%20-%20Du%20site%20dynamique%20au%20document%20imprimable%20en%20Python.webm"
    }
  ]
}
