{
  "description": "Tox permet de lancer les tests d'un paquet Python dans des\nenvironnements virtuels. L'utilisation de ces derniers pose plusieurs\nproblèmes:\n\n-  seuls les paquets disponibles sur PyPI sont gérés. Ainsi, il est\n   parfois nécessaire d'utiliser le gestionnaire de paquets de sa\n   distribution pour installer des fichiers d'en-tête (on pense\n   notamment à lib\\*-dev sous Debian);\n\n-  lorsque plusieurs environnements ont besoin de la même dépendance,\n   cette dernière est installée plusieurs fois, et est dupliquée sur le\n   disque, ce qui provoque une perte d'espace disque;\n\n-  mauvais niveau d'abstraction : la tendance actuelle consiste à\n   utiliser des gestionnaires de paquets spécifiques à des langages\n   (pip, npm, cpan...) plutôt qu'un gestionnaire de paquets robuste;\n\n-  manque de reproductibilité des tests : les environnements de tests\n   sont loin d'être parfaitement isolés (les variables d'environnement,\n   les fichiers présents dans /usr, le choix des locales... peuvent\n   influencer le déroulement des tests).\n\nGNU Guix est un gestionnaire de paquets fonctionnel (comme dans\n\"programmation fonctionnelle\") basé sur Nix. Il permet de construire des\npaquets dans un environnement complètement isolé utilisant les\nconteneurs fournis par le noyau Linux qui garantit la reproductibilité\nde l'opération. Nous ferons une présentation de cet outil et nous\nattarderons notamment sur la fonctionnalité que nous serons amenés à\nutiliser pour guix-tox : \"guix environment\", qui permet de créer un\nenvironnement isolé contenant uniquement certains paquets.\n\nEnfin, nous verrons comment il est possible de remplacer virtualenv par\nGuix dans tox, afin de profiter des avantages de ce gestionnaire de\npaquets de façon quasi-transparente. Nous montrerons comment il est\npossible de l'utiliser afin de travailler sur des projets OpenStack tels\nque python- keystoneclient ou encore la bibliothèque Oslo.\n",
  "duration": 1754,
  "language": "fra",
  "recorded": "2015-10-17",
  "speakers": [
    "Cyril Roelandt"
  ],
  "summary": "Tox est un outil, très utilisé dans les projets Python, qui permet de\nlancer des tests au sein d'environnements virtuels créés par virtualenv.\nCette approche souffre de plusieurs défauts qui affectent la\nreproductibilité des tests. Nous verrons comment il est possible de\nremplacer virtualenv par Guix et donnerons quelques exemples issus du\nquotidien d'un développeur OpenStack.\n",
  "thumbnail_url": "http://dl.afpy.org/pycon-fr-15/110%20-%20Cyril%20Roelandt%20-%20Guix-tox,%20une%20version%20fonctionnelle%20de%20tox.mp4.jpg",
  "title": "Guix-tox, une version fonctionnelle de tox.",
  "videos": [
    {
      "type": "ogv",
      "url": "http://dl.afpy.org/pycon-fr-15/110%20-%20Cyril%20Roelandt%20-%20Guix-tox,%20une%20version%20fonctionnelle%20de%20tox.ogv"
    },
    {
      "type": "mp4",
      "url": "http://dl.afpy.org/pycon-fr-15/110%20-%20Cyril%20Roelandt%20-%20Guix-tox,%20une%20version%20fonctionnelle%20de%20tox.mp4"
    },
    {
      "type": "webm",
      "url": "http://dl.afpy.org/pycon-fr-15/110%20-%20Cyril%20Roelandt%20-%20Guix-tox,%20une%20version%20fonctionnelle%20de%20tox.webm"
    }
  ]
}
