{
  "description": "Il est courant pour un développeur de devoir implémenter des\nfonctionnalités d'import de données. Les utilisateurs peuvent en effet\navoir besoin de données disponibles par ailleurs, dans un tableur par\nexemple, dans une autre base, ou accessibles par des services web. Nous\nintroduisons ici une méthode simple pour réaliser cela en favorisant la\ngénéricité et la ré-utilisabilité des composants développés.\n\nUn flux personnalisable d'entités\n---------------------------------\n\nL'idée est de transformer petit à petit les données externes afin de les\nrendre compatibles avec le schéma de l'application et donc insérables en\nbase.\n\nLe principe est de commencer par stocker les données de la source sur\nune «[HTML\\_REMOVED]entité externe[HTML\\_REMOVED]». Puis on utilise des\ngénérateurs Python pour créer un «[HTML\\_REMOVED]flux[HTML\\_REMOVED]»\nd'entités[HTML\\_REMOVED]: chaque entité passe de fonction en fonction,\nce qui va la transformer peu à peu pour la rapprocher du modèle attendu\net qu'elle soit finalement prête à être insérée, ou au contraire rejetée\nsi ce n'est pas possible.\n\nL'étape d'insertion est alors identique, quelle que soit la source d'où\nproviennent les données.\n\nExemple avec CubicWeb 3.21\n--------------------------\n\nAvec sa version 3.21 sortie en 2015, le framework CubicWeb dispose d'une\ntoute nouvelle API fondée sur cette méthode. Elle permet au développeur\nde se concentrer sur le flux de données provenant des sources qui\nl'intéressent.\n\nDe plus, l'étape d'insertion offre plusieurs composants\ninterchangeables. En fonction du compromis qu'il souhaite faire entre\nsécurité et rapidité, le développeur peut choisir entre une insertion\nsûre mais lente, où chaque entité à insérer est préalablement vérifiée\nquant au type de ses données et la validité de ses relations, et une\ninsertion plus rapide mais pouvant échouer, où les entités sont insérées\nen masse.\n\nTout cela sera illustré par le moissonnage des données de portails *Open\nData*. La diversité des formats (RDF (open-data.europa.eu), REST\n(data.gouv.fr, OpenDataSoft), CSW (geocatalogue.fr), etc.) ainsi que des\nmodèles de données impose de créer des flux différents afin que toutes\nces données puissent être importées dans un schéma unique de CubicWeb.\n\nDe la même façon, un autre exemple sera l'import de données SKOS où des\nthesaurus entiers sont importés dans CubicWeb grâce à cette API.\n",
  "duration": 1269,
  "language": "fra",
  "recorded": "2015-10-18",
  "speakers": [
    "Yann Voté"
  ],
  "summary": "Nous introduirons une nouvelle méthode pour importer des données\nexternes (service REST, fichier, etc.) dans une application. Simple et\nflexible, elle favorise la réutilisation des composants afin de se\nconcentrer sur ce qui est spécifique à chaque cas. Un exemple\nd'implémentation sera donné avec le framework CubicWeb 3.21 qui\nintroduit une API d'import de données fondée sur cette méthode.\n",
  "thumbnail_url": "http://dl.afpy.org/pycon-fr-15/216%20-%20Yann%20Vot%C3%A9%20-%20Importer%20des%20donn%C3%A9es%20en%20Python%20avec%20CubicWeb%203.21.mp4.jpg",
  "title": "Importer des données en Python avec CubicWeb 3.21",
  "videos": [
    {
      "type": "ogv",
      "url": "http://dl.afpy.org/pycon-fr-15/216%20-%20Yann%20Vot%C3%A9%20-%20Importer%20des%20donn%C3%A9es%20en%20Python%20avec%20CubicWeb%203.21.ogv"
    },
    {
      "type": "mp4",
      "url": "http://dl.afpy.org/pycon-fr-15/216%20-%20Yann%20Vot%C3%A9%20-%20Importer%20des%20donn%C3%A9es%20en%20Python%20avec%20CubicWeb%203.21.mp4"
    },
    {
      "type": "webm",
      "url": "http://dl.afpy.org/pycon-fr-15/216%20-%20Yann%20Vot%C3%A9%20-%20Importer%20des%20donn%C3%A9es%20en%20Python%20avec%20CubicWeb%203.21.webm"
    }
  ]
}
