{
  "description": "Les projets de grande échelle comme OpenStack, intégrant plus d'une\ncentaine de contributions par jour en moyenne, ne pourraient aboutir\nsans un contrôle rigoureux de la qualité du code. C'est pourquoi l'une\ndes tâches majeures des développeurs principaux (\"core devs\")\nd'OpenStack est de passer en revue les contributions (\"code review\")\npuis d'éventuellement les valider pour intégration au code source. Mais\ncomment gérer un tel flux de contributions en un temps raisonnable ?\nComment être certain qu'une contribution acceptée par un core dev ne va\npas avoir des effets de bord sur une autre contribution acceptée\nsimultanément par quelqu'un d'autre, ou sur un projet connexe ?\n\nLa communauté OpenStack utilise un outil codé en Python appelé Zuul (en\nréférence à Ghostbusters) pour répondre à ces problématiques, et\npermettre aux core devs de ne pas avoir à consacrer 100% de leur\nactivité à la revue de code. L'intérêt de Zuul est clair pour tout\nprojet, quel que soit son envergure, nécessitant un contrôle rigoureux\npour l'intégration et le déploiement continus. Nous présentons donc ici\nles principales fonctionnalités de Zuul à travers des cas d'usage\nsimples, et telles que nous les utilisons dans le projet `Software\nFactory <http://softwarefactory.enovance.com%20%22Software%20Factory%22>`__,\nune suite logicielle libre \"all in one\" de gestion de code, poussé par\nRed Hat.\n\nNous couvrirons les sujets suivants:\n\n-  Comment Zuul interagit avec Gerrit, le service de revue du code\n-  Que signifie la notion de \"pipelines\" dans Zuul, et comment les\n   utiliser\n-  Quelle stratégie suit Zuul pour gérer la queue des contributions à\n   tester ou à intégrer\n-  Comment Zuul gère les interdépendances de projets\n-  Exemples de workflows de CI et CD facilités par Zuul\n",
  "duration": 1582,
  "language": "fra",
  "recorded": "2015-10-17",
  "speakers": [
    "Matthieu Huin",
    "Fabien Boucher"
  ],
  "summary": "Cette présentation s'adresse à tout développeur soucieux de la qualité\ndu code, intéressé par les problématiques d'intégration et de\ndéveloppement continus, et travaillant sur un projet comptant plus de 2\ncontributeurs. Elle se concentre sur Zuul, un système de \"gating\" des\ncontributions à un ensemble de projets.\n",
  "thumbnail_url": "http://dl.afpy.org/pycon-fr-15/109%20-%20Matthieu%20Huin,%20Fabien%20Boucher%20-%20Optimiser%20l'int%C3%A9gration%20de%20code%20avec%20Zuul.mp4.jpg",
  "title": "Optimiser l'intégration de code avec Zuul",
  "videos": [
    {
      "type": "ogv",
      "url": "http://dl.afpy.org/pycon-fr-15/109%20-%20Matthieu%20Huin,%20Fabien%20Boucher%20-%20Optimiser%20l'int%C3%A9gration%20de%20code%20avec%20Zuul.ogv"
    },
    {
      "type": "mp4",
      "url": "http://dl.afpy.org/pycon-fr-15/109%20-%20Matthieu%20Huin,%20Fabien%20Boucher%20-%20Optimiser%20l'int%C3%A9gration%20de%20code%20avec%20Zuul.mp4"
    },
    {
      "type": "webm",
      "url": "http://dl.afpy.org/pycon-fr-15/109%20-%20Matthieu%20Huin,%20Fabien%20Boucher%20-%20Optimiser%20l'int%C3%A9gration%20de%20code%20avec%20Zuul.webm"
    }
  ]
}
