{
  "description": "We're lucky with Python that we can concentrate on getting the job done\nand often don't have to worry about how fast our code runs. Those of us\nwithout computer science degrees **really** know how to appreciate this.\nAnd 9 times out of 10 you probably don't need to worry at all about the\nspeed: if the program takes 10 minutes to run but saves you hours of\nwork then it's a job well done. But then there is that 10th time…\n\nBased on work done over the last couple of years with openpyxl I will\nshow some tips and tricks as to how you can approach improving\nperformance without having to become a mathematical genius or computer\nwhizz. There is lots of good advice about performance around but it has\nto make sense within the context of your application: does it matter\nthat Python loops are considered slow?\n\nThe talk will cover using tests and profiling to identify the areas that\nyou need to work on, stop you breaking stuff irreparably, and what\nthings you might want to research or ask about. I do promise you: the\nart of performance really is the art of doing nothing!\n\nLa présentation sera en anglais mais je parle le français assez bien et\npeu répondre aux questions en français ou peut-être le franglais!\n",
  "duration": 1001,
  "language": "eng",
  "recorded": "2015-10-17",
  "speakers": [
    "Charlie Clark"
  ],
  "summary": "We're lucky with Python that we can concentrate on getting the job done\nand often don't have to worry about how fast our code runs. After all\ncode than runs today will finish before faster code that runs tomorrow.\nBut what do you do when you need to make your code run faster? This talk\nwill give you an introduction into how to improve performance where you\nneed it most.\n",
  "thumbnail_url": "http://video-pyconfr2015.paulla.asso.fr/009%20-%20Charlie%20Clark%20-%20The%20Art%20of%20Doing%20Nothing%20-%20Using%20profiling%20to%20speed%20up%20your%20code.mp4.jpg",
  "title": "The Art of Doing Nothing – Using profiling to speed up your code",
  "videos": [
    {
      "type": "ogv",
      "url": "http://video-pyconfr2015.paulla.asso.fr/009%20-%20Charlie%20Clark%20-%20The%20Art%20of%20Doing%20Nothing%20-%20Using%20profiling%20to%20speed%20up%20your%20code.ogv"
    },
    {
      "type": "mp4",
      "url": "http://video-pyconfr2015.paulla.asso.fr/009%20-%20Charlie%20Clark%20-%20The%20Art%20of%20Doing%20Nothing%20-%20Using%20profiling%20to%20speed%20up%20your%20code.mp4"
    },
    {
      "type": "webm",
      "url": "http://video-pyconfr2015.paulla.asso.fr/009%20-%20Charlie%20Clark%20-%20The%20Art%20of%20Doing%20Nothing%20-%20Using%20profiling%20to%20speed%20up%20your%20code.webm"
    }
  ]
}
