{
  "description": "| Est-ce que mon application est compatible Python 2 ? Python 3 ?\n| Est-ce que mon app Django est compatible Django 1.7 ? 1.8 ? master ?\n| Est-ce que ma lib est compatible avec Postgresql ? MySQL ? SQLite ?\n\nEst-ce qu'il est possible de vérifier tous ces cas, et une\n**combinaison** de tous ces cas ? (par exemple, une app Django\ncompatible 1.7 / avec une base Postgresql en Python 3). Ou **toutes**\nles combinaisons possibles ?\n\nC'est ce que ``tox`` sait faire. Mais il sait faire bien plus. Et il\nvous aime. Il nous aime. Les programmeurs de ``tox`` nous aiment.\n\nIl n'est pas rare que le Pythoniste feignant se dise tout haut \"ah ça\nserait bien si c'était possible avec tox\". Et là, un des contributeurs\nde tox remonte le temps dans sa machine et implémente la fonctionnalité.\nDe retour dans le présent, le Pythoniste découvre la fonctionnalité\nprésente dans la doc et s'écrie \"Mais c'est trop bien !\".\n\nDans cette conférence, nous aurons un aperçu des potentialités de\n``tox``, comment le mettre en place très simplement pour votre projet et\nde découvrir, émerveillé, comment un outil bien fait travaille à votre\nplace.\n",
  "duration": 1247,
  "language": "fra",
  "recorded": "2015-10-17",
  "speakers": [
    "Bruno Bord"
  ],
  "summary": "``tox`` est, à l'origine, un outil qui lance les tests d'une application\nou d'une bibliothèque au sein de virtualenvs isolés. Ceci rend possible\nl'exécution des tests pour plusieurs version de Python, ou plusieurs\nversions de votre framework de développement favori, ou d'une\ncombinaison de tout ceci.\n\nMais tox est amour, alors il sait faire bien plus encore.\n",
  "thumbnail_url": "http://dl.afpy.org/pycon-fr-15/108%20-%20Bruno%20Bord%20-%20tox%20est%20amour.mp4.jpg",
  "title": "tox est amour",
  "videos": [
    {
      "type": "ogv",
      "url": "http://dl.afpy.org/pycon-fr-15/108%20-%20Bruno%20Bord%20-%20tox%20est%20amour.ogv"
    },
    {
      "type": "mp4",
      "url": "http://dl.afpy.org/pycon-fr-15/108%20-%20Bruno%20Bord%20-%20tox%20est%20amour.mp4"
    },
    {
      "type": "webm",
      "url": "http://dl.afpy.org/pycon-fr-15/108%20-%20Bruno%20Bord%20-%20tox%20est%20amour.webm"
    }
  ]
}
