{
  "description": "Vous avez lu tout un tas d'articles sur les microservices avec Django,\ndu NoSQL, déployés avec Chef sur un cluster openstack. Maintenant, vous\navez une idée de comment gérer un million d'utilisateurs, un bon mal de\ntête, et toujours aucune idée de comment commencer.\n\nVotre objectif, c’est de développer une application qui fonctionne bien\n: c’est à dire avec peu de bugs (visibles), de bonnes performances et\nune bonne disponibilité. Sans cette base stable, la dette technique\nfinira pas devenir un frein à votre réussite.\n\nOn verra déjà comment, dès le début du projet, on peut anticiper sur des\nproblèmes futurs grâce à quelques décisions et bonnes pratiques. Puis on\ns’intéressera à la vie de l’application une fois en production : comment\nassurer sa stabilité et l’ajout de fonctionnalités et comment s’en\nsortir en cas de panne. Enfin, on verra quelques techniques qui nous\npermettront de progressivement accueillir de nouveaux utilisateurs.\n\nPython et son écosystème seront mis à contribution à chaque étape !\n",
  "duration": 1716,
  "language": "fra",
  "recorded": "2015-10-17",
  "speakers": [
    "Martin Richard"
  ],
  "summary": "C'est décidé, vous vous lancez dans un nouveau projet d'appli web et\nmobile. Vous visez le million d'utilisateurs, le passage au 20h, et\nXavier Niel rêvera de vous racheter. Maintenant, techniquement, comment\nfaut-il s'y prendre ? Comment s'y retrouver dans la jungle des buzzwords\n? Que reprendre des techniques des géants ? Qu'est-ce qui va nous servir\ndans l'écosystème de Python ?\n",
  "thumbnail_url": "http://video-pyconfr2015.paulla.asso.fr/001%20-%20Martin%20Richard%20-%20Votre%20appli%20web%20et%20Python:%20de%20z%C3%A9ro%20au%20million%20d'utilisateurs.mp4.jpg",
  "title": "Votre appli web et Python: de zéro au million d'utilisateurs",
  "videos": [
    {
      "type": "ogv",
      "url": "http://video-pyconfr2015.paulla.asso.fr/001%20-%20Martin%20Richard%20-%20Votre%20appli%20web%20et%20Python:%20de%20z%C3%A9ro%20au%20million%20d'utilisateurs.ogv"
    },
    {
      "type": "mp4",
      "url": "http://video-pyconfr2015.paulla.asso.fr/001%20-%20Martin%20Richard%20-%20Votre%20appli%20web%20et%20Python:%20de%20z%C3%A9ro%20au%20million%20d'utilisateurs.mp4"
    },
    {
      "type": "webm",
      "url": "http://video-pyconfr2015.paulla.asso.fr/001%20-%20Martin%20Richard%20-%20Votre%20appli%20web%20et%20Python:%20de%20z%C3%A9ro%20au%20million%20d'utilisateurs.webm"
    }
  ]
}
