{
  "description": "La boucle. Un pilier de la programation impérative. Et pourtant, les\nutilisateurs avertis de Numpy l'évite comme la peste pour des raisons de\nperformance. Heureusement, Numpy fournit de bonnes abstractions piur\ns'en passer dans pas mal de cas.\n\nLe but de cette présentation est de montrer que le compilateur Pythran,\nun compilateur statique pour un langage embarqué dans le couple Python /\nNumpy et spécialisé pour le code scientifique, est compatible avec cette\napproche, et qu'il en bénéficie même pour générer du code plus efficace\nque s'il n'avait eu que les boucles à disposition.\n\nOn tordra ainsi le cou à un vieil adage qui dit que plus on est\nexplicite dans sa description de l'algorithme, plus on saura tirer des\nperfs. En pratique, si on souhaite rester au niveau Python - Pythran est\n100% retro-compatible Python - rester à haut niveau n'est pas un frein.\n",
  "duration": 1382,
  "language": "fra",
  "recorded": "2015-10-18",
  "speakers": [
    "Serge Guelton",
    "Pierrick Brunet"
  ],
  "summary": "Pythran est un compilateur pour le Python scientifique qui se distingue\npar des performances importantes pour du code de haut niveau.\n\nCette présentation se concentre sur les boucles, ou plutôt l'absence de\nboucle dans les codes numériques, pourquoi on les évite, ce que ça\napporte, et pourquoi ce n'est pas si grave de les utiliser.\n",
  "thumbnail_url": "http://dl.afpy.org/pycon-fr-15/022%20-%20serge%20sans_paille,%20pierrick%20brunet%20-%20We%20don't%20need%20your%20loops.mp4.jpg",
  "title": "We don't need your loops",
  "videos": [
    {
      "type": "ogv",
      "url": "http://dl.afpy.org/pycon-fr-15/022%20-%20serge%20sans_paille,%20pierrick%20brunet%20-%20We%20don't%20need%20your%20loops.ogv"
    },
    {
      "type": "mp4",
      "url": "http://dl.afpy.org/pycon-fr-15/022%20-%20serge%20sans_paille,%20pierrick%20brunet%20-%20We%20don't%20need%20your%20loops.mp4"
    },
    {
      "type": "webm",
      "url": "http://dl.afpy.org/pycon-fr-15/022%20-%20serge%20sans_paille,%20pierrick%20brunet%20-%20We%20don't%20need%20your%20loops.webm"
    }
  ]
}
