{
  "id": 3154, 
  "category": "PyTexas 2014", 
  "slug": "3-hours-to-docker-fundamentals-jumpstart-your-do", 
  "title": "3 hours to Docker fundamentals: Jumpstart your Docker knowledge", 
  "summary": "", 
  "description": "Docker, the new trending containerization technique, is gaining interest from organizations of all sizes with its lightweight, portable, “build once, configure once and run anywhere” functionalities. Docker skills are expected to be in high-demand because of its ability to streamline workflow and reduce the need for hardware investment. \r\n\r\nThis tutorial focuses on providing an in-depth understanding of Docker and how to containerize Python web applications. Docker provides a mechanism for low overhead virtualization and can be a key aspect of a DevOps architecture. Docker allows isolated environments to be created in a single machine without imposing a performance overhead. This leads to new possibilities for optimizing the developer flows and creating multi-tenant applications, saving time coding and improving quality. \r\n\r\nThis tutorial will highlight a list of best practices, pitfalls, and dos and dont’s from real-world case studies.  We’ll walk through:\r\n\r\n- Basic concepts and Docker terminology\r\n- Docker Commands\r\n- Must Know Docker Features\r\n- Docker in the real world using examples of projects implemented at Flux7\r\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC-BY", 
  "thumbnail_url": "http://i.ytimg.com/vi/ddhU3NMrhX4/hqdefault.jpg", 
  "duration": 10800, 
  "videos": [
    {
      "url": "http://64966d3674e0a64d8f4a-47c94b14ef8e1f83d5390cdb0629c6ed.r53.cf2.rackcdn.com/pytexas-2014/3154_3_hours_to_Docker_fundamentals_Jumpstart_your_Dock.mp4", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "http://youtu.be/ddhU3NMrhX4", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://youtu.be/ddhU3NMrhX4", 
  "tags": [], 
  "speakers": [
    "Aater Suleman"
  ], 
  "recorded": "2014-10-03"
}