{
  "id": 3197, 
  "category": "PyTexas 2014", 
  "slug": "snakes-in-sheets", 
  "title": "Snakes in Sheets", 
  "summary": "", 
  "description": "Microsoft Excel continues to be popular across many industries where data analysis is fundamental to success. It marries powerful organization and presentation functionality to sift through large datasets. However, the default scripting language for Excel, VBA, is often cumbersome to use. Python is maturing as a quantitative scripting language with a growing scientific community around it, so it makes great sense to marry Excel’s user interface with Python’s extensive data acquisition and analysis libraries.\r\n\r\nThis talk introduces you to Pyinex, an open source project to embed a Python interpreter within an Excel addin. It directly exposes Python user defined functions as Excel worksheet functions, allows users to call arbitrary Python code from within Excel, and provides an interactive Python session all from within the same process space. Pyinex brings to Excel all the goodies of Python—data analysis using SciPy, NumPy, Pandas and more; integration with databases, web services, and other network resources; rapid function prototyping; extensive library support; and so much more.\r\n\r\nThis talk will demonstrate the capabilities of Pyinex and give an overview of how it works internally.  The aim is to present the tool for both end-users and developers to inspire the audience thinking of new use cases and spark conversation on how to further improve the project.\r\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC-BY", 
  "thumbnail_url": "http://i.ytimg.com/vi/X3ImPHjAmUQ/hqdefault.jpg", 
  "duration": 3000, 
  "videos": [
    {
      "url": "http://64966d3674e0a64d8f4a-47c94b14ef8e1f83d5390cdb0629c6ed.r53.cf2.rackcdn.com/pytexas-2014/3197_Snakes_in_Sheets.mp4", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "http://64966d3674e0a64d8f4a-47c94b14ef8e1f83d5390cdb0629c6ed.r53.cf2.rackcdn.com/pytexas-2014/3197_Snakes_in_Sheets.webm", 
      "length": null, 
      "type": "webm"
    }, 
    {
      "url": "http://www.youtube.com/watch?v=X3ImPHjAmUQ", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=X3ImPHjAmUQ", 
  "tags": [], 
  "speakers": [
    "Abhipray Sahoo"
  ], 
  "recorded": "2014-10-05"
}