{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon AU 2010", "speakers": ["Jeff B Edwards"], "title": "PyConAU 2010: Genropy - a framework for creating complex applications deployed on the web", "quality_notes": "", "video_flv_length": null, "recorded": null, "video_mp4_length": null, "description": "Genropy - A framework for creating complex applications deployed on the web\n\nPresented by Jeff B Edwards (Goodsoftware)\n\n[Genropy](http://blog.genropy.org/) is the python implementation of Genro, and\nis an application framework quite different from the standard (django,\ncherrypy, turbogears), for building powerful database applications deployed\nfrom the browser. Many differences and advantages between this framework and\ntraditional python application frameworks are explained. Genropy is a suitable\nfor creating complex 'applications' as opposed to 'sites'. The differentiation\nis that an application is something an operator uses all day, has trained\nusers, that have to 'squeeze' all the power from it available. Conversely, a\n'site' is basically public and not necessarily powerful as a user spends a\nrelatively small amount of time on it. Genropy is the framework for creation\napplications. It is used for attendee registration and sales in pycon italy,\nthe larger national conference in Europe (Florence, Italy).\n\nThis session will demonstrate how to create a simple application (3 tables)\nand demonstrate the ease and power of using python for the model view and\ncontroller on the client. It demonstrates how one api- being the genro Bag -\nis used to create the model, to map the sql to objects, to create the GUI and\ncommunicate all data. So all of it can be done in python instead of having to\nuse many different technologies and languages.\n\nJeff Edwards from Goodsoftware is strategic partner of Sofwell who is the\nauthor of Genropy.\n\n", "video_mp4_url": null, "tags": ["databases", "gui", "pyconau", "pyconau2010", "web"], "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", "related_urls": [], "video_flv_download_only": false, "source_url": "", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://a.images.blip.tv/Pyconau-GenropyAFrameworkForCreatingComplexApplicationsDeployed301.png", "video_flv_url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-au-2010/482_pyconau-2010-genropy-a-framework-for-creating-complex-applications-deployed-on-the-web.flv"}