{
  "description": "This talk was presented at PyBay2021 Food Truck Edition - 6th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for information about this talk.\n\nDESCRIPTION\nPython is great at helping ideas and companies get off the ground quickly. It is elegant, simple and offers great library support for getting ideas off the ground and into the hands of customers. But with success we need to adjust the way we write python to support more \"enterprise\" development. This space is filled with industry buzzwords like Domain Driven Design, Hexagonal architecture, design patterns, CQRS, Kafka, and the list goes on and on. But what is missing is advice on how to structure your classes, package and overall code to support this intimidating world of enterprise development. This talks is about those techniques to keep you code simple regardless of framework choices that made you successful in the first place while preventing the dreaded \"rewrite\" phase of your application.\n\nSPEAKER BIO\nRobert is a Staff Engineer at Carta working on problems decomposing monolithic legacy applications into distributed systems. His primary focus is teaching Domain Driven Design, distributed data patterns, Software Architecture and Event Systems/Kafka. He programs in a variety of languages, from python to java/javascript/typescript/golang. But his real passion is mentoring other software engineers, keeping things simple and staying on-top of technology trends. And he is known to really enjoy a good pint of craft beer or a dram of good whiskey.\n\nSPONSOR ACKNOWLEDGEMENT\nThe post production of this and other PyBay2020 videos are made possible by our sponsors:\n- Carta https://carta.com\n- Anyscale https://anyscale.com\n- Goodrx https://goodrx.com\n- Nginx https://nginx.com\n- Bit.io https://bit.io\n\nEVENT PRODUCER ACKNOWLEDGEMENT\nThis community conference is produced by organizers of SF Python meetup and volunteers from around the SF Bay Area and beyond. See upcoming events here: https://sfpythonmeetup.com",
  "duration": 1010,
  "language": "eng",
  "recorded": "2021-10-09",
  "speakers": [
    "Robert Jackiewicz"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/mYQZq_Dc3Vg/maxresdefault.webp",
  "title": "Keep it Simple: Moving from Webapp to Enterprise",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mYQZq_Dc3Vg"
    }
  ]
}