{
  "description": "V ostatných rokoch sme svedkami opätovnej explózie záujmu o školské programovanie prakticky v každej krajine s rozvinutým školstvom, a to aj na úrovni základnej školy, či dokonca v predprimárnom vzdelávaní. Rozvoj moderného školského programovania pre každého žiaka je hlavným cieľom mojej odbornej práce už od konca 80-tych rokov. Avšak až donedávna som neevidoval ani jednu celoplošnú, systematickú, vývinovo primeranú, rešpektovanú a správne podporenú implementáciu edukačného programovania do niektorého formálneho vzdelávacieho systému – napriek tomu, že viacero krajín explicitne deklarovalo práve takúto politiku ako svoj cieľ, a to prostredníctvom povinného predmetu s názvom ako Computer Science, Informatika, IKT či Computing.\nJe preto namieste pýtať sa, či sa táto súčasná vlna obnoveného záujmu o edukačné programovanie niečím líši od tých predchádzajúcich a či má tentoraz nádej na udržateľnú integráciu do vzdelávacieho procesu v bežnej škole, napr. aj na základnej škole. Vo svojom vystúpení sa pokúsim zdôvodniť, prečo tento ambiciózny cieľ považujem za dosiahnuteľný a ktoré faktory musíme starostlivo zvažovať, aby sme dosiahli takéto všeobecne akceptované a stabilné školské programovanie pre každého.",
  "duration": 2231,
  "language": "slk",
  "recorded": "2017-03-10",
  "speakers": [
    "Ivan Kalaš"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/hBrtaZ7Yex8/hqdefault.jpg",
  "title": "Programovanie v škole: Primerané, udržateľné, rešpektované a integrované. Platí či neplatí?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hBrtaZ7Yex8"
    }
  ]
}
