{
  "copyright_text": null,
  "description": "Slides - https://docs.google.com/presentation/d/1zyuwCx7knqnP-LJswlDfWSmk5FhFgFmYJGqdEZn8yhc/edit?usp=sharing\n\nRepos - https://github.com/scoutbee/pytorch-nlp-notebooks\n\nIn this tutorial, we will give you some deeper insights into recent developments in the field of Deep Learning NLP. The first part of the workshop will be an introduction into the dynamic deep learning library PyTorch. We will explain the key steps for building a basic model. In the second part, we will introduce how to implement more advanced architectures and apply it to real world datasets.\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 6017,
  "language": "eng",
  "recorded": "2019-07-13",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/london2019/schedule/"
    },
    {
      "label": "https://github.com/scoutbee/pytorch-nlp-notebooks",
      "url": "https://github.com/scoutbee/pytorch-nlp-notebooks"
    },
    {
      "label": "https://docs.google.com/presentation/d/1zyuwCx7knqnP-LJswlDfWSmk5FhFgFmYJGqdEZn8yhc/edit?usp=sharing",
      "url": "https://docs.google.com/presentation/d/1zyuwCx7knqnP-LJswlDfWSmk5FhFgFmYJGqdEZn8yhc/edit?usp=sharing"
    }
  ],
  "speakers": [
    "Jeffrey Hsu",
    "Susannah Klanecek"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Apx_1erbQB4/maxresdefault.jpg",
  "title": "A Deep Dive into NLP with PyTorch",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Apx_1erbQB4"
    }
  ]
}
