{
  "copyright_text": null,
  "description": "Embeddings! Embeddings everywhere! - How to build a recommender system using representation learning.\n\nSlides - https://www.slideshare.net/arciuchm/embeddings-embeddings-everywhere-156063776\n\nRecommender systems are the major source of income of modern e-commerce. In this talk we will describe a large scale (over 90 millions items and 20 million registered users) e-commerce recommender system used at Allegro. The system is composed of two main parts: learning item representations and finding nearest neighbours. We will share the experience we gained from building the system.\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 2296,
  "language": "eng",
  "recorded": "2019-07-13",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/london2019/schedule/"
    },
    {
      "label": "https://www.slideshare.net/arciuchm/embeddings-embeddings-everywhere-156063776",
      "url": "https://www.slideshare.net/arciuchm/embeddings-embeddings-everywhere-156063776"
    }
  ],
  "speakers": [
    "Maciej Arciuch",
    "Karol Grzegorczyk"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/muXTMnfPU0k/maxresdefault.jpg",
  "title": "Embeddings! Embeddings everywhere!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=muXTMnfPU0k"
    }
  ]
}
