{
    "copyright_text": null,
    "description": "‘Growth’, the concern of all developers!\n\nI will share my experience of growing as a developer through open source contributions. I prepared the presentation based on what I learned while contributing to ‘Django’, a representative web framework in Python among many open sources.\nAs a developer, I was able to experience growing not only technically but also mentally while contributing to open source.\n\nI will also share tips on how to start contributing to open source and tips on how to contribute to open source with others.\n\nI have not contributed much to open source yet, but I thought it would be good to contribute to open source and grow together with more Korean Python developers, so I decided to give the presentation.\n\nBae Doo-sik (Jordan)\nI am developing a credit rating analysis platform and data platform at Verticah, which creates the future sales transaction platform, Revenue Market. After graduating from college, I started my career in circuit design at LG and then switched to becoming a software engineer. After switching, I worked as a server engineer, data infrastructure engineer, and data engineer at various large and small startups such as Ateamventures, Sendbird, Chai, and Quotabook. I have been working in various positions and have been solving business and technical problems without any boundaries in the field. I try to make time to contribute to open source often and recently I have been interested in building a good data platform.",
    "duration": 984,
    "language": "kor",
    "recorded": "2023-08-12",
    "related_urls": [
        {
            "label": "Growing with Open SourceFeat Django",
            "url": "https://2023.pycon.kr/session"
        }
    ],
    "speakers": [
        "Bae Doo-sik"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/gBjWgCXL4mA/default.jpg",
    "title": "Growing with Open SourceFeat Django",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=gBjWgCXL4mA"
        }
    ]
}