{
    "copyright_text": null,
    "description": "The computing infrastructures of today run many services, and those services consist of a huge number of modules and frameworks, each of which has a huge number of dependencies. There are too many of them.\n\nWhen I ask people around me how to manage dependencies, most of them still don't know how to manage them, and although the environment for managing dependencies has improved greatly in 2023, I realized that many developers end up suffering and having a hard time because of dependencies when I see that many of them end up installing using only pip.\n\nIn particular, there must be many people who know Python well in the field, other than me, who definitely know how to do it, but I made this announcement for those who still don't know.\n\nI hope that these most important but easily overlooked parts can be developed with less suffering.\n\nService is Service, AI is AI, Package and Library development is also very flexible in dependency management, and once you get used to it, you won't have to worry about dependencies much. I think you can reduce your stress with a tool like Poetry!\n\nKim Du-hoon\nHello. These days, I'm a person who lives for fun and tinkers with anything. I do C and C++, but I do Python more these days. I try to do as many activities as possible. I also try to do a lot of presentations and things like that these days. I mainly worked on things related to machinery, electricity/electronics, and computers, and I'm especially interested in education and research (AI, Biology, Medical, Financial).",
    "duration": 1531,
    "language": "kor",
    "recorded": "2023-08-12",
    "related_urls": [
        {
            "label": "How is your Dependency?",
            "url": "https://2023.pycon.kr/session"
        }
    ],
    "speakers": [
        "Kim Du-hoon"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/OBvnsAwXnd0/default.jpg",
    "title": "How is your Dependency?",
    "videos": [
        {
            "type": "Youtube",
            "url": "https://www.youtube.com/watch?v=OBvnsAwXnd0"
        }
    ]
}