{
    "copyright_text": null,
    "description": "Becoming famous is an opportunity to receive a lot of love, but at the same time, it is also a risk of receiving a lot of hate.\n\nWhen I saw the phrase 'Again, Us, Python' at this PyCon 2023, as a SW educator,\nI thought of the beginning of 2016~2020, when Python was loved and hated a lot.\n\nThe goal of this session is not to 'provide the right answer/solution'.\n\nEducation. Especially, education in Korea is a sensitive and passionate topic, and it is almost impossible to find a 'good' method that will satisfy everyone.\n\nHowever, if we can sympathize with the direction.\n\nIf we are prepared with an opportunity and understanding to understand each other's perspectives.\n\nI think we will be able to find a better decision that more people can sympathize with.\n\nIn this session, we will share the 'background knowledge' necessary to sympathize with the topic of 'Python public education' with those in the 'non-education industry'.\n- Python is good for education, but if it's good, it's good, so why is there such a fuss? - Why are you worried that Python, which is doing so well, will be hated?\n\nIf we think about the related background and topic and have more people sympathize,\nI expect that we will be more likely to find 'more sympathetic, good methods for Python, students, and parents' than if we don't.\n\nSpencer\nHello, I'm Spencer. I'm not a developer, but an educator who loves Python. I'm currently an education manager at a boot camp called Programmers DevCourse, and I try to help junior developers in the same space as them. It's been 6 years since I started developing SW education, and these days, I often think about 'Isn't there a realistic way to prevent necessary education from being only for the rich?'",
    "duration": 2197,
    "language": "kor",
    "recorded": "2023-08-12",
    "related_urls": [
        {
            "label": "I'm worried about the future where students and parents hate Python.",
            "url": "https://2023.pycon.kr/session"
        }
    ],
    "speakers": [
        "spencer"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/C7_IZnLy4zc/maxresdefault.jpg",
    "title": "I'm worried about the future where students and parents hate Python.",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=C7_IZnLy4zc"
        }
    ]
}