{
  "description": "Emily Hoffmann, Alfonso Roman\nhttp://lanyrd.com/2015/writethedocs/sdmwyb/\nA mathematical proof is a logically rigorous way of showing that something is true. It begins with a statement of the desired result and any assumptions that must be made. It guides the reader through a set of logical sequential steps, supported by figures to aid intuition or cross-references for prerequisite knowledge. It ends by declaring that the desired result has been achieved. At risk of insulting every mathematician who ever lived, in many ways a proof is not so different from a grand, abstract how-to document.\nPerhaps surprisingly, for most of human history mathematical proofs and mathematics itself have been written in prose. Even those of us who cringe at the memory of high school algebra can agree that “10x + y^2 = 3” is more user-friendly than “the sum of an unknown quality multiplied by ten and another unknown quantity multiplied by itself is equal to three”. The first part of this talk explores the development of mathematical writing, which can be divided into improvements in symbolic representation and improvements in structure. This discussion is partly inspired by Bret Victor’s observation that the most influential breakthroughs in the history of mathematics were actually breakthroughs in “UI design”, for example the invention of arabic numerals (0, 1, 2, 3,...) as a replacement for clunky roman numerals (I, II, III, IV…).\nProofs and rigorous documentation empower their readers to greater understanding by never relying on authority or persuasion. A mathematical proof, unlike a scientific experiment or a souffle recipe, must show that the desired result is always achieved when the right steps are executed under the right conditions. Users of computer applications certainly expect documentation to live up to the same standards. The second part of this talk explores the concept of mathematical proof in more depth. We will look at how proofs are structured and use logic in a particular way to minimize ambiguity and maximize credibility, and how the writing process is itself a powerful tool to root out hidden assumptions and errors in thinking.",
  "language": "eng",
  "recorded": "2015-05-18",
  "related_urls": [
    "http://lanyrd.com/2015/writethedocs/sdmwyb/"
  ],
  "speakers": [
    "Emily Hoffmann",
    "Alfonso Roman"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/3PbkglMkzS0/hqdefault.jpg",
  "title": "A brief history of math writing: symbol, structure, and proof",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3PbkglMkzS0"
    }
  ]
}
