{
  "description": "Matt Ness\nhttp://lanyrd.com/2015/writethedocs/sdmwxx/\nTo new users, complex software products can seem like dark woods on a stormy day. As tech writers, we often spend a lot of time talking about the overall shape of the forest and the variety of paths within it (conceptual docs), creating detailed catalogs of local tree species (reference docs), and providing step-by-step guides to things like “how to cross a river” or “how to knock on a door” (task-based docs).\nBut none of that helps your customers when they just want to know how to get to Grandmother’s house, without getting lost in the forest, falling into the river, and accidentally going to the other cabin in the woods, where the lycanthropic senior citizens live.\nIn other words, your customers need a narrative. And maybe they need lots of them. When you’re dealing with products that can be run and configured in a bewildering variety of ways, a single getting started manual might not do the trick. It’s like giving people a Choose Your Own Adventure book and only allowing them to choose one path through to the end.\nFor my talk I’ll explain how we became aware of the need for better scenario-based documentation, and how we ended up building a prototype during a hack week project. Now we’re on our way to creating a collection of short stories that show users how to string sets of features and procedures together to solve complex problems. We’ll cover some of the things we’ve learned along the way and offer best practices for those who want to tell a few stories of their own.\nMatt Ness is a technical writer with over twenty years of experience at places like PeopleSoft, Oracle, and Intuit. He&#39;s currently a writer for Splunk, a leader in the machine data analytics sector.",
  "language": "eng",
  "recorded": "2015-05-18",
  "related_urls": [
    "http://lanyrd.com/2015/writethedocs/sdmwxx/"
  ],
  "speakers": [
    "Matt Ness"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/3hneCmLYWjc/hqdefault.jpg",
  "title": "Let’s Tell a Story: Scenario-Based Documentation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3hneCmLYWjc"
    }
  ]
}
