{
  "description": "Christine Burwinkle\nhttp://lanyrd.com/2015/writethedocs/sdmwyf/\nHere at Atlassian, we’ve been moving ever closer to a world of continuous deployment for our software products. Five years ago, releases took months. Now, many products are releasing every two weeks at a minimum. In addition, the past year has seen features being deployed as soon as they pass testing. What’s a tech writer to do!?\nIn true agile fashion, the response to these challenges varies across products and writers within Atlassian. This gives us a breadth of stories and examples I can share about our experiences in this world. Here’s a high-level look at what I’ll share:\nA brief discussion of continuous deployment: what does it mean, especially for tech writers and others involved in the process?\nA look at some things that have worked for us. Making the mental shift from releases to features has been an absolute necessity. We’ve also had to change the tooling we use, the processes we follow, and the way we communicate. This journey has also forced us to consider what the documentation equivalent of an MVP (minimal viable product in Agile development) looks like.\nThere are a few things that haven’t worked out very well! Resource-heavy deliverables (like videos and tutorials) are really difficult to maintain. Communication also increases in importance in a rapidly-paced cycle. These and other areas provide us with some good lessons learned.\nThe jury is still out on a few experiments! Things like investing more heavily in in-app help and automating doc publication in tandem with code deployment are among the experiments we’re attempting to get better at this new world.",
  "language": "eng",
  "recorded": "2015-05-18",
  "related_urls": [
    "http://lanyrd.com/2015/writethedocs/sdmwyf/"
  ],
  "speakers": [
    "Christine Burwinkle"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Bsod_z9OKQY/hqdefault.jpg",
  "title": "Tech writing in a continuous deployment world",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Bsod_z9OKQY"
    }
  ]
}
