{
  "description": "Joao Fernandes\nhttp://lanyrd.com/2015/writethedocs/sdmwyd/\nAt OutSystems we make an awesome development platform, but our documentation wasn&#39;t that awesome. We focused on describing each button available on the user interface, and not the user intentions and goals.\nA clear example of this, was that we had a full documentation page for the find text feature (CTRL+F). It described in excruciating detail every option available on the UI, but didn&#39;t told our users how they could actually find what they needed!\nFor us it was a nightmare to maintain the docs. Our development environment was constantly changing and we couldn&#39;t keep up with the changes.\nMore importantly, we weren&#39;t meeting the user needs. And that was clear from pages with a single-digit page view, and from the feedback we got from our customers.\nDue to this approach, we also ended up having page titles that were feature-oriented, which is not the best for SEO. For instance, the doc page for the find text feature was called &quot;Find Tool&quot;. Who in their right mind would search for that on Google?\nIn this talk I&#39;ll tell you the story of how we stopped trying to document the UI, and started creating user-story driven docs. We now focus on what the user wants to achieve and how to achieve it, independently of how many windows or buttons they need to go through.\nI&#39;ll cover:\nHow you can check if you&#39;re documenting the UI, and why you should avoid doing it\nWhy users stories work better for our users\nHow focusing on user stories changed the culture of our team and allowed us to work on what really matters.\nI&#39;ll also share some unexpected outcomes, like how this lead us to work closer than ever with the development teams. Now our users get twice the cake: better features and better docs!",
  "language": "eng",
  "recorded": "2015-05-18",
  "related_urls": [
    "http://lanyrd.com/2015/writethedocs/sdmwyd/"
  ],
  "speakers": [
    "Joao Fernandes"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/MRnZFVCirQM/hqdefault.jpg",
  "title": "User-Story Driven Docs",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MRnZFVCirQM"
    }
  ]
}
