{
  "description": "Mo Nishiyama\nhttp://lanyrd.com/2015/writethedocs/sdmwxd/\nAs documentarians, we are rarely afforded an opportunity to thrive in a pristine greenfield environment. Sometimes we are asked to resurrect an existing documentation system which had fallen into a derelict state over many years. To turn this ship around, we must shepherd contents, customer base, and internal Subject Matter Experts into a future state where outdated, neglected, and ambiguous support documents are transformed into timely, relevant, and pleasing works of art.\nThe role of the documentarian is to help execute this transformation. However, we are often asked (or voluntold) by our organizations to wear other hats beyond our primary writing duties: repair and build relationships, analyze business processes, learn about how others react to change, discover unknown troves of documentation, train and encourage the next generation of writers, gather and crunch data, tell stories, design workflows, and perform “other duties as needed.” Some may respond with an exasperated “I wasn’t trained on this!!!” or “That’s not part of my job!” But those of us who embrace the opportunity to stretch beyond our areas of expertise and learn new peripheral skills may realize that working on a documentation equivalent of a cleaning up Superfund site can turn into super fun.\nIn this talk, I will share my experiences and lessons learned as a technical writer who is witnessing this documentation culture change, one conversation at a time. Wearing many hats can be exhilarating and rewarding.",
  "language": "eng",
  "recorded": "2015-05-19",
  "related_urls": [
    "http://lanyrd.com/2015/writethedocs/sdmwxd/"
  ],
  "speakers": [
    "Mo Nishiyama"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/3X8xyfkRmO4/hqdefault.jpg",
  "title": "What Can Brownfield Do For You?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3X8xyfkRmO4"
    }
  ]
}
