{
  "alias": "video/1451/beziehungen-nein-danke-agiledatenbankentwickl",
  "category": "PyCon DE 2012",
  "copyright_text": "",
  "description": "",
  "duration": null,
  "id": 1451,
  "language": "deu",
  "quality_notes": "",
  "recorded": "2012-11-01",
  "slug": "beziehungen-nein-danke-agiledatenbankentwickl",
  "speakers": [
    "Martin Schönert"
  ],
  "summary": "Python-Projekte haben immer häufiger alternative Datenbanken aus der\nnosql /newsql-Familie in ihrem Stack, seien es Graphendatenbanken wie\nNeo4j, Key- Value-Stores wie Redis oder dokumentenorientierte\nDatenbanken wie MongoDB.\n\nSo verschiedenartig diese Datenbanken auch sind, gemeinsam ist ihnen,\ndass sie nicht das relationale Datenmodell implementieren, Daten nicht\nin miteinander in Beziehung stehenden Entitäten ablegen. Während\nNicht-Normalisirung bei relationalen Datenbanken meist als Anti-Pattern\nangesehen wird, ist es bei schemafreien Datenbanken Prinzip, das\nschnelles und agiles Entwickeln und Deployen fördert.\n\nDieser Talk zeigt an Hand eines konkreten Use-Cases, welche Auswirkungen\ndie Verwendung einer nicht-relationalen Datenbank auf den\nEntwicklungsprozess hat, zeigt wie Daten modelliert werden können und\nauch, wie Veränderungen am Datenbankmodell implementiert werden können,\nwenn es kein \"Alter table\" mehr gibt.\n\nDiskutiert werden sollen dabei auch die Pros und Kontras der\nverschiedenen Datenmodelle hinsichtlich ihrer Query-Möglichkeiten, der\nQuery-Performance, Anforderungen an Plattenplatz und Auswirkungen auf\ndie Client/Anwendungsseite.\n",
  "tags": [
    "agile softwareentwicklung",
    "datenbank",
    "datenmodellierung",
    "nosql",
    "orm",
    "python"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/0re7PgM9Duc/hqdefault.jpg",
  "title": "Beziehungen? Nein danke! - Agile Datenbankentwicklung mit schemafreien Datenbanken und Python",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/pyconde/pyconde2012/Vortrag_Beziehungen_Nein_danke.mp4?Signature=GwcLq3LbRvmkwcwlWe3K%2FBqDsnE%3D&Expires=1351856279&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0re7PgM9Duc"
    }
  ]
}
