{
  "alias": "video/1431/cython-mit-pypy-das-beste-aus-drei-welten",
  "category": "PyCon DE 2012",
  "copyright_text": "",
  "description": "",
  "duration": null,
  "id": 1431,
  "language": "deu",
  "quality_notes": "",
  "recorded": "2012-10-30",
  "related_urls": [
    "http://cython.org"
  ],
  "slug": "cython-mit-pypy-das-beste-aus-drei-welten",
  "speakers": [
    "Stefan Behnel"
  ],
  "summary": "Die Programmiersprache Cython (http://cython.org \"Web- Seite des\nCython-Projekts\") ist das de-facto Standard-Tool um CPython um nativen\nCode zu erweitern. Die Python-ähnliche Sprache macht schon seit einigen\nJahren das Schreiben von schnellen Erweiterungsmodulen für CPython und\ndas Anbinden von externen nativen Bibliotheken (C/C++/Fortran/...) so\neinfach wie Python selbst und gleichzeitig so effizient wie C. Davon\nprofitiert besonders das weite Feld des High-Performance-Computing in\nPython (NumPy/SciPy/Sage/...), aber auch zahllose andere Bereiche, die\neine effiziente Verarbeitung großer Datenmengen und die Anbindung von\nnativen Bibliotheken an die Programmiersprache Python benötigen.\n\nDie neueste Version des Cython-Compilers bietet erstmals auch\nUnterstützung für PyPy an, eine alternative Python-Implementierung, die\nvor allem durch ihren schnellen JIT-Compiler von sich reden macht.\nDadurch kann einmal mit Cython geschriebener und in C übersetzter Code\nsowohl in CPython als auch in PyPy verwendet werden. So wird es\nbeispielsweise möglich, in einer einzigen Code-Basis effiziente\nAnbindungen externer Bibliotheken für beide Laufzeitumgebungen zu\nentwickeln.\n\nDieser Vortrag von einem der Cython Core-Entwickler erklärt, welche\nFallstricke dabei noch auf Benutzerseite zu erwarten sind und gibt\nHilfestellungen beim Schreiben von Cython-Code, der sowohl in CPython\nals auch in PyPy funktioniert.\n",
  "tags": [],
  "thumbnail_url": "https://i2.ytimg.com/vi/IETT76NN6Z8/hqdefault.jpg",
  "title": "Cython mit PyPy - das Beste aus drei Welten",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/pyconde/pyconde2012/Vortrag_Cython_mit_PyPy_das_Be.mp4?Signature=JeqVDywROU3i4DxAbmNJDPZ%2FvVM%3D&Expires=1351795204&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IETT76NN6Z8"
    }
  ]
}
