{
  "alias": "video/1423/funktionale-programmierung-mit-python",
  "category": "PyCon DE 2012",
  "copyright_text": "",
  "description": "",
  "duration": null,
  "id": 1423,
  "language": "deu",
  "quality_notes": "No audio until 10:10.",
  "recorded": "2012-10-30",
  "slug": "funktionale-programmierung-mit-python",
  "speakers": [
    "Mike Müller"
  ],
  "summary": "In den letzten Jahren hat die funktionale Programmierung wieder mehr\nAufmerksamkeit erhalten. Das Vorurteil nur für akademische Nutzer\ninteressant zu sein hat sich stark abgeschwächt. Haskell, Erlang und F#\nsind funktionale Programmiersprachen, die verstärkt für praktische\nZwecke zum Einsatz kommen.\n\nPython unterstütz mehrere Programmierparadigmen. Neben der prozeduralen\nund objektorientierten unterstütz es auch wichtige Konzepte der\nfunktionalen Programmierung. Der Vortrag zeigt wie sich diese Merkmale\nwie Funktionen als Objekte erster Klasse, Funktionsabschlüsse\n(Closures), Funktionen ohne Seiteneffekte, Currying, verzögerte\nAuswertung, Vermeidung veränderlicher Datenstrukturen und Einsatz von\nIteratoren, Generator und Comprehensions anstatt von Schleifen nutzen\nlassen. Beispiele verdeutlichen die Vor- und Nachteile des funktionellem\nAnsatzes für verschiedene Aufgaben.\n\nDer Aufbau eines Programms mit funktionalen Ansatz kann sich stark von\ndem eines objektorientierten unterscheiden. Beispiele zeigen wie mit\nPython Teile eines Programms die Vorteile der funktionalen\nProgrammierung nutzen können und sich schrittweise funktionale\nPrinzipien in objektorientierte Programme einbeziehen lassen.\n\nDer Vortrag verdeutlicht wie das Modul itertools die verzögerte\nAuswertung unterstützt. Mit den Funktionen dieses Moduls lassen sich\nAlgorithmen oft kurz, gut lesbar und effizient umsetzen. Auch hier ist\neine Integration in sonst nicht-funktional geschriebene Programme\neinfach möglich.\n",
  "tags": [
    "closure",
    "funktional",
    "generator",
    "iterator",
    "itertools",
    "paradigma",
    "verzögerte auswertung"
  ],
  "thumbnail_url": "https://i3.ytimg.com/vi/2c0TTt48ir4/hqdefault.jpg",
  "title": "Funktionale Programmierung mit Python",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/pyconde/pyconde2012/Vortrag_Funktionale_Programmierung_mit_Python.mp4?Signature=Dbnfql17863Wk8wpbrfxlcmvzuM%3D&Expires=1351786192&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2c0TTt48ir4"
    }
  ]
}
