{
  "alias": "video/1427/getting-things-done-pragmatische-projekte-mit",
  "category": "PyCon DE 2012",
  "copyright_text": "",
  "description": "",
  "duration": null,
  "id": 1427,
  "language": "deu",
  "quality_notes": "",
  "recorded": "2012-10-30",
  "slug": "getting-things-done-pragmatische-projekte-mit",
  "speakers": [
    "Andreas Jung"
  ],
  "summary": "Plone ist ein komplexes Web-Framework with vielen Modulen und\nvielschichtigen Abstraktionsebenen. Kundenprojekte im Bereich Web\nerfordern oft Anpassungen auf mehreren Ebenen: neue Inhaltstypen,\nÄnderungen an Templates und existierenden Funktionalitäten etc. Es ist\nimmer schwierig den richtigen Weg bei einer Anpassung zu finden\ninsbesondere wenn die üblichen Projektressourcen wie Personal, Zeit und\nBudget begrenzt sind und nicht beliebig skalierbar sind.\n\nIn dem Vortrag berichte ich wie wir in vergangenen großen Webprojekten\nmit diesem Spannungsfeld umgegangen sind und Plone-Anpassungen in einer\npragmatischen Art und Weise durchgeführt haben - ohne dem Kunden einen\nSack voller hässlicher Workarounds zu liefern aber auch nicht mit dem\nAnspruch die perfekteste Lösung gebaut zu haben.\n\nIch behandle Techniken zur Anpassungen von existierenden Templates und\nViews, Strategien bei der Behebung von Fehlern in Plone oder\nDrittprodukten, die Verwendung von Site-Fixtures, um Kunden und Designer\nfrühzeitig eine Site mit Fake-Inhalten (Text + Bilder) zu versorgen\nsowie Ansätze zum pragmatischen Testen in großen Web-Projekten.\n",
  "tags": [],
  "thumbnail_url": "https://i4.ytimg.com/vi/oqhOeFKiBVk/hqdefault.jpg",
  "title": "\"Getting things done\" - Pragmatische Projekte mit Plone",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/pyconde/pyconde2012/Vortrag_Getting_things_done_Pragmatische_Projekte_mit_Plone.mp4?Signature=RxwhiYdvMWfUReKoWwuLIanXgeM%3D&Expires=1351791406&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=oqhOeFKiBVk"
    }
  ]
}
