{
  "alias": "video/1455/metaprogrammierung-praktisch",
  "category": "PyCon DE 2012",
  "copyright_text": "",
  "description": "",
  "duration": null,
  "id": 1455,
  "language": "deu",
  "quality_notes": "",
  "recorded": "2012-10-30",
  "slug": "metaprogrammierung-praktisch",
  "speakers": [
    "Andreas Albrecht"
  ],
  "summary": "Metaprogrammierung ist eine fortgeschrittene Methode der\n\nProgrammierung. Wie das \"Meta\" im Namen schon vermuten lässt, findet\n\nMetaprogrammierung auf einer abstrakteren Ebene statt - oder etwas\n\neinfacher: man programmiert, was man programmiert. Obwohl\n\nMetaprogrammierung in Python auf eine lange Historie zurückblicken\n\nkann, ist sie dennoch eine Technik, der oft mit einer gehörigen\n\nPortion Skepsis und fragenden Blicken begegnet wird. Der Vortrag will\n\naufzeigen, ob diese Skepsis gerechtfertigt ist, wie Metaprogrammierung\n\nin Python funktioniert und wie man diese Technik sinnvoll einsetzen\n\nkann.\n\nZu Beginn des Vortrags wird das allgemeine Konzept der\n\nMetaprogrammierung vorgestellt und in einem kurzen historischen\n\nAufriss der Einzug dieser Technik in Python skizziert. Im Hauptteil\n\ndes Vortrags werden gängige Muster der Metaprogrammierung in Python\n\nund deren Funktionsweise anhand von Beispielen\n\npräsentiert. Abschließend wird mit Beispielen aus der Praxis und aus\n\nOpenSource-Projekten auf konkrete Anwendungen hingewiesen, die Ideen\n\nzum Einsatz dieser Technik geben sollen - aber auch mögliche Probleme\n\naufzeigen.\n\nDer Vortrag richtet an alle, die mehr über die Technik der\n\nMetaprogrammierung in Python erfahren wollen. Die Beispiele sind so\n\ngewählt, dass sie auch für weniger erfahrene Entwickler\n\nnachvollziehbar bleiben.\n",
  "tags": [
    "metaprogrammierung"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/poBj2-2J5o8/hqdefault.jpg",
  "title": "Metaprogrammierung, praktisch.",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/pyconde/pyconde2012/Vortrag_Metaprogrammierung_pra.mp4?Signature=HveSs9KFpFRtP2heAhqhOzbAZfg%3D&Expires=1352032057&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=poBj2-2J5o8"
    }
  ]
}
