{
  "alias": "video/1489/programmieren-als-kulturtechnik-uber-hobbyprogra",
  "category": "PyCon DE 2012",
  "copyright_text": "",
  "description": "",
  "duration": null,
  "id": 1489,
  "language": "deu",
  "quality_notes": "",
  "recorded": "2012-10-30",
  "slug": "programmieren-als-kulturtechnik-uber-hobbyprogra",
  "speakers": [
    "Jörg Kantel"
  ],
  "summary": "Nicht nur bei Berufsprogrammierern ist der sogenannte Quereinsteiger\nweit verbreitet. Auch in Wissenschaft und Technik gibt es Menschen, die\n»nebenher« programmieren, weil es für ihre eigene Arbeit nützlich ist.\nNicht nur in den Natur-, sondern auch in den Sozial- und\nGeisteswissenschaften gibt es Wissenschaftler, die an neuen Methoden des\nZugangs zu ihrem Forschungsmaterial arbeiten und dabei auf\n»selbstgestrickte« Programme zurückgreifen.\n\nAuch im Hobbybereich sind Programmierer anzutreffen. Hier sind sogar in\nder kurzen Geschichte der Programmierung regelrechte, zu bestimmten\nEreignissen auftretende kreative Explosionen zu verzeichen, die auch\nRückwirkungen auf die professionelle Programmierung hatten.\n\nIn meinem Vortrag möchte ich kurz auf die Geschichte dieser anderen,\nmehr spielerischen Seite des Programmierens eingehen und dann die Frage\nbeantworten, welche Bedeutung Python als lauffähiger Pseudocode\n\nspeziell im Wissenschafts- und Hobbybereich hat. Python ist in diesem\nBereich eine sehr populäre Programmiersprache. Aber ich möchte auch\nEntwicklungen benennen, die meiner Meinung nach dieser Popularität\ngefährlich werden könnten und auch anhand von anderen Umgebungen zeigen,\nwas es eventuell zu integrieren gilt.\n\nÜber all dem steht mein Kredo, daß jedefrau und jedermann wenigstens ein\nwenig programmieren können sollte, weil sie sonst programmiert werden.\nUnd ich glaube, daß Python immer noch die beste Einstiegssprache dafür\nist.\n",
  "tags": [
    "keynote"
  ],
  "thumbnail_url": "https://i4.ytimg.com/vi/3gsKdEgA03w/hqdefault.jpg",
  "title": "Programmieren als Kulturtechnik? Über Hobbyprogrammierer, Gelegenkeitsskripter und Python.",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/pyconde/pyconde2012/Keynote_Programmieren_als_Kult.mp4?Signature=d0xvoJfua6nZ9s2FOSZURm94dP8%3D&Expires=1352127665&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3gsKdEgA03w"
    }
  ]
}
