{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon DE 2012", "speakers": ["Jörg Kantel"], "title": "Programmieren als Kulturtechnik? Über Hobbyprogrammierer, Gelegenkeitsskripter und Python.", "quality_notes": "", "video_flv_length": null, "recorded": "2012-10-30", "video_mp4_length": null, "description": "", "video_mp4_url": "http://s3.us.archive.org/nextdayvideo/pyconde/pyconde2012/Keynote_Programmieren_als_Kult.mp4?Signature=d0xvoJfua6nZ9s2FOSZURm94dP8%3D&Expires=1352127665&AWSAccessKeyId=FEWGReWX3QbNk0h3", "tags": ["keynote"], "copyright_text": "", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=3gsKdEgA03w", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "German", "video_webm_length": null, "summary": "Nicht nur bei Berufsprogrammierern ist der sogenannte Quereinsteiger weit\nverbreitet. Auch in Wissenschaft und Technik gibt es Menschen, die »nebenher«\nprogrammieren, weil es für ihre eigene Arbeit nützlich ist. Nicht nur in den\nNatur-, sondern auch in den Sozial- und Geisteswissenschaften gibt es\nWissenschaftler, die an neuen Methoden des Zugangs zu ihrem Forschungsmaterial\narbeiten und dabei auf »selbstgestrickte« Programme zurückgreifen.\n\nAuch im Hobbybereich sind Programmierer anzutreffen. Hier sind sogar in der\nkurzen Geschichte der Programmierung regelrechte, zu bestimmten Ereignissen\nauftretende kreative Explosionen zu verzeichen, die auch Rückwirkungen auf die\nprofessionelle Programmierung hatten.\n\nIn meinem Vortrag möchte ich kurz auf die Geschichte dieser anderen, mehr\nspielerischen Seite des Programmierens eingehen und dann die Frage\nbeantworten, welche Bedeutung Python als lauffähiger Pseudocode\n\nspeziell im Wissenschafts- und Hobbybereich hat. Python ist in diesem Bereich\neine sehr populäre Programmiersprache. Aber ich möchte auch Entwicklungen\nbenennen, die meiner Meinung nach dieser Popularität gefährlich werden könnten\nund auch anhand von anderen Umgebungen zeigen, was es eventuell zu integrieren\ngilt.\n\nÜber all dem steht mein Kredo, daß jedefrau und jedermann wenigstens ein wenig\nprogrammieren können sollte, weil sie sonst programmiert werden. Und ich\nglaube, daß Python immer noch die beste Einstiegssprache dafür ist.\n\n", "thumbnail_url": "http://i4.ytimg.com/vi/3gsKdEgA03w/hqdefault.jpg", "video_flv_url": ""}