{
  "alias": "video/1437/white-box-debugging-debugger-f-r-unittests-nut",
  "category": "PyCon DE 2012",
  "copyright_text": "",
  "description": "",
  "duration": null,
  "id": 1437,
  "language": "deu",
  "quality_notes": "",
  "recorded": "2012-10-31",
  "slug": "white-box-debugging-debugger-f-r-unittests-nut",
  "speakers": [
    "Reinhard Wobst"
  ],
  "summary": "\"White Box Testing\" ist das Testen von internen Zuständen zur Laufzeit,\nwährend ubliche Unittests in der Regel nur Funktionen rufen. Man kann\naber mittels eines Debuggers White Box Testing durchführen - ein\nPythonskript erlaubt dies fur Python mit pdb wie auch für C/C++ -\nProgramme mit gdb.\n\nUnittests sind ohne Frage unerlässlich, aber oft aufwändig zu\nprogrammieren und beschränkt aussagefähig, da in der Regel nur einzelne\nFunktionen oder Module als Black Box getestet werden können. Nicht\nselten ist sogar gesonderter Code notwendig, um sinnvolle Tests zu\nermöglichen.\n\nAussagekräftiger und naheliegender wären Tests auf Werte mitten im Code,\ndoch solch eine Funktionalität bietet bisher nur die assert-Anweisung,\ndie bei Fehlern mit einem wenig aussagekräftigen Abbruch endet.\n\nDie Idee des Python-Skripts \"wbd\" (\"white box debugging\") ist, aus\nKommentaren im Quelltext Konfigurationsfiles für Debugger zu erzeugen,\nso dass an bedingten Breakpoints Tests stattfinden. Beim Fehler landet\nman gleich im Debugger und kann die Umgebung analysieren.\n\nDas funktioniert derzeit für Pythonskripte und C/C++-Programme und ist\nauch gut als Hilfsmittel beim Debuggen selbst einzusetzen.\n",
  "tags": [],
  "thumbnail_url": "https://i3.ytimg.com/vi/26tmYQk2vI8/hqdefault.jpg",
  "title": "\"White Box Debugging\" - Debugger für Unittests nutzen",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/pyconde/pyconde2012/Vortrag_White_Box_Debugging_De.mp4?Signature=LgR%2Fs9%2F5Hgh37jNYY7RjN1YCORE%3D&Expires=1351851790&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=26tmYQk2vI8"
    }
  ]
}
