{
  "description": "This presentation begins by laying out the foundational components of sequence modeling - Perceptrons and RNN cells. We discuss inherent issues associated with RNNs, focusing on challenges such as handling long sequences and managing vanishing or exploding gradients.\n\nAttention mechanisms form the core of this lecture. We present a practical case of attention in translation tasks, followed by an in-depth examination of self-attention, a variant independent of external context. We unpack its motivations and explain its implementation process. We proceed with an exploration of the Transformer model and the way it leverages self-attention. \n\nThe final section is dedicated to the Generative Pretrained Transformers (GPT) series. We break down the architecture of GPT assessing its distinguishing features. We delve into zero-shot, one-shot, and few-shot learning, discussing how these models interact with prompts with limited training examples.\n\nSpeaker bio:\nAlon Oring is the Head of Research at Dynamic Infrastructure, a predictive maintenance startup focused on using computer vision to identify defects and risks in critical infrastructure before they evolve into large-scale failures. Since joining Dynamic Infrastructure in 2019, Alon has led the development of several core technologies that obtained state-of-the-art performance and are currently serving multiple customers worldwide. Additionally, Alon is an active lecturer on deep learning, machine learning, and data science at Reichman University (IDC Herzliya), international coding boot camps, and an active mentor for up-and-coming data scientists.\n\nFollow PyData Tel Aviv on:\nhttps://www.meetup.com/PyData-Tel-Aviv/\nhttps://www.linkedin.com/company/pydata-tlv\nhttps://www.facebook.com/PyDataTLV\nhttps://x.com/PyDataTLV\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1582,
  "language": "eng",
  "recorded": "2024-11-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/telaviv2024/"
    },
    {
      "label": "https://www.meetup.com/PyData-Tel-Aviv/",
      "url": "https://www.meetup.com/PyData-Tel-Aviv/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-tlv",
      "url": "https://www.linkedin.com/company/pydata-tlv"
    },
    {
      "label": "https://x.com/PyDataTLV",
      "url": "https://x.com/PyDataTLV"
    },
    {
      "label": "https://www.facebook.com/PyDataTLV",
      "url": "https://www.facebook.com/PyDataTLV"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/HAKgbLcSiVg/maxresdefault.jpg",
  "title": "Alon Oring: A Shallow Introduction to Self-Attention  | PyData Tel Aviv 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HAKgbLcSiVg"
    }
  ]
}
