{
  "description": "To get the song lyrics we had to use some scraping, and we have plenty of tips to share on this.\nWe use our own implementation of LZ compression to measure how repetitive a song is, based on similar work that was done for English pop charts. We explain why this is a good idea, and what alternatives we considered.\nWe analyze some interesting trends in the radio pop charts using pandas and provide visualization using plotly, which we've also made available through an interactive web interface.\n\nSpeaker Bio:\nI'm an M.Sc graduate of Tel-Aviv University in Computer Science and I work for Google on products that aim to make phone calls more tolerable.\nI've been excited about data and algorithms since I was young, and what I like even more is trying to get other to be as excited about them as I am.  \nI always try to pick projects that will interest the general public, or at least make them laugh.\n\n\nFollow PyData Tel Aviv on:\nhttps://www.meetup.com/PyData-Tel-Aviv/\nhttps://www.linkedin.com/company/pydata-tlv\nhttps://www.facebook.com/PyDataTLV\nhttps://x.com/PyDataTLV\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1406,
  "language": "eng",
  "recorded": "2024-11-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/telaviv2024/"
    },
    {
      "label": "https://www.meetup.com/PyData-Tel-Aviv/",
      "url": "https://www.meetup.com/PyData-Tel-Aviv/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-tlv",
      "url": "https://www.linkedin.com/company/pydata-tlv"
    },
    {
      "label": "https://x.com/PyDataTLV",
      "url": "https://x.com/PyDataTLV"
    },
    {
      "label": "https://www.facebook.com/PyDataTLV",
      "url": "https://www.facebook.com/PyDataTLV"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/jrKAtOsj1Lo/maxresdefault.jpg",
  "title": "Geva Kipper: Identifying Repetitive Songs using LZ Compression (HE) | PyData Tel Aviv 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jrKAtOsj1Lo"
    }
  ]
}
