{
  "description": "As the amount of data grows at an unprecedented rate, engineers face a critical challenge of efficiently processing and analyzing it. However, manual and time-consuming methods of familiarizing with data are still commonly used, despite the urgent need for shortcuts. In this talk, we review several automated EDA methods leveraging several Python libraries to research data, model it in distinct clusters and reduce time-to-insights.\nOur solution can be applied in various use cases, including data pre-processing for labeling, segmentation problems, and more.\nThis talk is an essential guide for lazy (and/or busy) engineers who want to streamline the process of data exploration and reduce the workload\n\nSpeaker Bio:\nHead of Data and Data scientists at Parazero, IoT and signal processing expert. \nCommunity lead and Mentor in WiDS. \nMSc mechanical engineering, researching fluid dynamic models.\n\n\nFollow PyData Tel Aviv on:\nhttps://www.meetup.com/PyData-Tel-Aviv/\nhttps://www.linkedin.com/company/pydata-tlv\nhttps://www.facebook.com/PyDataTLV\nhttps://x.com/PyDataTLV\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1434,
  "language": "eng",
  "recorded": "2024-11-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/telaviv2024/"
    },
    {
      "label": "https://www.meetup.com/PyData-Tel-Aviv/",
      "url": "https://www.meetup.com/PyData-Tel-Aviv/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-tlv",
      "url": "https://www.linkedin.com/company/pydata-tlv"
    },
    {
      "label": "https://x.com/PyDataTLV",
      "url": "https://x.com/PyDataTLV"
    },
    {
      "label": "https://www.facebook.com/PyDataTLV",
      "url": "https://www.facebook.com/PyDataTLV"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/g5d8f3CUffU/maxresdefault.jpg",
  "title": "Mor Hananovitz: The TL;DR of EDA (HE)  | PyData Tel Aviv 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=g5d8f3CUffU"
    }
  ]
}
