{
  "description": "Pandas and SQL are both great tools for data manipulation and analysis, yet they each come with their unique challenges. Pandas is handy and easy to use, especially for iterative research, but can slow down or crash with anything larger than a few gigabytes. SQL is efficient with huge datasets, but can be tricky and rigid when your analysis becomes more complex. \n\nIn our talk, we'll explore how these tools, instead of working against each other, can complement each other in your data science work. We'll show you how ibis can bring the python experience with the power of SQL environment, helping you get the best of both worlds.\n\nWe'll share our journey from complex distributed data science pipelines to jobs that can be run efficiently from a notebook. and share useful tips, common patterns and how to avoid frequent mistakes when working with ibis.\n\nJoin us as we show you how pandas and SQL can work together, making your data science tasks easier on any scale.\n\nSpeaker Bio:\nOmri is a Data Hacker, Maker, and LEGO builder. Currently, He is a Prinicipal Engineer at Walmart Global Tech\n\nFollow PyData Tel Aviv on:\nhttps://www.meetup.com/PyData-Tel-Aviv/\nhttps://www.linkedin.com/company/pydata-tlv\nhttps://www.facebook.com/PyDataTLV\nhttps://x.com/PyDataTLV\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1654,
  "language": "eng",
  "recorded": "2024-11-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/telaviv2024/"
    },
    {
      "label": "https://www.meetup.com/PyData-Tel-Aviv/",
      "url": "https://www.meetup.com/PyData-Tel-Aviv/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-tlv",
      "url": "https://www.linkedin.com/company/pydata-tlv"
    },
    {
      "label": "https://x.com/PyDataTLV",
      "url": "https://x.com/PyDataTLV"
    },
    {
      "label": "https://www.facebook.com/PyDataTLV",
      "url": "https://www.facebook.com/PyDataTLV"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/zXIivC1Hxys/maxresdefault.jpg",
  "title": "Omri Fima: Ibis framework, Making data science work at any scale (HE)  | PyData Tel Aviv 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zXIivC1Hxys"
    }
  ]
}
