{
  "description": "Unveiling the Journey of Natural Language Processing (NLP): Milestones, Limitations, and Practical Applications\n\nJoin us in this introductory lecture on Natural Language Processing (NLP) as we delve into a captivating exploration of the key milestones that have shaped the advancement of this dynamic field. Delving into notable developments and breakthroughs, we will provide a comprehensive overview of NLP's evolution to its current state, while also shedding light on existing limitations and persistent challenges. Furthermore, we will explore the practical implications of NLP advancements in day-to-day research conduct. Whether you are a data scientist, researcher, or simply curious about NLP, this lecture will equip you with a fundamental understanding of significant milestones, limitations, and practical applications of NLP. By the end of the session, you will gain valuable insights into the dynamic world of NLP and its profound impact on the field of research.\n\n\nSpeaker Bio:\nOrtal Ashkenazi is a seasoned NLP researcher with over four years of experience at Gong, where she specialized in transforming data into actionable insights using advanced language models. Prior to that, she worked as a software engineer for 2.5 years at Algotec, developing information systems and processing solutions in the field of medical imaging. Holding an MSc from the Technion, her thesis focused on generating medical screening questionnaires by analyzing social media data, bridging artificial intelligence with practical healthcare solutions. Her expertise lies in model evaluation and deploying production-ready NLP solutions that address real-world challenges.\n\n\nFollow PyData Tel Aviv on:\nhttps://www.meetup.com/PyData-Tel-Aviv/\nhttps://www.linkedin.com/company/pydata-tlv\nhttps://www.facebook.com/PyDataTLV\nhttps://x.com/PyDataTLV\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1356,
  "language": "eng",
  "recorded": "2024-11-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/telaviv2024/"
    },
    {
      "label": "https://www.meetup.com/PyData-Tel-Aviv/",
      "url": "https://www.meetup.com/PyData-Tel-Aviv/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-tlv",
      "url": "https://www.linkedin.com/company/pydata-tlv"
    },
    {
      "label": "https://x.com/PyDataTLV",
      "url": "https://x.com/PyDataTLV"
    },
    {
      "label": "https://www.facebook.com/PyDataTLV",
      "url": "https://www.facebook.com/PyDataTLV"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/QSOqFdff5_c/maxresdefault.jpg",
  "title": "Ortal Ashkenazi: Unveiling the Journey of NLP  | PyData Tel Aviv 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QSOqFdff5_c"
    }
  ]
}
