{
  "description": "Everything in Pandas comes down to the dtypes. And while most Pandas users are familiar with a variety of numeric and string dtypes, I've found that they're far less familiar with datetime and timedelta, two dtypes for working with dates and times. Pandas offers a great deal of functionality to work with them — and given how common it is to have date/time columns in our data, knowing how to work with them can be extremely useful.\n\nIn this talk, I'll introduce you to the datetime and timedelta dtypes, and particularly how we can read CSV data into Pandas in these forms. We'll see how you can sort and group your data using datetime values, and how you can extract pieces of datetime data with the \"dt\" accessor. We'll also see how you can create, manipulate, and compare values against \"timedelta\" values.\n\nThen we'll talk about indexes, and the host of functionality that we get when an index contains datetime values. We'll look at retrieving values with \"loc\", and also at the \"resample\" method that offers time-based grouping.\n\nBy the end of this talk, you'll have gained practical skills that you can apply to nearly any real-world data set you use.\n\nSpeaker Bio:\nReuven is a full-time trainer in Python and data science, teaching companies around the world via in-person, online, and recorded courses. He is the author of both \"Python Workout\" and \"Pandas Workout\" (Manning), and writes both \"Better Developers\" (weekly articles about Python) and \"Bamboo Weekly\" (weekly Pandas puzzles based on current events). Reuven lives with his wife and children in Modi'in, Israel.\n\n\nFollow PyData Tel Aviv on:\nhttps://www.meetup.com/PyData-Tel-Aviv/\nhttps://www.linkedin.com/company/pydata-tlv\nhttps://www.facebook.com/PyDataTLV\nhttps://x.com/PyDataTLV\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1673,
  "language": "eng",
  "recorded": "2024-11-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/telaviv2024/"
    },
    {
      "label": "https://www.meetup.com/PyData-Tel-Aviv/",
      "url": "https://www.meetup.com/PyData-Tel-Aviv/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-tlv",
      "url": "https://www.linkedin.com/company/pydata-tlv"
    },
    {
      "label": "https://x.com/PyDataTLV",
      "url": "https://x.com/PyDataTLV"
    },
    {
      "label": "https://www.facebook.com/PyDataTLV",
      "url": "https://www.facebook.com/PyDataTLV"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/J-7xcs8nq7s/maxresdefault.jpg",
  "title": "Reuven M. Lerner: Times and Dates in Pandas | PyData Tel Aviv 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=J-7xcs8nq7s"
    }
  ]
}
