{
  "description": "Empowering ML Developers with Self Serve Data Analytics\n\nMobileye primarily focuses on algorithmic (ML/DL) development. Approximately 70% of our development time is dedicated to data-oriented tasks with large-scale data analysis being one of our major challenges. \nTo address this challenge, we've developed a solution that empowers developers to build data applications for large-scale data analysis using simple Python code which are then transformed into web dashboards.  \nWe will present our system architecture and SDK that facilitates the apps development while abstracting the complexity of both visualization and writing queries over big data framework.\n\nSpeaker Bio:\nRoman Olshanskiy is with over 10 years of experience as a software engineer and leader in various domains, including backend, frontend, cloud computing, big data, and infrastructure, I am passionate about building innovative and efficient solutions, fostering collaboration, and bringing teams together to reach new heights.\n\nDavid Katz is a Software Engineer​ at Mobileye, specializing in self-service big data analytics platforms. \nWith extensive experience in big data engineering, he has a strong background in developing and optimizing large-scale data pipelines using Python, PySpark, and AWS.    \nDavid has also contributed to open-source projects in the Python data ecosystem. (https://github.com/DavidKatz-il)\n\n\n\nFollow PyData Tel Aviv on:\nhttps://www.meetup.com/PyData-Tel-Aviv/\nhttps://www.linkedin.com/company/pydata-tlv\nhttps://www.facebook.com/PyDataTLV\nhttps://x.com/PyDataTLV\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1270,
  "language": "eng",
  "recorded": "2024-11-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/telaviv2024/"
    },
    {
      "label": "https://x.com/PyDataTLV",
      "url": "https://x.com/PyDataTLV"
    },
    {
      "label": "https://github.com/DavidKatz-il",
      "url": "https://github.com/DavidKatz-il"
    },
    {
      "label": "https://www.meetup.com/PyData-Tel-Aviv/",
      "url": "https://www.meetup.com/PyData-Tel-Aviv/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-tlv",
      "url": "https://www.linkedin.com/company/pydata-tlv"
    },
    {
      "label": "https://www.facebook.com/PyDataTLV",
      "url": "https://www.facebook.com/PyDataTLV"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/tfOY0qTPbWs/maxresdefault.jpg",
  "title": "Roman Olshanskiy & David Katz: Empowering ML Developers (HE) | PyData Tel Aviv 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tfOY0qTPbWs"
    }
  ]
}
