{
  "description": "AIOps for Security: SaaS Compliance Automation with a Python Stack\n\nAutomating the management of a large number of applications can be a daunting task, but the Python ecosystem offers exceptional tools to aid in compliance and security posture for SaaS apps. By utilizing AI to collect information from various sources, such as social media, continuous risk assessment for each application is possible, resulting in a comprehensive application catalog.\n\nDuring this talk, we will explore how we achieved this using a Python-based best-of-breed stack, which includes PyAthena and PySpark for querying, aggregating, and extracting pertinent information from the Hadoop stack. Additionally, we utilized the NLTK package in conjunction with Sklearn to analyze complex social media data using NLP techniques like stemming, tokenization, and classification to score sentiment through a Linear Regression model. Combining this sentiment analysis score with the application’s network data and the Hadoop Stack with PySpark package enabled us to gain insights into the application. The analysis results and final insights were stored in MongoDB using PyMongo, which served as the primary database for the project.\n\nBy the end of this presentation, you will have a clear understanding of how to replicate this architecture and build your own AI-automation stack using Python, with a real-world example as a guide.\n\n\nSpeaker Bio:\nTomer is a security research team lead in Cato Research Labs at Cato Networks, with a keen interest in various aspects of cybersecurity, including reverse engineering, network protocol analysis, and detecting malicious traffic. Additionally, Tomer is enthusiastic about machine learning and thrives on tackling intricate challenges within this field. Presently, his main area of focus is network-based security research, where he endeavors to devise innovative approaches for detecting threats in corporate network \nsettings.\n\n\nFollow PyData Tel Aviv on:\nhttps://www.meetup.com/PyData-Tel-Aviv/\nhttps://www.linkedin.com/company/pydata-tlv\nhttps://www.facebook.com/PyDataTLV\nhttps://x.com/PyDataTLV\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1286,
  "language": "eng",
  "recorded": "2024-11-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/telaviv2024/"
    },
    {
      "label": "https://www.meetup.com/PyData-Tel-Aviv/",
      "url": "https://www.meetup.com/PyData-Tel-Aviv/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-tlv",
      "url": "https://www.linkedin.com/company/pydata-tlv"
    },
    {
      "label": "https://x.com/PyDataTLV",
      "url": "https://x.com/PyDataTLV"
    },
    {
      "label": "https://www.facebook.com/PyDataTLV",
      "url": "https://www.facebook.com/PyDataTLV"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ISxz4HKt9mI/maxresdefault.jpg",
  "title": "Tomer Doitshman: SaaS Compliance Automation with a Python Stack  (HE)  | PyData Tel Aviv 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ISxz4HKt9mI"
    }
  ]
}
