{
  "description": "The Apache parquet file format offers convenient columnar-based data access and is popular in both Python-based (i.e., Pandas) and big data frameworks.  In this talk, we will dive into the details of how parquet files are saved, advantages and disadvantages of this format, and how the Row Groups feature can solve performance challenges and reduce cloud costs, providing a good balance between column and row-wise access (necessary in cloud object storage solutions such as AWS S3, for example). In addition to discussing some technical background, we will also demonstrate how it can be implemented efficiently.\n\nSpeaker Bio:\nMenachem Kluft - Senior Backend Developer in Mobileye.\nUri Mogilevsky - Technical lead in Mobileye.\nWe're part of a group creating a data processing infrastructure. This system serves different groups, addresses various needs, and tackles challenging data processing tasks across the entire company.\n\n\nFollow PyData Tel Aviv on:\nhttps://www.meetup.com/PyData-Tel-Aviv/\nhttps://www.linkedin.com/company/pydata-tlv\nhttps://www.facebook.com/PyDataTLV\nhttps://x.com/PyDataTLV\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1775,
  "language": "eng",
  "recorded": "2024-11-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/telaviv2024/"
    },
    {
      "label": "https://www.meetup.com/PyData-Tel-Aviv/",
      "url": "https://www.meetup.com/PyData-Tel-Aviv/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-tlv",
      "url": "https://www.linkedin.com/company/pydata-tlv"
    },
    {
      "label": "https://x.com/PyDataTLV",
      "url": "https://x.com/PyDataTLV"
    },
    {
      "label": "https://www.facebook.com/PyDataTLV",
      "url": "https://www.facebook.com/PyDataTLV"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/eXdfYiJmMUQ/maxresdefault.jpg",
  "title": "Uri & Menachem: Using Row Groups for fast filtering of large parquet files (HE)|PyData Tel Aviv 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eXdfYiJmMUQ"
    }
  ]
}
