{
  "description": "Did you ever wonder: \"What if there was a tool to handle biggish data?\" You do not have terabytes of data, but using just Python with Pandas didn't quite work, and now you are using tools like Apache Spark and Trino with all their complexity. And what the hell is biggish data anyway?  \nIt is time to declare: Not all Big Data is created equal, and therefore, not all Big Data needs the same tools to process and query.  \nFirst I want to explain what biggish data is. Then, I will show you how incorporating DuckDB into your Python project, you can relinquish all those complex data analysis and processing tools when dealing with biggish data. Let's delve together into the many possibilities DuckDB offers using Python when processing data, and I hope you will see how this opens a whole new set of options for you.\n\nSpeaker Bio:\nYoav Nordmann is a Backend & Data Architect and Tech Lead with over 20 years of experience. At Tikal he holds the position of a Group Leader mentoring fellow workers. He is passionate about new and emerging technologies, knowledge sharing and a fierce advocate for open source. Being in the industry for so long gives him a sense of perspective on different languages, architectures, and hypes.\n\n\nFollow PyData Tel Aviv on:\nhttps://www.meetup.com/PyData-Tel-Aviv/\nhttps://www.linkedin.com/company/pydata-tlv\nhttps://www.facebook.com/PyDataTLV\nhttps://x.com/PyDataTLV\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1497,
  "language": "eng",
  "recorded": "2024-11-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/telaviv2024/"
    },
    {
      "label": "https://www.meetup.com/PyData-Tel-Aviv/",
      "url": "https://www.meetup.com/PyData-Tel-Aviv/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-tlv",
      "url": "https://www.linkedin.com/company/pydata-tlv"
    },
    {
      "label": "https://x.com/PyDataTLV",
      "url": "https://x.com/PyDataTLV"
    },
    {
      "label": "https://www.facebook.com/PyDataTLV",
      "url": "https://www.facebook.com/PyDataTLV"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/wjhMB4XhQxQ/maxresdefault.jpg",
  "title": "Yoav Nordmann: Processing Biggish Data with DuckDB and Python (HE)  | PyData Tel Aviv 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wjhMB4XhQxQ"
    }
  ]
}
