{
  "description": "2D ARIMA: Capturing New Trends for Distant Time Horizons in Cohort Revenue Forecasting\n\nWe are proud to introduce the \"Two-Dimensional ARIMA\" method - a novel technique we designed to enhance ARIMA models for today's forecasting demands.\nThis approach elevates the capabilities of traditional ARIMA by adeptly capturing emerging trends for extended forecasting horizons in cohort revenue predictions.\nIn this presentation, we'll illuminate its core principles:\nVersatility: Crafted for any cohort revenue forecasts.\nResponsiveness: Incorporating both recent and long-term data for swift market response.\nSynergy: time-centric elements, seasonal variations, and overarching trends to produce a cohesive forecast.\n\nSpeaker Bio:\nYonathan Guttel is a Data Scientist at Lightricks, serving in the Business DS team. In this role, he aids the marketing and finance sectors by crafting models, tools, and pipelines, refining revenue forecasts and marketing strategies.\n\n\nFollow PyData Tel Aviv on:\nhttps://www.meetup.com/PyData-Tel-Aviv/\nhttps://www.linkedin.com/company/pydata-tlv\nhttps://www.facebook.com/PyDataTLV\nhttps://x.com/PyDataTLV\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1272,
  "language": "eng",
  "recorded": "2024-11-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/telaviv2024/"
    },
    {
      "label": "https://www.meetup.com/PyData-Tel-Aviv/",
      "url": "https://www.meetup.com/PyData-Tel-Aviv/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-tlv",
      "url": "https://www.linkedin.com/company/pydata-tlv"
    },
    {
      "label": "https://x.com/PyDataTLV",
      "url": "https://x.com/PyDataTLV"
    },
    {
      "label": "https://www.facebook.com/PyDataTLV",
      "url": "https://www.facebook.com/PyDataTLV"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/97nfRfn1JS4/maxresdefault.jpg",
  "title": "Yonathan Guttel:  2D ARIMA, Capturing New Trends for Distant Time Horizons(HE)| PyData Tel Aviv 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=97nfRfn1JS4"
    }
  ]
}
