{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 4, Wednesday \nMitxelena. Talk. 12.00\n\nModern Data Science: A new approach to DataFrames and pipelines\nMaarten Breddels, Jovan Veljanoski\n\nWe will demonstrate how to explore and analyse massive datasets  on a laptop with the Vaex library in Python. Using computational graphs, efficient algorithms and storage (Apache Arrow / hdf5) Vaex can easily handle up to a billion rows.\n\nWorking with datasets comprising millions or billions of samples is an increasingly common task, one that is typically tackled with distributed computing. Nodes in high-performance computing clusters have enough RAM to run intensive and well-tested data analysis workflows. More often than not, however, this is preceded by the scientific process of cleaning, filtering, grouping, and other transformations of the data, through continuous visualizations and correlation analysis. In today’s work environments, many data scientists prefer to do this on their laptops or workstations, as to more effectively use their time and not to rely on spotty internet connection to access their remote data and computation resources. Modern laptops have sufficiently fast I/O SSD storage, but upgrading RAM is expensive or impossible.\n\nApplying the combined benefits of computational graphs, which are common in neural network libraries, with delayed (a.k.a lazy) evaluations to a DataFrame library enables efficient memory and CPU usage. Together with memory-mapped storage (Apache Arrow, hdf5) and out-of-core algorithms, we can process considerably larger data sets with fewer resources. As an added bonus, the computational graphs ‘remember’ all operations applied to a DataFrame, meaning that data processing pipelines can be generated automatically.\n\nIn this talk, we will demonstrate Vaex, an open-source DataFrame library that embodies these concepts. Using data from the New York City YellowCab taxi service comprising 1.1 billion samples and taking up over 170 GB on disk, we will showcase how one can conduct an exploratory data analysis, complete with filtering, grouping, calculations of statistics and interactive visualisations on a single laptop in real time. Finally we will show an example of how one can automatically build a machine learning pipeline as a by-product of the exploratory data analysis using the computational graphs in Vaex.\n\nDomains – Astronomy, Big Data, Data Visualisation, Jupyter, Machine Learning, Open Source, Vector and array manipulation \nDomain Expertise – none \nPython Skill Level – basic \nProject Homepage / Git – https://github.com/vaexio/vaex \nAbstract as a tweet – We will use #Vaex to explore and analyse a massive dataset on a laptop in real time. Using computational graphs, efficient algorithms and storage (Apache Arrow / hdf5) Vaex can easily handle up to a billion rows.",
  "duration": 2166,
  "published_at": "2019-10-27T17:49:55.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/85f9SWgWj1Q/hqdefault.jpg",
  "title": "EuroSciPy 2019 Bilbao - Modern Data Science - Maarten and Jovan",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=85f9SWgWj1Q"
    }
  ]
}