{
  "description": "Having been around for two decades, QGIS clearly is an organically grown\nproject. It has primarily been fulfilling the various special needs of\nits developers. From an outsider's perspective, it is an amazingly rich\npatchwork of features. However, some are deeply hidden in numerous\nlayers of user interface elements, requiring intense training for\ngetting used to. Others are only accessibly through APIs, requiring not\nonly training but also programming skills.\n\nBeing confronted with QGIS as professional users on a regular basis, we\nthought about what would make working with QGIS more attractive. What if\nQGIS has a pleasant, coherent theme, including not only colors but also\nicons? What if QGIS had the ability to store workbench configurations?\nWhat if QGIS had dedicated interface configurations for specific\nworkflows? What if much more of the API's functionality was accessible\nthrough the GUI in a well-organized way? How could QGIS work in a useful\nmanner with ribbons? How could the incredible amount of dialogs be tamed\ninto tabs?\n\nWe demonstrate (live) a series of user interface experiments – all of\nwhich are or will be `available online <https://github.com/qgist>`__ as\nPython plugins.\n\nIn this context, the current state of play with respect to Python and\nQGIS is explained in detail. The way QGIS is typically being distributed\nputs quite a few unusual limitations on Python plugin code. The case is\nmade that some of those limitations are simply out of date and must be\novercome, which may require help from the broader (scientific) Python\ncommunity.\n\nWe seek a conversation with the audience.\n\nHow can one of the largest code bases in open source Geographical\nInformation Science – QGIS – be enhanced and re-designed? Through the\npowers of Python plugins. This talk demonstrates concepts on how to make\nQGIS more user- friendly.\n",
  "duration": 813,
  "language": "eng",
  "published_at": "2020-03-06T12:30:17.000Z",
  "recorded": "2019-09-05",
  "speakers": [
    "Sebastian M. Ernst"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/mRJVIhRKA60/hqdefault.jpg",
  "title": "Enhancing & re-designing the QGIS user interface – a deep dive",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mRJVIhRKA60"
    }
  ]
}
