{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 5, Thursday \nOteiza. Talk. 15.15\n\nemzed: a Python based framework for analysis of mass-spectrometry data\nUwe Schmitt \n\nThis talk is about emzed, a Python library to support biologists with little programming knowledge to implement ad-hoc analyses as well as workflows for mass-spectrometry data.\n\nMany of the existing mass spectrometry data analysis tools are desktop applications designed for specific applications without support for customization. In addition, many of the commercial solutions offer no or only limited functionality for exporting results.\n\nIn addition, the existing programming libraries in this area are scattered across different languages, mostly R, Java and Python.\n\nAs a result, data analysis in this area often consists of manual import/export steps from/to various tools and self-developed scripts that prevent the reproducibility of results obtained or automated execution on high-performance infrastructures.\n\nemzed tries to avoid these problems by integrating existing libraries and tools from Python, R (and in the near future also Java) into an easy-to-use API.\n\nTo support workflow development and increase confidence in end results\n\nemzed also offers tools for interactive visualization of mass spectrometry related data structures.\n\nThe presentation introduces basics and concepts of emzed, some lessons learned and current development of the next version of emzed.\n\nDomain Expertise – none \nDomains – Data Visualisation, Open Source, \nAbstract as a tweet – emzed: reproducible LCMS analysis with Python the easy way \nProject Homepage / Git – http://emzed.ethz.ch/ \nPython Skill Level – basic",
  "duration": 1738,
  "published_at": "2020-03-06T15:07:48.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/zc7EDqezjSQ/hqdefault.jpg",
  "title": "EuroSciPy 2019 Bilbao - emzed: a framework for analysis of mass-spectrometry data - Uwe Schmitt",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zc7EDqezjSQ"
    }
  ]
}