{
  "description": "QuTiP is emerging as a library at the center of a lively ecosystem. In\nthis talk you will learn about the ongoing projects that have invested\nthis project, from providing the framework to simulate quantum machine\nlearning for quantum computers to the development of efficient numerical\nsolvers tackling dynamical problems that are inherently hard to simulate\nclassically.\n\nIt can be noted that\nAstropy <https://www.astropy.org/affiliated/index.html> is a\ncommunity effort to develop a common core package for Astronomy in\nPython and \"foster an ecosystem of interoperable astronomy packages\",\n\nIt seems an interesting model for the quantum tech landscape.\nQiskit <> did build its own ecosystem of sub-libraries for quantum\ncomputing. The physics library for quantum tech is http://qutip.org .\n\nAbout the idea of QuTiP as a super-library, here are some details:\n\n-  | krotov, a very recent package for optimal control built on top\n     of QuTiP ( https://arxiv.org/abs/1902.11284).\n   | [https://github.com/qucontrol/krotov].\n\n-  piqs, the permutational invariant quantum solver, now a QuTiP\n   module (see also https://arxiv.org/abs/1805.05129 );\n\n-  matsubara, a plugin to study the ultrastrong coupling regime with\n   structured baths, http://matsubara.readthedocs.io/\n\n-  QNET, a computer algebra package for quantum mechanics and\n   photonic quantum networks, which actually calls QuTiP as a plugin,\n   mainly developed at Stanford in Mabuchi Lab\n   https://github.com/mabuchilab/QNET\n\n-  qptomographer,\n   https://qptomographer.readthedocs.io/en/latest/install, a library to\n   derive error bars for experiments in quantum computing and quantum\n   information processing.\n\n-  tiqs, a library to study open quantum systems on extended\n   lattices exploiting the symmetries of such systems,\n   https://github.com/fminga/tiqs\n\n-  other upcoming integrations relative to pulse control, such as\n   qupulse,\n   https://github.com/qutech/qupulse/wiki/Architecture-Proposal\n\nThis talk will be of interest to the curious coder and researcher,\nanalyzing how QuTiP's impact in the research community has fostered a\n*lingua franca* for quantum tech\nresearch <https://twitter.com/goerz/status/1118739088595652611>. We\nwill also draw comparisons with other larger ecosystems in Python-based\nscientific projects, such as astropy and scikit-learn.\n\nMore about QuTiP\n================\n\n-  QuTiP is the open-source software to study quantum physics. It\n   develops both an intuitive playground to understand quantum mechanics\n   and cutting-edge tools to investigate it.\n-  QuTiP provides the most comprehensive toolbox to characterize noise\n   and dissipation –realistic processes– affecting quantum systems, as\n   well as tools not only to monitor but also to minimize their impact\n   (quantum optimal control, description of decoherence-free spaces).\n-  For this reason QuTiP is a software born out of the quantum optics\n   community and that has become increasingly relevant for the quantum\n   computing community, as current quantum computing devices are noisy\n   (NISQ definition by Preskill).\n-  pypinfo data shows that QuTiP is popular in countries that are\n   strong in quantum tech and quantum computing research, eg, The\n   Netherlands in the top five, as well as countries that benefit in the\n   use of open source software (OSS) for university coursework, eg,\n   India.\n-  In the past three years, there has been an evolution in the quantum\n   tech community, which has embraced OSS.\n-  OSS libraries are used as a means to grow the user base, as well as\n   in a more structural way for quantum computers, as they provide cloud\n   access to quantum devices, e.g., IBM Q.\n-  QuTiP is the only major library that has continued to thrive in this\n   ecosystem, competing with other library packages that are funded by\n   corporations or VC-backed startups/\n-  Since the tools of QuTiP provide a common ground to study quantum\n   mechanics, it is important that this independent project is provided\n   with the necessary support to thrive\n-  As access to quantum computers becomes more and more widespread also\n   for the use of data scientist and QuTiP's popularity grows even more\n   for undergraduate and graduate courses, becoming the de-facto\n   standard OSS to study quantum optical systems, it is imperative that\n   the QuTiP library makes a quality jump to provide a comprehensive\n   introduction to its tools for a much broader community of users.\n\n-  QuTiP website: http://www.qutip.org/\n\n-  GitHub repository: https://github.com/qutip\n-  GitHub repository (QuTiP code): https://github.com/qutip/qutip\n-  GitHub repository (QuTiP documentation):\n   https://github.com/qutip/qutip-doc\n-  GitHub repository (QuTiP tutorials):\n   https://github.com/qutip/qutip-notebooks\n-  | Latest version of the documetnation:\n   | http://qutip.org/docs/latest/index.html\n\n-  Historical archive of released documentation:\n   http://qutip.org/documentation.html\n\nQuTiP core development team\n---------------------------\n\nQuTiP core development team: (Alex Pitchford, alex.pitchford@gmail.com).\nAdditional mentors will be the project's core contributors Nathan\nShammah (nathan.shammah@gmail.com), Shahnawaz Ahmed\n(shahnawaz.ahmed95@gmail.com) and Eric Giguere\n(eric.giguere@usherbrooke.ca).\n\nQuTiP is a project started by Robert J. Johansson and Paul Nation. Other\ncore developers have been Arne Grimso, Chris Granade and over other 44\ncontributors.\n\nReferences\n----------\n\n[1] J. R. Johansson, P. D. Nation, and F. Nori: “QuTiP: An open-source\nPython framework for the dynamics of open quantum systems.”, Comp. Phys.\nComm. 183, 1760–1772 (2012)\n\n[2] J. Robert Johansson, Paul D. Nation, and Franco Nori: “QuTiP 2: A\nPython framework for the dynamics of open quantum systems.”, Comp. Phys.\nComm. 184, 1234 (2013)\n\n[3] J. Preskill, \"Quantum Computing in the NISQ era and beyond.\" Quantum\n**2** , 79 (2018)\n\n[4] Mark Fingerhuth, Tomáš Babej, and Peter Wittek, Open source software\nin quantum computing, PLoS ONE 13 (12): e0208561 (2018).\n\n[5] N. Shammah, S. Ahmed, N. Lambert, S. De Liberato, and F. Nori, \"Open\nquantum systems with local and collective incoherent processes:\nEfficient numerical simulation using permutational invariance \" Phys.\nRev. A 98, 063815 (2018). Code at http://piqs.readthedocs.io\n\n[6] N. Lambert, S. Ahmed, M. Cirio, and F. Nori, \"Virtual excitations in\nthe ultra-strongly-coupled spin-boson model: physical results from\nunphysical modes\", arXiv preprint arXiv:1903.05892. Also\nhttp://matsubara.readthedocs.io\n\n**Other relevant material** :\n\n-  Slides on QuTiP and the quantum-tech open source ecosystem (Nathan\n   Shammah @ Berkeley Lab, 2019).\n   PDF <https://conferences.lbl.gov/event/195/session/6/contribution/13/material/slides/0.pdf>\n\n-  \"The rise of open source in quantum physics\n   research\" <http://blogs.nature.com/onyourwavelength/2019/01/09/the-rise-of-open-source-in-quantum-physics-research/>,\n   Nathan Shammah and Shahnawaz Ahmed, Nature's physics blog, January 9,\n   2019.\n\n-  \"Bit to QuBit: Data in the age of quantum computers\", Shahnawaz\n   Ahmed, PyData 2018, Warsaw, Poland, 2019. YouTube\n   video <https://www.youtube.com/watch?v=6GAXJhL1mSs>.\n\nIn this talk you will learn how QuTiP, the quantum toolbox in Python\n(http://qutip.org), has emerged from a library to an *ecosystem*. QuTiP\nis used for education, to teach quantum physics. In research and\nindustry, for quantum computing simulation.\n",
  "duration": 1926,
  "language": "eng",
  "published_at": "2019-12-01T09:15:48.000Z",
  "recorded": "2019-09-04",
  "speakers": [
    "Nathan Shammah",
    "Alexander Pitchford"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/pt4CSLwQK5U/hqdefault.jpg",
  "title": "QuTiP: the quantum toolbox in Python as an ecosystem for quantum physics exploration and quantum information science",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pt4CSLwQK5U"
    }
  ]
}
