{
  "description": "Open source and open science come together when the software is\naccessible, transparent, and owned by all. For data analysis pipelines\nthat grow in complexity beyond a single Jupyter notebook, this can\nbecome a challenge as the number of steps and software dependencies\nincrease. In this talk, Nicholas Del Grosso will review a variety of\ntools for packaging and managing a data analysis pipeline, showing how\nthey fit together and benefit the development, testing, deployment, and\npublication processes and the scientific community. In particular, this\ntalk will cover:\n\n-  **Workflow managers** (e.g. Snakemake, PyDoit, Luigi) to combine\n   complex pipelines into single applications.\n\n-  **Container Solutions** (e.g. Docker and Singularity) to package and\n   deploy the software on others' computers, including high-performance\n   computing clusters.\n\n-  **The Scientific Filesystem** to build explorable and multi-purpose\n   applications.\n\n-  **Testing Frameworks** (e.g. PyTest, Hypothesis) to declare and\n   confirm the assumptions and functionality of the analysis pipeline.\n\n-  **Ease-of-Use Utilities** to share the pipeline online and make it\n   accessible to non-programmers.\n\nBy writing software that stays manageable, reproducible, and deployable\ncontinuously throughout the development cycle, we can better fulfill the\ngoals of open science and good scientific practice in a digital era.\n\nA review of DevOps tools as applied to data analysis pipelines,\nincluding workflow managers, software containers, testing frameworks,\nand online repositories for performing reproducible science that scales.\n",
  "duration": 1832,
  "language": "eng",
  "published_at": "2019-12-02T12:06:20.000Z",
  "recorded": "2019-09-04",
  "speakers": [
    "Nicholas Del Grosso"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/VldeBnFQ-Y8/hqdefault.jpg",
  "title": "Scientific DevOps: Designing Reproducible Data Analysis Pipelines with Containerized Workflow Managers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VldeBnFQ-Y8"
    }
  ]
}
