{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 4, Wednesday \nOteiza Track. Talk. 14:45\n\nScientific DevOps: Designing Reproducible Data Analysis Pipelines with Containerized Workflow Managers\nNicholas Del Grosso \n\nA review of DevOps tools as applied to data analysis pipelines, including workflow managers, software containers, testing frameworks, and online repositories for performing reproducible science that scales.\n\nOpen source and open science come together when the software is accessible, transparent, and owned by all. For data analysis pipelines that grow in complexity beyond a single Jupyter notebook, this can become a challenge as the number of steps and software dependencies increase. In this talk, Nicholas Del Grosso will review a variety of tools for packaging and managing a data analysis pipeline, showing how they fit together and benefit the development, testing, deployment, and publication processes and the scientific community. In particular, this talk will cover:\n\n    Workflow managers (e.g. Snakemake, PyDoit, Luigi) to combine complex pipelines into single applications.\n\n    Container Solutions (e.g. Docker and Singularity) to package and deploy the software on others' computers, including high-performance computing clusters.\n\n    The Scientific Filesystem to build explorable and multi-purpose applications.\n\n    Testing Frameworks (e.g. PyTest, Hypothesis) to declare and confirm the assumptions and functionality of the analysis pipeline.\n\n    Ease-of-Use Utilities to share the pipeline online and make it accessible to non-programmers.\n\nBy writing software that stays manageable, reproducible, and deployable continuously throughout the development cycle, we can better fulfill the goals of open science and good scientific practice in a digital era.\n\nDomains – Open Source, Scientific data flow and persistence\nDomain Expertise – some \nPython Skill Level – professional \nAbstract as a tweet – DevOps in science--making data analysis shareable, reproducible, and open!",
  "duration": 1832,
  "published_at": "2019-12-02T12:06:20.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/VldeBnFQ-Y8/hqdefault.jpg",
  "title": "EuroSciPy 2019 Bilbao - Scientific DevOps - Nicholas Del Grosso",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VldeBnFQ-Y8"
    }
  ]
}