{
  "description": "Working with datasets comprising millions or billions of samples is an\nincreasingly common task, one that is typically tackled with distributed\ncomputing. Nodes in high-performance computing clusters have enough RAM\nto run intensive and well-tested data analysis workflows. More often\nthan not, however, this is preceded by the scientific process of\ncleaning, filtering, grouping, and other transformations of the data,\nthrough continuous visualizations and correlation analysis. In today’s\nwork environments, many data scientists prefer to do this on their\nlaptops or workstations, as to more effectively use their time and not\nto rely on spotty internet connection to access their remote data and\ncomputation resources. Modern laptops have sufficiently fast I/O SSD\nstorage, but upgrading RAM is expensive or impossible.\n\nApplying the combined benefits of computational graphs, which are common\nin neural network libraries, with delayed (a.k.a lazy) evaluations to a\nDataFrame library enables efficient memory and CPU usage. Together with\nmemory-mapped storage (Apache Arrow, hdf5) and out-of-core algorithms,\nwe can process considerably larger data sets with fewer resources. As an\nadded bonus, the computational graphs ‘remember’ all operations applied\nto a DataFrame, meaning that data processing pipelines can be generated\nautomatically.\n\nIn this talk, we will demonstrate Vaex, an open-source DataFrame library\nthat embodies these concepts. Using data from the New York City\nYellowCab taxi service comprising 1.1 billion samples and taking up over\n170 GB on disk, we will showcase how one can conduct an exploratory data\nanalysis, complete with filtering, grouping, calculations of statistics\nand interactive visualisations on a single laptop in real time. Finally\nwe will show an example of how one can automatically build a machine\nlearning pipeline as a by-product of the exploratory data analysis using\nthe computational graphs in Vaex.\n\nWe will demonstrate how to explore and analyse massive datasets (>150GB)\non a laptop with the Vaex library in Python. Using computational graphs,\nefficient algorithms and storage (Apache Arrow / hdf5) Vaex can easily\nhandle up to a billion rows.\n",
  "duration": 2166,
  "language": "eng",
  "published_at": "2019-10-27T17:49:55.000Z",
  "recorded": "2019-09-04",
  "speakers": [
    "Jovan Veljanoski",
    "Maarten Breddels"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/85f9SWgWj1Q/hqdefault.jpg",
  "title": "Modern Data Science: A new approach to DataFrames and pipelines",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=85f9SWgWj1Q"
    }
  ]
}
