{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 4, Wednesday \nBaroja Track. Talk. 14.45\n\nConstrained Data Synthesis\nNick Radcliffe \n\nWe introduce a method for creating synthetic data \"to order\" based on learned (or provided) constraints and data classifications. This includes \"good\" and \"bad\" data.\n\nSynthetic data is useful in many contexts, including\n\n    providing \"safe\", non-private alternatives to data containing personally identifiable information\n    software and pipeline testing\n    software and service development\n    enhancing datasets for machine learning.\n\nSynthetic data is often created on a bespoke basis, and since the advent of generative adverserial networks (GANs) there has been considerable interest and experimentation with using those as the basis for creating synthetic data.\n\nWe have taken a different approach. We have worked for some years on developing methods for automatically finding constraints that characterise data, and which can be used for testing data validity (so-called \"test-driven data analysis\", TDDA). Such constraints form (by design) a useful characterisation of the data from which they were generated. As a result, methods that generate datasets that match the constraints necessarily construct datasets that match many of the original characteristics of the data from which the constraints were extracted.\n\nAn important aspect of datasets is the relationship between \"good\" (~ valid) and \"bad\" (~ invalid) data, both of which are typically present. Systems for creating useful, realistic synthetic data generally need to be able to synthesize both kinds, in realistic mixtures.\n\nThis talk will discuss data synthesis from constraints, describing what has been achieved so far (which includes synthesizing good and bad data) and future research directions.\n\nDomains – Big Data, Machine Learning, Simulation \nDomain Expertise – some \nPython Skill Level – professional \nProject Homepage / Git – https://github.com/tdda \nAbstract as a tweet – Creating good and bad synthetic data to order using constraints",
  "duration": 1482,
  "published_at": "2019-12-01T09:58:56.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/YtIBSr2dAtI/hqdefault.jpg",
  "title": "EuroSciPy 2019 Bilbao - Constrained Data Synthesis - Nick Radcliffe",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YtIBSr2dAtI"
    }
  ]
}