{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 5, Thursday \nMitxelena. Talk. 16.45\n\nEnhancing & re-designing the QGIS user interface – a deep dive\nSebastian M. Ernst \n\nHow can one of the largest code bases in open source Geographical Information Science – QGIS – be enhanced and re-designed? Through the powers of Python plugins. This talk demonstrates concepts on how to make QGIS more user-friendly.\n\nHaving been around for two decades, QGIS clearly is an organically grown project. It has primarily been fulfilling the various special needs of its developers. From an outsider's perspective, it is an amazingly rich patchwork of features. However, some are deeply hidden in numerous layers of user interface elements, requiring intense training for getting used to. Others are only accessibly through APIs, requiring not only training but also programming skills.\n\nBeing confronted with QGIS as professional users on a regular basis, we thought about what would make working with QGIS more attractive. What if QGIS has a pleasant, coherent theme, including not only colors but also icons? What if QGIS had the ability to store workbench configurations? What if QGIS had dedicated interface configurations for specific workflows? What if much more of the API's functionality was accessible through the GUI in a well-organized way? How could QGIS work in a useful manner with ribbons? How could the incredible amount of dialogs be tamed into tabs?\n\nWe demonstrate (live) a series of user interface experiments – all of which are or will be available online as Python plugins.\n\nIn this context, the current state of play with respect to Python and QGIS is explained in detail. The way QGIS is typically being distributed puts quite a few unusual limitations on Python plugin code. The case is made that some of those limitations are simply out of date and must be overcome, which may require help from the broader (scientific) Python community.\n\nWe seek a conversation with the audience.\n\nAbstract as a tweet – The QGIS user interface can, has been and will be further improved - through Python! \nProject Homepage / Git – https://github.com/qgist \nPython Skill Level – professional \nProject Homepage / Git – https://github.com/qgist \nDomain Expertise – some \nDomains – Data Visualisation, Earth, Ocean and Geo Science",
  "duration": 813,
  "published_at": "2020-03-06T12:30:17.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/mRJVIhRKA60/hqdefault.jpg",
  "title": "EuroSciPy 2019 Bilbao - The QGIS user interface - a deep dive - Sebastian M. Ernst",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mRJVIhRKA60"
    }
  ]
}