{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 5, Thursday \nOteiza. Talk. 16.45\n\nTelApy a Python module to compute free surface flows and sediments transport in geosciences and examples of how it is used to inter-operate with other Python libraries for Uncertainty Quantification, Optimization, Reduced Order Model.\nYoann Audouin\n\nThis talk is focused on the application of TelApy module (www.opentelemac.org). TelApy aims to provide a Python wrapper of TELEMAC-MASCARET API (Application Program Interface). The goal of TelApy is to have a full control on the simulation while running a case. For example, it must allow the user to stop the simulation at any time step, get values of some variables and change them. In order to make this possible, a Fortran structure called instantiation was developed with the API. It contains a list of strings pointing to TELEMAC variables. This gives direct access to the physical memory of variables, and allows therefore to get and set their values. Furthermore, changes have been made in TELEMAC-MASCARET main subroutines to make hydraulic cases execution possible time step by time step. It is useful to drive the TELEMAC-MASCARET SYSTEM APIs using Python programming language. In fact, Python is a portable, dynamic, extensible, free language, which allows (without imposing) a modular approach and object oriented programming. In addition of benefits of this programming language, Python offers a large amounts of interoperable libraries. The link between various interoperable libraries with TELEMAC-MASCARET SYSTEM APIs allows the creation of an ever more efficient computing chain able to more finely respond to various complex problems. Therefore, the TelApy module has the ambition to enable a new way of use for the TELEMAC-MASCARET system. In particular one can think about high performance computing for the calculation of uncertainties, optimization, code coupling and so on. The objectives of this talk is to present some examples of the TelApy module in the case of Uncertainty Quantification, Optimization, Reduced Order Model.\n\n\nDomain Expertise – none \nDomains – Earth, Ocean and Geo Science, Jupyter, Open Source, Simulation \nAbstract as a tweet – TelApy a Python module to compute free surface flows and sediments transport in geosciences \nProject Homepage / Git – www.opentelemac.org\nPython Skill Level – basic",
  "duration": 939,
  "published_at": "2020-03-06T15:07:44.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/uMASPCr_YRE/hqdefault.jpg",
  "title": "EuroSciPy 2019 Bilbao - TelApy: compute free surface flows and sediments transport - Yoann Audouin",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uMASPCr_YRE"
    }
  ]
}