{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 4, Wednesday \nBaroja Track. Talk. 12.00\n\nQuTiP: the quantum toolbox in Python as an ecosystem for quantum physics exploration and quantum information science \nNathan Shammah and Alexander PitchfordIn \n\nThis talk you will learn how QuTiP, the quantum toolbox in Python (http://qutip.org), has emerged from a library to an ecosystem. QuTiP is used for education, to teach quantum physics. In research and industry, for quantum computing simulation.\n\nQuTiP is emerging as a library at the center of a lively ecosystem. In this talk you will learn about the ongoing projects that have invested this project, from providing the framework to simulate quantum machine learning for quantum computers to the development of efficient numerical solvers tackling dynamical problems that are inherently hard to simulate classically.\n\n\nIt can be noted that Astropy is a community effort to develop a common core package for Astronomy in Python and \"foster an ecosystem of interoperable astronomy packages\",It seems an interesting model for the quantum tech landscape. Qiskit did build its own ecosystem of sub-libraries for quantum computing. The physics library for quantum tech is http://qutip.org .\n\n\nAbout the idea of QuTiP as a super-library, here are some details: \n\n- krotov, a very recent package for optimal control built on top of QuTiP ( https://arxiv.org/abs/1902.11284).    [https://github.com/qucontrol/krotov]. \n\n- piqs, the permutational invariant quantum solver, now a QuTiP module (see also https://arxiv.org/abs/1805.05129 ); \n\n- matsubara, a plugin to study the ultrastrong coupling regime with structured baths, http://matsubara.readthedocs.io/ \n\n - QNET, a computer algebra package for quantum mechanics and photonic quantum networks, which actually calls QuTiP as a plugin, mainly developed at Stanford in Mabuchi Lab https://github.com/mabuchilab/QNET \n\n-  qptomographer, https://qptomographer.readthedocs.io/en/latest/install, a library to derive error bars for experiments in quantum computing and quantum information processing. \n\n- tiqs, a library to study open quantum systems on extended lattices exploiting the symmetries of such systems, https://github.com/fminga/tiqs \n\n\n\nother upcoming integrations relative to pulse control, such as qupulse, https://github.com/qutech/qupulse/wiki/Architecture-Proposal\n\n\nThis talk will be of interest to the curious coder and researcher, analyzing how QuTiP's impact in the research community has fostered a lingua franca for quantum tech research. We will also draw comparisons with other larger ecosystems in Python-based scientific projects, such as astropy and scikit-learn.\n\n\nMore about QuTiP \n\nQuTiP is the open-source software to study quantum physics. It develops both an intuitive playground to understand quantum mechanics and cutting-edge tools to investigate it.    QuTiP provides the most comprehensive toolbox to characterize noise and dissipation –realistic processes– affecting quantum systems, as well as tools not only to monitor but also to minimize their impact (quantum optimal control, description of decoherence-free spaces).    For this reason QuTiP is a software born out of the quantum optics community and that has become increasingly relevant for the quantum computing community, as current quantum computing devices are noisy (NISQ definition by Preskill).    pypinfo data shows that QuTiP is popular in countries that are strong in quantum tech and quantum computing research, eg, The Netherlands in the top five, as well as countries that benefit in the use of open source software (OSS) for university coursework, eg, India. \n\n\n\nIn the past three years, there has been an evolution in the quantum tech community, which has embraced OSS. \n\n\n\nOSS libraries are used as a means to grow the user base, as well as in a more structural way for quantum computers, as they provide cloud access to quantum devices, e.g., IBM Q. \n\n\n\nQuTiP is the only major library that has continued to thrive in this ecosystem, competing with other library packages that are funded by corporations or VC-backed startups/ \n\n\n\nSince the tools of QuTiP provide a common ground to study quantum mechanics, it is important that this independent project is provided with the necessary support to thrive \n\n\n\nAs access to quantum computers becomes more and more widespread also for the use of data scientist and QuTiP's popularity grows even more for undergraduate and graduate courses, becoming the de-facto standard OSS to study quantum optical systems, it is imperative that the QuTiP library makes a quality jump to provide a comprehensive introduction to its tools for a much broader community of users.\n\n\nDomains – Data Visualisation, Jupyter, Open Source, Simulation \nProject Homepage – https://github.com/qutip/qutip \nDomain Expertise – none \nPython Skill Level – basic \nProject Homepage – qutip.org \nAbstract as a tweet – qutip empowers the quantum physics and quantum information community in Python",
  "duration": 1926,
  "published_at": "2019-12-01T09:15:48.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/pt4CSLwQK5U/hqdefault.jpg",
  "title": "EuroSciPy 2019 Bilbao - QuTiP: a quantum toolbox in Python - Alex and Nathan",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pt4CSLwQK5U"
    }
  ]
}