{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 4, Wednesday \nMitxelena. Talk. 11.30\n\nDistributed GPU Computing with Dask\nPeter Andreas Entschev\n\n\n\nDask has evolved over the last year to leverage multi-GPU computing alongside its existing CPU support. We present how this is possible with the use of NumPy-like libraries and how to get started writing distributed GPU software.\n\nThe need for speed remains important for scientific computing. Historically, computers were limited to few dozens of processors, but with modern GPUs, we can have thousands, or even millions of cores running in parallel on distributed systems.\n\nHowever, developing software for distributed GPU systems can be difficult, both because writing GPU code can be challenging for non-experts, and because distributed systems are inherently complex. We can work to address these challenges by using GPU-enabled libraries that mimic parts of the SciPy ecosystem, such as CuPy, RAPIDS, and Numba, abstracting GPU programming complexity, combined with Dask to abstract distributed computing complexity.\n\nWe talk about how Dask has come a long way to support distributed GPU-enabled systems by leveraging community standards and protocols, reusing open source libraries for GPU computing, and keeping it simple and complication-free to build highly-configurable accelerated distributed software.\nAbstract as a tweet – Dask leverages multi-GPU computing alongside with its existing CPU support. Join us to get started writing distributed GPU software with Dask. \n\nDomains – Big Data, General-purpose Python, Image Processing, Machine Learning, Open Source, Parallel computing / HPC, Vector and array manipulation \nProject Homepage – https://dask.org/ \nDomain Expertise – some \nPython Skill Level – basic",
  "duration": 1560,
  "published_at": "2019-10-27T17:39:18.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/8smUdz_DFok/hqdefault.jpg",
  "title": "EuroScipy 2019 Bilbao - Distributed GPU Computing with Dask - Peter Entschev",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8smUdz_DFok"
    }
  ]
}