{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 4, Wednesday \nOteiza Track. Talk. 16.45\n\nHigh Voltage Lab Common Code Basis library: a uniform user-friendly object-oriented API for a high voltage engineering research.\nMikołaj Rybiński \n\nThe library leverages Python richness to provide a uniform user friendly API for a zoo of industrial communication protocols used to control high voltage engineering devices, together with abstraction and implementations for such devices.\n\nAt the heart of ETH High Voltage Lab's (HVL) research are industrial devices put together into code-automated experiments. It's a zoo of industrial communication protocols one needs to handle when controlling these devices. HVL decided to switch from MATLAB to Python as a programming and analysis tool. Python community provides solutions to majority of technicalities involved in handling multitude of industrial communication protocols used to control high voltage research experiment devices. Moreover Python seems to be a more future-proof choice, meeting industry demand for a more cost-effective and collaborative solution.\n\nThe HVL Common Code Basis library (hvl_ccb) provides a uniform user-friendly object-oriented API as well as implementation for multiple of high voltage engineering devices and their respective communication protocols. The library leverages Python's open source community - implementations of specific communication protocols, but also relies heavily on some of the languages newer features such as typing hints, dataclasses or enums.\n\nPython typing hints are used not only for their static type checking and autocompletion support from IDEs, but also for dynamic type checking of the communication protocol's and devices' configurations. The configurations themselves are a customized implementation of Python's 3.7 dataclasses. Configurations properties rely heavily on Python (advanced) enumerations.\n\nCurrently, the library supports serial port, VISA over TCP, Modbus TCP, LabJack LJM and OPC UA communication protocols. These protocols are used within code abstraction of devices such MBW973 SF6 Analyzer / dew point mirror, LabJack (T7-PRO) device, Schneider Electric ILS2T stepper motor drive, Elektro-Automatik PSI9000 DC power supply, Rhode & Schwarz RTO 1024 oscilloscope, or the Lab's state-of-the-art Supercube platform, which encapsulates safety components, the voltage source, as well as other auxiliary devices.\n\nProject Homepage / Git – https://gitlab.ethz.ch/hvl/hvl_ccb/ \nDomains – General-purpose Python, Open Source \nDomain Expertise – none \nPython Skill Level – basic \nProject Homepage / Git – https://gitlab.ethz.ch/hvl/hvl_ccb/ \nAbstract as a tweet – High voltage engineering research equals handling a zoo of industrial communication protocols. Python to the rescue!",
  "duration": 1143,
  "published_at": "2019-12-02T13:27:09.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/AVVasLFQYXM/hqdefault.jpg",
  "title": "EuroSciPy 2019 Bilbao - High Voltage Lab Common Code Basis library - Mikołaj Rybiński",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AVVasLFQYXM"
    }
  ]
}