{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 5, Thursday \nOteiza. Talk. 10.30\n\nKubeflow Kale: from Jupyter Notebook to Complex Pipelines\nValerio Maggio\n\nNowadays, most of the High Performance Computing (HPC) tasks are carried out in the Cloud, and this is as much as in industry as in research.\n\nMain advantages provided by the adoption of Cloud services include (a) constant up-to-date hardware resources; (b) automated infrastructure setup; (c) simplified resource management. Therefore, new solutions have been recently released to the community (e.g. Kubernetes by Google) providing custom integrations to specifically support the migration of existing Machine/Deep Learning pipelines to the Cloud.\n\nHowever, a shift towards a complete Cloud-based computational paradigm imposes new challenges in terms of data and model reproducibility, privacy, accountability, and (efficient) resource configuration and monitoring. Moreover, the adoption of these technologies still imposes additional workloads requiring significant software and system engineering expertise (e.g. set up of containerised environments, storage volumes, clusters nodes).\n\nIn this talk, I will present kale (/ˈkeɪliː/) - a new Python solution to ease and support ML workloads for HPC in the Cloud is presented.\n\nKale leverages on the combination of Jupyter notebooks, and Kubernetes/Kubeflow Pipelines (KFP) as core components in order to:\n\n    (R1) automate the setup and deployment procedures by automating the creation of (distributed) computation environments in the Cloud;\n\n    (R2) democratise the execution of machine learning models at scale by instrumented and reusable environments;\n\n    (R3) provide a simple interface (UI, and SDK) to enable researchers to deploy ML models without requiring extensive engineering expertise.\n\nTechnical features of Kale as well as open challenges and future development will be presented, along with working examples integrating kale with the complete ML/DL workflows for pipeline reproducibility.\n\nDomains:\n    Jupyter\n    Machine Learning\n    DevOps\n    Parallel Computing/HPC\n\nGitHub: https://github.com/orgs/kubeflow-kale",
  "duration": 1816,
  "published_at": "2020-03-06T15:07:44.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/nD3rn9pIUGA/hqdefault.jpg",
  "title": "EuroSciPy 2019 Bilbao - Kubeflow Kale: from Jupyter Notebook to Complex Pipelines - Valerio Maggio",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nD3rn9pIUGA"
    }
  ]
}