{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 5, Thursday \nOteiza. Talk. 14.45\n\nVeloxChem: Python meets quantum chemistry and HPC\nOlav Vahtras \n\nA new and efficient Python/C++ modular library for real and complex response functions at the level of Kohn-Sham density functional theory Zilvinas Rinkevicius, Xin Li, Olav Vahtras, Manuel Brand, Karan Ahmadzadeh, Magnus Ringholm, Nanna List, and Patrick Norman With the ease of Python library modules, VeloxChem offers a front end to quantum chemical calculations on contemporary high-performance computing (HPC) systems and aims at harnessing the future compute power within the EuroHPC initiative. At the heart of this software lies a module for the evaluation of electron-repulsion integrals (ERIs) using the ObaraSaika recurrence scheme, where a high degree of efficiency is achieved by employing architecture-independent vectorization via OpenMP SIMD pragmas in the auto-generated C++\nsource code. The software is topology aware and with a Python-controlled work and task flow, the idle time is minimized using an MPI/OpenMP partitioning of resources.\n\nIn the second software layer, we have implemented a highly accurate SCF start guess based on atomic densities and a first-level of iterations in a reduced version of the user-defined basis\nset, leading to a very smooth convergence in the subsequent standard DIIS scheme. This layer also includes vectorized and OpenMP/MPI parallelized modules for efficient generation of DFT\ngrid points and weights as well as kernel integration.\n\nIn the third software layer, we present real and complex response functions as to address dispersive and absorptive molecular properties in spectroscopy. The kernel module in this layer\nis the iterative linear response equation solver that we have formulated and implemented for a combination of multiple optical frequencies and multiple perturbation operators. With efficient\nuse of computer memory, we enable the simultaneous reference to, and solving of, in the order of 1,000 response equations for sizable biochemical systems without spatial symmetry, and we\ncan thereby determine electronic response spectra in arbitrary wavelength regions, including UV/vis and X-Ray, without resolving the sometimes embedded excited states in the spectrum.\nE.g. the electronic CD spectrum (involving the Cartesian sets of electric and magnetic perturbations) over a range of some 10 eV is obtained at a computational cost comparable to that of determining the transition energy of the lowest excited state, or optimizing the electronic structure of the reference state.\n\nAbstract as a tweet – VeloxChem: Python meets quantum chemistry and HPC, a new efficient program for molecular response properties. \nProject Homepage / Git – https://veloxchem.readthedocs.io Python Skill Level – basic \nDomain Expertise – some \nDomains – Materials Science, Parallel computing / HPC, Simulation",
  "duration": 1276,
  "published_at": "2020-03-06T15:07:43.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/IaXTdkMc7gE/hqdefault.jpg",
  "title": "EuroSciPy 2019 Bilbao - VeloxChem: Python meets quantum chemistry and HPC - Olav Vahtras",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IaXTdkMc7gE"
    }
  ]
}