{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 4, Wednesday \nBaroja Track. Talk. 16.30\n\nControlling a confounding effect in predictive analysis.\nDarya Chyzhyk\n\nConfounding effects are often present in observational data: the effect or association studied is observed jointly with other effects that are not desired.\n\nFor instance, when predicting the salary to offer given the descriptions of professional experience, the risk is to capture indirectly a gender bias present in the distribution of salaries. Another example is found in biomedical applications, where for an automated radiology diagnostic system to be useful, it should use more than socio-demographic information to build its prediction.\n\nHere I will talk about confounds in predictive models. I will review classic deconfounding techniques developed in a well-established statistical literature, and how they can be adapted to predictive modeling settings. Departing from deconfounding, I will introduce a non-parametric approach –that we named “confound-isolating cross-validation”– adapting cross-validation experiments to measure the performance of a model independently of the confounding effect.\n\nThe examples are mentioned in this work are related to the common issues in neuroimage analysis, although the approach is not limited to neuroscience and can be useful in another domains.\n\nDomains – Machine Learning, Medicine/Health, Statistics Project \nDomain Expertise – none \nPython Skill Level – basic \nProject Homepage / Git – https://github.com/darya-chyzhyk/confound_prediction \nAbstract as a tweet – “confound-isolating cross-validation”– adapting cross-validation experiments to measure the performance of a model independently of the confounding effect #nonparametric",
  "duration": 889,
  "published_at": "2019-12-01T13:49:34.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Jz8u4NusWjM/hqdefault.jpg",
  "title": "EuroSciPy 2019 Bilbao - Controlling a confounding effect in predictive analysis - Darya Chyzhyk",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Jz8u4NusWjM"
    }
  ]
}