{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 5, Thursday \nBaroja. Talk. 15.45\n\nHigh performance machine learning with dislib\nJavier Álvarez \n\nThis talk will present dislib, a distributed machine learning library built on top of PyCOMPSs programming model. One of the main focuses of dislib is solving large-scale scientific problems on high performance computing clusters.\n\nPyCOMPSs is a distributed programming model and runtime for Python. PyCOMPSs' main goal is to make distributed computing accessible to non-expert developers by providing a simple programming model, and a runtime that automates many aspects of the parallel execution. In addition to this, PyCOMPSs is infrastructure agnostic, and can run on top of a wide range of platforms, from HPC clusters to clouds, and from GPUs to FPGAs.\n\nThis talk will present dislib, a distributed machine learning library built on top of PyCOMPSs. Inspired by scikit-learn, dislib programming interface is based on the concept of estimators. This provides a clean and easy-to-use API that highly increases the productivity of building large-scale machine learning pipelines. Thanks to PyCOMPSs, dislib can run in multiple distributed platforms without changes in the source code, and can handle up to billions of input samples using thousands of CPU cores. This makes dislib a perfect tool for scientists (and other users) that are not machine learning experts, but that still want to extract useful knowledge from extremely large data sets.\n\nAbstract as a tweet – This talk will present dislib, a distributed machine learning library built on top of PyCOMPSs programming model. One of the main focuses of dislib is solving large-scale scientific problems on high performance computing clusters. \nProject Homepage / Git – https://dislib.bsc.es \nPython Skill Level – basic \nDomain Expertise – some \nDomains – Big Data, Machine Learning, Parallel computing / HPC",
  "duration": 1060,
  "published_at": "2020-03-06T17:30:18.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/MHywCJCd798/hqdefault.jpg",
  "title": "EuroSciPy 2019 Bilbao - High performance machine learning with dislib - Javier Álvarez",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MHywCJCd798"
    }
  ]
}