{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 5, Thursday \nMitxelena. Talk. 14.45\n\nInside NumPy: preparing for the next decade\nMatti Picus \n\nOver the past year, and for the first time since its creation, NumPy has been operating with dedicated funding. NumPy developers think it has invigorated the project and its community. But is that true, and how can we know?\n\nOver the past year, and for the first time since its creation, NumPy has been operating with dedicated funding. NumPy developers think it has invigorated the project and its community. But is that true, and how can we know?\n\nWe will give an overview of the actions we’ve taken, both successful and unsuccessful, to improve sustainability of the NumPy project and its community. We will draw some lessons from a first year of grant-funded activity, discuss key obstacles faced, attempt to quantify what we need to operate sustainably, and present a vision for the project and how we plan to realize it.\nTopics we will cover include the following:\n- Invigorating the community - what did we do, and are we correct in our opinion that it invigorated the community?\n- doing things in the open as much as possible\n- creating a roadmap\n- NumPy Enhancement Proposal process\n- commit rights\n- in-person meetings\n\n* Measuring community/project health. We will use a number of published or proposed metrics to quantify this. Which ones do we think accurately represent the state of the project?\n* Lessons from the first grant and introducing paid work into a previously fully volunteer-driven project.\n* What is the best profile for a salaried employee\n   - Social profile\n   - From inside or outside?\n* Have we succeeded in encouragin diversity?\n* A vision for future sustainabity\n* Models for obtaining and funneling funding\n\nAbstract as a tweet – Inside NumPy: how full-time developers and the communit are shaping the next decade of NumPy Project \nHomepage / Git – https://github.com/numpy/numpy \nPython Skill Level – basic \nDomain Expertise – none \nProject Homepage / Git – http://www.numpy.org/ \nDomains – General-purpose Python, Open Source",
  "duration": 1784,
  "published_at": "2020-03-06T12:30:17.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/e6wAXyF_o-c/hqdefault.jpg",
  "title": "EuroSciPy 2019 Bilbao - Inside NumPy: preparing for the next decade - Matti Picus",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=e6wAXyF_o-c"
    }
  ]
}