{
  "description": "*Nowadays, research in every scientific domain, from medicine to\nastronomy, is impossible without processing huge amounts of data to\ncheck hypotheses, find new relations, and make discoveries. However, the\ntraditional technologies which include data structures and algorithms,\nbecome ineffective or require too many resources. This creates a demand\nfor various optimization techniques, new data processing paradigms, and,\nfinally, appropriate algorithms.*\n\nThe presentation is dedicated to *probabilistic data structures* , that\nis a common name for advanced data structures based mostly on different\nhashing techniques. Unlike classical ones, these provide approximated\nanswers but with reliable ways to estimate possible errors and\nuncertainty. They are designed for extremely low memory requirements,\nconstant query time, and scaling, the factors that are essential for\ndata applications. It is hard to imagine a branch that requires learning\nfrom data, where they cannot be applicable.\n\nThey are not necessarily new. Probably, everybody knows about the Bloom\nfilter data structure, designed in the 70s, it efficiently solves the\nproblem of performing membership queries (a task to decide whether some\nelement belongs to the dataset or not) in a constant time without\nrequirements to store all elements. This is an example of a\nprobabilistic data structure, but there are much more that have been\ndesigned for various tasks in many domains.\n\nIn this talk, I explain **the five most important problems in data\nprocessing** that occurred in different domains but **can be efficiently\nsolved with probabilistic data structures and algorithms**. We cover the\n*membership querying* , *counting* of unique elements, *frequency* and\n*rank* estimation in data streams, and *similarity*.\n\nEverybody interested in such a topic is welcome to participate in\ncontributing a free and open-source Python (Cython) library called\n`PDSA <https://github.com/gakhov/pdsa>`__.\n\nWe interact with an increasing amount of data but classical data\nstructures and algorithms can't fit our requirements anymore. This talk\nis to present the probabilistic algorithms and data structures and\ndescribe the main areas of their applications.\n",
  "duration": 1689,
  "language": "eng",
  "published_at": "2020-03-06T15:07:43.000Z",
  "recorded": "2019-09-05",
  "speakers": [
    "Andrii Gakhov"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ZhY7lqug5yo/hqdefault.jpg",
  "title": "Exceeding Classical: Probabilistic Data Structures in Data Intensive Applications",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZhY7lqug5yo"
    }
  ]
}
