{
  "description": "Synthetic data is useful in many contexts, including\n\n-  providing \"safe\", non-private alternatives to data containing\n   personally identifiable information\n-  software and pipeline testing\n-  software and service development\n-  enhancing datasets for machine learning.\n\nSynthetic data is often created on a bespoke basis, and since the advent\nof generative adverserial networks (GANs) there has been considerable\ninterest and experimentation with using those as the basis for creating\nsynthetic data.\n\nWe have taken a different approach. We have worked for some years on\ndeveloping methods for automatically finding constraints that\ncharacterise data, and which can be used for testing data validity\n(so-called \"test-driven data analysis\", TDDA). Such constraints form (by\ndesign) a useful characterisation of the data from which they were\ngenerated. As a result, methods that generate datasets that match the\nconstraints necessarily construct datasets that match many of the\noriginal characteristics of the data from which the constraints were\nextracted.\n\nAn important aspect of datasets is the relationship between \"good\" (~\nvalid) and \"bad\" (~ invalid) data, both of which are typically present.\nSystems for creating useful, realistic synthetic data generally need to\nbe able to synthesize both kinds, in realistic mixtures.\n\nThis talk will discuss data synthesis from constraints, describing what\nhas been achieved so far (which includes synthesizing good and bad data)\nand future research directions.\n\nWe introduce a method for creating synthetic data \"to order\" based on\nlearned (or provided) constraints and data classifications. This\nincludes \"good\" and \"bad\" data.\n",
  "duration": 1482,
  "published_at": "2019-12-01T09:58:56.000Z",
  "recorded": "2019-09-04",
  "speakers": [
    "Nick Radcliffe"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/YtIBSr2dAtI/hqdefault.jpg",
  "title": "Constrained Data Synthesis",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YtIBSr2dAtI"
    }
  ]
}
