{
  "description": "Modern data systems tend to heavily focus on optimizing for the system’s\ntime. Some of these optimizations, however, are counterproductive to the\nend user’s workflow and thought process. In this talk, we discuss the\ndesign of Modin, a DataFrame library, and how to optimize for the human\nsystem.\n\nModin is a project at UC Berkeley's RISELab designed to optimize for the\ndata scientist’s time. Often when building a data system, the system\ndesigners will follow a set of “best practices” in order to optimize\nperformance. These “best practices” often require data scientists to\nunderstand and personally optimize concepts and system components that\nare not central to extracting value from their data.\n\nThe fundamental goal of data science is to extract value from data.\nDespite this, data systems are being built with user requirements such\nas: (1) knowledge of partitioning, (2) understanding laziness and what\ntriggers computation, (3) an entirely new API, and (4) where their code\nis running (e.g. locally, on-prem cluster, cloud). This overhead is\npassed to the data scientist, even though there is no overlap between\nthese new requirements and the fundamental goal of their profession.\n\nIn this talk, we will discuss how we think about the problem of large\nscale data science and optimizing for the human system. We will discuss\nthe system design of Modin, which enables pluggable backends, runtimes,\nand APIs. The system is designed to solve the needs of the data science\ncommunity regardless of an individual user’s environment. Currently,\nModin supports the pandas API, and a proof of concept for SQL has been\nimplemented. Modin is completely open- source and can be found on\nGitHub: https://github.com/modin-project/modin.\n\nModern data systems tend to heavily focus on optimizing for the system’s\ntime. In this talk, we discuss the design of Modin, a DataFrame library,\nand how to optimize for the human system.\n",
  "duration": 1039,
  "published_at": "2019-10-27T17:37:56.000Z",
  "recorded": "2019-09-04",
  "speakers": [
    "Devin Petersohn"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/U7P80XEl6iA/hqdefault.jpg",
  "title": "Modin: Scaling the Capabilities of the Data Scientist, not the machine",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=U7P80XEl6iA"
    }
  ]
}
