{
  "description": "Video compression algorithms result in a reduction of image quality,\nbecause of their lossy approach to reduce the required bandwidth. This\naffects commercial streaming services such as Netflix, or Amazon Prime\nVideo, but affects also video conferencing and video surveillance\nsystems. In all these cases it is possible to improve the video quality,\nboth for human view and for automatic video analysis, without changing\nthe compression pipeline, through a post-processing that eliminates the\nvisual artefacts created by the compression algorithms. In this\npresentation we show how deep convolutional neural networks implemented\nin Python using TensorFlow, Scikit-Learn and Scipy can be used to reduce\ncompression artefacts and reconstruct missing high frequency details\nthat were eliminated by the compression algorithm.\n\n| In particular, we follow an approach based on Generative Adversarial\n  Networks, that in the scientific literature have obtained extremely\n  high quality results in image enhancement tasks. However, to obtain\n  these results, typically, large generators are employed, resulting in\n  high computational costs and processing time, and thus the method can\n  be implemented using GPUs usually available only on desktop machines.\n| In this presentation we show also an architecture that can be used to\n  reduce the computational cost and that can be implemented also on\n  mobile devices.\n\nA possible application is to improve video conferencing, or live\nstreaming. Since in these cases there is no original uncompressed video\nstream available, we report results using no-reference video quality\nmetric showing high naturalness and quality even for efficient networks.\n\nVideo compression algorithms used to stream videos are lossy, and when\ncompression rates increase they result in strong degradation of visual\nquality. We show how deep neural networks can eliminate compression\nartefacts and restore lost details.\n",
  "duration": 2009,
  "published_at": "2020-03-06T12:30:17.000Z",
  "recorded": "2019-09-05",
  "speakers": [
    "Marco Bertini",
    "Tiberio Uricchio"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/PPkLP8n7CKY/hqdefault.jpg",
  "title": "High quality video experience using deep neural networks",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PPkLP8n7CKY"
    }
  ]
}
