{
  "description": "Over the past year, and for the first time since its creation, NumPy has\nbeen operating with dedicated funding. NumPy developers think it has\ninvigorated the project and its community. But is that true, and how can\nwe know?\n\n| We will give an overview of the actions we’ve taken, both successful\n  and unsuccessful, to improve sustainability of the NumPy project and\n  its community. We will draw some lessons from a first year of\n  grant-funded activity, discuss key obstacles faced, attempt to\n  quantify what we need to operate sustainably, and present a vision for\n  the project and how we plan to realize it.\n| Topics we will cover include the following:\n| - Invigorating the community - what did we do, and are we correct in\n  our opinion that it invigorated the community?\n| - doing things in the open as much as possible\n| - creating a roadmap\n| - NumPy Enhancement Proposal process\n| - commit rights\n| - in-person meetings\n\n-  Measuring community/project health. We will use a number of published\n   or proposed metrics to quantify this. Which ones do we think\n   accurately represent the state of the project?\n-  Lessons from the first grant and introducing paid work into a\n   previously fully volunteer-driven project.\n-  What is the best profile for a salaried employee?\n\n   -  Social profile\n   -  From inside or outside?\n\n-  Have we succeeded in encouragin diversity?\n\n-  A vision for future sustainabity\n\n-  Models for obtaining and funneling funding\n\nOver the past year, and for the first time since its creation, NumPy has\nbeen operating with dedicated funding. NumPy developers think it has\ninvigorated the project and its community. But is that true, and how can\nwe know?\n",
  "duration": 1784,
  "published_at": "2020-03-06T12:30:17.000Z",
  "recorded": "2019-09-05",
  "speakers": [
    "Matti Picus"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/e6wAXyF_o-c/hqdefault.jpg",
  "title": "Inside NumPy: preparing for the next decade",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=e6wAXyF_o-c"
    }
  ]
}
