{
  "description": "EuroSciPy 2019 Bilbao \nSeptember 4, Wednesday \nBaroja Track. Talk. 16.45\n\nThe Rapid Analytics and Model Prototyping (RAMP) framework: tools for collaborative data science challenges\nGuillaume Lemaitre and Joris Van den Bossche \n\nThe RAMP (Rapid Analytics and Model Prototyping) framework provides a platform to organize reproducible and transparent data challenges. We will present the different framework bricks.\n\nWe will give an overview of the RAMP framework, which provides a platform to organize reproducible and transparent data challenges.\n\nRAMP workflow is a python package used to define and formalize the data science problem to be solved. It can be used as a standalone package and allows a user to prototype different solutions. In addition to RAMP workflow, a set of packages have been developed allowing to share and collaborate around the developer solutions. Therefore, RAMP database provides a database structure to store the solutions of different users and the performance of these solutions. RAMP engine is the package to run the user solutions (possibly on the cloud) and populate the database. Finally, RAMP frontend is the web frontend where users can upload their solutions and which shows the leaderboard of the challenge.\n\nThe project is open-source and can be deployed on any local server. The framework has been used at the Paris-Saclay Center for Data Science for setting up and solving about twenty scientific problems, for organizing collaborative data challenges, for organizing scientific sub-communities around these events, and for training novice data scientists.\n\nAbstract as a tweet – RAMP framework: a solution to collaborate on your data science challenge \nDomains – Machine Learning, Parallel computing / HPC, Statistics \nProject Homepage / Git – https://ramp.studio/ \nDomain Expertise – some \nPython Skill Level – basic \nProject Homepage / Git – https://ramp.studio/",
  "duration": 943,
  "published_at": "2019-12-01T14:08:28.000Z",
  "recorded": "",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/CWIXZQXLdUg/hqdefault.jpg",
  "title": "EuroSciPy 2019 Bilbao - RAMP - Guillaume and Joris",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CWIXZQXLdUg"
    }
  ]
}