{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Designing a Human-Friendly CLI for API-Driven Infrastructure\n\nAs Bloomberg's infrastructure grows and evolves, the tools we use to manage it are becoming increasingly important. To streamline infrastructure management, our team set out to design a REST API and constituent CLI (Command Line Interface) that would comprise a single interface for both programmatic and human interaction with our infrastructure. Traditionally, building a CLI that is tightly coupled to an API requires maintaining a separate codebase, which is tedious and error-prone. Instead, we designed a CLI that dynamically generates commands based on the OpenAPI JSON documentation. However, since APIs are designed for computer interaction, we designed our API to include the information needed to implement a human-friendly CLI. Leveraging Python, FastAPI, and numerous other open source projects, we built a stable, extensible tool that greatly improves how we interact with our infrastructure.\n\nSpeaker: Oliver Rew is a software engineer and a lifelong tinkerer/maker, I have a deep-rooted passion for building, fixing, and breaking things. I recently earned a Masters in Electrical and Computer Engineering, and have gained experience working at both small startups and large companies. I thrive on fixing hard bugs and diving deep into challenging problems.\n\nBeyond my professional work, I'm also involved in an exciting Cubesat project at Portland State University. When I'm not immersed in technology, I enjoy outdoor activities such as biking, rock-climbing, and spending quality time with my dog, Bruce.",
  "duration": 1548,
  "language": "eng",
  "recorded": "2024-04-21",
  "speakers": [
    "Oliver Rew"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/rM_P1vkM1kw/maxresdefault.webp",
  "title": "Designing a Human-Friendly CLI for API-Driven Infrastructure",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rM_P1vkM1kw"
    }
  ]
}