{"whiteboard": "", "video_mp4_download_only": true, "video_webm_download_only": false, "duration": 30, "video_ogv_download_only": false, "category": "PyCon DE 2013", "speakers": ["Mike Müller"], "title": "Python verbindet - Der Python Software Verband e.V. in 20 Minuten", "quality_notes": "", "video_flv_length": null, "recorded": "2013-10-15", "video_mp4_length": null, "description": "", "video_mp4_url": "", "tags": ["community", "pysv", "verband"], "copyright_text": "", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=dr8y6ECP8sM", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "German", "video_webm_length": null, "summary": "Der Python Software Verband (PySV) ist als eingetragener Verein in Deutschland organisiert, und versteht sich als Support-Organ der gesamten deutschsprachigen Python-Community. 2011 hat sich der PySV langsam aber sicher organisatorisch aus dem früheren DZUG e.V.,  der bereits vollständig aus Python Enthusiasten bestand, emanzipiert und seine Neustrukturierung im letzten Jahr weitgehend abgeschlossen.\r\n\r\nDie wichtigsten Mittel zur Unterstützung der Community sind u. a. unsere aktiven Mitglieder und die PySV-Website als zentraler Anlaufpunkt und der neue Usergruppen-Hub. Der PySV unterstützte und organisierte bereits die Python-Konferenzen PyCon.DE 2011 und 2012 als verantwortlicher Partner mit. Auch die PyCon.DE 2013 wird er in enger Zusammenarbeit mit der Kölner PyCologne Usergroup und dem DLR ermöglichen. In den Jahren 2014 und 2015 wird der PySV sogar Mitausrichter der EuroPython – der größten europäsichen Python-Konferenz – sein. Die Berliner Usergroup mit dem PySV im Rücken konnte sich in der Bewerbung durchsetzen.\r\n\r\nAuch kleinere, aber deswegen nicht unwichtigere Events unterstützt der PySV. Neben dem mittlerweile schon traditionellen PythonCamp in Köln sind das verschiedene Python-Sprints und u.A. der World Plone Day an mehreren Orten. Auf Messen wie der CeBIT, der überregionalen FrOSCon Konferenz und den Berliner und Chemnitzer Linuxtagen und dem Linuxtag in Berlin sorgt der Verband dafür, dass Python regelmäßig präsent ist. \r\n\r\nDer gemeinsam neu entwickelte Programmierwettbewerb nimmt Formen an. Studenten erhalten vom PySV Unterstützung für die Teilnahme an der EuroSciPy.  \r\n\r\nWie der Verband der Community helfen kann, wird mit allen, die mithelfen wollen, gemeinsam erarbeitet. Er bietet organisatorische, finanzielle und technische Hilfe für Usergruppen, Sprints und Workshops mit Python-Bezug. Alle Python-Enthusiasten sind eingeladen im Verein aktiv mitzuarbeiten. Neue Ideen und Verbesserungsvorschläge sind immer gern gesehen. Unsere Grundregel lautet: “Soviel Unterstüzung wie möglich, so wenig Reglementierung wie möglich.”\r\n", "thumbnail_url": "http://i1.ytimg.com/vi/dr8y6ECP8sM/hqdefault.jpg", "video_flv_url": null}