{
  "id": 2402, 
  "category": "PyCon DE 2013", 
  "slug": "sponsoring-von-open-source-und-damit-den-chef-u", 
  "title": "Sponsoring von Open-Source - und damit den Chef überzeugen", 
  "summary": "Nutzen Sie Open-Source-Software? \r\n\r\nHaben Sie schon einmal eine Kleinigkeit ändern wollen? \r\n\r\nKonnten Sie für “Einwurf kleiner Münzen” diese Änderung machen lassen?\r\n\r\nOpen-Source-Software zeichnet sich unter anderem durch die leichte Anpassbarkeit an die eigenen Bedürfnisse aus. Doch nicht jeder kann oder möchte die Software selbst ändern. Lieber würde man die Autoren oder andere Spezialisten damit beauftragen.\r\n\r\nDer Vortrag gibt Einblick in die praktische Arbeit mit dem Sponsoring von Open-Source-Projekten und beantwortet die Frage, wie man mit Hilfe von Sponsoring seine eigenen Probleme schneller und günstiger lösen kann: Nach der Vorstellung typischer Entwicklungsmodelle von Open-Source-Projekten erfahren Besucher, wie sie Kontakte zu Open-Source Projekten knüpfen können und damit jemanden finden, der ihnen weiter hilft.\r\n\r\nWeitere Themen sind\r\n\r\n*  rechtliche Aspekte wie ein Werksvertrag, Gewährleistung und einfache Abwicklung\r\n*  Anforderungen so formulieren, dass der Kundennutzen und die Nachhaltigkeit im Vordergrund steht\r\n* Abnahmekriterien für den Auftrag\r\n* Wirtschaftlichkeitsberechnung und Kosten-Nutzen-Abwägung\r\n* Nachhaltige Lösungen statt ewigen Workarounds\r\n* Mehrwert für sich und die Open-Source-Gemeinschaft schaffen\r\n* Imagepflege über Open-Source-Sponsoring\r\n* Eigene Open-Source Projekte durch Externe weiterentwickeln lassen\r\n\r\nAls konkrete Beispiele dienen diverse in Python entwickelte Open-Source Projekte der ImmobilienScout24.\r\n\r\n", 
  "description": "", 
  "quality_notes": "", 
  "language": "German", 
  "copyright_text": "", 
  "thumbnail_url": "http://i1.ytimg.com/vi/yiBCb6Z2jKo/hqdefault.jpg", 
  "duration": 60, 
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=yiBCb6Z2jKo", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=yiBCb6Z2jKo", 
  "tags": [
    "geld", 
    "kultur", 
    "open-source", 
    "politik", 
    "wirtschaft"
  ], 
  "speakers": [
    "Schlomo Schapiro"
  ], 
  "recorded": "2013-10-15"
}