{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "In the past few months, chatbots have made headlines and have become a much-required interface for communication. In this talk, we will discuss three aspects of chatbots:\n\n1) How chatbots have evolved from Natural Language Processing and Artificial Intelligence\n2) Internals and Technologies involved\n3) How to build chatbots yourself and the questions to ask yourself before building one\n\n**Abstract**\n\nIn the past few months, chatbots have made headlines and have become a much-required interface for communication. In this talk, we will discuss three aspects of chatbots:\n\n1) How chatbots have evolved from Natural Language Processing and Artificial Intelligence In this segment we will answer the following questions:\n    - What research-areas have led to the evolution of chatbots?\n    - How important is it for a chatbot to appear human, and to pass the Turing test?\n\n2) Internals and Technologies involved in Chatbots In this segment we will answer the following questions:\n    - What are the tools and technologies do you need to know about in order to make computers understand human language?\n    - Which python libraries should one be familiar with to build Language Understanding interfaces?\n\n3) How to build chatbots yourself and the questions to ask yourself before building one In this segment we will answer the following questions:\n    - Which API's are available for building chatbots\n    - Pro/Con's for using API's vs building chatbots from scratch\n    - Where can one host their chatbots?\n\nFinally we will discuss where chatbots are heading to from here",
  "duration": 2130,
  "language": "eng",
  "recorded": "2017-07-06",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/seattle2017/schedule"
    }
  ],
  "speakers": [
    "Dr. Rutu Mulkar-Mehta"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/28fengRZHII/maxresdefault.jpg",
  "title": "Chatbots Past, Present and Future",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=28fengRZHII"
    }
  ]
}
