{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Description\nIn the past few months, chatbots have made headlines and have become a much-required interface for communication. In this talk, we will discuss three aspects of chatbots: 1) How chatbots have evolved from Natural Language Processing and Artificial Intelligence 2) Internals and Technologies involved 3) How to build chatbots yourself and the questions to ask yourself before building one\n\nAbstract\nIn the past few months, chatbots have made headlines and have become a much-required interface for communication. In this talk, we will discuss three aspects of chatbots:\n\n1) How chatbots have evolved from Natural Language Processing and Artificial Intelligence In this segment we will answer the following questions: -- What research-areas have led to the evolution of chatbots? -- How important is it for a chatbot to appear human, and to pass the Turing test? 2) Internals and Technologies involved in Chatbots In this segment we will answer the following questions: -- What are the tools and technologies do you need to know about in order to make computers understand human language? -- Which python libraries should one be familiar with to build Language Understanding interfaces? 3) How to build chatbots yourself and the questions to ask yourself before building one In this segment we will answer the following questions: -- Which API's are available for building chatbots -- Pro/Con's for using API's vs building chatbots from scratch -- Where can one host their chatbots?\n\nFinally we will discuss where chatbots are heading to from here\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 2130,
  "language": "eng",
  "recorded": "2017-07-24",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/seattle2017/schedule"
    }
  ],
  "speakers": [
    "Dr. Rutu Mulkar-Mehta"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/28fengRZHII/maxresdefault.jpg",
  "title": "Chatbots Past, Present and Future",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=28fengRZHII"
    }
  ]
}
