{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Customer lifetime value models (CLVs) are powerful predictive models that allow analysts and data scientists to forecast how much customers are worth to a business. CLV models provide crucial inputs to inform marketing acquisition decisions, retention measures, customer care queuing, demand forecasting, etc. They are used and applied in a variety of verticals, including retail, gaming, and telecom.\n\nThis tutorial is separated into two parts:\n\nIn the first part, we will provide a brief overview of the ins and outs of probabilistic models, which can be used to quantify the future value of a customer, and demonstrate how e-commerce companies are using the outputs of these models to identify, retain, and target high-value customers.\n\nIn the second part, we will implement, train, and validate predictive customer lifetime value models in a hands-on Python tutorial. Throughout the tutorial, we will use a real-world retail dataset and go over all the steps necessary to build a reliable customer lifetime value model: data exploration, feature engineering, model implementation, training, and validation. We will also use some of the probabilistic programming language packages available in Python (e.g. Stan, PyMC) to train these models.\n\nThe resulting Python notebooks will lay out the foundation for more advanced models tailored to the specifics of each business setting. Throughout the tutorial, we will give the audience additional tips on how to tweak the models to fit different business settings.",
  "duration": 2186,
  "language": "eng",
  "recorded": "2017-07-06",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/seattle2017/schedule"
    }
  ],
  "speakers": [
    "Jean-Rene Gauthier",
    "Ben Van Dyke"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/gx6oHqpRgpY/maxresdefault.jpg",
  "title": "Implementing and Training Predictive Customer Lifetime Value Models in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gx6oHqpRgpY"
    }
  ]
}
