{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Description\nScattertext is a Python package that lets you compare and contrast how words are used differently in two types of documents, producing interactive, Javascript-based visualizations that can easily be embedded into Jupyter Notebooks. Using spaCy and Empath, Scattertext can also show how emotional states and words relating to a particular topic differ.\n\nAbstract\nNotebooks and presentation for this talk are available from https://github.com/JasonKessler/Scattertext-PyData.\n\nMotivation and introduction\n-What's the matter with word clouds?\n-How to read a plot made by Scattertext\nHow to make your own plots\n-Preparing a Pandas data frame with your data set\n-Plotting with Scattertext, and fine tuning plots for interpretability and speed\nScattertext and the Python NLP ecosystem\n-Visualizing emotions using Empath.\n-Using word vectors from spaCy and elsewhere see how topic-specific language differs.\n-Visualizing topic models from scikit-learn.\nLinks\n-Source code for the package is hosted on Github at github.com/JasonKessler/scattertext.\n-For more information, please see the paper which will appear as a 2017 ACL Demo at https://arxiv.org/abs/1703.00565.\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 2070,
  "language": "eng",
  "recorded": "2017-07-24",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/seattle2017/schedule"
    },
    "https://arxiv.org/abs/1703.00565.",
    "https://github.com/JasonKessler/Scattertext-PyData."
  ],
  "speakers": [
    "TODO",
    "enter_manually"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/H7X9CA2pWKo/maxresdefault.jpg",
  "title": "Jason Kessler - Using Scattertext and the Python NLP Ecosystem for Text Visualization",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=H7X9CA2pWKo"
    }
  ]
}
