{
  "copyright_text": "Standard YouTube License",
  "description": "Link to Slides: https://www.slideshare.net/secret/x8P1vnpGJIh31t\n\nDescription\nWe are developing the next generation of the Allen Brain Observatory, in which we will release neuronal activity across multiple cell types and brain regions while mice are making decisions based on the images they see. In this talk, we provide an overview of our Python-based infrastructure built to integrate automated training of mice into our existing open neuroscience data generation pipeline.\n\n**Abstract**\n\nThe Allen Brain Observatory, the newest publicly available resource from the Allen Institute for Brain Science, presents the first standardized and freely downloadable survey of neuronal activity in the mouse visual cortex, featuring representations of the visual world among 27,154 neurons at the latest release. We are developing the second generation of this dataset, in which we will release neuronal activity across multiple cell types and brain regions while mice are making decisions based on the images they see. In this talk, we provide an overview of our Python-based infrastructure built to integrate automated training of mice into our existing open neuroscience data generation pipeline. This infrastructure includes:\n\n- Automated training algorithms built on PsychoPy & PyDAQmx\n- PyQT & Flask-based GUIs that allow technicians to manage training sessions & maintain mouse health records\n- Real time monitoring & web-based data visualization with VEGA & pyzmq\n- Posthoc analysis and visualization with pandas, matplotlib, & seaborn\n- Automated progression through training stages using the transitions state machine framework",
  "duration": 2037,
  "language": "eng",
  "recorded": "2017-07-06",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/seattle2017/schedule"
    },
    {
      "label": "slides",
      "url": "https://www.slideshare.net/secret/x8P1vnpGJIh31t"
    }
  ],
  "speakers": [
    "Justin Kiggins",
    "Doug Ollerenshaw"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/rn8S9wenARs/maxresdefault.jpg",
  "title": "Building a Brain Observatory for Visual Behavior",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rn8S9wenARs"
    }
  ]
}
