{
  "copyright_text": "Standard YouTube License",
  "description": "Link to Slides: https://www.slideshare.net/secret/x8P1vnpGJIh31t\n\nDescription\nWe are developing the next generation of the Allen Brain Observatory, in which we will release neuronal activity across multiple cell types and brain regions while mice are making decisions based on the images they see. In this talk, we provide an overview of our Python-based infrastructure built to integrate automated training of mice into our existing open neuroscience data generation pipeline.\n\nAbstract\nThe Allen Brain Observatory, the newest publicly available resource from the Allen Institute for Brain Science, presents the first standardized and freely downloadable survey of neuronal activity in the mouse visual cortex, featuring representations of the visual world among 27,154 neurons at the latest release. We are developing the second generation of this dataset, in which we will release neuronal activity across multiple cell types and brain regions while mice are making decisions based on the images they see. In this talk, we provide an overview of our Python-based infrastructure built to integrate automated training of mice into our existing open neuroscience data generation pipeline. This infrastructure includes:\n\n-Automated training algorithms built on PsychoPy & PyDAQmx\n-PyQT & Flask-based GUIs that allow technicians to manage training sessions & maintain mouse health records\n-Real time monitoring & web-based data visualization with VEGA & pyzmq\n-Posthoc analysis and visualization with pandas, matplotlib, & seaborn\n-Automated progression through training stages using the transitions state machine framework\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 2037,
  "language": "eng",
  "recorded": "2017-08-02",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/seattle2017/schedule"
    },
    "https://www.slideshare.net/secret/x8P1vnpGJIh31t"
  ],
  "speakers": [
    "TODO",
    "enter_manually"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/rn8S9wenARs/maxresdefault.jpg",
  "title": "Justin Kiggins, Doug Ollerenshaw - Building a Brain Observatory for Visual Behavior",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rn8S9wenARs"
    }
  ]
}
