{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Description\nStreaming or batch is an ongoing debate with the large-scale adoption of “Big Data”. In this talk, we discuss the pros & cons of batch vs. streaming processing, especially with respect to the workflow of data engineers and data scientists. We also present a a demo using PySpark Logistic Regression for offline and online model training to illustrate the difference between the two.\n\nAbstract\nThe large-scale adoption of “Big Data” has created a multitude of exciting new job roles and technologies. In line with this, data scientists and data engineers have both become key members of many technology teams, a coexistence which has often motivated the debate: streaming or batch? In this talk, we discuss the pros & cons of batch vs. streaming processing, especially with respect to finding common ground between the data engineer and data scientist’s workflows. We address the types of cases that are applicable to batch processing, streaming processing, or both. Finally, we present a demo using PySpark Logistic Regression for offline or online decisioning and model updating, to illustrate different ways to utilize batch and/or streaming processing to apply machine learning to real-time data.\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 1765,
  "language": "eng",
  "recorded": "2017-07-24",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/seattle2017/schedule"
    }
  ],
  "speakers": [
    "Keira Zhou"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/lpXCd2dcWUE/maxresdefault.jpg",
  "title": "Batch and Streaming Processing in the World of Data Engineering and Data Science",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lpXCd2dcWUE"
    }
  ]
}
