{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Ever wonder if 10,000 hours is really the baseline? Did some set of events make the difference in someone getting to the olympics? WorldRowing has captured data on races and athletes for decades but little has been done to analyze the data across countries, athletes and races to the possible outcomes and where investment might be best to identify impact to rowing at a high performance level. Data for each race, for each athlete is stored on the WorldRowing website. Varying amounts of personal information, plus race information, is available for athletes spanning several decades. This talk investigates the athlete race data from WorldRowing.com and demonstrates an end to end walk through of a data analysis problem using Python. Introduction/Problem Statement ⁃ World Rowing Athlete Database ⁃ Description of the data\n\nData Analysis ⁃ Scraping the data - what to get, how to get it ⁃ Data Munging and Wrangling ⁃ Analysis - Does the data show correlations?\n\nTakeaways ⁃ How to identify a problem for data analysis ⁃ Dealing with inconsistent data ⁃ Drawing conclusions from that dataset\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 2240,
  "language": "eng",
  "recorded": "2017-07-24",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/seattle2017/schedule"
    }
  ],
  "speakers": [
    "Lou Harwood"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/iJteZT4e7sc/maxresdefault.jpg",
  "title": "WorldRowing com: End To End Data Analysis",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iJteZT4e7sc"
    }
  ]
}
