{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Vincent Van Gogh was noticeably one of the most influential artistic figures of the Western art. Won't it be great, if one is able to teach machines to paint in a similar manner to create visually appealing images. In this talk, we will learn how to paint images with the help of Convolutional Neural Network - VGG-19 using TensorFlow, SparkMagic and Livy to imitate renowned artists.\n\n**Abstract**\n\nHumans have continuously mastered the art of painting images that are visually appealing. They are able mix multiple different styles to produce new styles which instantly catches our attention. Generating such high quality images using algorithms have been less explored in the past. With the advancement in computer vision and object recognition coupled by maturity of Deep Learning frameworks, recently it has become more convenient to generate high quality emotional intuitive artistic images. In 2015, Leon A. Gatys et al, published paper \"Image Style Transfer Using Convolutional Neural Network\" explaining how to generate artistic images using neural representation to separate and combine random input images using a very deep Convolutional Neural Network - VGG-VD. In this talk, we take a fun dive into learning to be a painter by extracting relevant feature representation from high performing Neural Network using TensoFlow, SparkMagic and Livy in a scalable manner.\n\nTake away for the audience:\n\n1. Develop basic understanding of Convolutional Neural Network\n2. Realize benefits of using TensforFlow in building Deep Neural Networks\n3. Learn how to use SparkMagic and Livy to build scalable solutions\n4. Learn how to make machines paint like experts\n5. Learn how to apply this style of painting to create poster thumbnails which might have wide variety of applications",
  "duration": 2373,
  "language": "eng",
  "recorded": "2017-07-06",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/seattle2017/schedule"
    }
  ],
  "speakers": [
    "Pramit Choudhary"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/WXDr5H1hVOU/maxresdefault.jpg",
  "title": "Learn to be a painter using Neural Style Painting",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WXDr5H1hVOU"
    }
  ]
}
