{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "In an age where decisions are increasingly powered by data, the benefits of being data-driven are undeniable. We no longer need to convince the data science community of the value of data. But can the same be said about the value of diversity? This panel discussion and QA will be framed around the benefits of inclusion efforts and how building a diverse data science community benefits everyone.\n\n**Abstract**\n\nThis session will be organized as a panel and QA discussion around the need for diversity, how diversity drives excellence, and incentivizing a diverse community. The panel participants will represent an array of diversity in backgrounds, experiences, current job positions, and career stages.\n\nThe flow of the discussion will loosely follow this general outline: Brief panelist introductions What obstacles have you encountered to building a diverse community? What lessons can you share about overcoming these obstacles? What actionable advice do you have for someone who is trying to increase understanding of the value of building a diverse a community?\n\nThe goals of the session are to build a discussion such that the audience will Learn about how others have overcome obstacles to inclusive environments. Have an increased understanding of how diversity benefits more than the minority. Connect with others and share resources for building up communities in which the importance of diversity is a foundational principle.",
  "duration": 3225,
  "language": "eng",
  "recorded": "2017-07-06",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/seattle2017/schedule"
    }
  ],
  "speakers": [
    "Various speakers"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/xOcbLqnFUa8/maxresdefault.jpg",
  "title": "How diversity drives excellence in our data driven tech world",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xOcbLqnFUa8"
    }
  ]
}
