{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Description\nThis tutorial will walk through Visual Studio 2017, including how to set it up for use with Python and R, and the features it provides that will make you a more efficient, effective, and happier data scientist or engineer.\n\nAbstract\nAccording to Stack Overflow's developer survey for 2017, the majority of data scientists are working in Visual Studio, and with the latest release of Visual Studio 2017 including support for Python and R out of the box, there is a good reason for this. In this tutorial, we will walk through setting up Visual Studio 2017, its special features for Python and R developers, and the features it provides for all languages that will make you a more efficient, effective, and happier data scientist or engineer.\n\nBring your Windows laptop or virtual machine, and to prepare ahead of time, install Visual Studio 2017 Community (or Professional/Enterprise if you have access) from visualstudio.com, and select the \"Data Science and Analytical Applications\" workload.\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 7224,
  "language": "eng",
  "recorded": "2017-07-24",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/seattle2017/schedule"
    }
  ],
  "speakers": [
    "TODO",
    "enter_manually"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/dLHa78bEtwA/maxresdefault.jpg",
  "title": "Steve Dower - Effective Visual Studio",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dLHa78bEtwA"
    }
  ]
}
