{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Description\nThis tutorial aims to introduce beginner Python learners to the diverse types of data a data scientist may face at work: time series, images, videos, text, graphs, geospatial data. In two hours participants will become comfortable handling each type of data and extracting interesting information from it. Participants will also learn tips and tricks how to handle large datasets of each kind.\n\nAbstract\nData are all around us and come in all sizes and shapes. As a beginner Python learner you often dream to become a master of all data types and handle them with ease: but soon you get intimidated by piles of libraries and unfamiliar jargon surrounding specific data formats and processing tools. The good news is that once you overcome the initial hurdles, you realize that you can analyze these diverse datasets using similar methodology.\n\nThe goal of this tutorial is to provide participants with hands-on experience working with diverse types of data: text, sound, video, graphs, GIS. Each data module will include an example with a small dataset to introduce the properties of the data type, and one with a larger dataset to equip the learners with tools to handle the vast data in the wild. Throughout the tutorial we will illustrate how same data mining techniques can be used on different types of data.\n\nhttps://github.com/valentina-s/Novice2DataNinja\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 6880,
  "language": "eng",
  "recorded": "2017-07-24",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/seattle2017/schedule"
    },
    "https://github.com/valentina-s/Novice2DataNinja"
  ],
  "speakers": [
    "TODO",
    "enter_manually"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/z-NcSu2uYxw/maxresdefault.jpg",
  "title": "Valentina Staneva - From Novice to Data Ninja",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=z-NcSu2uYxw"
    }
  ]
}
