{
  "description": "The talk is aimed at everyone that wants to learn how to put data science in practice more effectively. The traits can help individual contributors, collaborating teams or even organisations that are looking to become more effective in how they organize. Sharing these traits will hopefully speed up your development as a data science enthusiast.\nThe talk will touch on the following topics:\n-Brief intro of Data Science @ bol.com\n-Introduce the six traits that made the list (so far)\n-Highlight two in more details from personal experience and actual use cases\n-Engage with the audience for feedback and reflection\n\nIn the highlighted examples I will talk about two use case from personal experience. In the first, I'll talk about how we introduced a paradigm shift in how we create and use data driven forecasts to improve how we operate many processes across bol.com. In the second, I'll share the approach taken to help governmental agencies make better use of data to predict COVID outbreaks and enable them to adopt their strategy using novel techniques and data sources.\nThe following traits will be presented and highlighted (in rough order):\n-Fail fast to learn fast\n-Understand your solution\n-Pick the right tool\n-Take small directed steps\n-Collaborate with T-shaped teams\n-Excite your users\n\nThe talk will be supported with real time feedback from Menti and encourages feedback from the audience. This list was compiled based on many iterations and lots of feedback, and will definitely change after this session once again. I'm hoping you'll help and further refine the list for future sessions.\n\nErick Webbe\nLinkedIn: https://www.linkedin.com/in/erick-webbe-2634a633//\n\nPyData Eindhoven 2021\nWebsite: https://pydata.org/eindhoven2021/\nTwitter: https://twitter.com/pydataeindhoven\n\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1845,
  "language": "eng",
  "recorded": "2021-11-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/eindhoven2021/"
    },
    {
      "label": "https://www.linkedin.com/in/erick-webbe-2634a633//",
      "url": "https://www.linkedin.com/in/erick-webbe-2634a633//"
    },
    {
      "label": "https://twitter.com/pydataeindhoven",
      "url": "https://twitter.com/pydataeindhoven"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://pydata.org/eindhoven2021/",
      "url": "https://pydata.org/eindhoven2021/"
    }
  ],
  "speakers": [
    "Erick Webbe"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/CbgLFnuMidc/maxresdefault.jpg",
  "title": "An incomplete list of implementing data science effectively",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CbgLFnuMidc"
    }
  ]
}
