{
  "description": "Biosensors allow you to perform data science on your own bio signals, like brainwaves, heart rates and electrical muscle signals. How cool is that?! In this talk I'll briefly introduce you to the open source community growing around biosensor devices. \nI will explain briefly what biosensors are. What kinds are available to consumers and engineers. What sensors do I have myself? How to obtain the data from them. \nFor the latter part I will introduce the open source BrainFlow library, for which I am a voluntary open source developer. It is a fast performing c++ library that's easy to use, can be deployed anywhere and has many language bindings, including Python and Julia. BrainFlow allows anyone with a biosensor to extract their own data with little hassle and build applications in their favorite programming language.\nI will show code examples for how to obtain data from such biosensors, using Julia and BrainFlow. I specifically demonstrate gesture predictions using myo-electric muscle sensors. This topic I investigated for building open source bionic arm control systems. I would like to do a live demo, or at least show videos of the live data streaming and machine learning predictions. You can control real devices with these algorithms, like bionic arms, but I have also used it to play video games.\nThe live data processing, data streaming and machine learning predictions need to be as fast as possible, so I wrote all my code in Julia to show it is performant enough for this task.\n\nMatthijs Cox : A physicist who loves to code. I taught myself data science, software development and neurotechnology. I learned all about biosensors and neurotechnology as founder of the Symbionic Project where we tried to create more affordable bionic arms.\nCurrently I am a product architect at ASML, developing numerical computing applications. We struggle a lot with the two language problem at ASML. In order to solve this problem I discovered Julia about two years ago. Julia is now my favorite programming language.\n\nGitHub: https://github.com/matthijscox/\nTwitter: https://twitter.com/matthijscox/\nLinkedIn: https://www.linkedin.com/in/matthijscox//\nWebsite: https://www.functionalnoise.com/\n\nPyData Eindhoven 2021\nWebsite: https://pydata.org/eindhoven2021/\nTwitter: https://twitter.com/pydataeindhoven\n\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1569,
  "language": "eng",
  "recorded": "2021-11-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/eindhoven2021/"
    },
    {
      "label": "https://www.linkedin.com/in/matthijscox//",
      "url": "https://www.linkedin.com/in/matthijscox//"
    },
    {
      "label": "https://twitter.com/pydataeindhoven",
      "url": "https://twitter.com/pydataeindhoven"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/matthijscox/",
      "url": "https://github.com/matthijscox/"
    },
    {
      "label": "https://pydata.org/eindhoven2021/",
      "url": "https://pydata.org/eindhoven2021/"
    },
    {
      "label": "https://www.functionalnoise.com/",
      "url": "https://www.functionalnoise.com/"
    },
    {
      "label": "https://twitter.com/matthijscox/",
      "url": "https://twitter.com/matthijscox/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/kLj0JQKhNMM/maxresdefault.jpg",
  "title": "Biosensor Machine Learning with Julia- Matthijs Cox | PyData Eindhoven 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kLj0JQKhNMM"
    }
  ]
}
