{
  "description": "This paper describes a hybrid agent trained to play in Fantasy Football AI which participated in the Bot Bowl III competition. The agent, MimicBot, is implemented using a specifically designed deep policy network and trained using a combination of imitation and reinforcement learning. Previous attempts in using a reinforcement learning approach in such context failed for a number of reasons, e.g. due to the intrinsic randomness in the environment and the large and uneven number of actions available, with a curriculum learning approach failing to consistently beat a randomly paying agent. Currently no machine learning approach can beat a scripted bot which makes use of the domain knowledge on the game. Our solution, thanks to an imitation learning and a hybrid decision-making process, consistently beat such scripted agents. Moreover we shed lights on how to more efficiently train in a reinforcement learning setting while drastically increasing sample efficiency. MimicBot is the winner of the Bot Bowl III competition, and it is currently the state-of-the-art solution.\n\nNicola Pezzotti: is a Senior Scientist in Artificial Intelligence at Philips Research, Eindhoven, the Netherlands and assistant professor at Eindhoven University of Technology. His research interests include machine learning, medical imaging, visual analytics, explainable AI, optimization techniques and software engineering. He received his BSc and MSc degrees in Computer Science and Engineering from the University of Brescia, Italy, in 2009 and 2011. He received his PhD cum Laude from Delft University of Technology, the Netherlands, in 2018. Besides his experience in the startup world, he was a visiting scientist to INRIA Saclay, Paris, in 2017 and Google AI, Zurich, in 2018. He is recipient of several awards, including the IEEE VGTC Best Dissertation Award, TU Delft Excellence in Research and the Dirk Bartz Prize for Visual Computing in Medicine.\n\nGitHub: https://github.com/Nicola17/\nTwitter: https://twitter.com/nicolapezzotti/\nLinkedIn: https://www.linkedin.com/in/nicola-pezzotti-58670527/\n\nPyData Eindhoven 2021\nWebsite: https://pydata.org/eindhoven2021/\nTwitter: https://twitter.com/pydataeindhoven\n\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1749,
  "language": "eng",
  "recorded": "2021-11-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/eindhoven2021/"
    },
    {
      "label": "https://www.linkedin.com/in/nicola-pezzotti-58670527/",
      "url": "https://www.linkedin.com/in/nicola-pezzotti-58670527/"
    },
    {
      "label": "https://twitter.com/pydataeindhoven",
      "url": "https://twitter.com/pydataeindhoven"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/nicolapezzotti/",
      "url": "https://twitter.com/nicolapezzotti/"
    },
    {
      "label": "https://github.com/Nicola17/",
      "url": "https://github.com/Nicola17/"
    },
    {
      "label": "https://pydata.org/eindhoven2021/",
      "url": "https://pydata.org/eindhoven2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/XX-OkBcG5WI/maxresdefault.jpg",
  "title": "Combining Imitation + Reinforcement Learning to win the Bot Bowl competition | PyData Eindhoven 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XX-OkBcG5WI"
    }
  ]
}
