{
  "description": "Machine Learning Operations is the most hyped topic these days, but let's have a talk without much hype. Shall we? In this one, I am going to discuss stages of the machine learning project with emphasis on practical aspects of each stage. In these 30 minutes you will learn about scoping, data, modelling and deployment parts of the ML project. Proper understanding of these stages will allow a smooth transition of your Untitled_final.ipynb to production deployment bringing value to your business stakeholders. The focus of this talk is to guide the audience throughout the ML lifecycle considering best practices and advice for the following stages:\n-Scoping \n-Data\n-Modeling \n-Deployment \n\nBy the end of this talk, you will know which important questions to ask before starting ML project, answers on which will boost the development cycle. We will also briefly touch upon tooling for MLOPS and ML team composition. The takeaway of tips and best practices with help you to set current and future ML projects on the rails of success.\n\nVladimir Osin\nGitHub: https://github.com/osin-vladimir\nLinkedIn: https://www.linkedin.com/in/vosin//\n\nPyData Eindhoven 2021\nWebsite: https://pydata.org/eindhoven2021/\nTwitter: https://twitter.com/pydataeindhoven\n\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2034,
  "language": "eng",
  "recorded": "2021-11-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/eindhoven2021/"
    },
    {
      "label": "https://twitter.com/pydataeindhoven",
      "url": "https://twitter.com/pydataeindhoven"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/osin-vladimir",
      "url": "https://github.com/osin-vladimir"
    },
    {
      "label": "https://www.linkedin.com/in/vosin//",
      "url": "https://www.linkedin.com/in/vosin//"
    },
    {
      "label": "https://pydata.org/eindhoven2021/",
      "url": "https://pydata.org/eindhoven2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/dzSp3Zf897g/maxresdefault.jpg",
  "title": "MLOPS 101: Tips, Tricks and Best Practices- Vladimir Osin | PyData Eindhoven 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dzSp3Zf897g"
    }
  ]
}
