{
  "description": "In particular, I'll discuss:\n-a general method to calm down optimistic claims of optimal results\n-how easy it is to draw the wrong lesson when running a grid-search\n-how data is a much better proxy for interpretation than hyperparameters\n-how easy it is to find wrong labels in public datasets\n-why sentiment models are generally a bit strange\n-tricks to deal with some of these issues\n\nThere will also be a demo, and an announcement, of a new python project\n\nMy name is Vincent, ask me anything. I have been evangelizing data and open source for the last 7 years. You might know my from tech talks where I attempt to defend common sense over hype in data science.\nCurrently, I work as a Research Advocate at Rasa where I collaborate with the research team to explain and understand conversational systems better.\n\nIn my spare time, I maintain a suite of open source packages (scikit-lego, human-learn, whatlies, tokenwiser, clumper, memo, pytest-duration-insights, mktestdocs, and more). I'm also building some online services (calmcode.io and dearme.email).\nGithub: https://github.com/koaning/\nTwitter: https://twitter.com/fishnets88/\nLinkedIn: https://www.linkedin.com/in/vincentwarmerdam//\nWebsite: https://koaning.io/\n\nPyData Eindhoven 2021\nWebsite: https://pydata.org/eindhoven2021/\nTwitter: https://twitter.com/pydataeindhoven\n\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2194,
  "language": "eng",
  "recorded": "2021-11-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/eindhoven2021/"
    },
    {
      "label": "https://twitter.com/pydataeindhoven",
      "url": "https://twitter.com/pydataeindhoven"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/fishnets88/",
      "url": "https://twitter.com/fishnets88/"
    },
    {
      "label": "https://koaning.io/",
      "url": "https://koaning.io/"
    },
    {
      "label": "https://github.com/koaning/",
      "url": "https://github.com/koaning/"
    },
    {
      "label": "https://www.linkedin.com/in/vincentwarmerdam//",
      "url": "https://www.linkedin.com/in/vincentwarmerdam//"
    },
    {
      "label": "https://pydata.org/eindhoven2021/",
      "url": "https://pydata.org/eindhoven2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/lJKPiOf_o8k/maxresdefault.jpg",
  "title": "Optimal on Paper, Broken in Reality- Vincent D. Warmerdam | PyData Eindhoven 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lJKPiOf_o8k"
    }
  ]
}
