{
  "description": "Most engineers dabble in programming, hate repeating things, and like optimising, so they usually have a few directories full of python or Matlab scripts to help them with their analysis. While these tools can be very powerful, they are rarely understandable, let alone usable to anyone else. But what if those scripts can be turned into a product? Andrew has built a few tools from own-analysis scripts into products for a wide range of users. He will discuss some of the challenges of building software for other people, and some of the approaches including using Lambda functions, API Gateway, React and a variety of other tools.\n\nAndrew Rutgers: Andrew is the CEO of ChargeSim a SaaS Simulation and analysis tool which helps plan EV chargers for fleets, cutting the costs to change bus and other fleets to electric. He started with electric vehicles racing solar powered cars, then moved on to solar-powered airplanes. He has built software throughout his career, including in C and Assembly for 8-bit microcontrollers for power electronics, C++ for image analysis during his PhD, Matlab for analysis tools, recently he has been working in Python and React and is Julia-curious. He has a PhD in Electrical Engineering and an MBA in Circular Economy. In his spare time he boulders, runs marathons and co-hosts the Tangible Computing Podcast\nGitHub:https://github.com/andrew-chargesim/\nLinkedIn: https://www.linkedin.com/in/andrew-rutgers//\n\nPyData Eindhoven 2021\nWebsite: https://pydata.org/eindhoven2021/\nTwitter: https://twitter.com/pydataeindhoven\n\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1935,
  "language": "eng",
  "recorded": "2021-11-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/eindhoven2021/"
    },
    {
      "label": "https://twitter.com/pydataeindhoven",
      "url": "https://twitter.com/pydataeindhoven"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/andrew-rutgers//",
      "url": "https://www.linkedin.com/in/andrew-rutgers//"
    },
    {
      "label": "https://github.com/andrew-chargesim/",
      "url": "https://github.com/andrew-chargesim/"
    },
    {
      "label": "https://pydata.org/eindhoven2021/",
      "url": "https://pydata.org/eindhoven2021/"
    }
  ],
  "speakers": [
    "Andrew Rutgers"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/2sHKPYLIAhw/maxresdefault.jpg",
  "title": "The journey from home-brew analysis scripts to a product",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2sHKPYLIAhw"
    }
  ]
}
