{
  "description": "👉Aplica el análisis de sentimientos a tu red social desde cero por Angelica Alexandra Landazabal Maldonado\n🔗 Material: https://github.com/ALandazabal/Python-Pereira---Analisis-de-Sentimiento\n🔎 Descripción:\nEl motivo de esta charla es enseñar al público presente la utilización de herramientas capaces de detectar el sentimiento alrededor de un tópico a través del análisis sentimental, por medio de las publicaciones o comentarios que se generan en la plataforma de una red social, expresando de ésta manera su emoción y analizando los factores que hacen que la comunidad genere dicho sentimiento. Así mismo, la contextualización que se genera a través de estas herramientas es de gran utilidad debido a que ayudan a un análisis profundo en base a una publicación realizada o una situación en particular, por ejemplo, cómo la está pasando la comunidad de Python en la conferencia SciPy 2019 según los comentarios publicados en Twitter. También facilita la captura de palabras claves para tratar de especificar las causas que generen el sentimiento en tiempo real y a bajo coste, debido a que se elimina la utilización de las herramientas para la realización de recolección de datos con técnicas tradicionales como las encuestas o entrevistas.",
  "duration": 2425,
  "language": "eng",
  "recorded": "2022-04-27",
  "related_urls": [
    {
      "label": "https://github.com/ALandazabal/Python-Pereira---Analisis-de-Sentimiento",
      "url": "https://github.com/ALandazabal/Python-Pereira---Analisis-de-Sentimiento"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Google BigQuery",
    "Python",
    "Tecnología",
    "jupyter"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/VHbrXEsiq2M/maxresdefault.jpg",
  "title": "Aplica el análisis de sentimientos a tu red social desde cero | Python Pereira",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VHbrXEsiq2M"
    }
  ]
}
