{
  "description": "00:00:00 Introducción\n00:01:00 Creando un microservicio para almacenar archivos usando FastAPI + Mongo\n00:19:30 VSCode, más que un editor (Introducción al Debugging)\n01:04:00 Preguntas\n01:10:00 Eventos\n\n📣 Queremos invitarlos al primer meetup virtual del año, en esta ocación contaremos con dos interesantes charlas 🐍💻:\r\n👉 Creando un microservicio para almacenar archivos usando FastAPI + Mongo por Germán Grandas.\r\n🔎 Descripción: Dentro de todas las funcionalidades de MongoDb existe una diseñada para el almacenamiento de archivos llamada GridFS. En esta charla veremos cómo crear un GridFS, cómo agregar y descargar archivos del Grid usando como interfaz para comunicarnos con este servicio Motor, finalmente pondremos a disposición de los usuarios esta funcionalidad construyendo un servicio REST usando FastAPI. \r\n\r\n👉  VSCode, más que un editor (Introducción al Debugging) por Alejandro E. Rendon.\r\n🔎 Descripción: En el campo de la programación es común encontrarse con que nuestro código no funciona y simplemente no encontramos la razón. En algunas ocasiones, dedicamos mucho tiempo recorriendo las implementaciones y tratando de revisar las salidas para detectar posibles fallas, pistas o simplemente realizar pruebas. Ese tipo de operaciones podrían ser ejecutadas con eficiencia utilizando un Debugger.\r\n\r\nEl debugger o depurador es una herramienta que permite crear ambientes controlados en los cuales podemos comprobar la funcionalidad o simular cierto tipo de acciones en una implementación.\r\n\r\nEn esta ocasión hablaré sobre las ventajas y desventajas de usar este tipos de herramientas. Además, usaré VSCode como caso de estudio.\r\n⚠️Información importante⚠️\r\n🚩Evento Gratuito",
  "duration": 4322,
  "language": "eng",
  "recorded": "2022-04-27",
  "related_urls": [],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/LR1Vp90WwO8/maxresdefault.jpg",
  "title": "Creando un microservicio usando FastAPI + Mongo - VSCode, más que un editor | Python Pereira",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LR1Vp90WwO8"
    }
  ]
}
