{
  "description": "📣Queremos invitarlos a la Reunión Online #29 de Python Pereira 🎉\r\n\r\nEn esta ocasión contaremos con una interesante charla 🐍💻:\r\n\r\n👉 Procesamiento de Imágenes con Python por Carlos Alberto Bustillo López\r\n🔎 Descripción:\r\nIntroducción:\r\nEsta charla será una breve explicación para iniciarse en el amplió campo del procesamiento de imágenes basándonos en la librería OpenCV.\r\nEn primera instancia mostraremos un caso de uso sobre un agente racional que aprende, no omnisciente, que al entrenarlo aprenda a partir de sus percepciones y le permita ser autónomo gracias a la experiencia adquirida.\r\nLuego se hablará de las etapas esenciales que se debe tener en cuenta para el procesamiento de imágenes tales como: Adquisición de imágenes; Transformación; Prepocesamiento; Filtración; Extracción de rasgos y Clasificación de objetos. \r\n\r\nEl objetivo es que aprendamos las bases del procesamiento de imágenes mediante un ejemplo teórico-práctico. Muy útil cuando tenemos las ganas de arrancar con un proyecto de este tipo pero no sabemos por donde arrancar. \r\n\r\nPresentación:\r\nYo vivo en la capital del vino Mendoza, Argentina. La provincia, representa más del 60% de la producción de vino del país.\r\nHay una gran variedad de varietales, y para alguien que no es de la región es difícil reconocer cada uno a simple vista. \r\nSe pueden clasificar a partir de distintas características: color, pH, acidez, momentos de Hu, etc.\r\nPropongo un modelo de juguete para analizar uvas blancas, rosadas y azules. \r\nEn el cual  le presentamos una imagen al algoritmo y éste nos diga a qué clase de uva pertenece.\r\n\r\nRecursos:\r\nSe analizaron las clases grape Blue, Pink y White del dataset Fruits 360  en Kaggle.\r\nVer: https://www.kaggle.com/moltean/fruits \n\nMaterial: https://github.com/cabustillo13/Charla-procesamiento-de-imagenes\n\nhttps://medium.com/@carlosbustillo/solve-sudoku-9x9-with-computer-vision-and-a-constraint-satisfaction-algorithm-in-python-7bb27769c1eb\n\r\n⚠️Información importante⚠️\r\n🚩Evento Gratuito",
  "duration": 4366,
  "language": "eng",
  "recorded": "2022-04-27",
  "related_urls": [
    {
      "label": "https://www.kaggle.com/moltean/fruits",
      "url": "https://www.kaggle.com/moltean/fruits"
    },
    {
      "label": "https://medium.com/@carlosbustillo/solve-sudoku-9x9-with-computer-vision-and-a-constraint-satisfaction-algorithm-in-python-7bb27769c1eb",
      "url": "https://medium.com/@carlosbustillo/solve-sudoku-9x9-with-computer-vision-and-a-constraint-satisfaction-algorithm-in-python-7bb27769c1eb"
    },
    {
      "label": "https://github.com/cabustillo13/Charla-procesamiento-de-imagenes",
      "url": "https://github.com/cabustillo13/Charla-procesamiento-de-imagenes"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/cxC5dsKriqs/maxresdefault.jpg",
  "title": "Procesamiento de Imágenes con Python | Python Pereira",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cxC5dsKriqs"
    }
  ]
}
