{
  "alias": "video/2126/a-gentle-introduction-to-machine-learning-scipy-1",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2126,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "a-gentle-introduction-to-machine-learning-scipy-1",
  "speakers": [],
  "summary": "Authors: Kastner, Kyle, Southwest Research Institute\n\nTrack: Machine Learning\n\nThis talk will be an introduction to the root concepts of machine\nlearning, starting with simple statistics, then working into parameter\nestimation, regression, model estimation, and basic classification.\nThese are the underpinnings of many techniques in machine learning,\nthough it is often difficult to find a clear and concise explanation of\nthese basic methods.\n\nParameter estimation will cover Gaussian parameter estimation of the\nfollowing types: known variance, unknown mean; known mean, unknown\nvariance; and unknown mean, unknown variance.\n\nRegression will cover linear regression, linear regression using\nalternate basis functions, bayesian linear regression, and bayesian\nlinear regression with model selection.\n\nClassification will extend the topic of regression, exploring k-means\nclustering, linear discriminants, logistic regression, and support\nvector machines, with some discussion of relevance vector machines for\n\"soft\" decision making.\n\nStarting from simple statistics and working upward, I hope to provide a\nclear grounding of how basic machine learning works mathematically.\nUnderstanding the math behind parameter estimation, regression, and\nclassification will help individuals gain an understanding of the more\ncomplicated methods in machine learning. This should help demystify some\nof the modern approaches to machine learning, leading to better\ntechnique selection in real-world applications.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/NOm1zA_Cats/hqdefault.jpg",
  "title": "A Gentle Introduction To Machine Learning; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NOm1zA_Cats"
    }
  ]
}
