{
  "alias": "video/1966/a-rapidly-adaptable-imaging-measurement-platfor",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 1966,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "a-rapidly-adaptable-imaging-measurement-platfor",
  "speakers": [],
  "summary": "A Rapidly-Adaptable Analytical Imaging & Measurement Standardization\nPlatform for Cancer Diagnostics Research\n\nAuthors: Garsha, Karl, Ventana Medical Systems Inc.; Ventura, Franklin,\nVentana Medical Systems Inc.;\n\nTrack: Medical Imaging\n\nThe focus of personalized medicine is to develop rationally-designed\ntherapeutics targeting specific molecular mechanisms of diseases such as\ncancer. For targeted therapeutics to be of value in complex disease\nstates, such as cancer, patient-specific mechanism(s) of disease must be\nidentified by physicians such that the appropriate targeted\ntherapeutic(s) may be identified and administered. The ability to\nevaluate phenotype and genotype for multiplexed biomarkers at the\ncellular level, in the context of preserved tissue, provides important\ninformation for advancing the science of personalized medicine.\n\nClassical cancer diagnostic methods are based on direct inspection of\nprepared slides. In the classical approach, measurement and measurement\nstandardization are limited by the constraints of human perception,\nestablished tradition and training. Our research seeks to empower\nphysicians with new tools that diminish these existing limitations.\nThrough Python, we bring together sophisticated nano-reporter\ntechnology, advanced microscopies, computational analysis and databasing\ntechnologies to establish feasibility of analytical tissue assay\ntechnology. Advancement of this technology is hoped eventually to enable\npowerful new opportunities for treatment of cancer.\n\nOur work is greatly accelerated through the collective efforts of the\nPython community. The ability to leverage and combine rich scientific\nOpen Source projects including SciPy, VTK, ITK, PIL, wxPython,\nMatplotlib, ÂµManager, and OMERO are central to enabling this ambitious\neffort. Python allows us the synergy of sophisticated high-level\nlanguage interfaced with rich natively-compiled libraries. This\ncapability allows us to maintain a remarkable level of plasticity\nnecessary to adapt to fast-moving and diverse research problems, and\nscalability to visualize large and complex n-dimensional datasets. Rich\nGUI capabilities allow us to rapidly put powerful tools in the hands of\nmedical researchers.\n\nChallenges include mechanisms to pass high-level data structures between\nnative-compiled libraries, combining widgets from different GUI\ntoolkits, memory limits, and the complexity of building self-contained\ninstallers/uninstallers for deployment to collaborator sites.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/DDIW2rKxrbI/hqdefault.jpg",
  "title": "A Rapidly-Adaptable Imaging & Measurement Platform for Cancer Research; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DDIW2rKxrbI"
    }
  ]
}
