{
  "alias": "video/1988/advances-in-delivery-and-access-tools-for-coastal",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 1988,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "advances-in-delivery-and-access-tools-for-coastal",
  "speakers": [],
  "summary": "Authors: Signell, Richard, US Geological Survey\n\nTrack: Meteorology, Climatology, Atmospheric and Oceanic Science\n\nCoastal ocean modelers are producers and consumers of vast and varied\ndata, and spend significant effort on tasks that could be eliminated by\nbetter tools. In the last several years, standardization led by the US\nIntegrated Ocean Observing System Program to use OPeNDAP for delivery of\ngridded data (e.g. model fields, remote sensing) and OGC Sensor\nObservation Services (SOS) for delivery of in situ data (e.g. time\nseries sensors, profilers, ADCPs, drifters, gliders) has resulted in\nsignificant advancements, making it easier to deliver, find, access and\nanalyze data. For distributing model results, the Unidata THREDDS Data\nServer and PyDAP deliver aggregated data via OPeNDAP and other web\nservices with low impact on providers. For accessing data,\nNetCDF4-Python and PyDAP both allow efficient access to OPeNDAP data\nsources, but do not take advantage of common data models for structured\nand unstructured grids enabled by community-developed CF and UGRID\nconventions. This is starting to change with CF-data model based\nprojects like the UK Met Office Iris project. Examples of accessing and\nvisualizing both curvilinear and unstructured grid model output in\nPython will be presented, including both the IPython Notebook and ArcGIS\n10.1.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/EA8v770EcxE/hqdefault.jpg",
  "title": "Advances in delivery and access tools for coastal ocean model data; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EA8v770EcxE"
    }
  ]
}
