{
  "alias": "video/1978/all-by-all-learning-of-protein-complexes-from-mas-",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Authors: Blake Borgeson, Center for Systems and Synthetic Biology,\nUniversity of Texas at Austin; Cuihong Wa\n\nTrack: Bioinformatics\n\nDespite our knowledge that the vast majority of life's processes at a\ncellular level are carried out by complexes of multiple proteins,\nknowledge of all the complexes formed in a cell and their members is a\ndistant goal. By using a new approach first applied to human cell lines\nby collaborators Havugimana and Hart, et al, consisting of 1) subjecting\nbiological samples to many levels of many types of fractionations, 2)\nusing mass spectrometry to quantify protein levels in each fraction, and\n3) processing the data through a machine learning pipeline, we are able\nto seek complexes using a high-throughput all-by-all approach. By\nincorporating additional functional genomic information into our\nlearning process, we are able to reconstruct maps of complexes that\nrival in quality and far surpass in coverage those generated with\npreviously-used, much more labor-intensive methods such as affinity\npurification followed by mass spectrometry, or AP-MS. Here, using 6,000\nmass spectrometry experiments from more than 60 fractionated biological\nsamples from human, mouse, sea urchin, fly and worm, we predict with\nhigh confidence hundreds (~500) of expected and putative novel conserved\ncomplexes. IPython, SciPy, and scikit-learn are the foundational tools\nused to handle data integration and machine learning, and an integrated\npython environment for this work has been critical to the speed of\nprogress.\n",
  "duration": null,
  "id": 1978,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "all-by-all-learning-of-protein-complexes-from-mas-",
  "speakers": [
    "Blake Borgeson",
    "Cuihong Wa"
  ],
  "summary": "",
  "tags": [
    "bioinformatics",
    "machine learning"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/4qtek-GZGV0/hqdefault.jpg",
  "title": "All-by-all learning of protein complexes from mass spectrometry data",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4qtek-GZGV0"
    }
  ]
}
