{
  "alias": "video/2118/anatomy-of-matplotlib-scipy2013-tutorial-part-1-0",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2118,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-06-27",
  "related_urls": [
    "https://dl.dropbox.com/u/7325604/AnatomyOfMatplotlib.ipynb"
  ],
  "slug": "anatomy-of-matplotlib-scipy2013-tutorial-part-1-0",
  "speakers": [],
  "summary": "Presenter: Benjamin Root\n\nDescription\n\nThis tutorial will be the introduction to matplotlib, intended for users\nwho want to become familiar with python's predominate scientific\nplotting package. First, the plotting functions that are available will\nbe introduced so users will know what kinds of graphs can be done. We\nwill then cover the fundamental concepts and terminologies, starting\nfrom the figure object down to the artists. In an organized and logical\nfashion, the components of a matplotlib figure are introduced, such as\nthe axes, axis, tickers, and labels. We will explain what an Artist is\nfor, as well as explain the purpose behind Collections. Finally, we will\ntake an overview of the major toolkits available to use, particularly\nAxesGrid, mplot3d and basemap.\n\nOutline\n\nOutline:\n\nIntroduction\n\nPurpose of matplotlib Online Documentation Examples Page Gallery Page\nFAQs API documentation Mailing Lists Github Repository Bug Reports &\nFeature Requests What is this \"backend\" thing I keep hearing about?\n\nPlotting Functions\n\nGraphs (plot, scatter, bar, stem, etc.) Images (imshow, pcolor,\npcolormesh, contour[f], etc.) Lesser Knowns: (pie, acorr, hexbin, etc.)\nBrand New: streamplot() What goes in a Figure?\n\nAxes Axis ticks (and ticklines and ticklabels) (both major & minor) axis\nlabels axes title figure suptitle axis spines colorbars (and the\noddities thereof) axis scale axis gridlines legend (Throughout the\naforementioned section, I will be guiding audience members through the\ncreation and manipulation of each of these components to produce a fully\ncustomized graph)\n\nIntroducing matplotlibrc\n\nHands-On: Have users try making some changes to the settings and see how\na resulting figure changes What is an Artist?\n\nHands-On: Have audience members create some and see if they can get them\ndisplayed What is a Collection?\n\nHands-On: Have audience members create some, manipulate the properties\nand display them Properties:\n\ncolor (and edgecolor, linecolor, facecolor, etc...) linewidth and\nedgewidth and markeredgewidth (and the oddity that happens in\nerrorbar()) linestyle zorder visible What are toolkits?\n\naxes\\_grid1 mplot3d basemap Required Packages\n\nNumPy\n\nMatplotlib (version 1.2.1 or later is preferred, but earlier version\nshould still be sufficient for most of the tutorial)\n\nipython v0.13\n\nDocumentation\n\nhttps://dl.dropbox.com/u/7325604/AnatomyOfMatplotlib.ipynb\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/FhMmhYV7tNw/hqdefault.jpg",
  "title": "Anatomy of Matplotlib, SciPy2013 Tutorial, Part 1 of 3",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FhMmhYV7tNw"
    }
  ]
}
