{
  "alias": "video/1970/automating-quantitative-confocal-microscopy-analy",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 1970,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "automating-quantitative-confocal-microscopy-analy",
  "speakers": [],
  "summary": "Authors: Fenner, Mark; Fenner, Barbara, King's College, Wilkes-Barre, PA\n\nTrack: Medical Imaging\n\nConfocal microscopy is a qualitative analytical tool used to visualize\nthe associations between cellular processes and anatomical structures.\nQuantitative analysis of confocal images uses domain expertise, in the\nform of background correction, and statistical calculations to give\nsemi-quantitative comparisons among experimental conditions. Extended\nautomation of quantitative confocal methods will (1) reduce the time\nconsuming effort of manual background correction and (2) give a fully\nquantitative method to associate cellular process with structure.\n\nThe purpose of this project is: (1) to develop automated methods to\nquantitatively assess colocalization of multiple fluorescent labels\nwithin confocal images and (2) to apply these methods to assess\ncolocalization of trkB.t1 and BDNF to three types of organelles:\nendosomes, lysosomes, and transport organelles. Computing quantitative\ncolocalization values requires image correction for background noise. We\nperform background correction in three ways: (1) manual, (2) automated\nheuristic analysis of the label intensity histograms, and (3)\napplication of a regression model developed from a subset of manually\ncorrected images. Using the corrected images, we compute a set of domain\nspecific correlations: Pearson's and Mander's coefficients, the\n'colocalization coefficients' (M1, M2, m1, and m2), and the 'overlap\ncoefficients' (k1 and k2).\n\nThe project is implemented, end-to-end, in Python. Pure Python is used\nfor managing file access, input parameters, and initial processing of\nthe repository of 933 images. NumPy is used to apply manual background\ncorrection, compute the automated background corrections (reducing false\npositive results and manual labor), and to calculate the domain specific\ncoefficients. We visualize the raw intensity values and computed\ncoefficient values with Tufte-style panel plots created in matplotlib. A\nlonger term goal of this work is to explore plausible extensions of\ndual-label coefficients to triple-label coefficients.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/ar5YtgiXfNI/hqdefault.jpg",
  "title": "Automating Quantitative Confocal Microscopy Analysis; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ar5YtgiXfNI"
    }
  ]
}
