{
  "alias": "video/1992/best-practice-variant-calling-pipeline-for-automa-",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 1992,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "best-practice-variant-calling-pipeline-for-automa-",
  "speakers": [],
  "summary": "Best-practice variant calling pipeline for fully automated high\nthroughput sequencing analysis\n\nAuthors: Chapman, Brad; Kirchner, Rory; Hofmann, Oliver; Hide, Winston\n\nTrack: Bioinformatics\n\nbcbio-nextgen is an automated, scalable pipeline for detecting genomic\nvariants from large-scale next-generation sequencing data. It organizes\nmultiple best-practice tools for alignment, post-processing and variant\ncalling into a single, easily configurable pipeline. Users specify\ninputs and parameters in a configuration file and the pipeline handles\nall aspects of software and data management. Large-scale analysis run in\nparallel on compute clusters using IPython and on cloud systems using\nStarCluster. The goal is to create a validated and community maintained\npipeline for automated variant calling, allowing researchers to focus on\nanswering biological questions.\n\nOur talk will describe the practical challenges we face in scaling the\nsystem to handle large whole genome data for thousands of samples. We\nwill also discuss current work to develop a variant reference panel and\nassociated grading scheme that ensures reproducibility in a research\nworld with rapidly changing algorithms and tools. Finally we details\nplans for integration with STORMseq, a user-friendly Amazon front end,\ndesigned to make the pipeline available to non-technical users.\n\nThe presentation will show how bringing together multiple open-source\ncommunities provides infrastructure that bridges technical gaps and\nmoves analysis work to higher-level challenges.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/qNMPh0pIpBE/hqdefault.jpg",
  "title": "Best-practice variant calling pipeline for automated sequencing analysis; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qNMPh0pIpBE"
    }
  ]
}
