{
  "alias": "video/2016/breaking-the-diffraction-limit-with-python-and-sc",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2016,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "breaking-the-diffraction-limit-with-python-and-sc",
  "speakers": [],
  "summary": "Authors: Baddeley, David, Nanobiology Institute, Yale University\n\nTrack: General\n\nTextbook physics tells us that the resolution of a microsope is limited\nto half the wavelength of the radiation used. This means that structures\nsmaller than ~250 nm cannot be resolved in an optical microscope, and\nthat electron microscopy was required to study cellular nanostructures.\nRecent advances based on imaging stochastically switching fluorescent\nprobes have allowed the diffraction limit to be circumvented and optical\nimaging to be performed with a resolution of 10-20 nm. These new\nmethods, known as PALM (Photo-Activated Localisation Microscopy), STORM\n(STochastic Optical Reconstruction Microscopy), and a number of related\nacronyms are computationally intensive and involve detailed control of\nthe microscope hardware.\n\nI will present a comprehensive package for PALM/STORM microscope control\nand image analysis written in python and scipy. The package is modular,\nand comes complete with a facility for distributed data analysis. In\naddition to the specialised localisation microscopy components, there\nare many aspects of the project which are likely to be interesting to\nthe broader microscopy and image processing community. These include a\ngeneric microscope control package, an extensible 3D image viewer\nsupporting many basic image processing tasks, a 3D deconvolution\nsoftware (Richardson-Lucy and ICTM), as well as PSF simulation and pupil\nphase extraction code.\n\nMy knowledge of python has grown alongside the project, and In addition\nto giving an overview of the package, I will discuss some of the design\nchoices and mistakes I've made along the way.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/KiVwsCBkFYk/hqdefault.jpg",
  "title": "Breaking the diffraction limit with python and scipy; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KiVwsCBkFYk"
    }
  ]
}
