{
  "alias": "video/2165/cython-speed-up-python-and-numpy-pythonize-c-c-10",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2165,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-06-27",
  "related_urls": [
    "http://public.enthought.com/"
  ],
  "slug": "cython-speed-up-python-and-numpy-pythonize-c-c-10",
  "speakers": [],
  "summary": "Presenter: Kurt Smith\n\nDescription Cython is a flexible and multi-faceted tool that brings down\nthe barrier between Python and other languages. With cython, you can add\ntype information to your Python code to yield dramatic performance\nimprovements. Cython also allows you to wrap C, C++ and Fortran\nlibraries to work with Python and NumPy. It is used extensively in\nresearch environments and in end-user applications.\n\nThis hands-on tutorial will cover Cython from the ground up, and will\ninclude the newest Cython features, including typed memoryviews.\n\nTarget audience:\n\nDevelopers, researchers, scientists, and engineers who use Python and\nNumPy and who routinely hit bottlenecks and need improved performance.\n\nC / C++ / Fortran users who would like their existing code to work with\nPython.\n\nExpected level of knowledge:\n\nIntermediate and / or regular user of Python and NumPy. Have used\nPython's decorators, exceptions, and classes. Knowledge of NumPy arrays,\narray views, fancy indexing, and NumPy dtypes. Have programmed in at\nleast one of C, C++, or Fortran.\n\nSome familiarity with the Python or NumPy C-API a plus. Familiarity with\nmemoryviews and buffers a plus. Familiarity with OpenMP a plus.\nArray-based inter-language programming between Python and C, C++, or\nFortran a plus.\n\nRequired Packages\n\nAll necessary packages are available with an academic / full EPD\ninstallation, Anaconda, easy\\_install, or pip.\n\nUsers must have Cython v 0.16 or better for the course.\n\nThe tutorial material (slides, exercises & demos) will be available for\ndownload and on USB drives.\n\nDocumentation\n\nBasic slide content is based on Enthought's Cython training slides.\nThese slides will be reworked significantly for this tutorial. In\nparticular, the NumPy buffer declarations will be taken out and replaced\nwith the typed memoryview content listed in the outline. Other content\n(an IPython notebook with the start of the capstone project) is\navailable as well:\n\nhttp://public.enthought.com/~ksmith/scipy2013\\_cython/\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/kFLg5jw2esE/hqdefault.jpg",
  "title": "Cython: Speed up Python and NumPy, Pythonize C, C++, and Fortran, SciPy2013 Tutorial, Part 4 of 4",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kFLg5jw2esE"
    }
  ]
}
