{
  "alias": "video/1976/detection-and-characterization-of-interactions-of-",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Detection and characterization of interactions of genetic risk factors\nin disease\n\nAuthors: Francis-Lyon, Patricia, University of San Francisco; Belvadi,\nShashank, University of San Francisco; Wang, Lin, University of San\nFrancisco\n\nTrack: Bioinformatics\n\nIt is well known that two or more genes can interact so as to enhance or\nsuppress incidence of disease, such that the observed phenotype differs\nfrom when the genes act independently. The effect of a gene allele at\none locus can mask or modify the effect of alleles at one or more other\nloci. Discovery and characterization of such gene interactions is\npursued as a valuable aid in early diagnosis and treatment of disease.\nAlso it is hoped that the characterization of such interactions will\nshed light on biological and biochemical pathways that are involved in a\nspecific disease, leading to new therapeutic treatments.\n\nMuch attention has been focused on the application of machine learning\napproaches to detection of gene interactions. Our method is based upon\ntraining a supervised learning algorithm to detect disease, and then\nquantifying the effect on prediction accuracy when alleles of two or\nmore genes are perturbed to unmutated in patterns so as to reveal and\ncharacterize gene interactions. We utilize this approach with both a\nneural network and a support vector machine.\n\nWe test the versatility of our approach using seven disease models, some\nof which model gene interactions and some of which model biological\nindependence. In every disease model we correctly detect the presence or\nabsence of 2-way and 3-way gene interactions using our method with both\nneural network and support vector machine. We also correctly\ncharacterize all of the interactions as to the epistatic effect of gene\nalleles in both 2-way and 3-way gene interactions. We conclude that\nmachine learning approaches can be used to successfully detect and also\ncharacterize gene interactions in disease.\n",
  "duration": null,
  "id": 1976,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "detection-and-characterization-of-interactions-of-",
  "speakers": [
    "Lin Wang",
    "Patricia Francis-Lyon",
    "Shashank Belvadi"
  ],
  "summary": "Much attention has been focused on the application of machine learning\napproaches to detection of gene interactions. Our method is based upon\ntraining a supervised learning algorithm to detect disease, and then\nquantifying the effect on prediction accuracy when alleles of two or\nmore genes are perturbed to unmutated in patterns so as to reveal and\ncharacterize gene interactions.\n",
  "tags": [
    "bioinformatics",
    "machine learning"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/IA09mZRCCA8/hqdefault.jpg",
  "title": "Detection and characterization of interactions of genetic risk factors",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IA09mZRCCA8"
    }
  ]
}
