{
  "alias": "video/1974/estimating-and-visualizing-the-inertia-of-the-hum",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 1974,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "estimating-and-visualizing-the-inertia-of-the-hum",
  "speakers": [],
  "summary": "Authors: Moore, Jason, University of California at Davis; Dembia,\nChristopher, Stanford\n\nTrack: Medical Imaging\n\nThe Yeadon human body segment inertia model is a widely used method in\nthe biomechanical field that allows scientists to get quick and reliable\nestimations of mass, mass location, and inertia estimates of any human\nbody. The model is formulated around a collection of stadia solids that\nare defined by a series of width, perimeter, and circumference\nmeasurements. This talk will detail a Python software package that\nimplements the method and exposes a basic API for its use within other\ncode bases. The package also includes a text based user interface and a\ngraphical based user interface, both of which will be demonstrated. The\nGUI is implemented with MayaVi and allows the user to manipulate the\njoint angles of the human and instantaneously get inertia estimates for\nvarious poses. Researchers that readily need body segment and human\ninertial parameters for dynamical model development or other uses,\nshould find this package useful for quick interactive results. We will\ndemonstrate the three methods of using the package, cover the software\ndesign, show how the software can be integrated into other packages, and\ndemonstrate a non-trivial example of computing the inertial properties\nof a human seated on a bicycle.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/H9AK65ZY-Vw/hqdefault.jpg",
  "title": "Estimating and Visualizing the Inertia of the Human Body with Python; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=H9AK65ZY-Vw"
    }
  ]
}
