{
  "alias": "video/1998/exploring-disease-genetics-from-thousands-of-indi-",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 1998,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "exploring-disease-genetics-from-thousands-of-indi-",
  "speakers": [],
  "summary": "Authors: Quinlan, Aaron, University of Virginia; Paila, Uma, University\nof Virginia; Chapman, Brad, Harvard School of Public Health; Kirchner,\nRory,\n\nTrack: Bioinformatics\n\nThe throughput of DNA sequencing has increased by five orders of\nmagnitude in the last decade and geneticists can now sequence a complete\nhuman genome in 24 hours for less than $5000. This tremendous increase\nin efficiency has led to large-scale studies of the relationship between\ninherited genetic variation and human disease. While collecting genetic\nvariation from the genomes of thousands of humans is now possible,\nunraveling the genetic basis of disease remains a tremendous analytical\nchallenge. Interpretation is especially difficult since many genetic\nvariants associated with human disease lie outside the genomic regions\nthat encode genes. To address this challenge, we have developed GEMINI,\na flexible Python analysis framework for exploring human genetic\nvariation. By leveraging Numpy, SQLITE, and several powerful Python\npackages in the genomics domain, GEMINI integrates genome-scale genetic\nvariation from 1000s of individuals with a wealth of genome annotations\nthat are crucial for disease interpretation.\n\nGEMINI provides a powerful analysis framework allowing researchers to\nconduct otherwise complicated analyses with an easy to use analysis\ninterface. It provides methods for ad hoc data exploration, a\nprogramming interface for custom analyses, and both command line and\ngraphical tools for common analysis tasks. We demonstrate GEMINI's\nutility for exploring variation for personal genomes and family based\ngenetic studies. Thanks to advances such as IPython.parallel, we further\nillustrate the framework's ability to scale to studies involving\nthousands of human samples.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/p-UWmDG6yj4/hqdefault.jpg",
  "title": "Exploring disease genetics from thousands of individual genomes with Gemini; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=p-UWmDG6yj4"
    }
  ]
}
