{
  "alias": "video/2145/intro-to-scikit-learn-ii-scipy2013-tutorial-p-4",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2145,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-06-27",
  "related_urls": [
    "http://continuum.io/downloads.html",
    "http://www.enthought.com/products/epd\\_free.php",
    "https://github.com/jakevdp/sklearn\\_scipy2013"
  ],
  "slug": "intro-to-scikit-learn-ii-scipy2013-tutorial-p-4",
  "speakers": [],
  "summary": "Presenters: Gaël Varoquaux, Jake Vanderplas, Olivier Grisel\n\nDescription\n\nMachine Learning is the branch of computer science concerned with the\ndevelopment of algorithms which can learn from previously-seen data in\norder to make predictions about future data, and has become an important\npart of research in many scientific fields. This set of tutorials will\nintroduce the basics of machine learning, and how these learning tasks\ncan be accomplished using Scikit-Learn, a machine learning library\nwritten in Python and built on NumPy, SciPy, and Matplotlib. By the end\nof the tutorials, participants will be poised to take advantage of\nScikit-learn's wide variety of machine learning algorithms to explore\ntheir own data sets. The tutorial will comprise two sessions, Session I\nin the morning (intermediate track), and Session II in the afternoon\n(advanced track). Participants are free to attend either one or both,\nbut to get the most out of the material, we encourage those attending in\nthe afternoon to attend in the morning as well.\n\nSession II will build upon Session I, and assume familiarity with the\nconcepts covered there. The goals of Session II are to introduce more\ninvolved algorithms and techniques which are vital for successfully\napplying machine learning in practice. It will cover cross-validation\nand hyperparameter optimization, unsupervised algorithms, pipelines, and\ngo into depth on a few extremely powerful learning algorithms available\nin Scikit-learn: Support Vector Machines, Random Forests, and Sparse\nModels. We will finish with an extended exercise applying scikit-learn\nto a real-world problem.\n\nOutline\n\nTutorial 2 (advanced track)\n\n0:00 - 0:30 -- Model validation and testing Bias, Variance,\nOver-fitting, Under-fitting Using validation curves & learning to\nimprove your model Exercise: Tuning a random forest for the digits data\n0:30 - 1:30 -- In depth with a few learners SVMs and kernels Trees and\nforests Sparse and non-sparse linear models 1:30 - 2:00 -- Unsupervised\nLearning Example of Dimensionality Reduction: hand-written digits\nExample of Clustering: Olivetti Faces 2:00 - 2:15 -- Pipelining learners\nExamples of unsupervised data reduction followed by supervised learning.\n2:15 - 2:30 -- Break (possibly in the middle of the previous section)\n2:30 - 3:00 -- Learning on big data Online learning: MiniBatchKmeans\nStochastic Gradient Descent for linear models Data-reducing transforms:\nrandom-projections 3:00 - 4:00 -- Parallel Machine Learning with IPython\nIPython.parallel, a short primer Parallel Model Assessment and Selection\nRunning a cluster on the EC2 cloud using StarCluster\n\nhttps://github.com/jakevdp/sklearn\\_scipy2013\n\nRequired Packages\n\nThis tutorial will use Python 2.6 / 2.7, and require recent versions of\nnumpy (version 1.5+), scipy (version 0.10+), matplotlib (version 1.1+),\nscikit-learn (version 0.13.1+), and IPython (version 0.13.1+) with\nnotebook support. The final requirement is particularly important:\nparticipants should be able to run IPython notebook and create &\nmanipulate notebooks in their web browser. The easiest way to install\nthese requirements is to use a packaged distribution: we recommend\nAnaconda CE, a free package provided by Continuum Analytics:\nhttp://continuum.io/downloads.html or the Enthought Python Distribution:\nhttp://www.enthought.com/products/epd\\_free.php\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/uX4ZirOiWkw/hqdefault.jpg",
  "title": "Intro to scikit-learn (II), SciPy2013 Tutorial, Part 1 of 2",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uX4ZirOiWkw"
    }
  ]
}
