{
  "alias": "video/2156/intro-to-scikit-learn-i-scipy2013-tutorial-pa-6",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2156,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-06-27",
  "related_urls": [
    "http://continuum.io/downloads.html",
    "http://www.enthought.com/products/epd\\_free.php",
    "https://github.com/jakevdp/sklearn\\_scipy2013"
  ],
  "slug": "intro-to-scikit-learn-i-scipy2013-tutorial-pa-6",
  "speakers": [],
  "summary": "Presenters: Gaël Varoquaux, Jake Vanderplas, Olivier Grisel\n\nDescription\n\nMachine Learning is the branch of computer science concerned with the\ndevelopment of algorithms which can learn from previously-seen data in\norder to make predictions about future data, and has become an important\npart of research in many scientific fields. This set of tutorials will\nintroduce the basics of machine learning, and how these learning tasks\ncan be accomplished using Scikit-Learn, a machine learning library\nwritten in Python and built on NumPy, SciPy, and Matplotlib. By the end\nof the tutorials, participants will be poised to take advantage of\nScikit-learn's wide variety of machine learning algorithms to explore\ntheir own data sets. The tutorial will comprise two sessions, Session I\nin the morning (intermediate track), and Session II in the afternoon\n(advanced track). Participants are free to attend either one or both,\nbut to get the most out of the material, we encourage those attending in\nthe afternoon to attend in the morning as well.\n\nSession I will assume participants already have a basic knowledge of\nusing numpy and matplotlib for manipulating and visualizing data. It\nwill require no prior knowledge of machine learning or scikit-learn. The\ngoals of Session I are to introduce participants to the basic concepts\nof machine learning, to give a hands-on introduction to using\nScikit-learn for machine learning in Python, and give participants\nexperience with several practical examples and applications of applying\nsupervised learning to a variety of data. It will cover basic\nclassification and regression problems, regularization of learning\nmodels, basic cross-validation, and some examples from text mining and\nimage processing, all using the tools available in scikit-learn.\n\nOutline\n\nTutorial 1 (intermediate track)\n\n0:00 - 0:15 -- Setup and Introduction 0:15 - 0:30 -- Quick review of\ndata visualization with matplotlib and numpy 0:30 - 1:00 --\nRepresentation of data in machine learning Downloading data within\nscikit-learn Categorical & Image data Exercise: vectorization of text\ndocuments 1:00 - 2:00 -- Basic principles of Machine Learning & the\nscikit-learn interface Supervised Learning: Classification & Regression\nUnsupervised Learning: Clustering & Dimensionality Reduction Example of\nPCA for data visualization Flow chart: how do I choose what to do with\nmy data set? Exercise: Interactive Demo on linearly separable data\nRegularization: what it is and why it is necessary 2:00 - 2:15 -- Break\n(possibly in the middle of the previous section) 2:15 - 3:00 --\nSupervised Learning Example of Classification: hand-written digits\nCross-validation: measuring prediction accuracy Example of Regression:\nboston house prices 3:00 - 4:15 -- Applications Examples from text\nmining Examples from image processing\n\nhttps://github.com/jakevdp/sklearn\\_scipy2013\n\nRequired Packages\n\nThis tutorial will use Python 2.6 / 2.7, and require recent versions of\nnumpy (version 1.5+), scipy (version 0.10+), matplotlib (version 1.1+),\nscikit-learn (version 0.13.1+), and IPython (version 0.13.1+) with\nnotebook support. The final requirement is particularly important:\nparticipants should be able to run IPython notebook and create &\nmanipulate notebooks in their web browser. The easiest way to install\nthese requirements is to use a packaged distribution: we recommend\nAnaconda CE, a free package provided by Continuum Analytics:\nhttp://continuum.io/downloads.html or the Enthought Python Distribution:\nhttp://www.enthought.com/products/epd\\_free.php\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/hlaMiXCRxB0/hqdefault.jpg",
  "title": "Intro to scikit-learn (I), SciPy2013 Tutorial, Part 2 of 3",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hlaMiXCRxB0"
    }
  ]
}
