{
  "alias": "video/1990/iris-cartopy-python-packages-for-atmospheric-a",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 1990,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "iris-cartopy-python-packages-for-atmospheric-a",
  "speakers": [],
  "summary": "Iris & Cartopy: Open source Python packages for Atmospheric and\nOceanographic science\n\nAuthors: Elson, Philip, UK Met Office;\n\nTrack: Meteorology, Climatology, Atmospheric and Oceanic Science\n\nAs the capabilities of Python packages valuable to the Atmospheric and\nOceanographic Sciences (AOS) such as matplotlib, scipy and numpy have\ndeveloped, so the UK Met Office's use of Python has expanded. The open\nsource scientific Python stack is strategically important to the Met\nOffice as it strives to meet the increasing need to collaborate freely\nand openly in academic and commercial partnerships. Python's easy to\ndevelop, dynamically typed syntax is ideally suited for data\nassimilation and model post-processing type tasks, and in recent years\nthe Met Office has sustained funding for a team of software engineers to\nsimplify, develop and improve its scientific capabilities by\ncontributing to the the open source AOS community.\n\nThe focus of much of this effort has been on a new open source Python\npackage, Iris 1, which implements a generalised n-dimensional gridded\ndata model to isolate analysis and visualisation code from file format\nspecifics. The Iris data model is a result of close collaboration with\nthe CF Data Model community and currently has read/write support for a\nvariety of file formats including NetCDF and GRIB. In order to deliver a\ncomponent of the core visualisation functionality, a new mapping library\ncalled Cartopy 2 has also been developed on top of matplotlib. Cartopy\nexposes an intuitive interface for the transformation and visualisation\nof geospatial vector and raster data.\n\nThis talk will outline some of the Met Office's involvement in the open\nsource community, including demonstrations of Iris and Cartopy;\nhighlights of recent matplotlib contributions; and an outline of future\ndevelopments.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/MW9wmGsscrs/hqdefault.jpg",
  "title": "Iris & Cartopy: Python packages for Atmospheric and Oceanographic science; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MW9wmGsscrs"
    }
  ]
}
