{
  "alias": "video/2074/larvamap-a-python-powered-larval-transport-mode-1",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2074,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "larvamap-a-python-powered-larval-transport-mode-1",
  "speakers": [],
  "summary": "Authors: Wilcox, Kyle, Applied Science Associates (ASA); Crosby, Alex,\nApplied Science Associates (ASA)\n\nTrack: GIS - Geospatial Data Analysis\n\nLarvaMap is an open-access larval transport modeling tool. The idea\nbehind LarvaMap is to make it easy for researchers everywhere to use\nsophisticated larval transport models to explore and test hypotheses\nabout the early life of marine organisms.\n\nLarvaMap integrates four components: an ocean circulation model, a\nlarval behavior library, a python Lagrangian particle model, and a\nweb-system for running the transport models.\n\nAn open-source particle transport model was written in python to support\nLarvaMap. The model utilizes a parallel multi-process architecture.\nRemote data are cached to a local file in small chunks when a process\nrequires data, and the local data are shared between all of the active\nprocesses as the model runs. The caching approach improves performance\nand reduces the load on data servers by limiting the frequency and total\nnumber of web requests as well as the size of the data being moved over\nthe internet.\n\nModel outputs include particle trajectories in common formats (i.e.\nnetCDF-CF and ESRI Shapefile), a web accessible geojson representation\nof the particle centroid trajectory, and a stochastic GeoTIFF\nrepresentation of the probabilities associated with a collection of\nmodeling runs. The common interoperable data formats allow a variety of\ntools to be used for in-depth analysis of the model results.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/fbQExUiJXrk/hqdefault.jpg",
  "title": "LarvaMap - A python powered larval transport modeling system; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fbQExUiJXrk"
    }
  ]
}
