{
  "alias": "video/1965/lmonade-a-platform-for-development-and-distribut",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 1965,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "lmonade-a-platform-for-development-and-distribut",
  "speakers": [],
  "summary": "Authors: Erocal, Burcin, TU Kaiserslautern\n\nTrack: Reproducible Science\n\nMost results in experimental mathematics are accompanied by software\nimplementations which often push the boundaries of what can be computed\nin terms of mathematical theory and efficiency. Since new algorithms are\nbuilt on existing ones, just as theorems are derived from existing\nresults, it would be natural to expect that the code produced for one\nproject will be useful later on, to both the same researcher and others.\n\nWhile theorems blissfully stay intact over time, software deteriorates\nand ages. Implementations need to be updated with respect to changes in\nunderlying libraries and hardware architectures. Even if up to date,\nsoftware developed for a specific application area often needs to be\nadapted to new situations. Like proofs can be reused by taking some\ncomponents intact and modifying certain parts, software needs similar\nadaptations to be reusable.\n\nIt is natural that researchers cannot commit any more time than\nabsolutely necessary for distributing and maintaining their software.\nThe lmonade project aims to provide infrastructure and tools to foster\ncode sharing and openness in scientific software development by\n\nsimplifying the tasks of distributing software with its dependencies,\nensuring that it can be built on different platforms, and making sure\nthe software is compatible across new releases of its dependencies. This\nis achieved through\n\na light-weight meta distribution which can be installed by a user\nwithout administrative rights. Building on the Gentoo Linux distribution\nand the Gentoo Prefix project, lmonade creates a uniform environment for\nsoftware development where latest versions of scientific libraries can\nbe found easily. access to a continuous integration infrastructure to\ndetect compatibility problems between new versions of packages\nautomatically and warn authors. By simplifying code sharing and\ndistribution, especially when complex dependencies are involved, this\nplatform enables researchers to build on existing tools without fear of\nlosing users to baffling installation instructions.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/7RuSFfCv4Ak/hqdefault.jpg",
  "title": "lmonade: a platform for development and distribution of scientific software; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7RuSFfCv4Ak"
    }
  ]
}
