{
  "alias": "video/2095/lpedit-an-editor-to-facilitate-reproducible-anal-1",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2095,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "lpedit-an-editor-to-facilitate-reproducible-anal-1",
  "speakers": [],
  "summary": "lpEdit: An editor to facilitate reproducible analysis via literate\nprogramming\n\nAuthors: Richards, Adam, Duke University, CNRS France; Kosinski Andrzej,\nDuke University; Bonneaud, Camille,\n\nTrack: Reproducible Science\n\nThere is evidence to suggest that a surprising proportion of published\nexperiments in science are difficult if not impossible to reproduce. The\nconcepts of data sharing, leaving an audit trail and extensive\ndocumentation are essential to reproducible research, whether it is in\nthe laboratory or as part of an analysis. In this work, we introduce a\ntool for documentation that aims to make analyses more reproducible in\nthe general scientific community.\n\nThe application, lpEdit, is a cross-platform editor, written with PyQt4,\nthat enables a broad range of scientists to carry out the analytic\ncomponent of their work in a reproducible manner---through the use of\nliterate programming. Literate programming mixes code and prose to\nproduce a final report that reads like an article or book. A major\ntarget audience of lpEdit are the researchers getting started with\nstatistics or programming, so the hurdles associated with setting up a\nproper pipeline are kept to a minimum and the learning burden is reduced\nthrough the use of templates and documentation. The documentation for\nlpEdit is centered around learning by example, and accordingly we use\nseveral increasingly involved examples to demonstrate the software's\ncapabilities.\n\nBecause it is commonly used, we begin with an example of Sweave in\nlpEdit and then in the same way R may be embedded into LaTeX we go on to\nshow how Python can also be used. Next, we demonstrate how both R and\nPython code may be embedded into reStructuredText (reST). Finally, we\nwalk through a more complete example, where we perform a functional\nanalysis of high-throughput sequencing data, using the transcriptome of\nthe butterfly species Pieris brassicae. There is substantial flexibility\nthat is made available through the use of LaTeX and reST, which\nfacilitates reproducibility through the creation of reports,\npresentations and web pages.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/1HCeSwMirIA/hqdefault.jpg",
  "title": "lpEdit: An editor to facilitate reproducible analysis; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1HCeSwMirIA"
    }
  ]
}
