{
  "alias": "video/1981/massive-online-collaborative-research-and-modelin",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 1981,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "massive-online-collaborative-research-and-modelin",
  "speakers": [],
  "summary": "Authors: Omberg, Larsson, Sage Bionetworks\n\nTrack: Bioinformatics\n\nSynapse is an open source software as a service (SaaS) platform built by\nSage Bionetworks to enable collaborative and reproducible science.\nHaving RESTful APIs at its base, Synapse is able to easily link to\nanalytical software such as Python. In this talk I will present the\nPython bindings to this platform and, more specifically, how it fostered\na collaborative environment for over 140 individual researchers spread\nacross 25 institutions in The Cancer Genome Atlas (TCGA) consortium.\nSynapse enables tracking of provenance of data from individual genome\nsequencing centers, processing and quality control, and all the way\nthrough results generated from models of cancer genomics. Synapse is\ndesigned as an information commons. Allowing any user not only to access\ndata but also contribute results and models. This allows the TCGA\ncollaboration to accelerate discovery by using partial contributed\nresults as starting points for downstream analyses. One sub-project that\nhas emerged from the collaboration is an online machine learning\ncompetition to predict expected survival time of cancer patients given\nmolecular phenotype. All submitted models are immediately open sourced\nallowing derivative models to be built. These collaborative competitions\nprovide an alternative approach to performing computational science\nwhich tools like Python and Synapse can greatly accelerate.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/1u1ttwfTgrQ/hqdefault.jpg",
  "title": "Massive Online Collaborative Research and Modeling using Synapse and Python; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1u1ttwfTgrQ"
    }
  ]
}
