{
  "alias": "video/2052/mist-micro-simulation-tool-to-support-disease-mo-1",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2052,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "mist-micro-simulation-tool-to-support-disease-mo-1",
  "speakers": [],
  "summary": "Authors: Jacob Barhak\n\nTrack: Bioinformatics\n\nMIST stands for Misco-Simulation Tool. It is a modeling and simulation\nframework that supports computational Chronic Disease Modeling\nactivities. It is a fork from the IEST = Indirect Estimation and\nSimulation Tool GPL modeling framework.\n\nMIST removes complexity associated with the estimation engine, with\nparameter definitions, and with rule restrictions. This significantly\nsimplifies the system and allows its development in the Micro-simulation\npath less encumbered.\n\nThe incentive to split MIST was to adapt the code to use newer compiler\ntechnology to speed up simulations. There is wrong skepticism in the\nmedical disease modeling community towards using Interpreters for\nsimulations due to performance issues. The use of advanced compiler\ntechnology with Python may remedy this misconception and provide\noptimized python based simulations. MIST is a first step in this\ndirection.\n\nMIST takes care of a few documented and known issues. It also moves to\nuse new scientific Python stacks such as Anaconda and PythonXY as its\nplatform. This improves its accessibility to less sophisticated users\nthat can now benefit from easier installation.\n\nThe Reference Model for disease progression intends to use MIST as its\nmain platform. Yet MIST is equipped with a Micro-simulation compiler\ndesigned to accommodate Monte Carlo simulations for other purposes.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/AD896WakR94/hqdefault.jpg",
  "title": "MIST: Micro-Simulation Tool to Support Disease Modeling; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AD896WakR94"
    }
  ]
}
