{
  "alias": "video/1977/neurotrends-large-scale-automated-analysis-of-th",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 1977,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "neurotrends-large-scale-automated-analysis-of-th",
  "speakers": [],
  "summary": "Authors: Carp, Joshua, University of Michigan\n\nTrack: Medical Imaging\n\nHow do researchers design and analyze experiments? How should they? And\nhow likely are their results to be reproducible? To investigate these\nquestions, we developed NeuroTrends, a platform for large-scale analysis\nof research methods in the neuroimaging literature. Neurotrends\nidentifies relevant research reports using the PubMed API, downloads and\nparses full-text HTML and PDF documents, and extracts hundreds of\nmethodological details from this unstructured text.\n\nIn the present study, NeuroTrends was evaluated using a corpus of over\n16,000 journal articles. Automatically extracted methodological\nmeta-data were validated against a hand-coded database. Overall,\nmethodological details were extracted accurately, with a mean d-prime\nvalue of 3.53 (range: 1.12 to 6.18). Results revealed both variability\nand stability in methodological practices over time, with some methods\nincreasing in prevalence, some decreasing, and others remaining\nconsistent. Results also showed that design and analysis pipelines were\nhighly variable across studies and have grown more variable over time.\n\nIn sum, the present study confirms the feasibility of accurately\nextracting methodological meta-data from unstructured text. We also\ncontend that variability in research methods across time and from study\nto study poses a challenge to reproducibility in the neuroimaging\nliterature--and likely in many other fields as well. Future directions\ninclude improving the accuracy and coverage of the NeuroTrends platform,\nintegrating with additional databases, and extending to research domains\nbeyond neuroimaging.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/iqE3JcHR6VQ/hqdefault.jpg",
  "title": "NeuroTrends: Large-scale automated analysis of the neuroimaging literature; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iqE3JcHR6VQ"
    }
  ]
}
