{
  "alias": "video/2175/numpy-and-ipython-scipy2013-tutorial-part-2-of-1",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2175,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-06-27",
  "related_urls": [
    "http://git.io/bocNDg.",
    "https://github.com/esc/scipy2013-tutorial-numpy-ipython"
  ],
  "slug": "numpy-and-ipython-scipy2013-tutorial-part-2-of-1",
  "speakers": [],
  "summary": "Description\n\nThis tutorial is a hands-on introduction to the two most basic\nbuilding-blocks of the scientific Python stack: the enhanced interactive\ninterpreter IPython and the fast numerical container Numpy. Amongst\nother things you will learn how to structure an interactive workflow for\nscientific computing and how to create and manipulate numerical data\nefficiently. You should have some basic familiarity with Python\n(variables, loops, functions) and basic command-line usage (executing\ncommands, using history).\n\nOutline\n\nIpython (1 hour)\n\nUsing the IPython notebook Help system, magic functions, aliases and\nhistory Numpy (3 hours)\n\nBasic arrays, dtypes and numerical operations Indexing, slicing,\nreshaping and broadcasting Copies, views and fancy indexing The tutorial\nwill feature short bursts of small exercises every 5-10 minutes.\n\nRequired Packages\n\nAn install of Anaconda should be enough\n\nNumpy (Version 1.6 or higher) Ipython (Version 0.13 or higher)\nMatplotlib (Version 1.2.1 or higher) Documentation\n\nI have converted a large part of the Numpy chaper from the Python\nScientific Lecture Notes to IPython notebook format using the\nsphinx2ipynb converter from the nbconvert project. All materials are\ncollected in my scipy2013-tutorial-numpy-ipython Gitub repository at\nhttps://github.com/esc/scipy2013-tutorial-numpy-ipython or\nhttp://git.io/bocNDg.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/lSfkIle93hQ/hqdefault.jpg",
  "title": "NumPy and IPython, SciPy2013 Tutorial, Part 2 of 2",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lSfkIle93hQ"
    }
  ]
}
