{
  "alias": "video/2062/python-tools-for-coding-and-feature-learning-sci",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2062,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "python-tools-for-coding-and-feature-learning-sci",
  "speakers": [],
  "summary": "Authors: Johnson, Leif, University of Texas at Austin\n\nTrack: Machine Learning\n\nSparse coding and feature learning have become popular areas of research\nin machine learning and neuroscience in the past few years, and for good\nreason: sparse codes can be applied to real-world data to obtain\n\"explanations\" that make sense to people, and the features used in these\ncodes can be learned automatically from unsupervised datasets. In\naddition, sparse coding is a good model for the sorts of data processing\nthat happens in some areas of the brain that process sensory data\n(Olshausen & Field 1996, Smith & Lewicki 2006), hinting that sparsity or\nredundancy reduction (Barlow 1961) is a good way of representing raw,\nreal-world signals.\n\nIn this talk I will summarize several algorithms for sparse coding\n(k-means [MacQueen 1967], matching pursuit [Mallat & Zhang 1994], lasso\nregression [Tibshirani 1996], sparse neural networks [Lee Ekanadham & Ng\n2008, Vincent & Bengio 2010]) and describe associated algorithms for\nlearning dictionaries of features to use in the encoding process. The\ntalk will include pointers to several nice Python tools for performing\nthese tasks, including standard scipy function minimization,\nscikit-learn, SPAMS, MORB, and my own packages for building neural\nnetworks. Many of these techniques converge to the same or qualitatively\nsimilar solutions, so I will briefly mention some recent results that\nindicate the encoding can be more important than the specific features\nthat are used (Coates & Ng, 2011).\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/nT4SGi-aaMU/hqdefault.jpg",
  "title": "Python Tools for Coding and Feature Learning; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nT4SGi-aaMU"
    }
  ]
}
