{
  "alias": "video/2002/reproducible-documents-with-pythontex-scipy-2013",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2002,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "reproducible-documents-with-pythontex-scipy-2013",
  "speakers": [],
  "summary": "Authors: Poore, Geoffrey, Union University\n\nTrack: Reproducible Science\n\nWriting a scientific document can be slow and error-prone. When a figure\nor calculation needs to be modified, the code that created it must be\nlocated, edited, and re-executed. When data changes or analysis is\ntweaked, everything that depends on it must be updated. PythonTeX is a\nLaTeX package that addresses these issues by allowing Python code to be\nincluded within LaTeX documents. Python code may be entered adjacent to\nthe figure or calculation it produces. Built-in utilities may be used to\ntrack dependencies.\n\nPythonTeX maximizes performance and efficiency. All code output is\ncached, so that documents can be compiled without executing code. Code\nis only re-executed when user-specified criteria are met, such as exit\nstatus or modified dependencies. In many cases, dependencies can be\ndetected and tracked automatically. Slow code may be isolated in\nuser-defined sessions, which automatically run in parallel. Errors and\nwarnings are synchronized with the document so that they have meaningful\nline numbers.\n\nSince PythonTeX documents mix LaTeX and Python code, they are less\nportable than plain LaTeX documents. PythonTeX includes a conversion\nutility that creates a new copy of a document in which all Python code\nis replaced by its output. The result is suitable for journal submission\nor conversion to other formats such as HTML.\n\nWhile PythonTeX is primarily intended for Python, its design is largely\nlanguage-independent. Users may easily add support for additional\nlanguages.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/G-UDHc2UVOg/hqdefault.jpg",
  "title": "Reproducible Documents with PythonTeX; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=G-UDHc2UVOg"
    }
  ]
}
