{
  "alias": "video/2072/sci-wms-a-python-based-web-map-service-for-met-o-1",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2072,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "sci-wms-a-python-based-web-map-service-for-met-o-1",
  "speakers": [],
  "summary": "SCI-WMS: A Python Based Web Map Service For Met-Ocean Data Accessible\nOver OpenDAP Or As NetCDF\n\nAuthors: Crosby, Alexander\n\nTrack: GIS - Geospatial Data Analysis\n\nSCI-WMS is a Python based web map service (WMS) designed as a web\nservice for visualization of local or remote data such that they can be\noverlaid in georeferenced mapping environments like web maps or\ngeographic information systems (GIS). The service follows the Open\nGeospatial Consortium (OGC) WMS specifications and is focused on the\nvisualization of gridded data and unstructured meshes commonly stored in\nNetCDF files or available from distributed servers over the OpenDAP\nprotocol. WMS servers are commonly used to visualize large archives of\nnumerically modeled and observed data, and SCI-WMS is currently used in\nseveral U.S. Integrated Ocean Observing System (IOOS) projects around\nthe country including the IOOS Super-regional Modeling Testbed and\nregional data portals. SCI-WMS was originally developed to fill a need\nfor standards based visualization and data access tools to examine\ndifferences between unstructured mesh ocean models like FVCOM and\nADCIRC, and the available visualization styles attempt to preserve as\nmuch of the complex topology as possible in the unstructured meshes.\nSupport for regularly gridded datasets expanded the applicability of\nSCI-WMS for use with more commonly available ocean and meteorological\nmodel output as well as satellite derived observations.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/iH6fDRPLCYk/hqdefault.jpg",
  "title": "SCI-WMS: A Python Based Web Map Service For Met-Ocean Data; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iH6fDRPLCYk"
    }
  ]
}
