{
  "alias": "video/2003/scientific-computing-and-the-materials-genome-ini-",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2003,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "scientific-computing-and-the-materials-genome-ini-",
  "speakers": [],
  "summary": "Authors: Reid, Andrew, National Institute of Standards and Technology\n\nTrack: General\n\nIt is a commonplace notion that, as computers continue to become more\npowerful and more widely available, the communities surrounding various\ncomputational tools and techniques gain the ability to tackle larger and\nmore interesting problems.\n\nThe US government's Materials Genome Initiative for Global\nCompetitiveness (MGI), announced in June of 2011, has the goal of\nreducing the time to discover, develop, manufacture, and deploy advanced\nmaterials by a factor of two, while reducing the associated costs. Among\nthe approaches foreseen in the initiative, there are two that are of\nparticular interest to computational science. These are, firstly, more\nsophisticated computational models of materials systems, and secondly,\ndata management tools that will better organize materials data, making\ndata more easily discoverable, providing validation and provenance\ninformation, and simplifying the incorporation of data into new models.\n\nThe scientific python community has long had its eye not only on the\ncomputational solution of scientific and engineering problems, but also\non the related issues surrounding the management of large volumes of\ndata, version control for codes, and management of the computational\nscientific workflow, including reproducibility. This community is well\npositioned to address MGI-related issues. This talk will describe how\nMGI goals are being translated into more specific computational problems\nat NIST and other institutions, and will describe some of the challenges\nand issues that we have already seen in working towards its goals. The\nrole of the Python language in general, and scientific Python tools in\nparticular, will be highlighted. In addition, the talk will describe\nareas of overlap and opportunities for contributions between the MGI and\nthe scientific python community.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/57hqE4m6Us0/hqdefault.jpg",
  "title": "Scientific Computing and the Materials Genome Initiative; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=57hqE4m6Us0"
    }
  ]
}
