{
  "alias": "video/2019/scikit-fuzzy-a-new-scipy-toolkit-for-fuzzy-logic",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2019,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "scikit-fuzzy-a-new-scipy-toolkit-for-fuzzy-logic",
  "speakers": [],
  "summary": "Authors: Warner, Joshua, Mayo Clinic Department of Biomedical\nEngineering; Ottesen, Hal H., Adjunct Professor\n\nTrack: General\n\nScikit-fuzzy is a robust set of foundational tools for problems\ninvolving fuzzy logic and fuzzy systems. This area has been a challenge\nfor the scientific Python community, largely because the common first\nexposure to this topic is through the MATLAB® Fuzzy Logic Toolbox™. This\ntalk officially introduces a general set of original fuzzy logic\nalgorithms to the scientific Python community which predate the\ncommercial toolbox, were released under the 3-clause BSD license, and\nwere translated to Python by an author who never used the MathWorksÂ®\nFuzzy Logic Toolbox™.\n\nThe current capabilities of scikit-fuzzy include: fuzzy membership\nfunction generation; fuzzy set operations; lambda-cuts; fuzzy\nmathematics including Zadeh's extension principle, the vertex method,\nand the DSW method; fuzzy implication given an IF THEN system of fuzzy\nrules (via Mamdani [min] or Larsen [product] implication); various\ndefuzzification algorithms; fuzzy c-means clustering; and Fuzzy\nInference Ruled by Else-action (FIRE) denoising of 1d or 2d signals.\n\nThe goals of scikit-fuzzy are to provide the community with a robust\ntoolkit of independently developed and implemented fuzzy logic\nalgorithms, filling a void in the capabilities of scientific and\nnumerical Python, and to increase the attractiveness of scientific\nPython as a valid alternative to closed-source options. Scikit-fuzzy is\nstructured similarly to scikit-learn and scikit-image, current source\ncode is available on GitHub, and pull requests are welcome.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/qUQf1JxnTnY/hqdefault.jpg",
  "title": "Scikit-Fuzzy: A New SciPy Toolkit for Fuzzy Logic; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qUQf1JxnTnY"
    }
  ]
}
