{
  "alias": "video/2041/scipy-2013-keynote-the-new-scientific-publishers-1",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2041,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "scipy-2013-keynote-the-new-scientific-publishers-1",
  "speakers": [],
  "summary": "Presenter: William Schroeder, Kitware\n\nTrack: Keynotes\n\nScientific societies such as the Royal Society were formed in the 17th\ncentury with the goals of sharing information and ensuring\nreproducibility. Very quickly scientific letters and publications were\nassembled into collected transactions and eventually journals. For\nhundreds of years publishers served admirably as disseminators of\nscientific knowledge. Publications, and the associated peer review\nprocess, became central to the scientific process, greatly impacting how\nscience is practiced, knowledge disseminated, and careers made. However,\nas software becomes increasingly important to the practice of science,\nand data becomes larger and more complex, the conventional scientific\njournal is no longer an adequate vehicle to communicate scientific\nfindings and ensure reproducibility. So who are the new scientific\npublishers filling these needs, and what roles will they play in the\nfuture of science?\n\nIn this presentation we'll discuss the central mandate of\nreproducibility, and the role of Open Science, in particular Open\nAccess, Open Source and Open Data, and how emerging communities and\norganizations are filling the needs of the scientific community. We'll\nalso discuss the challenges of curating the avalanche of scientific\nknowledge, whether it be software, data or publications, and how these\ncommunities and organizations can work together to support science\nprogress, and ensure continued technological innovation.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/7FIjpuwE0BQ/hqdefault.jpg",
  "title": "SciPy 2013 Keynote: The New Scientific Publishers",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7FIjpuwE0BQ"
    }
  ]
}
