{
  "alias": "video/2141/statistical-data-analysis-in-python-scipy2013-tu-8",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2141,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-06-27",
  "related_urls": [
    "https://github.com/fonnesbeck/statistical-analysis-python-tutorial"
  ],
  "slug": "statistical-data-analysis-in-python-scipy2013-tu-8",
  "speakers": [],
  "summary": "Presenter: Christopher Fonnesbeck\n\nDescription\n\nThis tutorial will introduce the use of Python for statistical data\nanalysis, using data stored as Pandas DataFrame objects. Much of the\nwork involved in analyzing data resides in importing, cleaning and\ntransforming data in preparation for analysis. Therefore, the first half\nof the course is comprised of a 2-part overview of basic and\nintermediate Pandas usage that will show how to effectively manipulate\ndatasets in memory. This includes tasks like indexing, alignment,\njoin/merge methods, date/time types, and handling of missing data. Next,\nwe will cover plotting and visualization using Pandas and Matplotlib,\nfocusing on creating effective visual representations of your data,\nwhile avoiding common pitfalls. Finally, participants will be introduced\nto methods for statistical data modeling using some of the advanced\nfunctions in Numpy, Scipy and Pandas. This will include fitting your\ndata to probability distributions, estimating relationships among\nvariables using linear and non-linear models, and a brief introduction\nto Bayesian methods. Each section of the tutorial will involve hands-on\nmanipulation and analysis of sample datasets, to be provided to\nattendees in advance.\n\nThe target audience for the tutorial includes all new Python users,\nthough we recommend that users also attend the NumPy and IPython session\nin the introductory track.\n\nTutorial GitHub repo:\nhttps://github.com/fonnesbeck/statistical-analysis-python-tutorial\n\nOutline\n\nIntroduction to Pandas (45 min)\n\nImporting data Series and DataFrame objects Indexing, data selection and\nsubsetting Hierarchical indexing Reading and writing files Date/time\ntypes String conversion Missing data Data summarization Data Wrangling\nwith Pandas (45 min)\n\nIndexing, selection and subsetting Reshaping DataFrame objects Pivoting\nAlignment Data aggregation and GroupBy operations Merging and joining\nDataFrame objects Plotting and Visualization (45 min)\n\nTime series plots Grouped plots Scatterplots Histograms Visualization\npro tips Statistical Data Modeling (45 min)\n\nFitting data to probability distributions Linear models Spline models\nTime series analysis Bayesian models\n\nRequired Packages\n\nPython 2.7 or higher (including Python 3) pandas 0.11.1 or higher, and\nits dependencies NumPy 1.6.1 or higher matplotlib 1.0.0 or higher pytz\nIPython 0.12 or higher pyzmq tornado\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/YZDtBEEZuAk/hqdefault.jpg",
  "title": "Statistical Data Analysis in Python, SciPy2013 Tutorial, Part 3 of 4",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YZDtBEEZuAk"
    }
  ]
}
