{
  "alias": "video/1883/streamed-clustering-of-lightning-mapping-data-in",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 1883,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "streamed-clustering-of-lightning-mapping-data-in",
  "speakers": [
    "Eric Bruning"
  ],
  "summary": "Authors: Bruning, Eric C., Texas Tech University\n\nTrack: GIS - Geospatial Data Analysis\n\nLightning mapping at radio frequencies (here with VHF Lightning Mapping\nArray data) is typically performed by a time-of-arrival source retrieval\nmethod. Thereafter, it is common to cluster the located sources into\nflash-level entities (often comprised of 10^2 - 10^3 sources) using\nspace and time separation thresholds. A previously-used clustering\nalgorithm was a one-off implementation in Fortran, and was designed\nwithout reference to the machine learning literature. This study\nreplaces the previous algorithm, which had been wrapped into the\nPython-based lmatools workflow, with the general-purpose DBSCAN\nimplementation in Python's sklearn package. The legacy code included\nsubstantial, file format-specific, I/O boilerplate. The new code\nclarifies the boundary between algorithm and I/O, and promotes clean\nintegration with the rest of the lmatools infrastructure, aiding\nmaintainability.\n\nA chunked, streamed processing method was developed to account for\ncontinuous data rates that may exceed 10^5 four-coordinate (space and\ntime) source vectors per minute. The chunking method exploits known\nphysical limits to lightning flash duration, allowing the N^2\nimplementation of DBSCAN in sklearn to achieve real-time processing\nrates within available memory. The streaming technique is expected to be\nuseful in future work as a flexible building block for end-to-end\nreal-time and post-processing scripts and interactive analysis tools.\n\nThe algorithm is expected to find immediate use in our analysis of data\nfrom the NSF-sponsored Deep Convective Clouds and Chemistry campaign.\nThe open nature of the underlying clustering libraries promotes code\nreuse by other research groups. Accounts of source-to-flash clustering\nin the literature are complemented by the availability of this open,\nobjective reference implementation for clustering of lightning mapping\ndatasets.\n",
  "tags": [
    "lightning talks",
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/0Z17Q22HEMI/hqdefault.jpg",
  "title": "Streamed Clustering of Lightning Mapping Data in Python Using sklearn; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0Z17Q22HEMI"
    }
  ]
}
