{
  "alias": "video/1964/sunpy-python-for-solar-physicists-0",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Authors: Mumford, Stuart, University of Sheffield / SunPy\n\nTrack: Astronomy and Astrophysics\n\nModern solar physicists have, at their disposal, an abundance of space\nand ground based instruments providing a large amount of data to analyse\nthe complex Sun every day. The NASA Solar Dynamics Observatory\nsatellite, for example, collects around 1.2 TB of data every 24 hours\nwhich requires extensive reconstruction before it is ready for\nscientific use. Currently most data processing and analysis for all\nsolar data is done using IDL and the 'SolarSoft' library. SunPy is a\nproject designed to provide a free, open and easy-to-use Python\nalternative to IDL and SolarSoft.\n\nSunPy provides unified, coordinate-aware data objects for many common\nsolar data types and integrates into these plotting and analysis tools.\nProviding this base will give the global solar physics community the\nopportunity to use Python for future data processing and analysis\nroutines. The astronomy and astrophysics community, through the\nimplementation and adoption of AstroPy and pyRAF, have already\ndemonstrated that Python is well suited for the analysis and processing\nof space science data.\n\nIn this presentation, we give key examples of SunPy's structure and\nscope, as well as the major improvements that have taken place to\nprovide a stable base for future expansion. We discuss recent\nimprovements to file I/O and visualisation, as well as improvements to\nthe structure and interface of the map objects.\n\nWe discuss the many challenges which SunPy faces if it is to achieve its\ngoal of becoming a key package for solar physics. The SunPy developers\nhope to increase the the visibility and uptake of SunPy, and encourage\npeople to contribute to the project, while maintaining a high quality\ncode base, which is facilitated by the use of a social version control\nsystem (git and GitHub).\n",
  "duration": null,
  "id": 1964,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "sunpy-python-for-solar-physicists-0",
  "speakers": [
    "Stuart Mumford"
  ],
  "summary": "SunPy is a project designed to provide a free, open and easy-to-use\nPython alternative to IDL and SolarSoft. SunPy provides unified,\ncoordinate-aware data objects for many common solar data types and\nintegrates into these plotting and analysis tools.\n",
  "tags": [
    "astronomy",
    "astrophysics",
    "SunPy"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/bXPPTCkaVu8/hqdefault.jpg",
  "title": "SunPy - Python for Solar Physicists",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bXPPTCkaVu8"
    }
  ]
}
