{
  "alias": "video/2137/symbolic-computing-with-sympy-scipy2013-tutorial-7",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2137,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-06-27",
  "related_urls": [
    "http://mattpap.github.com/scipy-2011-tutorial/html/index.html"
  ],
  "slug": "symbolic-computing-with-sympy-scipy2013-tutorial-7",
  "speakers": [],
  "summary": "Ondrej Certik, Mateusz Paprocki, Aaron Meurer\n\nDescription\n\nSymPy is a pure Python library for symbolic mathematics. It aims to\nbecome a full-featured computer algebra system (CAS) while keeping the\ncode as simple as possible in order to be comprehensible and easily\nextensible. SymPy is written entirely in Python and does not require any\nexternal libraries.\n\nIn this tutorial we will introduce attendees to SymPy. We will start by\nshowing how to install and configure this Python module. Then we will\nproceed to the basics of constructing and manipulating mathematical\nexpressions in SymPy. We will also discuss the most common issues and\ndifferences from other computer algebra systems, and how to deal with\nthem. In the last part of this tutorial we will show how to solve\nsimple, yet illustrative, mathematical problems with SymPy.\n\nThis knowledge should be enough for attendees to start using SymPy for\nsolving mathematical problems and hacking SymPy's internals (though\nhacking core modules may require additional expertise).\n\nWe expect attendees of this tutorial to have basic knowledge of Python\nand mathematics. However, any more advanced topics will be explained\nduring presentation.\n\nOutline\n\ninstalling, configuring and running SymPy basics of expressions in SymPy\ntraversal and manipulation of expressions common issues and differences\nfrom other CAS setting up and using printers querying expression\nproperties not only symbolics: numerical computing (mpmath) Mathematical\nproblem solving with SymPy Required Packages\n\nPython 2.x or 3.x, SymPy (most recent version) Optional packages:\nIPython, matplotlib, NetworkX, GMPY, numpy, scipy\n\nDocumentation\n\nhttp://mattpap.github.com/scipy-2011-tutorial/html/index.html\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/JDztSdQqh0o/hqdefault.jpg",
  "title": "Symbolic Computing with SymPy, SciPy2013 Tutorial, Part 3 of 6",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JDztSdQqh0o"
    }
  ]
}
