{
  "alias": "video/1996/sympy-gamma-and-sympy-live-python-and-mathematic",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 1996,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "sympy-gamma-and-sympy-live-python-and-mathematic",
  "speakers": [],
  "summary": "Authors: Li, David, SymPy\n\nTrack: General\n\nSymPy (sympy.org) is a Python library for symbolic mathematics and a\ncomputer algebra system. The project also develops two web applications\nthat allow users to experiment with mathematics online, SymPy Gamma and\nSymPy Live. SymPy Gamma, modeled after Wolfram\\|Alpha, lets users enter\nmathematical expressions and see a variety of related computations and\nvisualizations. Meanwhile, SymPy Live provides an online Python shell\nwith features, such as LaTeX equation rendering, designed to aid the\nmanipulation of mathematics with Python.\n\nThis talk will examine the implementation and development of the web\napplications as well as general experiences contributing to the SymPy\nproject. In particular, the design of Gamma and the implementation of\nits server will be examined, as well as its features that help users\nexplore mathematics using the SymPy library. For instance, by entering a\ntrigonometric expression, users will receive alternate forms of the\ninput, a plot, a series expansion, and other pertinent information.\nFurthermore, the purposes and development of SymPy Live will be\nexamined, including the execution of code on Google App Engine and the\ndevelopment of the mobile site and other features during the 2011 Google\nCode-In contest and afterwards. One such feature is in SymPy's Sphinx\ndocumentation, which leverages SymPy Live to let users easily execute\nand see the results of any code examples in the documentation, and then\nuse the shell to continue exploring the capabilities of this library.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/Ad_D4i-oYjU/hqdefault.jpg",
  "title": "SymPy Gamma and SymPy Live: Python and Mathematics Online; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ad_D4i-oYjU"
    }
  ]
}
