{
  "alias": "video/2113/the-advantages-of-a-scientific-ide-scipy-2013-pr-1",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2113,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "the-advantages-of-a-scientific-ide-scipy-2013-pr-1",
  "speakers": [],
  "summary": "Authors: Cordoba, Carlos, The Spyder Project\n\nTrack: Reproducible Science\n\nThe enormous progress made by the IPython project during the last two\nyears, has made many of us --the Python scientific community-- think\nthat we are quite close to provide an application that can rival the big\ntwo M's of the computing scientific world: Matlab and Mathematica.\n\nHowever, after following the project on GitHub and its mailing list for\nalmost the same time and specially after reading its roadmap for the\nnext two years, we at Spyder believe that its real focus is different\nfrom that aim. IPython developers are working hard to build several\npowerful and flexible interfaces to evaluate and document code, but they\nseem to have some troubles on going from a console application to a GUI\none (e.g see GitHub Issues 1747, 2203, 2522, 2974 and 2985).\n\nWe consider Spyder can really help to solve these issues, by integrating\nIPython in a richer and more intuitive, yet powerful, environment. After\nworking with the mentioned M's, most people expects not only a good\nevaluation interface but also easy access to rich text documentation, an\nspecialized editor and a namespace browser, tied with good debugging\nfacilities. Spyder already has all these features and, right now, also\nthe best integration with the IPython Qt frontend.\n\nThis shows that Spyder can be the perfect complement to IPython,\nproviding what it's missing and aiming to reach a wider audience (not\njust researchers and graduate students). As the current Spyder\nmaintainer, I would like to assist to SciPy to show more concretely to\nthe community what our added value to the scientific Python ecosystem\nis. We would also like to get in closer contact with her and have a\ndirect feedback to define what should be the features we need to work or\nimprove on the next releases.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/k2yuB7IBpOY/hqdefault.jpg",
  "title": "The advantages of a scientific IDE; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=k2yuB7IBpOY"
    }
  ]
}
