{
  "alias": "video/2014/the-open-science-framework-improving-by-opening",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2014,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "related_urls": [
    "http://openscienceframework.org)"
  ],
  "slug": "the-open-science-framework-improving-by-opening",
  "speakers": [],
  "summary": "Authors: Spies, Jeffrey, Center for Open Science; Nosek, Brian, Center\nfor Open Science\n\nTrack: Reproducible Science\n\nThe Center for Open Science (COS) is using Python to develop the Open\nScience Framework (OSF)--an infrastructure for conducting science\ntransparently and openly with a focus on incentives and workflows. The\ngoal of the infrastructure is to help reduce the gap between scientific\npractices and scientific values. The vehicle for this framework is a\nwebsite (http://openscienceframework.org) and set of accompanying tools\nthat provide scientists with a shared infrastructure that makes it easy\nto collaborate as well as document, organize, and search the entire\nlifespan of a research project. The Reproducibility Project--another\nCOS-supported initiative--is a large-scale, collaborative study\nexamining the rate of reproducibility in the psychological sciences. The\nOSF is being used to host and pre-register replication materials and\nreplication hypotheses.\n\nThis talk will review the reasons why the major focus of the OSF is on\nincentives and workflow, demonstrate current features of the OSF,\ndiscuss how projects like the Reproducibility Project are using the OSF,\nand discuss why the COS believes that Python and the Python community\nwill lead the open science (r)evolution.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/WRadGRdkAIQ/hqdefault.jpg",
  "title": "The Open Science Framework: Improving, by Opening, Science; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WRadGRdkAIQ"
    }
  ]
}
