{
  "alias": "video/2025/using-ipython-notebook-with-ipython-cluster-scip",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2025,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "using-ipython-notebook-with-ipython-cluster-scip",
  "speakers": [],
  "summary": "Using IPython Notebook with IPython Cluster for Reproducibility and\nPortability of Atomistic Simulations\n\nAuthors: Trautt, Zachary, Materials Measurement Science Division,\nNational Institute of Standards and Technology\n\nTrack: Reproducible Science\n\nThe information presented in a typical journal article is rarely\nsufficient to reproduce all atomistic simulations reported within. A\ntypical study requires the distribution of parallel preprocessing,\nproduction, and post processing tasks. This is typically accomplished\nwith scripting and a queuing system and is not typically captured in a\npublication or supporting information. A traditional workflow tool can\ncapture this. However, a traditional workflow tool has a steep learning\ncurve and many are not capable of distributing parallel tasks. We\npresent the use of IPython Notebook and IPython Cluster as a tool for\nreproducible and portable atomistic simulations. IPython Notebook is\nused to define and annotate functions that implement simulation tasks.\nIPython Cluster is used to execute and distribute tasks, including\nexternal parallel tasks. This combination is an improvement for a number\nof reasons. First, the IPython notebook documents all steps of all\nsimulations and can easily be included as supplementary information with\na journal submission. Second, the IPython Cluster executes computational\ntasks with minimal effort (a single map command) and therefore does not\ndistract from the science. Third, the IPython Cluster abstracts\ncomputational resources, such that organization-specific computational\ndetails (cluster name, batch submission details, etc.) are not defined\nin the notebook. Therefore, if a third party attempts to reproduce\nsimulation results, the notebook can be used without modification if all\ndependencies are met. Furthermore, the initial researcher may observe a\nreduction of their time effort because of the efficiency gains in using\na single map command over traditional scripting for the distribution of\ntasks.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/OFzYMtHepXg/hqdefault.jpg",
  "title": "Using IPython Notebook with IPython Cluster; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OFzYMtHepXg"
    }
  ]
}
