{
  "alias": "video/2039/using-sumatra-to-manage-numerical-simulations-sc",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Authors: Davison, Andrew, CNRS (principal developer); Wheeler, Daniel,\nNIST (speaker)\n\nTrack: Reproducible Science\n\nSumatra is a lightweight system for recording the history and provenance\ndata for numerical simulations. It works particularly well for\nscientists that are in the intermediate stage between developing a code\nbase and using that code base for active research. This is a common\nscenario and often results in a mode of development that mixes branching\nfor both code development and production simulations. Using Sumatra\navoids this unintended use of the versioning system by providing a\nlightweight design for recording the provenance data independently from\nthe versioning system used for the code development. The lightweight\ndesign of Sumatra fits well with existing ad-hoc patterns of simulation\nmanagement contrasting with more pervasive workflow tools, which can\nrequire a wholesale alteration of work patterns. Sumatra uses a\nstraightforward Django-based data model enabling persistent data storage\nindependently from the Sumatra installation. Sumatra provides a command\nline utility with a rudimentary web interface, but has the potential to\nbecome a full web-based simulation management solution. During the talk,\nthe speaker will provide an introduction to Sumatra as well as\ndemonstrate some typical usage patterns and discuss achievable future\ngoals.\n",
  "duration": null,
  "id": 2039,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-02",
  "slug": "using-sumatra-to-manage-numerical-simulations-sc",
  "speakers": [
    "Daniel Wheeler"
  ],
  "summary": "Sumatra is a lightweight system for recording the history and provenance\ndata for numerical simulations. ... The speaker will provide an\nintroduction to Sumatra as well as demonstrate some typical usage\npatterns and discuss achievable future goals.\n",
  "tags": [
    "numerical simulations",
    "provenance",
    "reproducibility",
    "sumatra"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/1YJr9c-zSng/hqdefault.jpg",
  "title": "Using Sumatra to Manage Numerical Simulations",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1YJr9c-zSng"
    }
  ]
}
