{
  "alias": "video/2099/viper-a-new-tool-to-work-with-ipython-notebooks-1",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2099,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "viper-a-new-tool-to-work-with-ipython-notebooks-1",
  "speakers": [],
  "summary": "Authors: Avila, Damian, OQUANTA;\n\nTrack: Reproducible Science\n\nIn the last years, Python have gained a lot of interest in the\nscientific community because several useful tools, well-suited to do\nscientific computing research, have been developed. IPython [1], a\ncomprehensive environment for interactive and exploratory computing, has\narose as must-have application to run in the daily scientific work-flow\nbecause provide not only enhanced interactive Python shells (terminal\nand qt-based) but also an interactive browser-based notebook with rich\nmedia support [2]. Despite the fact that we can run the IPython notebook\nin any most-used web browsers, there is not one better-suited to do the\ndaily scientific work-flow and with features to easily present their\nresults. So, in this paper, we describe the vIPer [3], and pyqt-based\nweb browser designed specifically to host an IPython notebook, and\npowered with multiple features to address the most common tasks\nperformed by scientific researchers in the publication and spreading of\ntheir results, such as:\n\nSplitted notebook views. Exporting notebook several formats including\npdf documents and html archives. Video and voice recording. Slide-show\nview (for oral presentation). Shortcuts to most common task. To\nconclude, we have developed a better visualization tool for the IPython\nnotebook, suited not only for the daily interactive work-flow but also\nsuited for an enhanced presentation of results in multiple formats.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/NVf_giNcNro/hqdefault.jpg",
  "title": "vIPer, a new tool to work with IPython notebooks; SciPy 2013 Presentations",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NVf_giNcNro"
    }
  ]
}
