{
  "alias": "video/2117/writing-reproducible-papers-with-dexy-scipy-2013-1",
  "category": "SciPy 2013",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2117,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-01",
  "slug": "writing-reproducible-papers-with-dexy-scipy-2013-1",
  "speakers": [],
  "summary": "Authors: Nelson, Ana\n\nTrack: Reproducible Science\n\nScientists are frequently admonished to create reproducible papers, but\none reason so few do is the lack of good tools. Imagine you want to\ncreate a reproducible paper that any other researcher in your field can\neasily grab, look at, and run in order to verify your results. What\nwould you use? A tool intended for generating API documentation? A\nliterate programming tool? Maybe some hand coded scripts binding\ntogether a rickety project that nobody but you can run? The truth is,\nthe tools available to scientists to create clean reproducible papers\nare too limited, not general purpose enough, and not portable enough for\nsharing with other scientists.\n\nThis talk will be a demonstration of generating a paper using Dexy, a\ntool that has been written from scratch for making it as painless as\npossible to write truly reproducible technical documents. The whole\nproject workflow will be automated including gathering and cleaning\ninput data, running analysis scripts, producing plots, and compiling\noutput documents to PDF, HTML and ePub output formats. The example\nproject will include software and scripts in Python as well as other\nprogramming languages. We will automate running the code, applying\nsyntax highlighting, generating plots and other files as side effects\nfrom running the code, and incorporating all these elements into the\nvarious documents we wish to create.\n",
  "tags": [
    "Tech"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/u6_qtDJ6ciA/hqdefault.jpg",
  "title": "Writing Reproducible Papers with Dexy; SciPy 2013 Presentation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=u6_qtDJ6ciA"
    }
  ]
}
