{
  "description": "Da qualche anno si parla sempre più insistentemente di *Word Embedding*,\nidentificando così quell’insieme di tecniche che tentano di modellare il\nlinguaggio umano creando una mappatura delle parole nel campo\nvettoriale. Come spesso accade per ambiti in rapido sviluppo, si è\nassistito alla nascita di diversi approcci algoritmici tra i quali a\nvolte è difficile districarsi. Da questo punto di vista un linguaggio di\npropotipazione rapida come Python consente l’implementazione e\nl’utilizzo di una serie di librerie al fine di scegliere di volta in\nvolta quelle che meglio modellano il problema in esame. Il talk mostra\nla potenzialità del word embedding entrando nel merito di due\napplicazioni reali relative a due contesti lontani fra loro, quali\nquelli della pubblica amministrazione e del privato. In ambito PA viene\nmostrato come, analizzando le descrizioni progettuali presentate da un\ninsieme di aziende ad un importante istituto italiano, è possibile\nprevedere l’esito delle rispettive richieste di finanziamento,\nconsentendo di aumentare in modo sostanziale il numero degli\ninvestimenti. Nella seconda parte ci spostiamo invece nel privato e\nmostriamo come codificare un’informazione naturalmente non strutturata,\ncome la descrizione di un intervento in una officina meccanica,\nrendendola così gestibile al pari di quella strutturata.\n",
  "duration": 2729,
  "language": "ita",
  "recorded": "2017-04-08",
  "related_urls": [
    {
      "label": "slides",
      "url": "https://www.pycon.it/media/conference/slides/word-embedding-come-maneggiare-informazione-non-strutturata.pdf"
    }
  ],
  "speakers": [
    "Felice Tuosto",
    "Andrea Ianni"
  ],
  "tags": [
    "word_embedding",
    "embedding",
    "text_mining"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Xrz052IA_nk/hqdefault.jpg",
  "title": "Word Embedding: come codificare il linguaggio naturale per algoritmi di previsione e classificazione",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Xrz052IA_nk"
    }
  ]
}
