{
  "description": "Nel talk si parlerà di come attraverso il linguaggio Python sia\npossibile risolvere un problema reale e complesso relativamente alla\ntrasmissione di energia elettrica. Verrà spiegato il progetto\n**RealtimeLoadForecast** che è stato sviluppato per un importante TSO\n(Transmission System Operator). Si tratta di sistema predittivo che\npermette di fornire in tempo reale ogni 15 minuti ed entro 5 minuti, le\nprevisioni delle serie storiche dei consumi di energia elettrica\nrelativi a circa 500 nodi elettrici.\n\nSi parlerà dei passi che occorre seguire per ottenere da un semplice\nprototipo, un sistema *ingegnerizzato* che lavori in tempo reale e di\ncome sono state utilizzate le librerie di Python per l’acquisizione,\nmanipolazione e processamento dei dati elettrici ed ambientali.\n\nSaranno descritte alcune tecniche algoritmiche e di Machine Learning per\nottenere dei modelli predittivi capaci di fornire previsioni accurate ma\ncon tempi di risposta sfidanti.\n\nVerrà mostrato un *esempio concreto* di implementazione di un algoritmo\npredittivo basato sulla libreria Deep Learning **Keras**.\n\nPer la comprensione del talk non sono necessari particolari requisiti se\nnon una conoscenza di base di programmazione in Python e di Machine\nLearning.\n",
  "duration": 3632,
  "recorded": "2017-04-08",
  "related_urls": [
    {
      "label": "slides",
      "url": "https://www.pycon.it/media/conference/slides/talk.pdf"
    }
  ],
  "speakers": [
    "Felice Tuosto"
  ],
  "tags": [
    "Forecasting",
    "Genetic Algorithms",
    "Keras",
    "Data Mining",
    "programming-paradigms",
    "scikit-learn",
    "bigdata",
    "scalability",
    "Deep-Learning",
    "threading",
    "realtime",
    "Data-Scientist",
    "database",
    "machine-learning",
    "mysql",
    "signal-processing",
    "LoadForecasting",
    "cassandra"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/QZHe4s4g1OE/hqdefault.jpg",
  "title": "Machine Learning con Python: previsione in real-time della richiesta di energia elettrica",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QZHe4s4g1OE"
    }
  ]
}
