{
  "description": "Genropy è un framework per la creazione di Single Page Applications che\nconsente allo sviluppatore di scrivere applicazioni complesse in tempi\nbrevissimi. Lo scopo del framework è di mettere a disposizione un\npotente costruttore di GUI web, un ORM molto facile, veloce ed intivo ed\nuna serie di component che rendono possibile costruire la propria\napplicazione in poche righe di codice. A questo si aggiungono tools di\namministrazione per la gestione di permessi, grafici, gestione del\nworkflow, gestore di stampe e molti altri che fanno di Genropy\nun’ambiente usabile immediatamente in produzione anche in situazioni\ncomplesse e critiche.\n\nAbbiamo cominciato a scrivere Genropy nel 2005 e durante il primo Pycon\nqui a Firenze nel 2007, abbiamo ne abbiamo mostrato la primissima\nversione. Da allora, ogni edizione di Pycon è stata l’occasione per\npresentare le nuove features e cercare di diffondere la copnoscenza di\nquesto framework . A distanza di 10 anni possiamo dire che esiste una\nminuscola ma molto attiva community che utilizza Genropy come strumento\nquotidiano per scrivere le proprie applicazioni web.\n\nIn questo talk vorremmo raccontarvi questa avventura, e darvi modo di\nconoscere meglio Genropy e di capire se può essere anche per voi il\nvostro nuovo modo di scriverre applicazioni web.\n",
  "duration": 1285,
  "language": "ita",
  "recorded": "2017-04-07",
  "related_urls": [
    {
      "label": "slides",
      "url": "https://www.pycon.it/media/conference/slides/genropy-10-anni-di-sviluppo-di-un-framework-italiano.pdf"
    }
  ],
  "speakers": [
    "Giovanni Porcari"
  ],
  "tags": [
    "community",
    "genropy",
    "gui",
    "web-development",
    "business"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/uxQnGxIY4kE/hqdefault.jpg",
  "title": "Genropy: 10 anni di sviluppo di un framework italiano",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uxQnGxIY4kE"
    }
  ]
}
