{
  "description": "We propose a novel solution in differential network analysis to both the\nnetwork comparison and the classification tasks by introducing the\nglocal HIM metric for comparing graphs and a graph kernel induced by the\nHIM measure. The HIM distance is defined as the one-parameter family of\nproduct metrics linearly combining the normalised Hamming distance H and\nthe normalised Ipsen- Mikhailov spectral distance IM. The combination of\nthe two components within a single metric allows overcoming their\ndrawbacks and obtaining a measure which is simultaneously global and\nlocal. Furthermore, plugging the HIM kernel into a Support Vector\nMachine gives us a classification algorithm based on the HIM distance.\nHere we outline the underlying theoretical details of the metric\nconstruction, and we present several applications of the HIM distance\nand the HIM kernel to datasets belonging to different areas, including\nsocioeconomics, neuroscience, oncogenomics and developmental genomics,\nsupporting the adoption of the HIM family as a general analysis tool for\ninformation extraction based on a quantitative evaluation of the\ndifference among diverse instances of a complex system. We conclude\nintroducing the Open Source implementation of the HIM metrics provided\nin the R package nettols and in its web interface ReNette.\n",
  "duration": 2337,
  "language": "eng",
  "recorded": "2017-04-09",
  "related_urls": [
    {
      "label": "slides",
      "url": "https://www.pycon.it/media/conference/slides/differential-network-analysis-and-graph-classification-a-glocal-approach.pdf"
    }
  ],
  "speakers": [
    "Giuseppe Jurman"
  ],
  "tags": [
    "mathematics",
    "algebra",
    "Network",
    "Machine Learning"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/gZCKODe8UWY/hqdefault.jpg",
  "title": "Differential network analysis and graph classification: a glocal approach",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gZCKODe8UWY"
    }
  ]
}
