{
  "description": "If you are into Deep Learning, sooner or later, it inevitbly happens\nthat you’re asked at least once to explain what actually means **Deep\nLearning** , and what’s all the fuss about it.\n\nIndeed, answering this question in a proper way, may vary (and it has\nto) depending on the kind of audience you’ve been talking to.\n\nIf you are talking to a machine learning experts, you have to\nconcentrate on what *deep* means, for the multiple learning models you\ncan come up with. Most importarly, you have to convince them that a deep\nlearning model would work by far better than a more standard and robust\nRandom Forest or Support Vector Machine.\n\nOn the other hand, if your audience is made up of engineers, they\n[STRIKEOUT:don’t give a damn..] are definitely more interested in how\nyou implement your Artificial Neural Networks (ANN) rather than\nunderstanding what are the implications of different *activations* and\n*optimizers*.\n\nFinally, if your audience is made up of data scientists - who are a good\nmixture of the previous two, according to `Drew\nConway <http://drewconway.com/zia/2013/3/26/the-data-science-venn-diagram>`__\n- they are more or less interested in both the two aspects.\n\nThe other way, that is the *unconventional way*, to explain what Deep\nLearning means, is from the perspective of the computational model it\nrequires to be properly effective. Therefore, you may want to talk about\nANN in terms of matrix multiplications algorithms, running on a (series\nof) GPUs in parallel. And this is **exactly** the perspecitve I intend\nto pursue in this talk.\n\nThis talk is for PyData scientists who are interested in understanding\nDeep Learning models from this unconventional perspective, learning what\nare the libraries and tools they may leverage for their experiments on\nGPUs. Experienced engineers may likely benefit from this talk as well,\nlearning how they can make their models run fast(er).\n",
  "duration": 2438,
  "language": "eng",
  "recorded": "2017-04-07",
  "related_urls": [
    {
      "label": "slides",
      "url": "https://www.pycon.it/media/conference/slides/the-unconventional-introduction-to-deep-learning.pdf"
    }
  ],
  "speakers": [
    "Valerio Maggio"
  ],
  "tags": [
    "Keras",
    "rumba",
    "Deep-Learning",
    "machine-learning",
    "Theano",
    "GPU",
    "tensorflow"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/FIU7mVT2YRg/hqdefault.jpg",
  "title": "The unconventional Introduction to Deep Learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FIU7mVT2YRg"
    }
  ]
}
