{
  "alias": "video/84/djangocon-2011--benevolent-designer-for-life--39-",
  "category": "DjangoCon 2011",
  "copyright_text": "",
  "description": "Benevolent Designer for Life's Keynote: Designers make it go to eleven\n\nPresented by Idan Gazit\n\nThe open-source world is and always has been focused on code; attention\nand respect doled out in exchange for patches. As a result, many\nopen-source projects want for design love but don't know how to secure\nit. We scare off potential contributors from the many fields beneath the\naegis of \"design\": user experience, user interfaces, usability,\ninteraction design, information architects, graphic design, typography,\nand other roles assumed by the authors of our markup and styling. Django\ncan be a model citizen among open-source projects in changing these\nattitudes and coaxing contributors out of the woodwork -- not just for\nthe benefit of the framework, but for the constellation of 3rd party\napps which make Django great. Other FOSS communities have made efforts\nthat we can learn from, and the fight to change perceptions is less\nuphill than you might think. This talk will cover: - Misconceptions of\n\"Design.\" What is design, and what do designers do? - A brief trip down\nmemory lane, and how Django came to be relatively designer- friendly. -\n\"I don't get it: what is the BDesignFL role?\" - Process and tools: How\ncan Django better engage designers, for core's benefit and for the\nbenefit of *your projects*. How can we help these contributors get over\nthe \"suck\" threshold? - What parts of core are ripe for love from\ndesigners? What 3rd party projects?\n",
  "duration": null,
  "id": 84,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-09-05",
  "slug": "djangocon-2011--benevolent-designer-for-life--39-",
  "speakers": [
    "Idan Gazit"
  ],
  "summary": "",
  "tags": [
    "design",
    "djangocon",
    "djangocon2011",
    "ui",
    "ux"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_84___benevolent-designer-for-life-s-keynote-designers-make-it-go-to-eleven",
  "title": "Benevolent Designer For Life's Keynote - Designers Make It Go to Eleven",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_84___benevolent-designer-for-life-s-keynote-designers-make-it-go-to-eleven"
    }
  ]
}
