{
  "description": "La charla \"Deep Dream: Visualizando qué aprende una red neuronal convolucional\" tiene como finalidad ilustrar cómo una red convolucional identifica patrones visuales y qué características de las imágenes son las que más activan sus neuronas. Esto, enfocado a un área artística como lo es la aplicación de Deep Dream, en la que se pueden cargar imágenes y hacer transferencia de estilos. Se hará un barrido por diferentes frameworks y librerías que permitan implementar estos modelos en Python, así como en los recursos computacionales necesarios para entrenar y probarlos.\r\n\r\nPonente: Daniela Charris\r\n\r\nSoy Ingeniera Electrónica y Magíster de la Universidad del Norte. Tengo más de 4 años de experiencia en investigación y desarrollo de algoritmos de inteligencia artificial, procesamiento de imágenes y visión por computadora. También soy profesora catedrática del dpto de Ingenierías Eléctrica y Electrónica de la Universidad del Norte.\r\n\r\nPatrocinador: Birdiefy\r\n\r\nEn Birdiefy estamos construyendo una plataforma que permite a todos los golfistas obtener feedbacks instantáneos, precisos y accesibles sobre su swing de golf. Solo basta subir un video. Nuestra experiencia y profundo conocimiento de un juego tan complejo nos ha enseñado que hay algunos aportes en la experiencia de aprendizaje del golfista que solo los humanos pueden brindar (es decir, hoja de ruta a largo plazo, objetivos, confianza, etc.). Por lo tanto, nuestro objetivo es combinar tanto la inteligencia humana como la artificial para que nuestros usuarios puedan tener una experiencia de aprendizaje instantánea y personalizada. Si estás interesado (ya sea como jugador, entrenador o inversor), ¡no dudes en comunicarte con nosotros en hello@birdiefy.ai\r\n\r\n****** El evento será presencial para las personas en Barranquilla. ******",
  "duration": 3529,
  "language": "eng",
  "recorded": "2023-03-03",
  "related_urls": [
    {
      "label": "Website",
      "url": "https://pybaq.co/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/t3B0ENK7Ktk/sddefault.jpg?v=63f7b49c",
  "title": "DeepDream: Visualizando que aprende una red neuronal convolucional",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=t3B0ENK7Ktk"
    }
  ]
}
