{
  "description": "El evento presencial iniciará a las 7pm con un evento por Zoom (se podrá ver desde el teatrino de Koombea)\r\n\r\nLuego continuaremos con la transmisión de las charlas por Youtube a las 8:00pm.\r\n\r\n📣 Solucionando el tipico \"en mi local funciona\" usando DevContainers, Docker y Github codespaces\r\n\r\nLa charla busca mostrar algunos ejemplos de implementación de devcontainers con Github codespaces que facilitan la ejecución de proyectos con Django y Lektor.\r\n\r\nPonente: Sergio Orozco\r\n\r\nIngeniero de sistemas de la Corporación Universitaria Americana originario de Barranquilla con 11 años de experiencia en desarrollo de software, Co-Organizador de Python Barranquilla, Trabajo actualmente en Perficient como software developer\r\n\r\n📣 Automatización de tareas repetitivas con Python: deja que los Scripts trabajen por tí.\r\n\r\nSe busca mostrar cómo Python puede ser utilizado para automatizar tareas repetitivas en el ámbito laboral o personal. Presenta ejemplos de automatización de procesos como:\r\n\r\n- La descarga de archivos\r\n- El procesamiento de datos\r\n- El envío de correos electrónicos.\r\nCon ejemplos prácticos, los asistentes podrán comprender cómo ahorrar tiempo y esfuerzo mediante la programación de scripts.\r\n\r\nPonente: Pedro Bonilla\r\n\r\nSoy estudiante de física, en doble programa de lic. en matemáticas de la universidad del Atlántico, desarrollador web, hacker ético con experiencia en Cyberseguridad, seguridad en dispositivos IoT, backend. Investigo acerca de cómo combinar la estenografía con el álgebra abstracta.",
  "duration": 4982,
  "language": "eng",
  "recorded": "2023-09-22",
  "related_urls": [
    {
      "label": "Website",
      "url": "https://pybaq.co/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/jnZatfMc6rM/sddefault.jpg?v=650386f6",
  "title": "Devcontainers en localhost + automatizando tareas repetitivas con Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jnZatfMc6rM"
    }
  ]
}
