{
  "description": "En esta charla conoceremos algunas de las alternativas para realizar subidas y descargas de archivos en un contexto de una API REST. Profundizaremos en los componentes y configuraciones que propone django y django rest framework para manejar este tipo de procesos. Por último revisaremos configuraciones útiles de uwsgi y ngnix para cuando llevemos a producción aplicaciones que provean este tipo de servicios.\n\nPonente: Emiliano Martín\n\nMi nombre es Emiliano Martín, tengo 28 años y vivo en Córdoba, Argentina. Estudié Ingeniería en Sistemas de Información en la UTN y actualmente trabajo en Mercadolibre como Sr. Software Engineer.\nMe apasiona el desarrollo de software en general, me gusta estar en un constante aprendizaje de nuevas tecnologías y buenas prácticas de programación.\n\nEn 2015 comencé mi camino profesional en MercadoLibre principalmente como Desarrollador Backend Java en el área de prevención de fraude. Luego en 2017 tuve la posibilidad de emigrar al equipo de prevención de lavado de dinero, en donde además de desarrollar backend con Java, incursioné en el desarrollo frontend con NodeJS y ReactJS. Por último, en 2019 y hasta la actualidad, logré dar un giro en mi carrera y dedicarme full time a desarrollar Python como MLOps en el área de Machine Learning Technology, lenguaje que me gusta mucho y lo utilizaba en proyectos fuera de MercadoLibre.\n\nTambién puedes participar en zoom: https://koombea.zoom.us/j/95290884169?pwd=SkRXWHo1U0ZLc0pVcFFxSU5Gem5KZz09",
  "duration": 2795,
  "language": "eng",
  "recorded": "2020-08-14",
  "related_urls": [
    {
      "label": "Website",
      "url": "https://pybaq.co/"
    },
    {
      "label": "https://koombea.zoom.us/j/95290884169?pwd=SkRXWHo1U0ZLc0pVcFFxSU5Gem5KZz09",
      "url": "https://koombea.zoom.us/j/95290884169?pwd=SkRXWHo1U0ZLc0pVcFFxSU5Gem5KZz09"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/xFbdytRPK9Q/maxresdefault.jpg",
  "title": "Manejo de archivos grandes con una Django app & DRF | Python Barranquilla",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xFbdytRPK9Q"
    }
  ]
}
