{
  "description": "🎥 Watch our teaser video and share this great event with everyone!\n\nPyCon Colombia 2024 is the seventh edition of the national Python conference in Colombia. This year, PyCon Colombia returns with distinguished guests from various countries, eager to share their ideas, experiences, and knowledge with all attendees.\n\nLearn more about PyCon Colombia 2024 on our website:\n\n🔗 https://2024.pycon.co/\n\nThere you'll find more information about our speakers, talks, organizers, and sponsors.\n\nDon't forget to follow us on our social networks to stay updated:\n\nFacebook: 🔗 https://www.facebook.com/pyconcolombia\nTwitter: 🔗 https://twitter.com/pyconcolombia\nInstagram: 🔗 https://www.instagram.com/pyconcolombia/\nLinkedIn: 🔗 https://www.linkedin.com/company/pycon-colombia/\n\nAdditionally, we're thrilled to introduce our seven keynote speakers who will be joining us:\n\n1. Sebastian Ramirez: Creator of FastAPI, Typer, SQLModel, Asyncer, among other tools. A strong advocate for open source software.\n2. Lorena Barba: Professor and Director of the Open Source Software Office at George Washington University. Mechanical Engineer with a Ph.D. in Aeronautics. Woman in STEM, a reference for the Python community.\n3. Qumisha Goss: Keynote speaker at PyCon USA in 2023, Interim Executive Director of Peer2Peer University. Recognized in the US Python community for her program to teach children computational thinking and programming foundations.\n4. Cris Ewing: Engineering Manager at Amazon Web Services (AWS), with over 20 years of experience in the Software Development Industry. Was a keynote speaker at PyCon USA in 2016.\n5. Matthew Harrison: Python and Data Science trainer at MetaSnake. Lecturer of different courses using Python technologies. Co-chair of Utah Python.\n6. Van Lindberg: Founder/CEO at OSPOCO. Lawyer Specialist in Software and Computer Law Issues. Former General Counsel and Vice-Chairman of the Board of Directors at the Python Software Foundation.\n7. Marlene Mhangami: Computer Scientist and Molecular Biologist. Former Director (vice-chair) of the Python Software Foundation. Speaker at several PyCon around the world.\n\nDon't miss the chance to join this exciting event!\n\n#PyConColombia2024 #June #Programming #Colombia #Community #Conference #Event #PyCon #Python\"",
  "duration": 197,
  "language": "spa",
  "recorded": "2024-06-07",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.co/"
    },
    {
      "label": "https://2024.pycon.co/",
      "url": "https://2024.pycon.co/"
    },
    {
      "label": "https://www.linkedin.com/company/pycon-colombia/",
      "url": "https://www.linkedin.com/company/pycon-colombia/"
    },
    {
      "label": "https://www.facebook.com/pyconcolombia",
      "url": "https://www.facebook.com/pyconcolombia"
    },
    {
      "label": "https://twitter.com/pyconcolombia",
      "url": "https://twitter.com/pyconcolombia"
    },
    {
      "label": "https://www.instagram.com/pyconcolombia/",
      "url": "https://www.instagram.com/pyconcolombia/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/FgAh_ufALns/maxresdefault.jpg",
  "title": "Teaser PyCon Colombia 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FgAh_ufALns"
    }
  ]
}
