{
  "copyright_text": null,
  "description": "PyData Amsterdam 2018\n\nTensorFlow has a component named TensorFlow Object Detection, whose purpose is to train a system capable of recognizing objects in a frame. Usually, this technology is used to detect real-life objects, until I took on the challenge of building a detection system to detect everybody's favorite Pokemon, Pikachu. What is object detection, and how I built my model? That's what this talk is about.\n\nSlides: /redirect?redir_token=bM6BAMACOr-Y2JsOC8MefDtMqGd8MTUzMjc1ODc0OEAxNTMyNjcyMzQ4&event=video_description&v=Ru31N739MOM&q=https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1imW1WMorXMNs4GO4htvT4p494w1q4bJ0%2Fview\n--\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 2040,
  "language": "eng",
  "recorded": "2018-06-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/amsterdam2018/schedule/"
    }
  ],
  "speakers": [
    "TODO",
    "enter_manually"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Ru31N739MOM/maxresdefault.jpg",
  "title": "Detecting Pikachu on Android using Tensorflow Object Detection - Juan De Dios Sanos Rivera",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ru31N739MOM"
    }
  ]
}
