{
  "copyright_text": null,
  "description": "PyData Amsterdam 2018\n\nThe ability to accurately forecast the amount of passengers that will board a particular flight is crucial for airline operations. But how do we design a machine learning algorithm for this use case and in what ways can we improve it? In this talk, we start with a simple linear model, evolving to increasingly complex deep learning neural network architectures.\n\nSlides: /redirect?v=A-azJ8qmwug&redir_token=Bm-WhsvEH5CGrs91k9KXxxkew6d8MTUzMjc1ODc0N0AxNTMyNjcyMzQ3&event=video_description&q=https%3A%2F%2Fpydata.org%2Famsterdam2018%2Fproposals%2Fdocument%2F15%2Fae34b5af-f8ae-4cac-8d85-ae08dd8690e3.pdf\n--\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 2038,
  "language": "eng",
  "recorded": "2018-06-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/amsterdam2018/schedule/"
    }
  ],
  "speakers": [
    "Alexander Backus",
    "Jan van der Vegt"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/A-azJ8qmwug/maxresdefault.jpg",
  "title": "Forecasting airline passengers using designer machine learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=A-azJ8qmwug"
    }
  ]
}
