{
  "copyright_text": null,
  "description": "PyData Amsterdam 2018\n\nThe correct classification of customer service calls/chat transcription is crucial to identify bottlenecks in customer facing business processes and in improving customers satisfaction. In this talk we discuss the technical and even harder business challenges we had to overcome at KPN in applying multiple Text Analytics techniques in order to achieve a workable classification accuracy.\n\nSlides:  /redirect?redir_token=fKlz0Q8T06_N_A_cCOii-IpTv858MTUzMjc1ODc1OUAxNTMyNjcyMzU5&event=video_description&v=OKxG2r0-hFA&q=https%3A%2F%2Fwww.slideshare.net%2FMariaVechtomova%2Fimproving-classification-accuracy-for-customer-contact-transcriptions\n--\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 1845,
  "language": "eng",
  "recorded": "2018-06-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/amsterdam2018/schedule/"
    }
  ],
  "speakers": [
    "TODO",
    "enter_manually"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/OKxG2r0-hFA/maxresdefault.jpg",
  "title": "Improve classification accuracy for customer contact transcriptions - Maria Vechtomova",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OKxG2r0-hFA"
    }
  ]
}
