{
  "copyright_text": null,
  "description": "PyData Amsterdam 2018\n\nThe purpose of this talk is to illustrate the importance of network-based models in financial industry since the 2007-08 crisis. I will present our novel method to learn a (Bayesian) network using default dependence of financial institutions and show how financial distress can propagate via such a network. I will share some examples where we extensively use NetworkX and bnlearn packages.\n\nSlides: /redirect?v=arngQHLcZn8&event=video_description&q=https%3A%2F%2Fwww.slideshare.net%2FPyData%2Flearning-credit-networks-with-applications-in-financial-industry-sumit-sourabh&redir_token=LkGyzYxzlPCBRTKYLkcIlkpClOh8MTUzMjc1ODc1NEAxNTMyNjcyMzU0\n--\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 2254,
  "language": "eng",
  "recorded": "2018-06-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/amsterdam2018/schedule/"
    }
  ],
  "speakers": [
    "TODO",
    "enter_manually"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/arngQHLcZn8/maxresdefault.jpg",
  "title": "Learning credit networks with applications in financial industry - Sumit Sourabh",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=arngQHLcZn8"
    }
  ]
}
