{
  "copyright_text": null,
  "description": "PyData Amsterdam 2018\n\nRunning Machine learning jobs at scale places painful demands on infrastructure from an operational perspective. As the number of jobs increase, having an easy-to-use infrastructure becomes a necessity. In this talk we will cover how we use Kubernetes at Textkernel as a job manager to scale our Tensorflow-based jobs. We will also explore other solutions such as distributed Tensorflow and Kubeflow.\n\nSlides: /redirect?q=https%3A%2F%2Fdocs.google.com%2Fpresentation%2Fd%2F1-vP70IA_5-1xlUPhC09Pq9utxpNnTXfwCa-T_-zM8SU%2Fedit%23slide%3Did.g3b17409166_0_6&redir_token=rjd7cBg-UlVQ3YiiJorKOFxKU-d8MTUzMjc1ODc3M0AxNTMyNjcyMzcz&v=fYGu1ideQkw&event=video_description\n--\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 1548,
  "language": "eng",
  "recorded": "2018-06-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/amsterdam2018/schedule/"
    }
  ],
  "speakers": [
    "Tarek Mehrez",
    "Carsten Lygteskov Hansen"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/fYGu1ideQkw/maxresdefault.jpg",
  "title": "Scaling Machine Learning jobs with Kubernetes",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fYGu1ideQkw"
    }
  ]
}
