{
  "abstract": "Our artistic, creative nature is what has fuelled the human evolution. However today, there is a misconception of how technology is making humans indolent. Instead technology, especially python programming with its reach in AI, can empower humans to express themselves artistically like never before.",
  "description": "Around 2 million years ago, the primitive man started on the journey of evolution. They made tools out of stones, houses out of wood, food out of the wilderness. They imagined, innovated and created. Suddenly there was civilization, there was commerce. People were interested in more than just day-to-day functioning but also in something called art. There were paintings, there was music, dance, drama.\n\nFast forward to the 1990’s with the onset of technology and the world-wide-web. From then to now, we have had Wifi, Google, Artificial Intelligence, AR/VR, Cryptocurrency. As Technology is getting more exciting, the misconception about it making humans a dull, monotonous species is also increasing. Instead, technology serves to be the medium through which creative thoughts are made into a reality.\n\nThis talk aims to inspire both novices and professionals in the field to create. It will cover the unexplored applications of python programming in art and creativity by harnessing simple programming and mathematical techniques as well as by creating Artificially Intelligent Systems. The talk will cover a wide range of examples from bringing past artists back to life, integrating the cultures of the world with programming as well as examining real-life applications of artistically aimed python programming in music videos, museums and much more. Moreover, it will also cover the speaker’s role in the field and new, exciting areas to explore and prospective problems to solve to make humans a more creatively able and remarkable species.\n\nCopyright belongs to the speaker.",
  "language": "eng",
  "recorded": "2018-06-09",
  "speakers": [
    "Aparna Krishnakumar"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/PVCC0CQontU/hqdefault.jpg",
  "title": "Delve into Art and Creativity with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PVCC0CQontU"
    }
  ]
}
