{
  "abstract": "Traditional techniques to tune the hyperparameters of machine learning models provide no way of incorporating prior knowledge of model performance at given hyperparameter settings. I show that Bayesian Optimization can be used to rectify this, presenting a walkthrough of tuning a CNN model in Keras.",
  "description": "Choosing the best hyperparameters for machine learning models is sometimes considered as more of an art than science. For most machine learning practitioners, mastering this art of tuning hyperparameters requires not only a competent background in machine learning algorithms, but also extensive experience working with real-world datasets. Most machine learning algorithms present a variety of hyperparameters to tune, and in the case of neural networks and deep learning models, the list of potential hyperparameters to adjust can increase exponentially. As such, deep learning models are notoriously tricky to optimally tune, where thorough exploration of architectures and hyperparameters is imperative.\n\nGrid search and randomized search methodologies are traditionally used to tune model hyperparameters, however they are costly approaches and incorporate no notion of how trials of previous hyperparameters have performed. Bayesian Optimization is one such approach that forms knowledge about the relation between the hyperparameter settings and model performance in order to make a smarter choice for future parameter settings.\n\nUsing Zalando’s Fashion MNIST dataset, which comprises of 60,000 clothing images, I present the use of Bayesian Optimization to tune the hyperparameters of a convolutional neural network in Keras.\n\nCopyright belongs to the speaker.",
  "language": "eng",
  "recorded": "2018-06-10",
  "speakers": [
    "Niall Turbitt"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/MJMLlS8SURw/hqdefault.jpg",
  "title": "Tuning the knobs of neural networks using Bayesian Optimization",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MJMLlS8SURw"
    }
  ]
}
