{
  "id": 3871, 
  "category": "Kiwi PyCon 2015", 
  "slug": "micro-services-is-http-the-only-way", 
  "title": "Micro-Services: Is HTTP the only way?", 
  "summary": "", 
  "description": "Introduction\r\n============\r\n\r\nOver the past few years, micro-services have been gaining popularity due to their advantages over traditional monolithic architectures. It becomes easier to horizontally scale the heavier portions of an application; you're not tied to the same OS or programming language for the entire application, meaning you can easily slot in the best tool for the job; and finally, you can quickly build the entire application in dynamic yet less performant languages, then rebuild any bottlenecks with faster (but slower to develop) languages.\r\n\r\nAs a basic example, rather than directly communicating with a database for user authentication, a web front-end would make an HTTP request to another lightweight REST service to check credentials.\r\n\r\n\r\nAn Example Application\r\n======================\r\n\r\nIn order to elucidate the difference between monolithic and micro-services, we will use a simple Social-Network web application that allows users to post 141 character messages. A user must first sign up, then log in with a username and password, then they can post their messages publicly. A user can then follow any other user, and receive real time updates when that user posts. While the behaviour is simple, there are a number of different concepts that are explored: template rendering, user signup and authentication, data storage and notification delegation.\r\n\r\n\r\nA Monolithic Version\r\n======================\r\n\r\nThe first version of the will be a single Django application. The talk does not go into detail on the source code, instead briefly discusses the views, databases (tables and queries) and overall architecture at a high level.\r\n\r\n\r\nThe HTTP Micro-Service Version\r\n===============================\r\n\r\nIn order to deconstruct the monolith into micro-services, we look at different functions of the application: message viewing, user signup and authentication, data storage and search, and user notification. Django is kept as the front-end, but the databases for authentication, data storage and searching and user-follows are each transformed into their own micro-service. Flask is used as the HTTP framework for these services, with SQLAlchemy for database as necessary. Some source code is discussed (mostly in terms of standard Django database access c.f. HTTP) but this is also quite high level. The talk will also cover what HTTP comes with \"out of the box\", in terms of authentication, deployment and scalability.\r\n\r\n\r\nAlternative Transports\r\n======================\r\n\r\nAfter the micro-services have been split, we can start to think about different transports that might be more appropriate (or at least more interesting) in some circumstances.\r\n\r\n\r\nIntroducing a Message Queue\r\n---------------------------\r\n\r\nFrom a user perspective, HTTP is a synchronous protocol, so making other synchronous HTTP calls inside an HTTP handler doesn't introduce much complexity. Message queues, on the other hand, are asynchronous by nature. We look at using message queues for delegating user notifications (which don't require a response, and are easy to handle), then for authentication, data storage and searching – each requiring a slightly different \"level\" of \"synchronicity\" and a need to be shoehorned into HTTP differently. We'll look at code for message producing and consuming and discuss architecture again.\r\n\r\nMessage queues are already widely used for handling intensive background tasks, so we'll look at how they compare to HTTP in this application (for security and deployment), and briefly also talk about cross-platform compatibility.\r\n\r\n\r\nLower Down the Stack - Raw Sockets\r\n----------------------------------\r\n\r\nIf, for some reason, the overhead of HTTP or a message queue is too high, direct socket communication might be better. We'll look at a Python TCP server for user authentication, and a UDP server for handling user notifications, and example code for both. Also discussed are the security implications (it's DIY all the way), performance, and how you might scale these.\r\n\r\n\r\nConclusion\r\n==========\r\n\r\nFinally we'll look at a comparison overview for all these different methods and summarise with the pros and cons of each.\r\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC BY-SA", 
  "thumbnail_url": "https://i.ytimg.com/vi/O1qaoykYIXY/hqdefault.jpg", 
  "duration": 2027, 
  "videos": [
    {
      "url": "http://youtu.be/O1qaoykYIXY", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://youtu.be/O1qaoykYIXY", 
  "tags": [], 
  "speakers": [
    "Ben Shaw"
  ], 
  "recorded": "2015-09-05"
}