{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": 1646, "video_ogv_download_only": false, "category": "Kiwi PyCon 2015", "speakers": ["Eloise \"Ducky\" Macdonald-Meyer", "Martin Henschke"], "title": "Python in Classrooms", "quality_notes": "", "video_flv_length": null, "recorded": "2015-09-05", "video_mp4_length": null, "description": "Python as a language has had great success in being accessible to aspiring programmers of much younger ages than most contemporary languages, and the skill set attained from learning to program may include basic problem solving, mathematics and even literacy. We have conducted several workshops with diverse groups of primary school children in years 4 to 6, attempting to teach elementary programming skills using Python. The goals of the workshops were to promote numeracy and literacy in Tasmanian schools, where there may be lower rates of competency in these areas. We wanted to do this through the use of a formal, syntax-dependent language, which could have benefits related to natural language skills and literacy. To engage our students we constructed exercises in different topics, that lead to children being able to modify a small, simple and modular game using PyGame for Python 2.7. In some of these exercises, the students created elementary programs to answer simple math questions and participated in group exercises to make modifications to one version of the  game (adding characters, dialogue and interactions) before being able to modify their own version. In these sessions we found participants to engage well with the source material despite being reasonably advanced, with teaching staff making comparisons between accurate python syntax and grammatically correct English.", "video_mp4_url": "", "tags": [], "copyright_text": "CC BY-SA", "related_urls": [], "video_flv_download_only": false, "source_url": "http://youtu.be/cKcL7-IxEwg", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/cKcL7-IxEwg/hqdefault.jpg", "video_flv_url": null}