{
  "description": "www.pydata.org\n\nLive Demo: https://carlkcarlk.github.io/perfect-physics/pyscript/\nArticle: https://towardsdatascience.com/perfect-infinite-precision-game-physics-in-python-part-2-360cc445a197\nSpeaker: @CarlK (YouTube) @CarlKadie (twitter)\n\nThis fun and visual talk shows how to create a perfect (but impractical) physics engine in Python. The key is Python’s SymPy, a free package for computer algebra.\n\nThe physics engine turns parts of physics, mathematics, and even philosophy into Python programming. We’ll learn about:\n\nSimulating 2-D Newtonian physics such as Newton’s Cradle and the two-ball drop\nHaving the computer solve math problems too hard for us to personally solve\nThe surprising (even to physicists) non-determinism of a billiards break\nThoughts on making the simulator more practical\nIf you are an enthusiast interested in what Python can do in other fields, or an expert interested in the limits of simulation and programming, this talk is for you!\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2185,
  "language": "eng",
  "recorded": "2023-04-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/seattle2023/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://towardsdatascience.com/perfect-infinite-precision-game-physics-in-python-part-2-360cc445a197",
      "url": "https://towardsdatascience.com/perfect-infinite-precision-game-physics-in-python-part-2-360cc445a197"
    },
    {
      "label": "https://carlkcarlk.github.io/perfect-physics/pyscript/",
      "url": "https://carlkcarlk.github.io/perfect-physics/pyscript/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/52n2qKgwW_Q/maxresdefault.jpg",
  "title": "Carl Kadie - A Perfect, Infinite-Precision, Game Physics in Python | PyData Seattle 2023",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=52n2qKgwW_Q"
    }
  ]
}
