{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Chicago 2016\n\nThis tutorial provides you with a comprehensive introduction to machine learning in Python using the popular scikit-learn library. We will learn how to tackle common problems in predictive modeling and clustering analysis that can be used in real-world problems, in business and in research applications. And we will implement certain algorithms as scratch as well, to internalize the inner workings\n\nThis tutorial will teach you the basics of scikit-learn. We will learn how to leverage powerful algorithms from the two main domains of machine learning: supervised and unsupervised learning. In this talk, I will give you a brief overview of the basic concepts of classification and regression analysis, how to build powerful predictive models from labeled data. Furthermore, we will go over the basics of clustering analysis to discover hidden structures in unlabeled data. Although it's not a requirement for attending this tutorial, I highly recommend you to check out the accompanying GitHub repository at https://github.com/rasbt/pydata-chicago2016-ml-tutorial 1-2 days before the tutorial. During the session, we will not only talk about scikit-learn, but we will also go over some live code examples and code simple machine-learning algorithms from scratch to get the knack of scikit-learn's API.",
  "duration": 5200,
  "language": "eng",
  "recorded": "2016-08-26",
  "related_urls": [
    "https://github.com/rasbt/pydata-chicago2016-ml-tutorial",
    "http://pydata.org/chicago2016/schedule/presentation/36/"
  ],
  "speakers": [
    "Sebastian Raschka"
  ],
  "tags": [
    "learning",
    "machine learning",
    "scikit"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/9fOWryQq9J8/maxresdefault.jpg",
  "title": "Learning scikit learn - An Introduction to Machine Learning in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9fOWryQq9J8"
    }
  ]
}
