{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Andreas Dewes - Code is not text! How graph technologies can help us to understand our code better.\n[EuroPython 2015]\n[21 July 2015]\n[Bilbao, Euskadi, Spain]\n\nToday, we almost exclusively think of code in software projects as a\ncollection of text files. The tools that we use (version control\nsystems, IDEs, code analyzers) also use text as the primary storage\nformat for code. In fact, the belief that \"code is text\" is so deeply\ningrained in our heads that we never question its validity or even\nbecome aware of the fact that there are other ways to look at code.\n\nIn my talk I will explain why treating code as text is a very bad idea\nwhich actively holds back our understanding and creates a range of\nproblems in large software projects. I will then show how we can\novercome (some of) these problems by treating and storing code as\ndata, and more specifically as a graph. I will show specific examples\nof how we can use this approach to improve our understanding of large\ncode bases, increase code quality and automate certain aspects of\nsoftware development.\n\nFinally, I will outline my personal vision of the future of\nprogramming, which is a future where we no longer primarily interact\nwith code bases using simple text editors. I will also give some ideas\non how we might get to that future.\n\nMore information about me:\n\n- Github: https://github.com/adewes\n\n- Twitter: https://twitter.com/japh44\n\n- Website: http://www.andreas-dewes.de/en",
  "duration": 2464,
  "language": "eng",
  "recorded": "2015-08-07",
  "related_urls": [
    "https://github.com/adewes",
    "https://twitter.com/japh44",
    "http://www.andreas-dewes.de/en"
  ],
  "speakers": [
    "Andreas Dewes"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/mJyjkAOK0uw/maxresdefault.jpg",
  "title": "Code is not text! How graph technologies can help us to understand our code better.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mJyjkAOK0uw"
    }
  ]
}
