{
  "copyright_text": "Standard YouTube License",
  "description": "Scott Triglia - Arrested Development - surviving the awkward adolescence of a microservices-based application\n[EuroPython 2015]\n[24 July 2015]\n[Bilbao, Euskadi, Spain]\n\nThe potential upside of microservices is significant and exciting. So\nmuch so that Yelp's Transaction Platform committed from the start to\nan architecture of small, cooperative microservices. This talk\nexplores the inevitable complications that arise for Python developers\nin as the services grow larger and stretch both their own architecture\nand the developers responsible for them. Come hear tales of terror\n(tight coupling! low test coverage!), stories which will warm your\nheart (agility! strong interfaces!), and everything in between as we\nfollow the adventures of our plucky team.\n\nThe talk will be focused on the functional, cultural, and reliability\nchallenges which occur as a microservices-based project evolves and\nexpands over time. Particular attention will be paid to where these\ndiverge from the utopian way microservices are often described, and to\nthe particular difficulties faced by Python developers trying to\nimplement such systems. My goal is to share with attendees some\nmistakes we've made, some successful methods for growing gracefully,\nand Python-specific tools/libraries which can help with these\nproblems.\n\nTo enjoy this talk, you should be aware of the basic vocabulary and\nconcepts of HTTP-based services. Any additional awareness of\ndistributed systems (and their failure modes) will be helpful.",
  "duration": 2534,
  "language": "eng",
  "recorded": "2015-08-08",
  "related_urls": [],
  "speakers": [
    "Arrested Development"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/z3_HorshzJ4/maxresdefault.jpg",
  "title": "surviving the awkward adolescence of a microservices-based application",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=z3_HorshzJ4"
    }
  ]
}