{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Carrie Anne Philbin - Keynote: Designed for Education: A Python Solution\n[EuroPython 2015]\n[23 July 2015]\n[Bilbao, Euskadi, Spain]\n\nThe problem of introducing children to programming and computer science has\nseen growing attention in the past few years. Initiatives like Raspberry\nPi, Code Club, code.org, (and many more) have been created to help solve\nthis problem. With the introduction of a national computing curriculum in\nthe UK, teachers have been searching for a text based programming language\nto help teach computational thinking as a follow on from visual languages\nlike Scratch.\n\nThe educational community has been served well by Python, benefiting from\nits straight-forward syntax, large selection of libraries, and supportive\ncommunity. Education-focused summits are now a major part of most major\nPython Conferences. Assistance in terms of documentation and training is\ninvaluable, but perhaps there are technical means of improving the\nexperience of those using Python in education. Clearly the needs of\nteachers and their students are different to those of the seasoned\nprogrammer. Children are unlikely to come to their teachers with\nfrustrations about the Global Interpreter Lock! But issues such as\nusability of IDEs or comprehensibility of error messages are of utmost\nimportance.\n\nIn this keynote, Carrie Anne will discuss existing barriers to Python\nbecoming the premier language of choice for teaching computer science, and\nhow learning Python could be helped immensely through tooling and further\nsupport from the Python developer community.",
  "duration": 3576,
  "language": "eng",
  "recorded": "2015-08-04",
  "related_urls": [],
  "speakers": [
    "Carrie Anne Philbin"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/_gU7sfTrz4c/maxresdefault.jpg",
  "title": "Keynote: Designed for Education: A Python Solution",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_gU7sfTrz4c"
    }
  ]
}
