{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Sarah Bird - Getting started with Bokeh / Let's build an interactive data visualization for the web..in Python!\n[EuroPython 2015]\n[20 July 2015]\n[Bilbao, Euskadi, Spain]\n\nSlides: [birdsarah.github.io/europython-2015-bokeh][1]\n\nAs a web developer, I find myself being asked to make increasing\nnumbers of data visualizations, interactive infographics, and more.\nd3.js is great, as are many other javascript toolkits that are out\nthere. But if I can write more Python and less JavaScript... well,\nthat makes me happy!\n\nBokeh is a new Python library for interactive visualization. Its\norigins are in the data science community, but it has a lot to offer\nweb developers. In this mini-tutorial, I'll run through how to build a\ndata visualization in Bokeh and how to hook it into your web\napplication. This will be a real-world example, that was previously\nbuilt in d3.js.\n\nAlong the way, I'll provide tips and tricks that I've discovered in my\nexperience including how Bokeh works wonderfully with the iPython\nnotebook which I use to prototype my visualizations, and many data\nscience people use as their native way to explore data.\n\nFor those of you who already know a little Bokeh, I'll be covering the\nnew \"actions framework\" that lets you write JS callbacks in your\npython code so you can do lots of interactions all on the client side.\n\n[1]: http://birdsarah.github.io/europython-2015-bokeh/",
  "duration": 2325,
  "language": "eng",
  "recorded": "2015-08-06",
  "related_urls": [
    "http://birdsarah.github.io/europython-2015-bokeh/"
  ],
  "speakers": [
    "Sarah Bird"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/EQCtGIdA0nE/maxresdefault.jpg",
  "title": "Getting started with Bokeh / Let's build an interactive data visualization for the web..in Python!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EQCtGIdA0nE"
    }
  ]
}