{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Josef Heinen - Getting more out of Matplotlib with GR\n[EuroPython 2015]\n[20 July 2015]\n[Bilbao, Euskadi, Spain]\n\nPython is well established in software development departments of\nresearch and industry, not least because of the proliferation of\nlibraries such as *SciPy* and *Matplotlib*. However, when processing\nlarge amounts of data, in particular in combination with GUI toolkits\n(*Qt*) or three-dimensional visualizations (*OpenGL*), Python as an\ninterpretative programming language seems to be reaching its limits.\nIn particular, large amounts of data or the visualization of three-\ndimensional scenes may overwhelm the system.\n\nThis presentation shows how visualization applications with special\nperformance requirements can be designed on the basis of *Matplotlib*\nand *GR*, a high-performance visualization library for Linux, OS X and\nWindows. The lecture focuses on the development of a new graphics\nbackend for *Matplotlib* based on the *GR* framework. By combining the\npower of those libraries the responsiveness of animated visualization\napplications and their resulting frame rates can be improved\nsignificantly. This in turn allows the use of *Matplotlib* in real-\ntime environments, for example in the area of signal processing.\n\nUsing concrete examples, the presentation will demonstrate the\nbenefits of the `GR framework`_ as a companion module for\n*Matplotlib*, both in *Python* and *Julia*. Based on selected\napplications, the suitability of the *GR framework* will be\nhighlighted especially in environments where time is critical. The\nsystem’s performance capabilities will be illustrated using demanding\nlive applications. In addition, the special abilities of the *GR\nframework* are emphasized in terms of interoperability with graphical\nuser interfaces (*Qt/PySide*) and *OpenGL*, which opens up new\npossibilities for existing *Matplotlib* applications.\n\n.. _`GR framework`: http://gr-framework.org",
  "duration": 1263,
  "language": "eng",
  "recorded": "2015-08-05",
  "related_urls": [
    "http://gr-framework.org"
  ],
  "speakers": [
    "Josef Heinen"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/XaoT65DUbYA/maxresdefault.jpg",
  "title": "Getting more out of Matplotlib with GR",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XaoT65DUbYA"
    }
  ]
}