{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Kyle Knapp - It Works on My Machine: Writing Python Code for Any Environment\n[EuroPython 2015]\n[20 July 2015]\n[Bilbao, Euskadi, Spain]\n\nHave you ever developed a nice, well-working python program on one\nenvironment, only to have it blow up with exceptions and tracebacks\nwhen you run it on a different environment? Have no fear! This talk\nwill show you how to write and maintain python code that is compatible\nacross environments that may differ by python versions and/or\noperating systems.\n\nTechniques and tips will be drawn from lessons and experiences gained\nfrom making the AWS CLI, a python-based command line tool to manage\nAWS resources, compatible across a wide range of environments. In a\ncase-study-like format, real-life compatibility issues encountered\nwhile developing the AWS CLI will be presented along with how we\nresolved each of them. These real-life examples will encompass, but\nwill not be limited to, the following topics:\n\n• How to use functions and classes that may differ across python\nversions and/or operating systems\n\n• How to handle version-specific bugs\n\n• How to handle strings, bytes, and Unicode across python versions\n\n• How to handle differing locale settings\n\n• How to handle file operations across operating systems\n\n• How and when to vendor dependencies\n\n• How to write tests that are compatible across python versions and\noperating systems\n\n• How to create a testing environment that monitors compatibility of\ncode across various environments\n\nUltimately, the goal of these examples is introduce to you some\neffective, real-world programming practices to overcome your current\nor next compatibility issue.",
  "duration": 2271,
  "language": "eng",
  "recorded": "2015-08-06",
  "related_urls": [],
  "speakers": [
    "Kyle Knapp"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/DOQUPQZTXXs/maxresdefault.jpg",
  "title": "It Works on My Machine: Writing Python Code for Any Environment",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DOQUPQZTXXs"
    }
  ]
}