{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Michael Foord - To the Clouds: Why you should deploy to the cloud even if you don't want to\n[EuroPython 2015]\n[21 July 2015]\n[Bilbao, Euskadi, Spain]\n\nDo you deploy your Python services to Amazon EC2, or to Openstack, or\neven to HP cloud, joyent or Azure? Do you want to - without being tied\ninto any one of them? What about local full stack deployments with lxc\nor kvm containers?\n\nEven if you're convinced you don't need \"the cloud\" because you manage\nyour own servers, amazing technologies like Private clouds and MaaS,\nfor dynamic server management on bare metal, may change your mind.\n\nFed up with the cloud hype? Let us rehabilitate the buzzword! (A bit anyway.)\n\nA fully automated cloud deployment system is essential for rapid\nscaling, but it's also invaluable for full stack testing on continuous\nintegration systems. Even better, your service deployment and\ninfrastructure can be managed with Python code? (Devops distilled)\n\nTreat your servers as cattle not as pets, for service oriented\nrepeatable deployments on your choice of back-end. Learn how service\norchestration is a powerful new approach to deployment management, and\ndo it with Python! If any of this sounds interesting then Juju maybe\nfor you!\n\nIn this talk we'll see a demo deployment for a Django application and\nrelated infrastructure. We'll be looking at the key benefits of cloud\ndeployments and how service orchestration is different from the\n\"machine provisioning\" approach of most existing cloud deployment\nsolutions.",
  "duration": 2333,
  "language": "eng",
  "recorded": "2015-08-05",
  "related_urls": [],
  "speakers": [
    "Michael Foord"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/lkASgQg8vWQ/maxresdefault.jpg",
  "title": "To the Clouds: Why you should deploy to the cloud even if you don't want to",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lkASgQg8vWQ"
    }
  ]
}
