{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Raphael Pierzina - Come to the Dark Side! We have a whole bunch of Cookiecutters!\n[EuroPython 2015]\n[23 July 2015]\n[Bilbao, Euskadi, Spain]\n\n*(This talk is intended for intermediate-level participants who have a\nbasic understanding of the Python language and contains quotes from\nDarth Vader that some attendees may find hilarious)*\n\nWriting a Python script from scratch is fairly easy and you get on\nwith very little boilerplate code in general. However starting a new\nPython project can be tiring if you decide to stick to best practices\nand plan on submitting it to PyPI. It requires great diligence and\noccasionally gets pretty cumbersome if you start new tools on a\nregular basis.\n\nYou underestimate the power of a good template\n----------------------------------------------\n\nWhy not just use a template for it? Cookiecutter is a CLI tool written\nin pure Python that enables you to do so. Not only is it working for\nPython code, but also markdown formats and even other programming\nlanguages. We will talk about the ideas behind Cookiecutter and go\nover how you can create your very own template, so you and others can\nbenefit from your experience.\n\nI would like to briefly go into the technologies used and how you can\nget involved in the Cookiecutter GitHub project. There are already\nplenty of Cookiecutter templates, or Cookiecutters as we call them,\navailable online. Most of them target Python projects, but others can\nbe used to create C++, LaTeX or Javascript projects.\n\nThe ability to destroy a planet is insignificant next to the power of\nCookiecutter.\n----------------------------------------------------------------------\n-------------\n\nI will show you how to use Cookiecutter and highlight some of the\namazing templates created by the community. More importantly we will\ncreate a Cookiecutter template from scratch using the example of a\nsimple Kivy app and make use of advanced features such as post-gen\nhooks, copy-without-render and templates in context values.\n\nFinally I will recommend resources on how to follow up on this talk\nand how to get in touch in case of any queries.\n\n\nGitHub: [https://github.com/hackebrot][1]\n\nTwitter: [https://twitter.com/hackebrot][2]\n\nBlog: [http://www.hackebrot.de/][3]\n\n[1]: https://github.com/hackebrot\n[2]: https://twitter.com/hackebrot\n[3]: http://www.hackebrot.de/",
  "duration": 1876,
  "language": "eng",
  "recorded": "2015-08-03",
  "related_urls": [
    "https://github.com/hackebrot",
    "https://twitter.com/hackebrot",
    "http://www.hackebrot.de/"
  ],
  "speakers": [
    "Raphael Pierzina"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/yxXio-jzAMQ/maxresdefault.jpg",
  "title": "Come to the Dark Side! We have a whole bunch of Cookiecutters!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yxXio-jzAMQ"
    }
  ]
}
