{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Thomas Ballinger - Terminal Whispering\n[EuroPython 2015]\n[23 July 2015]\n[Bilbao, Euskadi, Spain]\n\nThe terminal emulators we run so many of our programming tools in are\nmore powerful than we remember to give them credit for, and the key to\nthat power is understanding the interface. This talk will cover\nterminal colors and styles, writing to arbitrary portions of the\nscreen, handling signals from the terminal, determining the terminal's\ndimensions and scrollback buffer behavior.\n\nTerminal programming can get hairy; along the way we'll deal with\nencoding issues, consider cross platform concerns, acknowledge 4\ndecades' worth of standards for terminal communication, and consider\nthat humans at interactive terminals may not be the only users of our\ninterfaces. By gaining an understanding of these issues, we'll be able\nchoose from the abstractions over them offered by Python libraries\nUrwid, Blessings, and Python Prompt Toolkit.\n\nThis talk requires minimal Python knowledge, but does assume\nfamiliarity with command line tools in a unix environment.\n\nAn abbreviated version of this talk was presented at PyCon 2015 in\nMontréal: https://www.youtube.com/watch?v=WAitSilLDUA With the\nadditional time I'd hope to present more code examples, a more in-\ndepth tour of existing libraries and more practical advice about\nwriting programs that use the terminal, and an additional example of a\ndifficult terminal details: dealing with reflowing of text in modern\nterminal emulators like GNOME Terminal and iTerm.",
  "duration": 2299,
  "language": "eng",
  "recorded": "2015-08-05",
  "related_urls": [
    "https://www.youtube.com/watch?v=WAitSilLDUA"
  ],
  "slug": "europython-2015-terminal-whispering",
  "speakers": [
    "Thomas Ballinger"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/qOoKR8qEglU/maxresdefault.jpg",
  "title": "Terminal Whispering",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qOoKR8qEglU"
    }
  ]
}