{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Todd Waits - Incorporando administrado repositorios de información para generar documentación on-demand\n[EuroPython 2015]\n[22 July 2015]\n[Bilbao, Euskadi, Spain]\n[En Español]\n\nGenerar  documentación de forma dinámica es relevante para los\ningenieros de software porque ellos interactúan con la data en el\nmismo donde está localizada.  Es también relevante para los clientes\nporque la documentación se puede presentar en un formato organizado y\nclaro.  En esta presentación, hablaremos de cómo usar un proceso\nunificado para generar dinámicamente la documentación de diversas\nfuentes de data incluyendo los wikis y los sistemas de rastreo de\nincidencias.\n\nIdealmente, nosotros como ingenieros deberíamos interactuar  solamente\ncon una Fuente de información que nos dara como resultado una\ndocumentación vigente y correspondiente al estado actual de un\nsistema.  En el Presente, el cliente recibe documentos incompletos y\nsin actualización dando una incorrecta impresión del estado vigente de\nun Sistema.  Usando un proceso unificado para generar documentación de\nsolo una Fuente de data permite presentar al cliente lo que se merece:\nartefactos actualizados y completos dando el real y mas reciente\nestado de un Sistema.  El resto de esta presentación se enfocara en\ncómo lograr este Sistema.\n\nIdealmente, nosotros como ingenieros deberíamos interactuar  solamente\ncon una Fuente de información que nos dara como resultado una\ndocumentación vigente y correspondiente al estado actual de un\nsistema.  En el Presente, el cliente recibe documentos incompletos y\nsin actualización dando una incorrecta impresión del estado vigente de\nun Sistema.  Usando un proceso unificado para generar documentación de\nsolo una Fuente de data permite presentar al cliente lo que se merece:\nartefactos actualizados y completos dando el real y mas reciente\nestado de un Sistema.  El resto de esta presentación se enfocara en\ncómo lograr este Sistema.",
  "duration": 1859,
  "language": "spa",
  "recorded": "2015-08-07",
  "related_urls": [],
  "speakers": [
    "Todd Waits"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Zhd1pRQKoNE/hqdefault.jpg",
  "title": "Incorporando administrado repositorios de información para generar documentación on-demand",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Zhd1pRQKoNE"
    }
  ]
}
