{
  "copyright_text": "Standard YouTube License",
  "description": "PyData DC 2016\n\nChatbots have become wildly popular interfaces for online services we use everyday. While these bots are not going to pass the Turing Test, they provide a platform to use natural language to perform a task. This talk covers the basics of chatbot development using Python NLP and Deep Learning libraries and provides a demonstration of Malbot, a simple bot that can converse about a piece of malware.\n\nChatbots are programs that employ rules or artificial intelligence that users interact with via a dialogue interface. Chatbots are extremely useful tools for accomplishing a range of tasks. From ordering pizza to checking the weather to buying shoes, there's a chatbot for that. This bot revolution has led to the creation of several Make-A-Bot services (all with really cool .ai domains!), but these bots are not extremely powerful examples of artificial intelligence. Most are simple template-based implementations that can be developed independently in Python.\n\nThis talk will provide an overview on the structure of chatbots and how tools such as SpaCy, NLTK, sklearn, and Keras can be used to develop bots ranging from a basic weather bot to a more sophisticated deep learning neural conversation model. The applicability of these tools will be demonstrated through MalBot, a chatbot capable of ingesting a piece of malware and responding to natural language inquiries into the malicious software’s capabilities. (e.g. \"Do you record key strokes?\", \"What malware family are you from?\")",
  "duration": 2394,
  "language": "eng",
  "recorded": "2016-10-09",
  "related_urls": [
    "http://pydata.org/dc2016/schedule/presentation/51/"
  ],
  "speakers": [
    "Bobby Filar"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/NqLmBvFKgbw/maxresdefault.jpg",
  "title": "Bot or Not? The Illusion of Intelligence",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NqLmBvFKgbw"
    }
  ]
}
