{
  "copyright_text": null,
  "description": "Diapositivas:Cuando hay problemas de rendimiento, las extensiones nativas de Python se empoderan para mejorar el rendimiento del \"critical path\", y también seguir usando Python y evitar una reinscripción costosa.\n\nSin embargo, normalmente se escriben las extensiones nativas en C y C++, y es un profundo reto usarlas de manera segura.\n\nRust ofrece una alternativa lista para la producción a las extensiones en C y C++. Con un rendimiento casi igual, Rust ofrece la seguridad de la memoria y de la concurrencia, acompañada con una ergonomía moderna y una comunidad inclusiva para los principiantes (¡como Python!).\n\nIncluso si no se tiene experiencia con las extensiones nativas, C/C++, o Rust, esta charla le dará un resumen accesible sobre cómo las extensiones nativas en Rust han empoderado el proyecto open source de Pants a realizar el rendimiento, mientras que mantiene la expresividad y la flexibilidad de Python para la mayoría de sus desarrolladores. Se adquirirá conocimiento de cuándo vale la pena usar extensiones nativas en Rust—basado en los 5 años de experiencia de la comunidad de Pants—y, además, algunos recursos para aprender cómo usar las extensiones nativas en Rust.\n\nDiapositivas: https://speakerdeck.com/ericarellano/cuando-usar-extensiones-nativas-en-rust-rendimiento-accesible-y-seguro",
  "duration": 1330,
  "language": "eng",
  "recorded": "2021-05-14",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2021/schedule/"
    },
    {
      "label": "https://speakerdeck.com/ericarellano/cuando-usar-extensiones-nativas-en-rust-rendimiento-accesible-y-seguro",
      "url": "https://speakerdeck.com/ericarellano/cuando-usar-extensiones-nativas-en-rust-rendimiento-accesible-y-seguro"
    }
  ],
  "speakers": [
    "Eric Arellano"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/gMFY0uUQexE/maxresdefault.webp",
  "title": "Cuándo usar extensiones nativas en Rust: rendimiento accesible y seguro",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gMFY0uUQexE"
    }
  ]
}
