{
  "copyright_text": null,
  "description": "OpenTelemetry nace de la fusión de OpenTracing y OpenCensus, dos proyectos similares que brindan un conjunto de APIs para tracing distribuido y métricas.\n\nEl tracing distribuido nos permite monitorear sistemas distribuidos recolectando información de monitoreo que es generada por los diferentes componentes. Para generar esta información, los desarrolladores instrumentan las aplicaciones y librerías introduciendo pequeñas porciones de código que envían información a un sistema colector que analiza y ensambla todos los datos para dar una visión general de las interacciones de los diferentes componentes del sistema.\n\nOpenTelemetry también provee un mecanismo de instrumentación automática que permite generar información de tracing en aplicaciones que no incluyen soporte para OpenTelemetry. Este mecanismo se basa en el hecho que la mayoría de aplicaciones usan un conjunto de librerías estándar que está instrumentado con OpenTelemetry.\n\nEsta charla explica el concepto de tracing distribuido, brinda una visión general de OpenTelemetry, presenta una demostración de una aplicación simple y como el sistema de instrumentación automática puede ser usado en aplicaciones que no tienen soporte nativo para OpenTelemetry.\n\nDiapositivas: https://tinyurl.com/pyconus-2021",
  "duration": 1596,
  "language": "eng",
  "recorded": "2021-05-14",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2021/schedule/"
    },
    {
      "label": "https://tinyurl.com/pyconus-2021",
      "url": "https://tinyurl.com/pyconus-2021"
    }
  ],
  "speakers": [
    "Mauricio Vásquez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/QA7fVDpueaY/maxresdefault.jpg",
  "title": "Tracing Distribuido con OpenTelemetry",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QA7fVDpueaY"
    }
  ]
}
