{
  "copyright_text": null,
  "description": "Akshay Sharma is executive vice president of artificial intelligence (AI) at Sharecare, the digital health company that helps people manage all their health in one place. Sharma joined Sharecare in 2021 as part of its acquisition of doc.ai, the Silicon Valley-based company that accelerated digital transformation in healthcare.\n\nSharma is an entrepreneur, founder, and experienced leader in engineering technology with a focus on healthcare. Since he initially joined doc.ai, he has been integral in the creation of core mobile app offerings including Passport, a privacy-based health-at-work solution; Serenity, a mental health digital offering; NetRunner, an edge computing and inference AI app; and Genewall, a genome app that deals with bioinformatics on the edge. He is passionate about developing and applying poly-omics data combinations to healthcare and life sciences as well as developing AI to assist in medical data understanding. He has built products, technology, and teams focused on edge computing (mobile/MCUs/sensors) and privacy (computations/inferences/learning), and holds several patents in this space.\n\nWith doc.ai, Sharma previously held various leadership positions including chief technology officer (CTO), and vice president of engineering, a role in which he developed several key technologies that power mobile-based privacy products in healthcare. Prior to joining the company, he also founded and co-founded several businesses including Swast, a startup focused on doctor-efficiency within the Indian healthcare ecosystem, and PixelSimple, a company engineering nextgen media streaming systems in the U.S. and Bangalore.\n\nIn addition to his role at Sharecare, Sharma serves as CTO of TEDxSanFrancisco and also is involved in initiatives to decentralize clinical trials. Sharma holds bachelor’s degrees in engineering and engineering in information science from Visvesvaraya Technological University.",
  "duration": 1706,
  "language": "eng",
  "recorded": "2021-05-14",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2021/schedule/"
    }
  ],
  "speakers": [
    "Akshay Sharma"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/Jmly1Jfbhak/maxresdefault.webp",
  "title": "Keynote: Akshay Sharma",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Jmly1Jfbhak"
    }
  ]
}
