{
  "copyright_text": null,
  "description": "Dynabench is a research platform for dynamic data collection and benchmarking. In the first part of this workshop, we introduce how we built the dynamic model evaluation pipeline for Dynabench using a collection of open source Python toolkits, e.g. pytorch, torchserve, boto3, etc, and how anyone in the community can easily submit their models into the pipeline using our open source toolkit, Dynalab. We believe that the evaluation cloud of Dynabench will transform how the community thinks of models and benchmarks, and continuously push the community to innovate beyond the current status quo from a completely new angle of thinking.\n\nThe two key components in a multi-task Reinforcement Learning codebase are (i) Multi-task RL algorithms and (ii) Multi-task RL environments. Facebook AI developed open-source libraries for both components. Part 2 of this workshop describes how one can use these two libraries to get started with multi-task reinforcement learning. By the end of the talk, the audience should be able to design their own multi-task RL agent using the components from the MTRL library (https://github.com/facebookresearch/mtrl) and run them on environments provided by the MTEnv library (https://github.com/facebookresearch/mtenv).\n\nSlides: https://drive.google.com/file/d/1FYRiyEojjGyRP8xifFzsuv9zU0nRx5rX/view?usp=sharing",
  "duration": 2303,
  "language": "eng",
  "recorded": "2021-05-14",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2021/schedule/"
    },
    {
      "label": "https://github.com/facebookresearch/mtrl",
      "url": "https://github.com/facebookresearch/mtrl"
    },
    {
      "label": "https://drive.google.com/file/d/1FYRiyEojjGyRP8xifFzsuv9zU0nRx5rX/view?usp=sharing",
      "url": "https://drive.google.com/file/d/1FYRiyEojjGyRP8xifFzsuv9zU0nRx5rX/view?usp=sharing"
    },
    {
      "label": "https://github.com/facebookresearch/mtenv",
      "url": "https://github.com/facebookresearch/mtenv"
    }
  ],
  "speakers": [
    "Zhiyi Ma",
    "Shagun Sodhani"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/54q_pAjeHWw/maxresdefault.webp",
  "title": " Facebook sponsor workshop",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=54q_pAjeHWw"
    }
  ]
}
