{
  "copyright_text": null,
  "description": "Do you remember what it was like when you first started to code? Do you remember feeling frustrated and discouraged or even wanting to give up? What would you say to yourself if you had a chance to go back in time and talk to your beginner self? Unfortunately, traveling back in time is not possible, but we can always share our experiences and advice with those who are just getting started.\n\nThe pandemic lockdown coincided with my teenager taking his first python courses remotely. I had the opportunity to witness the beginning of his path as a python programmer and to serve as an encouraging mentor. I demystified the programming process and created realistic expectations. Meeting four times a week to discuss and practice python for many months proved to be a surprising and amazing bonding experience with my child.\n\nIn this talk I will cover the main topics we discussed during our meetings, which were all the things I wish I had known when I was first starting to code.\n- Programming is not memorization. It is problem solving.\n- Don’t jump straight into coding, use lots of scratch paper and pseudo code to understand your problem and design your solution.\n- Make sure your code does what it’s supposed to do. Test it.\n- Getting stuck and making mistakes is normal. Debugging is not a sign of failure.\n- Don’t learn isolated. Find a mentor and join a community.\n\nI hope that after this talk you will be inspired to become a mentor, support others and share your experience with those that are starting their programming journey in python.",
  "duration": 1523,
  "language": "eng",
  "recorded": "2021-05-14",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2021/schedule/"
    }
  ],
  "speakers": [
    "Shemra Rizzo"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/Q58kwvICDwQ/maxresdefault.webp",
  "title": "Learning python during lockdown: a surprising bonding experience with my child",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Q58kwvICDwQ"
    }
  ]
}
