{
  "copyright_text": null,
  "description": "Code and data go together like tomato and basil; not many applications work without moving data in some way. As our applications modernise and evolve to become more event-driven, the requirements for data are changing. In this session we will explore Apache Kafka, a data streaming platform, to enable reliable real-time data integration for your applications.\nWe will look at the types of problems that Kafka is best at solving, and show how to use it in your own applications. Whether you have a new application or are looking to upgrade an existing one, this session includes advice on adding Kafka using the Python libraries and includes code examples (with bonus discussion of pizza toppings) to use.\nWith Kafka in place, many things are possible so this session also introduces Kafka Connect, a selection of pre-built connectors that you can use to route events between systems and integrate with other tools. This session is recommended for engineers and architects whose applications are ready for next-level data abilities.\n\nNotebook link: https://github.com/aiven/kafka-python-notebooks\nSlides: https://speakerdeck.com/ftisiot/event-driven-applications-apache-kafka-and-python",
  "duration": 1573,
  "language": "eng",
  "recorded": "2021-05-14",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2021/schedule/"
    },
    {
      "label": "https://speakerdeck.com/ftisiot/event-driven-applications-apache-kafka-and-python",
      "url": "https://speakerdeck.com/ftisiot/event-driven-applications-apache-kafka-and-python"
    },
    {
      "label": "https://github.com/aiven/kafka-python-notebooks",
      "url": "https://github.com/aiven/kafka-python-notebooks"
    }
  ],
  "speakers": [
    "Francesco Tisiot"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/Ltgt0ekso4c/maxresdefault.webp",
  "title": "Event-driven applications: Apache Kafka and Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ltgt0ekso4c"
    }
  ]
}
