{
  "copyright_text": null,
  "description": "Learn about programming hardware with Python and advanced uses of CircuitPython by walking through exciting demos of real-world projects in action. Advanced components like buttons, sensors, and screens bump up the fun and the interactivity of your project. Level-up your hardware skills in this fast-paced talk!\n\nCircuitPython is the education-friendly fork of MicroPython that's been steadily rising in popularity as new releases increase stability, reliability, and speed. CircuitPython allows Python enthusiasts to quickly learn about hardware projects without having to learn something completely brand new. Given the rise in popularity, the Python community is quickly becoming familiar with the basics of CircuitPython. In fact, all attendees of PyCon US in 2019 were given a CircuitPython-compatible CircuitPlayground Express device with LEDs, speakers, sensors, and more, all usable without the need of learning to solder.\n\nIf you're interested in doing more with hardware, this talk will point you in the right direction of where to go next. We'll start with choosing the right device for the scope of your project. Next, we'll scratch the surface of working with electronics -- what's a circuit? What are good resources for learning to solder? Lastly, I'll cover topics such as IoT, wearables, and adding interactivity to your projects with sensors, buttons, and switches with live demos of real-world projects I've created, along with sharing the build process and code for each.\n\nViewers will finish the talk feeling confident about continuing their hardware journey across a range of project types.\n\nSlides: https://nina.to/pycon2021",
  "duration": 1615,
  "language": "eng",
  "recorded": "2021-05-14",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2021/schedule/"
    },
    {
      "label": "https://nina.to/pycon2021",
      "url": "https://nina.to/pycon2021"
    }
  ],
  "speakers": [
    "Nina Zakharenko"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/GnteZjiHVdA/maxresdefault.webp",
  "title": "More Fun With Hardware and CircuitPython - IoT, Wearables, and more!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GnteZjiHVdA"
    }
  ]
}
