{
  "copyright_text": null,
  "description": "The success of Python and open source libraries is not separable from the availability of good documentation. Reading documentation is one of the first things a user of the open source library has to do.\n\nIn the Python open source community, documentation is often written using reStructuredText markup language, and built with Sphinx. The official Python documentation and Python Enhancements Proposals (PEPs) are all written using reStructuredText. Being able to write documentation using reStructuredText becomes a necessary skill for any aspiring Python open source contributors and maintainers.\n\nYet, reStructuredText itself can be seen as a barrier into contributing to open source, since it is not as straightforward as Markdown. Compared to Markdown, reStructuredText is not as widely adopted outside of the Python community. Don’t let this discourage you! Let’s break down this barrier! reStructuredText is not as complicated as you might think. You can learn it!\n\nIn this tutorial, we'll go through various useful features of reStructuredText. You will learn how to create and build a documentation project using Sphinx. Not only will you learn a new skill, you can also confidently start contributing to open source projects by helping to improve their documentation.\n\nSlides: https://sphinx-intro-tutorial.readthedocs.io/",
  "duration": 8900,
  "language": "eng",
  "recorded": "2021-05-14",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2021/schedule/"
    },
    {
      "label": "https://sphinx-intro-tutorial.readthedocs.io/",
      "url": "https://sphinx-intro-tutorial.readthedocs.io/"
    }
  ],
  "speakers": [
    "Mariatta"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/gWrc4xzm45Y/maxresdefault.webp",
  "title": "Writing Documentation with Sphinx and reStructuredText",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gWrc4xzm45Y"
    }
  ]
}
