{
  "copyright_text": null,
  "description": "A spreadsheet is a wonderful invention and an excellent tool for certain jobs. All too often, however, spreadsheets are called upon to perform tasks that are beyond their capabilities. It’s like the old saying, 'If the only tool you have is a hammer, every problem looks like a nail.' However, some problems are better addressed with a screwdriver, with glue, or with a Swiss Army Knife.\n\nPython is described by some in the programming world as the Swiss Army Knife of programming languages because of its unrivaled versatility and flexibility in use. This allows its users to solve complex problems relatively easily compared with other programming languages and is one of the reasons why Python has become increasingly popular over time.\n\nIn this tutorial, we’ll briefly discuss spreadsheets, signs that you might be living in “Excel Hell”, and then we’ll spend the rest of the time learning how to escape it using Python.\n\nIn the first section, we’ll extend on what spreadsheet users already know about cells, rows, columns, and formulas, and map them to their Python equivalent, such as variables, lists, dictionaries, and functions. At the end of this section, we’ll do an interactive exercise and learn how we can perform a simple calculation, similar to one you might do in Excel, but instead using Python.\n\nIn the second section, we’ll discuss (and attempt) how we can perform more complex tasks including web scraping, data processing, analysis, and visualization, by utilizing a few popular 3rd party libraries used including Requests, Pandas, Flask, Matplotlib, and others.\n\nIn the last section, we’ll round out our discussion with a few important concepts in data management, including concept of tidy data, building a data pipeline, and a few strategies (and packages) to use when approaching various data problems, including demo using Apache Airflow.\n\nhttps://github.com/ryansmccoy/spreadsheets-to-dataframes",
  "duration": 10336,
  "language": "eng",
  "recorded": "2021-05-14",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2021/schedule/"
    },
    {
      "label": "https://github.com/ryansmccoy/spreadsheets-to-dataframes",
      "url": "https://github.com/ryansmccoy/spreadsheets-to-dataframes"
    }
  ],
  "speakers": [
    "Ryan S McCoy"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/llgTl9BDuKw/maxresdefault.webp",
  "title": "From Spreadsheets to DataFrames",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=llgTl9BDuKw"
    }
  ]
}
