{
  "copyright_text": null,
  "description": "11:10 - Pause video to work through Part 1\n\nOptimising for multiple objectives is a non-trivial task, especially when they are in conflict. For example how can one best overcome the classic trade-off between quality and cost of production, when the monetary value of quality is not defined? In this hands-on Python tutorial you will learn about Pareto Fronts and use them to optimise for multiple objectives simultaneously.\n\nMulti-Objective Optimisation, also known as Pareto Optimisation, is a method to optimise for multiple parameters simultaneously. When applicable, this method provides better results than the common practice of combining multiple parameters into a single parameter heuristic. The reason for this is quite simple. The single heuristic approach is like horse binders limiting the view of the solution space, whereas Pareto Optimisation enables a bird’s eye view.\n\nReal world applications span from supply chain management, manufacturing, aircraft design to land use planning. For example when developing therapeutics, Pareto optimisation may help a biologist maximise protein properties like effectiveness and manufacturability while simultaneously minimising toxicity.\n\nI will provide a git repository with Jupyter notebooks with which you will apply lessons and tools learned to the simple Knapsack problem. Here you will program for filling a bag with packages with the objective of minimising the bag weight while maximising its content value.\n\nMy objective is for you to gain a basic intuition for the technique, understand its advantages and shortcomings to be able to assess applicability for your own projects\n\nSlides: http://bit.ly/pycon21-handson-moo",
  "duration": 1988,
  "language": "eng",
  "recorded": "2021-05-14",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2021/schedule/"
    },
    {
      "label": "http://bit.ly/pycon21-handson-moo",
      "url": "http://bit.ly/pycon21-handson-moo"
    }
  ],
  "speakers": [
    "Eyal Kazin"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/0xDi3HwI2Y8/maxresdefault.jpg",
  "title": "A Hands-On Introduction To Multi-Objective Optimization",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0xDi3HwI2Y8"
    }
  ]
}
