{
  "copyright_text": null,
  "description": "Scheduling machine learning pipelines in a robust fashion is an\nimportant aspect of many data science projects. Apache Airflow is an\nindustry standard tool to author, schedule, and monitor complex data\nprocessing workflows. In this workshop, participants will get hands-on\nexperience with Airflow, and learn how to properly schedule their\nmachine learning pipelines.\n\nOver the past years, the data science teams within organizations matured\nin their experimentation capabilities. Making machine learning pipelines\nproduction-ready has become the new main challenge. Apache Airflow is an\nindustry standard tool for authoring, scheduling, and monitoring\ncomplex, production-grade workflows, with a strong focus on data\nprocessing pipelines. The tool is highly customizable, and integrates\nwell with most modern working environments and data sources. Airflow\nworkflows are written in Python, which intersects with the capabilities\nof typical data science teams. This workshop is useful for both data\nscientists and data engineers who want to schedule machine learning\npipelines in a robust fashion. In the first plenary part, participants\nwill learn what Airflow is and when it is useful. We will cover the\nprinciples and architecture of Airflow, and show some example workflows.\nAfter that, participants will create their own workflow to schedule a\nbasic machine learning pipeline, and deploy it. For the more experienced\nparticipants, we offer a bonus assignment; they will leverage Airflow’s\nplugin system to further customize their pipeline. The necessary tools\nfor this workshop will be provided; all you need is a laptop with an\ninternet browser and basic Python knowledge.\n",
  "duration": 845,
  "language": "eng",
  "recorded": "2019-11-29",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/eindhoven2019/schedule/"
    }
  ],
  "speakers": [
    "Axel Goblet"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/bkZ3HAQYEEg/maxresdefault.jpg",
  "title": "Scheduling machine learning pipelines using Apache Airflow",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bkZ3HAQYEEg"
    }
  ]
}
