{
  "copyright_text": null,
  "description": "Deep generative models for text and image generation\n\nCan we program a computer to be creative? Doesn’t everyone dream of\npainting a portrait or writing poetry? If you are not a good painter nor\na good writer you can now rely on generative modeling, just like us.\nRecently, computers became able to paint, write, produce movies, and\ncompose music thanks to the advance of generative modeling. In this\nworkshop we will demonstrate the principles and the architecture of\nselected generative models for text and image.\n\nIn the first part of the workshop, we will focus on image generation and\nmanipulation using Variational AutoEncoders (VAE). VAE is one the most\nfundamental and well-established deep learning architectures for\ngenerative modeling. We will describe the principles of VAE architecture\nand its advantages over simple Autoencoders. We will guide the audience\nto build VAE from scratch to generate images and to morph between\nimages.\n\nIn the second part of the workshop, we will generate our own stories. We\nwill first cover the principles and architecture of Recurrent Neural\nNetworks (RNNs) and take a look at how these models can be used to\ngenerate text. Then, we describe Long Short Term Memory Networks (LSTM),\nwhich is another type of RNN. We observe its advantages over a basic RNN\nmodel and see how it improves our generated text.\n\nWe will provide notebooks. All you need is a laptop and basic python\nknowledge!\n",
  "duration": 4612,
  "language": "eng",
  "recorded": "2019-11-29",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/eindhoven2019/schedule/"
    }
  ],
  "speakers": [
    "Dimitra Gkorou",
    "Koen Vannisselroij",
    "Shama Khalil",
    "Sonali Fotedar"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/7D1sfQrEBRQ/maxresdefault.jpg",
  "title": "Deep generative models for image and text generation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7D1sfQrEBRQ"
    }
  ]
}
