{
  "abstract": "I love my job. My title is \"Information Architect\", but that’s mostly\nbecause \"She Who Figures Out What We Need To Do About Our Documentation\nAnd Does It\" is too wordy for HR. I work in a product unit of about 350\npeople creating software for developers, very few of them skilled\nwriters or native speakers of English. My role is to figure out how we\ncan produce good documentation.\n\nI have a problem of scale: I can’t do all of the technical writing we\nneed. So instead, I’ve become a contagious documentarian. Over the last\nyear, I’ve [STRIKEOUT:infected] taught technical writing to over 200\npeople around my company. My 3 1/2 hour course, \"Technical Writing for\nTechies\", is popular, and seems to be effective. There’s been a\nnoticeable improvement in the writing we’re producing, and (even better)\nan awareness that good writing is an achievable, even enjoyable, thing.\n\nWhen I describe the course formally, I tend to list attendee objectives\nsuch as:\n\n-  Think about the audience and how to write for them.\n-  Study and practice different writing techniques.\n-  Understand and use a style guide.\n-  Learn ways to improve word choice and sentence structure.\n-  Study the commonest mistakes that non‐native speakers make in English\n   and how to correct them. (etc)\n\nAnd I do cover all of those topics. But just between us, my real\nobjectives for my students are:\n\n-  Stay awake.\n-  Feel welcome and relaxed enough to participate openly.\n-  Finish the course feeling competent and capable about writing.\n-  Trust the Information Architect enough to come to her with future\n   problems.\n-  Want to be part of a community of documentarians.\n\nI’ll talk about the course structure, some of the ways I’ve designed and\ndelivered it to meet both sets of objectives, how it has evolved over\ntime, and what I’ve learned while giving it.\n",
  "copyright_text": null,
  "description": "",
  "duration": 1559,
  "language": "eng",
  "recorded": "2018-09-10",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/prague/2018/schedule/"
    },
    {
      "label": "Conference video documentation",
      "url": "http://www.writethedocs.org/videos/prague/2018/"
    }
  ],
  "speakers": [
    "Abigail Sutherland"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/3IlcJYKdP1g/maxresdefault.jpg",
  "title": "Teaching geeks to fish: tales of a contagious documentarian.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3IlcJYKdP1g"
    }
  ]
}
