{
  "alias": "video/2418/die-dinge-im-internet-der-dinge-mit-python-verbin",
  "category": "PyCon DE 2013",
  "copyright_text": "",
  "description": "",
  "duration": 60,
  "id": 2418,
  "language": "deu",
  "quality_notes": "",
  "recorded": "2013-10-17",
  "related_urls": [
    "http://mosquitto.org/",
    "http://mqtt.org/",
    "https://www.facebook.com/messages/"
  ],
  "slug": "die-dinge-im-internet-der-dinge-mit-python-verbin",
  "speakers": [
    "Andreas Schreiber"
  ],
  "summary": "Das Internet der Dinge besteht aus kleinen, manchmal intelligenten,\nGeräten und Sensoren, die über das Internet verbunden sind. Typische\nSensoren sind Wettermessgeräte oder medizinische Geräte. Das Internet\nder Dinge wird nun bald real da sein, was durch günstige kleine\nEinplatinencomputer wie Raspberry Pi oder Arduino mit beeinflusst wird.\nAllerdings haben diese Geräte nicht viel Rechenleistung. Außerdem sind\nsie in machen Umgebungen auch nur mit eingeschränkter Netzwerkbandbreite\nangebunden. Um nun (viele) solche Geräte zu verbinden und Daten\naustauschen zu lassen sind sehr leichtgewichtige Protokolle und\nImplementierungen notwendig.\n\nDer Vortrag ist über das Protokoll `Message Queuing Telemetry\nTransport <http://mqtt.org/>`__ (MQTT), ein sehr geeignetes Protokoll\nzum Verbinden kleiner Geräte und Sensoren. MQTT basiert auf einer\nPublish/Subscribe-Architektur. Es eignet sich gut zum Schicken von Daten\nvon Sensoren zu anderen Geräten. Zum Beispiel lassen sich\nTemperaturmesswerte von einem Temperaturfühler ohne viel Overhead zu\neinem Server schicken oder zu einem Smartphone als Push-Nachricht\nübermitteln. Ein andere Anwendung von MQTT sind Chat-Systeme, z.B. ist\ndas `Facebook-Messaging <https://www.facebook.com/messages/>`__ auf\nBasis von MQTT implementiert.\n\nIn dem Vortrag geht es vor allem um Open-Source-Implementierungen von\nMQTT. Speziell wird der freie MQTT-Broker\n`Mosquitto <http://mosquitto.org/>`__ und dessen\nPython-Client-Bibliothek vorgestellt. Mosquitto ist eine\nleichtgewichtige Implementierung die effizient auf günstigen\nEinplatinenrechnern oder Smartphones läuft. An ein paar Bespielen in\nPython wird im Vortrag verdeutlicht wie leicht sich Anwendungen auf\nBasis von MQTT realisieren lassen: Die Übertragung von\nTemperaturmesswerten per Raspberry Pi zu einem Server, das Senden von\nPush-Nachrichten zu Android-Smartphones und das Senden von Smartphones\naus einer Kivy-App heraus.\n",
  "tags": [
    "internet of things",
    "mqtt",
    "quantified self",
    "raspberry pi",
    "temperaturmessung"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/TM7lO_B-BPw/hqdefault.jpg",
  "title": "Die Dinge im Internet der Dinge mit Python verbinden...",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TM7lO_B-BPw"
    }
  ]
}
