{
  "alias": "video/2398/entwicklung-wissenschaftlicher-applikationen-mit",
  "category": "PyCon DE 2013",
  "copyright_text": "",
  "description": "",
  "duration": 30,
  "id": 2398,
  "language": "deu",
  "quality_notes": "",
  "recorded": "2013-10-15",
  "slug": "entwicklung-wissenschaftlicher-applikationen-mit",
  "speakers": [
    "Florian Rhiem",
    "Ingo Heimbach"
  ],
  "summary": "Durch Experimente und Simulationen werden im wissenschaftlichen Bereich\ngroße Mengen an Daten erzeugt. Diese müssen geeignet aufbereitet werden,\num sie in eine für die Wissenschaftler verständliche Form zu überführen.\nEin Beispiel dafür ist die Untersuchung von Phasenwechselmaterialien,\nwelche in wiederbeschreibbaren optischen Medien eingesetzt werden. Der\nbeim Löschen und Beschreiben eintretende Wechsel zwischen kristallinem\nund amorphen Zustand wird auf Großrechnern simuliert und die\nresultierende molekulare Struktur auf Hohlstellen hin untersucht, da\ndiese Rückschlüsse auf das Verhalten des Materials zulassen. Den Kern\nder Präsentation nimmt die Entwicklung der Anwendung *pyMolDyn* ein,\nwelche die Analyse und Visualisierung der Moleküle und Hohlstellen\nübernimmt.\n\nDieser Vortrag gibt einen Einblick in die Erfahrungen, die während der\nmehrjährigen Entwicklung dieser Software gesammelt wurden. Zum einen\nwird dabei die rechenintensive Analyse der Daten betrachtet und wie\ndiese durch Verwendung von NumPy und (py)OpenCL vereinfacht und\nbeschleunigt werden kann. Zum anderen werden die grafischen\nAnwendungskomponenten beschrieben, welche mithilfe von wxPython,\n(py)OpenGL und einem gezielten Zusammenspiel dieser beiden Pakete\numgesetzt werden konnten. Neben Performance und Einfachheit der\nProgrammierung werden auch die gewonnenen Eindrücke zu\nPlattformunabhängigkeit und Interversionskompatibilität vorgestellt.\nWeiterhin werden Eigenheiten der Anwendungsentwicklung im Bereich der\nForschung erläutert und es wird darauf eingegangen, welche Stärken und\nSchwächen Python in diesem Zusammenhang bietet. Abschließend folgt ein\nÜberblick darüber, wie sich die weitere Entwicklung von *pyMolDyn*\ngestalten wird und welche Konsequenzen die gesammelten Erfahrungen in\nZukunft für das Projekt haben werden.\n",
  "tags": [
    "anwendungsentwicklung",
    "numpy",
    "opencl",
    "opengl",
    "python",
    "visualisierung",
    "wxpython"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/PAE0CLzGxEE/hqdefault.jpg",
  "title": "Entwicklung wissenschaftlicher Applikationen mit Python",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PAE0CLzGxEE"
    }
  ]
}
