{
  "alias": "video/2383/python-verbindet-der-python-software-verband-e",
  "category": "PyCon DE 2013",
  "copyright_text": "",
  "description": "",
  "duration": 30,
  "id": 2383,
  "language": "deu",
  "quality_notes": "",
  "recorded": "2013-10-15",
  "slug": "python-verbindet-der-python-software-verband-e",
  "speakers": [
    "Mike Müller"
  ],
  "summary": "Der Python Software Verband (PySV) ist als eingetragener Verein in\nDeutschland organisiert, und versteht sich als Support-Organ der\ngesamten deutschsprachigen Python-Community. 2011 hat sich der PySV\nlangsam aber sicher organisatorisch aus dem früheren DZUG e.V., der\nbereits vollständig aus Python Enthusiasten bestand, emanzipiert und\nseine Neustrukturierung im letzten Jahr weitgehend abgeschlossen.\n\nDie wichtigsten Mittel zur Unterstützung der Community sind u. a. unsere\naktiven Mitglieder und die PySV-Website als zentraler Anlaufpunkt und\nder neue Usergruppen-Hub. Der PySV unterstützte und organisierte bereits\ndie Python-Konferenzen PyCon.DE 2011 und 2012 als verantwortlicher\nPartner mit. Auch die PyCon.DE 2013 wird er in enger Zusammenarbeit mit\nder Kölner PyCologne Usergroup und dem DLR ermöglichen. In den Jahren\n2014 und 2015 wird der PySV sogar Mitausrichter der EuroPython – der\ngrößten europäsichen Python-Konferenz – sein. Die Berliner Usergroup mit\ndem PySV im Rücken konnte sich in der Bewerbung durchsetzen.\n\nAuch kleinere, aber deswegen nicht unwichtigere Events unterstützt der\nPySV. Neben dem mittlerweile schon traditionellen PythonCamp in Köln\nsind das verschiedene Python-Sprints und u.A. der World Plone Day an\nmehreren Orten. Auf Messen wie der CeBIT, der überregionalen FrOSCon\nKonferenz und den Berliner und Chemnitzer Linuxtagen und dem Linuxtag in\nBerlin sorgt der Verband dafür, dass Python regelmäßig präsent ist.\n\nDer gemeinsam neu entwickelte Programmierwettbewerb nimmt Formen an.\nStudenten erhalten vom PySV Unterstützung für die Teilnahme an der\nEuroSciPy.\n\nWie der Verband der Community helfen kann, wird mit allen, die mithelfen\nwollen, gemeinsam erarbeitet. Er bietet organisatorische, finanzielle\nund technische Hilfe für Usergruppen, Sprints und Workshops mit\nPython-Bezug. Alle Python-Enthusiasten sind eingeladen im Verein aktiv\nmitzuarbeiten. Neue Ideen und Verbesserungsvorschläge sind immer gern\ngesehen. Unsere Grundregel lautet: “Soviel Unterstüzung wie möglich, so\nwenig Reglementierung wie möglich.”\n",
  "tags": [
    "community",
    "pysv",
    "verband"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/dr8y6ECP8sM/hqdefault.jpg",
  "title": "Python verbindet - Der Python Software Verband e.V. in 20 Minuten",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dr8y6ECP8sM"
    }
  ]
}
