{
  "alias": "video/2402/sponsoring-von-open-source-und-damit-den-chef-u",
  "category": "PyCon DE 2013",
  "copyright_text": "",
  "description": "",
  "duration": 60,
  "id": 2402,
  "language": "deu",
  "quality_notes": "",
  "recorded": "2013-10-15",
  "slug": "sponsoring-von-open-source-und-damit-den-chef-u",
  "speakers": [
    "Schlomo Schapiro"
  ],
  "summary": "Nutzen Sie Open-Source-Software?\n\nHaben Sie schon einmal eine Kleinigkeit ändern wollen?\n\nKonnten Sie für “Einwurf kleiner Münzen” diese Änderung machen lassen?\n\nOpen-Source-Software zeichnet sich unter anderem durch die leichte\nAnpassbarkeit an die eigenen Bedürfnisse aus. Doch nicht jeder kann oder\nmöchte die Software selbst ändern. Lieber würde man die Autoren oder\nandere Spezialisten damit beauftragen.\n\nDer Vortrag gibt Einblick in die praktische Arbeit mit dem Sponsoring\nvon Open-Source-Projekten und beantwortet die Frage, wie man mit Hilfe\nvon Sponsoring seine eigenen Probleme schneller und günstiger lösen\nkann: Nach der Vorstellung typischer Entwicklungsmodelle von\nOpen-Source-Projekten erfahren Besucher, wie sie Kontakte zu Open-Source\nProjekten knüpfen können und damit jemanden finden, der ihnen weiter\nhilft.\n\nWeitere Themen sind\n\n-  rechtliche Aspekte wie ein Werksvertrag, Gewährleistung und einfache\n   Abwicklung\n-  Anforderungen so formulieren, dass der Kundennutzen und die\n   Nachhaltigkeit im Vordergrund steht\n-  Abnahmekriterien für den Auftrag\n-  Wirtschaftlichkeitsberechnung und Kosten-Nutzen-Abwägung\n-  Nachhaltige Lösungen statt ewigen Workarounds\n-  Mehrwert für sich und die Open-Source-Gemeinschaft schaffen\n-  Imagepflege über Open-Source-Sponsoring\n-  Eigene Open-Source Projekte durch Externe weiterentwickeln lassen\n\nAls konkrete Beispiele dienen diverse in Python entwickelte Open-Source\nProjekte der ImmobilienScout24.\n",
  "tags": [
    "geld",
    "kultur",
    "open-source",
    "politik",
    "wirtschaft"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/yiBCb6Z2jKo/hqdefault.jpg",
  "title": "Sponsoring von Open-Source - und damit den Chef überzeugen",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yiBCb6Z2jKo"
    }
  ]
}
