{
  "alias": "video/2388/who-let-the-robot-out-qualitativ-hochwerte-softw",
  "category": "PyCon DE 2013",
  "copyright_text": "",
  "description": "",
  "duration": 30,
  "id": 2388,
  "language": "deu",
  "quality_notes": "",
  "recorded": "2013-10-15",
  "slug": "who-let-the-robot-out-qualitativ-hochwerte-softw",
  "speakers": [
    "Timo Stollenwerk"
  ],
  "summary": "Continuous Integration ist Begriff aus der Softwareentwicklung, der den\nProzess des fortlaufenden Zusammenfügens von Komponenten zu einer\nAnwendung beschreibt. Das Ziel der kontinuierlichen Integration ist die\nSteigerung der Softwarequalität. Jede \"Integration\" führt zu einem\nautomatisierten Build-Prozess der verschiedene Software-Tests und\nCode-Analyseschritte ausführt um Fehler so früh wie möglich erkennen und\nbeheben zu können.\n\nDieser Vortrag wird die Prinzipien der Kontinuierlichen Integration\nvorstellen und aufzeigen wie diese für ein Python-Projekt umgesetzt\nwerden können. Dabei werden die Erfahrungen aus dem Betrieb des\nCI-Servers für das Plone Projekt, eines der größten Python-basierten\nOpen Source Projekte, vorgestellt. Unter anderem werden die folgenden\nThemen behandelt:\n\n-  Aufsetzen eines Continous Integration Servers mit Travis-CI oder\n   Jenkins\n-  Einbindung verschiedener Versionskontrollsysteme\n-  Das Ausführen verschiedener Tests und die Analyse der Code-Qualität\n   für jede Integration\n-  Wie Jenkins verwendet werden kann um automatisch eine Software\n   Dokumentation zu erstellen, die Entwickler zu benachrichtigen,\n   Software Releases zu erstellen und Software zu deployen\n-  Das Schreiben und kontinuierliche Ausführen von funktionalen\n   Akzeptanztests, basierend auf Robot Framework\n\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/hf_Su92HdR8/hqdefault.jpg",
  "title": "Who let the robot out? Qualitativ hochwerte Software mit Hilfe von Continuous Integration erstellen",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hf_Su92HdR8"
    }
  ]
}
