{
  "alias": "video/3968/applied-data-science",
  "category": "PyCon AU 2015",
  "copyright_text": "creativeCommon",
  "description": "Ever tried to get into data science or machine learning, but struggled\nwith getting your tech stack working, or found the maths off-putting?\nCurious about the limits of what your laptop or desktop really are when\nit comes to Big Data and predictive analytics? Ever wondered if these\ntools were really accessible to a general developer?\n\nNote: Attendees should consider visiting the project URL for instruction\nto get set up ahead of time. The will allow more time for coding,\nalthough setup assistance will also be available on the day.\n\nThis tutorial will provide attendees with a walkthrough on getting set\nup for this work, and an overview of a good tech stack / software\necosystem for beginning work. We'll cover some of the standard data sets\nin machine learning, and how to apply interesting algorithms. Random\nForests and neural networks will be included, but with a minimum of fuss\nand jargon. There will be a focus on the application of technology, with\nonly the most relevant theoretical aspects included. This is about\nactually getting things done.\n\nThis tutorial would be suitable for intermediate developers of any\nbackground, or experienced developers who would like an introduction to\ndata science that gets to the point fast. Prerequisites: the ability to\ninstall Python modules on your laptop, the ability to set up a new\nvirtual environment, and an interest in applying new techniques.\n\nThe tutorial will include clear walkthroughs, as well as allowing\nadequate time for discussion and individual learning. Please contact\nTennessee via email ahead of time if you would like to get a head start\non setting up your environment -- this may help you get more out of the\ntutorial.\n",
  "duration": null,
  "id": 3968,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-08-04",
  "slug": "applied-data-science",
  "speakers": [
    "Tennessee J Leeuwenburg"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/LFy01OYCoEY/hqdefault.jpg",
  "title": "Applied Data Science",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LFy01OYCoEY"
    }
  ]
}
