{
  "alias": "video/3995/interactive-visualization-for-the-curious",
  "category": "PyCon AU 2015",
  "copyright_text": "creativeCommon",
  "description": "The workhorse plotting tool in Python for most of this century has been\nMatplotlib. It is stable, powerful, and comprehensive. But the plots it\nproduces are (mostly) lifeless.\n\nThe web is now emerging as a superior visualization platform to\ntraditional GUI backends, thanks to SVG, HTML5 Canvas, and WebGL, the\nspeed and quality of modern browsers, and an explosion of high-quality\nvisualization libraries in JavaScript. But what is the Python developer\nto do? Can we drive these browser-based capabilities from Python?\n\nThankfully, several recent Python projects are making progress toward\nthis goal -- including MPLd3, Bokeh, and VisPy. These each have\ndifferent goals and make different design decisions, but all three offer\nobvious advantages: being able to publish visualizations that users can\ninteract with to extract more meaning from data.\n\nThis talk will give shiny demos and review these newer projects\nthoroughly vis-a-vis other libraries to help you decide whether, or\nwhen, to adopt one of them as your go-to visualization library. We will\nanswer these questions: How does the performance compare? Would you need\nto rewrite all your plotting code? What would it take to integrate Bokeh\nor VisPy well with the current ecosystem of Python plotting libraries\nand data analysis tools? What is on the horizon for the different\nprojects? Where do the Jupyter project's interactive widgets fit into\nthis picture?\n\nCome to hear a critical review about the past, present, and future of\ninteractive visualization in Python.\n",
  "duration": null,
  "id": 3995,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-08-04",
  "slug": "interactive-visualization-for-the-curious",
  "source_url": "https://www.youtube.com/watch?v=kr85Jytwy0s",
  "speakers": [
    "Edward Schofield"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/kr85Jytwy0s/hqdefault.jpg",
  "title": "Interactive visualization for the curious",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kr85Jytwy0s"
    }
  ]
}