{
  "alias": "video/3998/inviting-code",
  "category": "PyCon AU 2015",
  "copyright_text": "creativeCommon",
  "description": "Projects tend to grow, expand and reshape as they progress, this can\nlead to; high code maintenance, legacy code and feature addition\nfatigue. Implementing a well-documented and malleable software\narchitecture is a major step in addressing these associated time sinks.\nThis talk will discuss viable software architecture approaches – while\ndemonstrating core python modules, concepts and design patterns from a\nbig data perspective.\n\nMany projects welcome code addition from third party developers, however\na well thought out software architecture should not be modified without;\nreview, testing, possible cascading code and documentation changes. To\nremove the additional complexity of reviewing and handling third party\ncode, designing and offering secure plugin infrastructure can allow for\noutside additions without the overhead.\n\nA big data visualisation python project utilised by Oxford and Cambridge\nuniversities will be used in code demonstrations to show the direct use\nof a project built with architecture design in mind, and a multi-level\ndynamic plugin infrastructure. Attendees will be provided with a clear\nunderstanding of how function documentation techniques (PEP-3107 &\nPEP-0484) can be utilised for class clarity and how to (re)design a code\nbase to allow for integration of third party code, while providing a\nconcise framework for code inclusion.\n\nAreas covered in this talk include\n\n| • Python 3.4 focused • Project architecture design • Abstract classes • Plugin frameworks • Documentation frameworks • Type hinting & Function annotations • Class method decorators • Code validation • Image manipulation\n\n",
  "duration": null,
  "id": 3998,
  "language": "English",
  "quality_notes": "",
  "recorded": "2015-08-04",
  "slug": "inviting-code",
  "source_url": "https://www.youtube.com/watch?v=mByG_51ZWiQ",
  "speakers": [
    "Capel Brunker"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/mByG_51ZWiQ/hqdefault.jpg",
  "title": "Inviting Code",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mByG_51ZWiQ"
    }
  ]
}