{
  "alias": "video/3990/software-carpentry-expansion-and-partnerships-i",
  "category": "PyCon AU 2015",
  "copyright_text": "creativeCommon",
  "description": "The Software Carpentry Foundation is an international volunteer\norganisation that teaches basic programming skills to researchers in\nscience, engineering, medicine and other disciplines. Further, the\nfoundation maintains a wealth of open-source, open-access teaching\nmaterials for a several programming related topics, including Python,\nthe Unix shell, Git, SQL, R and Matlab.\n\nLessons from Software Carpentry are usually delivered in the form of two\nday workshops. Taught by trained instructors, these workshops cover\nautomation of repetitive tasks using the shell, building modular and\ntestable programs using Python or R and using version control to build\nsoftware in a collaborative and efficient manner. Furthermore, workshops\nmay be expanded, covering topics such as SQL and the use of databases to\nreliably store and maintain data. Though of course it is impossible to\ntrain expert programmers in two days, Software Carpentry has had great\nsuccess in teaching ‘just enough’ to researchers that they can then\nreturn to the lab with a strong foundation of skills to build from.\n\nThis presentation will focus on the major progress that has been made by\nSoftware Carpentry in Australia and worldwide since PyCon-Au 2014. In\nparticular, the pool of Australian instructors has dramatically\nincreased through the live training session held as part of the Research\nBazaar conference held at Melbourne University in February. As such, the\npresentation will be somewhat meta – answering the question ‘What are\nthe educational principles and techniques you should know before\nattempting to teach novice programmers?’ The Software Carpentry lesson\ncontent has also evolved in the last 12 months, with the lesson content\nexpanding to such topics as the use of Pandas and the more effective use\nof the iPython Notebook to work with data and visualisation. These\nchanges allow Software Carpentry to cater to a broader audience of\nresearchers. There will also be some discussion of the Research Bazaar\nconference, which partnered with Software Carpentry this year to not\nonly train instructors, but also run a series of other ‘basic skills’\nworkshops for researchers. Finally, there is an interesting sister\norganisation of Software Carpentry, known as Data Carpentry, which\nfocuses on improving the way researchers work with and store their data.\n",
  "duration": null,
  "id": 3990,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-08-04",
  "slug": "software-carpentry-expansion-and-partnerships-i",
  "speakers": [
    "Nic Crouch"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/dGJzl286D5I/hqdefault.jpg",
  "title": "Software Carpentry - Expansion and Partnerships in 2015",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dGJzl286D5I"
    }
  ]
}
