{
  "alias": "video/3952/sprinting-for-beginners",
  "category": "PyCon AU 2015",
  "copyright_text": "creativeCommon",
  "description": "What do sprinters eat before a race? Nothing, they fast.\n\nSprinting at PyCon AU is not like that at all. Instead, it's a great\nchance to do something good for the community and get to know some\nfellow devs along the way. The sprints are an semi-formal two-day event\nfollowing the close of the main track of the conference where people get\ntogether and code on whatever takes their fancy. Most of the time, it's\na a chance to work on an open source package you're already involved\nwith in some way, or to meet face-to-face with people you otherwise know\nonly by email.\n\nHowever, there are also those brave souls who are joining in for the\nfirst time. It can be particularly intimidating if you don't know the\nothers there or how to really get started. This presentation will talk\nabout the sprint format, how to get in with a sprint group, and how to\nbe productive in such a short time (especially if you're new to the\nconcept).\n\nWe'll cover off basics like getting your environment set up, checking\nout the code, and identifying appropriate projects and tasks to work on.\nStandard workflows and tips on how and when to approach people for\nassistance can also help to make things flow more smoothly.\n\nIt will also include some tips for sprint leaders about how to make your\nproject easy and enjoyable for others to hack on. There is a lot than\ncan be done without a lot of effort, such as pre-classifying bugs or\nidentifying appropriate tasks for newcomers, identifying \"go-to\" people\nin your project, and spending time on the day talking to people and\ngetting them comfortable working on your code. Clearly documenting\nsimple workflows (like how to submit a patch, what code standards are\nused, and how to validate results) can help tremendously.\n\nWith any luck, this presentation can help both sprint leaders and\nattendees with a smoother experience which gets the difficulties out the\nway and leaves maximum opportunity for coding and enjoyment.\n\nTennessee has gone through the meatgrinder of sprinting, from sitting\ndown with a group of strangers trying to help them fix trivial bugs, to\ndeveloping significant extensions, to leading sprints. With the scars to\nshow and lessons learned, he is in a reasonable position to help suggest\nsome simple things that can make sprinting easier and more enjoyable for\nthe newcomer.\n",
  "duration": null,
  "id": 3952,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-08-04",
  "slug": "sprinting-for-beginners",
  "speakers": [
    "Tennessee J Leeuwenburg"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/6NUBO1DDQAY/hqdefault.jpg",
  "title": "Sprinting For Beginners",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6NUBO1DDQAY"
    }
  ]
}
