{
  "alias": "video/4002/wax-on-wax-off-the-tough-love-guide-to-mentorin",
  "category": "PyCon AU 2015",
  "copyright_text": "creativeCommon",
  "description": "Everyone has more bugs than they can fix, more features they would like\nthan time to write them. Wouldn't it be great to have some help? The\nproblem is who knows enough about what you know to actually provide help\nthe way you need?\n\nOpen Source has lots of fans and supporters, but many newcomers need the\nwarmth of a person caring about their existence to actually turn them\ninto a contributor.\n\nSomeone sees you working, is enamoured of what you do and wants to\nlearn. You could break down the steps of what you are doing and get them\nto follow those steps, that is teaching.\n\nYou could recognize the deep inner understanding the is the foundation\nof your behaviour. You could decide to help someone build such a\nfoundation for themselves. That is mentoring.\n\nMentoring is helping someone to fail and learn from it. Mentoring is\nabout witnessing someone else's journey, whereever they go, whereever it\ntakes them and saying I'm here, I'm with you, I'm watching. Mentoring is\n99% listening.\n\nMentoring is much more time consuming than teaching. Teaching helps\nsomeone learn a skill, mentoring helps someone learn themselves.\n\nNow don't get me wrong, teaching is great and we need teachers and to be\ntaught plus many great teachers can also be mentors. Teaching and\nmentoring are different.\n\nThis talk will discuss mentoring.\n\nWith examples drawn from learning acupuncture, yoga, astrology, pottery,\nworking on film sets, heavy equipment operating as well as code, Anita\nwill endeavour to share what she has learned about mentoring. She hopes\nyou will take away the ability to recognize the difference between\nteaching and mentoring. She also hopes that should you decide to mentor\nyou have some resources to help you strengthen your mentoring skills.\n",
  "duration": null,
  "id": 4002,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-08-16",
  "slug": "wax-on-wax-off-the-tough-love-guide-to-mentorin",
  "speakers": [
    "Anita Kuno"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/x1rIPW6IYVI/hqdefault.jpg",
  "title": "Wax On, Wax Off: The Tough Love Guide to Mentoring",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=x1rIPW6IYVI"
    }
  ]
}