{
  "alias": "video/3997/writing-python-for-kids",
  "category": "PyCon AU 2015",
  "copyright_text": "creativeCommon",
  "description": "Thinking of writing a book? We are in the midst of a boom in interest in\namateur programming, particularly among children. Brendan spent the most\nrecent summer past using his blog python4kids.brendanscott.com as\ninspiration for a new project based instructional book, Python for Kids\nfor Dummies (US release by Wiley this northern summer). This talk will\nprovide an overview of the development cycle for the book both in\nrespect of the book's content and the process involved in creating that\ncontent and shepherding it through the publisher's internal processes.\nTopics to be covered include engaging and negotiating with the\npublisher, the different functions provided by a publisher, project\nmanagement of the writing, interacting with editorial and technical\nreviewers, integrating with an existing \"house style\", art requirements\nand cross platform issues. In relation to content, Brendan will discuss\nthe thought that went into targeting the material to a kids audience and\nthe challenges involved in structuring a narrative which wends its way\nthrough each of the concepts that need to be introduced and providing a\nmotivation for each of them. This includes how the content was\nstructured, what concepts were included and what were passed over,\ntrying to balance material to maintain interest without overwhelming the\nreaders, the tension between explanation and demonstration and how to\nremain mindful of the audience's limitations. The highs, the lows, the\ntriumphs (getting it done!) and tragedies (whole chapters consigned to\nthe pyre), it's all here.\n\nThe book on Amazon:\nhttp://www.amazon.com/Python-For-Kids-Dummies/dp/1119093104\n",
  "duration": null,
  "id": 3997,
  "language": "English",
  "quality_notes": "",
  "recorded": "2015-08-04",
  "slug": "writing-python-for-kids",
  "source_url": "https://www.youtube.com/watch?v=lWyJ_HXGsm0",
  "speakers": [
    "Brendan Scott"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/lWyJ_HXGsm0/hqdefault.jpg",
  "title": "Writing Python For Kids",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lWyJ_HXGsm0"
    }
  ]
}