{
  "description": "Aghasi Tavadyan Presents:\n\nThe Dangers of Mindless Forecasting\n\n\"Prediction is very difficult, especially if it’s about the future!\" This phrase is attributed to Niels Bohr, the Nobel laureate in Physics and father of the atomic model. This quote warns about the unreliability of forecasts without proper testing and about constant changes in the initial assumed conditions.\n\nWith modern programming languages and convenient packages that provide ready-made modeling solutions, it is often easy to find a model that fits the past data well; perhaps too well! But does the maximization of metrics justify the means? Should the complex structures of predictions be built on the quicksand of noisy data?\n\nThis talk is a laid-back discussion that will be useful for the audience from any background, from beginner to advanced. Aghasi Tavadyan is the founder of Tvyal.com, which translates to \"data\" from Armenian. You can find more info about him following these websites: tavadyan.com, tvyal.com.\n\nPresentation Slides: https://pydatayerevan.aua.am/files/2022/09/Aghasi-Tavadyan.pptx\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1930,
  "language": "eng",
  "recorded": "2022-08-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/yerevan2022/"
    },
    {
      "label": "https://pydatayerevan.aua.am/files/2022/09/Aghasi-Tavadyan.pptx",
      "url": "https://pydatayerevan.aua.am/files/2022/09/Aghasi-Tavadyan.pptx"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/NGYR_f8HlQg/maxresdefault.jpg",
  "title": "Aghasi Tavadyan - The Dangers of Mindless Forecasting | PyData Yerevan 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NGYR_f8HlQg"
    }
  ]
}
