{
  "description": "Andrey Manoshin Presents:\n\nEENLP: Cross-lingual Eastern European NLP Index\n\nIn our project we present a wide index of existing Eastern European language datasets (90+) and models (60+). Furthermore, to support the evaluation of commonsense reasoning tasks, we compile and publish cross-lingual datasets for five such tasks and provide evaluation results for several existing multilingual models.\n\nPresentation Slides: https://pydatayerevan.aua.am/files/2022/09/Andrey-Manoshin.pdf\n--\nHayk Aprikyan Presents:\n\nWhat can your Telegram tell about you? (Answer: Everything)\n\nHow much has your vocabulary changed over the last year? Who shares the funniest memes with you? And does she find you interesting to chat with? ̶N̶o̶p̶e̶.̶\n\nIf you're a Telegram guy, Neplo is that painstakingly data-driven guy who's got answers to these (and hundreds of other) questions based on your Telegram chat histories.\n\nStill skeptical? Come and see. (John 1:39)\n\nPresentation Slides: https://pydatayerevan.aua.am/files/2022/09/Hayk-Aprikyan.pdf\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2095,
  "language": "eng",
  "recorded": "2022-08-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/yerevan2022/"
    },
    {
      "label": "https://pydatayerevan.aua.am/files/2022/09/Hayk-Aprikyan.pdf",
      "url": "https://pydatayerevan.aua.am/files/2022/09/Hayk-Aprikyan.pdf"
    },
    {
      "label": "https://pydatayerevan.aua.am/files/2022/09/Andrey-Manoshin.pdf",
      "url": "https://pydatayerevan.aua.am/files/2022/09/Andrey-Manoshin.pdf"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/y7_MlSSh7Co/maxresdefault.webp",
  "title": "Andrey Manoshin, Hayk Aprikyan | Lightning Talks | PyData Yerevan 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=y7_MlSSh7Co"
    }
  ]
}
