{
  "description": "Anna Shahinyan Presents:\n\nCifar-10 Exploratory Data Analysis\n\nImage classification datasets are completed from the analysis point of view, taking into account the complicated structure of images. However, the understanding of the dataset descriptors at the high level can add debugging facilities and, in early stage, predict the quality of the classification model. During this session, we will visually analyze one of the challenging SOTA datasets like Cifar-10.\nThe datasets in AI used to contain 1000+ images. Images are matrices, and the handling of available features, missing features that can lead to AI model overfitting or underfitting. Based on visualization will predict whether we can reduce the dataset and come up with a smaller set and predict its impact on the final AI model.\n\nPresentation Slides: https://pydatayerevan.aua.am/files/2022/09/Anna_Shahinyan_16_9_pydata_2022.pdf\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1656,
  "language": "eng",
  "recorded": "2022-08-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/yerevan2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://pydatayerevan.aua.am/files/2022/09/Anna_Shahinyan_16_9_pydata_2022.pdf",
      "url": "https://pydatayerevan.aua.am/files/2022/09/Anna_Shahinyan_16_9_pydata_2022.pdf"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/UfJh_5ea0EQ/maxresdefault.jpg",
  "title": "Anna Shahinyan - Cifar-10 Exploratory Data Analysis | PyData Yerevan 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UfJh_5ea0EQ"
    }
  ]
}
