{
  "description": "Ashot Vardanian Presents:\n\nAccelerated Data Science Libraries\n\nEveryone knows and uses Pandas, NumPy, and NetworkX, but is there something better? Something equally easy to use, but hopefully with more features or, more importantly, higher performance!\nIt is 2022, and we need to process a lot of data fast, but how? You can switch the BLAS version in NumPy. You can take CuPy instead to get GPU acceleration for Linear Algebra. You can replace NetworkX with RetworkX and cuGraph. You can replace Pandas with Modin, cuDF, or Dask. All of that is easy but comes with different pitfalls and hidden inefficiencies. \n\nPresentation Slides: https://pydatayerevan.aua.am/files/2022/09/Ashot-Vardanian.pdf\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2329,
  "language": "eng",
  "recorded": "2022-08-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/yerevan2022/"
    },
    {
      "label": "https://pydatayerevan.aua.am/files/2022/09/Ashot-Vardanian.pdf",
      "url": "https://pydatayerevan.aua.am/files/2022/09/Ashot-Vardanian.pdf"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/OxAKSVuW2Yk/maxresdefault.jpg",
  "title": "Ashot Vardanian - Accelerated Data Science Libraries | PyData Yerevan 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OxAKSVuW2Yk"
    }
  ]
}
