{
  "description": "Diyar Mohammadi Presents:\n\nNear-Duplicate Ad Detection in Online Classified Ad Services\n\nNear-Duplicate Ads are harmful to online classified ad services in many ways.\nDemand-side users face low-quality listings, which increases the time and effort required to find desired ads. Also, normal supply-side users get fewer views and make less profit out of their ads. Finally, Duplicate ads may cause a direct decrease in the business’s revenue (By skipping payments such as ad boosting)\n\nIn this talk, first, we will discuss the problem, definition, metrics, and training data generation. Then, we will talk about modeling, feature engineering, and how step-by-step metrics were improved.\n\nFor texts, we have tried different approaches such as MinHash, CountVectorizer, Bi-LSTM, and transformers. For images, we have tried different approaches, such as Perception-Hash and CNNs.\n\nAlso, we will discuss how to apply these approaches to find global duplicate ads and confront spammers.\n\nPresentation Slides: http://pydatayerevan.aua.am/files/2022/09/Diyar-Mohammadi.pdf\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2154,
  "language": "eng",
  "recorded": "2022-08-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/yerevan2022/"
    },
    {
      "label": "http://pydatayerevan.aua.am/files/2022/09/Diyar-Mohammadi.pdf",
      "url": "http://pydatayerevan.aua.am/files/2022/09/Diyar-Mohammadi.pdf"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/CcsqasfszjE/hqdefault.jpg?sqp=-oaymwEmCOADEOgC8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGEEgXyhlMA8=&rs=AOn4CLDH6JV4EXNd3K7mphqkfbcD-H5l1A",
  "title": "Diyar Mohammadi - Near-Duplicate Ad Detection in Online Classified Ad Services | PyData Yerevan 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CcsqasfszjE"
    }
  ]
}
