{
  "description": "Dmitry Korobchenko Presents:\n\nPyTorch Geometric for Graph Neural Nets\n\nIn contrast to classical Deep Learning models (such as MLP, CNN, RNN, Transformers), which are usually applied to tensors and sequences, Graph Neural Net (GNN) is a special type of Deep Learning model which works with non-euclidian data structures, such as graphs. Examples of graph analysis tasks where a data-driven approach can help may include 3D mesh processing, molecular analysis, social graphs data mining, and potentially any other task where traditional DL methods are inapplicable.\n\nPyTorch is an industry-standard Deep Learning framework which provides a lot of useful DL operations and utilities. PyTorch Geometric is a library built on top of PyTorch, implementing a set of tools to create and train Graph Neural Networks.\n\nIn this talk, I will give a very quick and high-level introduction to GNNs and PyTorch Geometrics.\n\nPresentation Slides: https://pydatayerevan.aua.am/files/2022/09/Dmitry-Korobchenko.pptx\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2816,
  "language": "eng",
  "recorded": "2022-08-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/yerevan2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://pydatayerevan.aua.am/files/2022/09/Dmitry-Korobchenko.pptx",
      "url": "https://pydatayerevan.aua.am/files/2022/09/Dmitry-Korobchenko.pptx"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/knmPoaqCoyw/maxresdefault.jpg",
  "title": "Dmitry Korobchenko - PyTorch Geometric for Graph Neural Nets | PyData Yerevan 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=knmPoaqCoyw"
    }
  ]
}
