{
  "description": "Fritz Obermeyer Presents:\n\nProbabilistic Programming and Readable Models\n\nCode can do many things, and one of those things is to communicate an idea from a writer to a human reader.  Probabilistic programming is a relatively recent style of writing code that leads to exceptionally readable and interpretable pieces of code that we call models.  The magic of probabilistic programming is that your model code doesn't express how you'll process your data, rather it expresses how the world might have created that data, and relies on semiautomated inference algorithms to convert the model description to data processing logic.\n\nPresentation Slides: https://pydatayerevan.aua.am/files/2022/09/Fritz-Obermeyer.pptx\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 4008,
  "language": "eng",
  "recorded": "2022-08-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/yerevan2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://pydatayerevan.aua.am/files/2022/09/Fritz-Obermeyer.pptx",
      "url": "https://pydatayerevan.aua.am/files/2022/09/Fritz-Obermeyer.pptx"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/GBLquwA9hYc/hqdefault.jpg?sqp=-oaymwEmCOADEOgC8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGH8gSigoMA8=&rs=AOn4CLDDs3XVQmQLi1nnHQ0UwVDSi2shrw",
  "title": "Fritz Obermeyer - Probabilistic Programming and Readable Models | PyData Yerevan 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GBLquwA9hYc"
    }
  ]
}
