{
  "description": "Karen Javadyan Presents:\n\nStreamlit: A Faster Way to Build and Share Data Apps\n\nPoor tooling slows down data science and machine learning projects.\nStreamlit is a fast way to build and share data apps. It is able to turn data scripts into shareable web apps with minimal effort. Let's hear Karen Javadyanl introduce Streamlit: the fastest way to build and share data apps as Python scripts.\n\nPresentation Slides: https://pydatayerevan.aua.am/files/2022/09/Karen-Javadyan.pptx\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2505,
  "language": "eng",
  "recorded": "2022-08-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/yerevan2022/"
    },
    {
      "label": "https://pydatayerevan.aua.am/files/2022/09/Karen-Javadyan.pptx",
      "url": "https://pydatayerevan.aua.am/files/2022/09/Karen-Javadyan.pptx"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/jDEtOb69A7g/hqdefault.jpg?sqp=-oaymwEmCOADEOgC8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGEAgWyhlMA8=&rs=AOn4CLBKlOFtinK-fYw2Of4mJqVaAMECUA",
  "title": "Karen Javadyan - Streamlit: A Faster Way to Build and Share Data Apps | PyData Yerevan 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jDEtOb69A7g"
    }
  ]
}
