{
  "description": "Nacho Aranguren Presents:\n\nModern Data Stack: Optimising and Scaling Data in a Tech Company\n\nThis talk is about a new approach to data integration that DataOps is enabling in tech companies (with Sololearn practical example) to save engineering time, allowing engineers and analysts to pursue higher-value activities, explaining why every tech organisation should have a Data + Analytics Engineering (DataOps) department.\n\nIt answers two main questions: Why should we care about the adoption of data + analytics engineering? What are the steps and processes to start the journey to full adoption?\n\nThis talk will look at themes around that journey: metadata, tools, & organisation action points to paint a picture of what the next phase of the journey looks like. We will go through the modern data stack. We will talk about its architecture, which tools fit where, and how to organise teams to support it. We’ll also touch on the challenges in operationalising warehouses and discuss future technology advancements that could unlock the warehouse to become the platform for business needs and operations.\n\nPresentation Slides: https://pydatayerevan.aua.am/files/2022/09/Nacho-Aranguren.pptx\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2471,
  "language": "eng",
  "recorded": "2022-08-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/yerevan2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://pydatayerevan.aua.am/files/2022/09/Nacho-Aranguren.pptx",
      "url": "https://pydatayerevan.aua.am/files/2022/09/Nacho-Aranguren.pptx"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/2ZTvRY-0_og/hqdefault.jpg?sqp=-oaymwEmCOADEOgC8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGEQgXihlMA8=&rs=AOn4CLDjWFvwWfjeajHGGeWNHO4RwHqVFQ",
  "title": "Nacho Aranguren - Modern Data Stack: Optimising and Scaling Data in a Tech Company",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2ZTvRY-0_og"
    }
  ]
}
