{
  "description": "Sergey Hayrapetyan Presents:\n\nBachelor theses in Deep Learning: Submitted to an Armenian University\n\nBachelor theses written in the area of Deep Learning based object detection will be presented. The main focus is on the detection of vehicles captured from the top, e.g. parking lots, satellites: I will present the challenges we encountered and solved in the scope of Bachelor thesis. The goal of this talk is not only to present the results of young undergraduate students but also to encourage new ones to get involved in the sphere.\n\nPresentation Slides: https://pydatayerevan.aua.am/files/2022/09/Sergey-Hayrapetyan.pptx\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1695,
  "language": "eng",
  "recorded": "2022-08-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/yerevan2022/"
    },
    {
      "label": "https://pydatayerevan.aua.am/files/2022/09/Sergey-Hayrapetyan.pptx",
      "url": "https://pydatayerevan.aua.am/files/2022/09/Sergey-Hayrapetyan.pptx"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/BVMRlxIbk1E/hqdefault.jpg?sqp=-oaymwEmCOADEOgC8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGEEgXyhlMA8=&rs=AOn4CLBjlqunHlHMrX5M6_bWfWT-Cb6X_g",
  "title": "Sergey Hayrapetyan - Bachelor theses in Deep Learning: Submitted to an Armenian University",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BVMRlxIbk1E"
    }
  ]
}
