{
  "description": "Sona Hunanyan Presents:\n\nEmpirical Determinacy of Posterior Location and Scale in Bayesian Hierarchical Models\n\nThe parameters in a statistical model are not always identified by the data. In Bayesian analysis, this problem remains unnoticed because of prior assumptions. It is crucial to find out whether the data determine the posterior parameters. In particular, it is important to learn to what extent the spread and the location of the marginal posterior distribution of the parameters are determined by the data.\n\nThe R package ed4bhm allows to investigate the empirical determinacy of marginal posterior parameters, their spread, and location. During this talk, I will showcase the functionality of the package ed4bhm with an application of Bayesian logistic regression to Bacterial resistance data.\n\nIn this talk, you will learn about:\n\n1. The typical problems in a Bayesian Hierarchical Model (BHM)\n2. The theory behind the empirical determinacy of posterior parameters in BHMs\n3. How to fit basic BHM in R\n4. How to apply the R package ed4bhm and how to interpret the results.\n\nPresentation Slides: https://pydatayerevan.aua.am/files/2022/09/Sona-Hunanyan.pdf\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2111,
  "language": "eng",
  "recorded": "2022-08-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/yerevan2022/"
    },
    {
      "label": "https://pydatayerevan.aua.am/files/2022/09/Sona-Hunanyan.pdf",
      "url": "https://pydatayerevan.aua.am/files/2022/09/Sona-Hunanyan.pdf"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/YoxvKgiSjTE/maxresdefault.jpg",
  "title": "Sona Hunanyan- Empirical Determinacy of Posterior Location and Scale in Bayesian Hierarchical Models",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YoxvKgiSjTE"
    }
  ]
}
