{
  "copyright_text": "",
  "description": "Joelle Maslak\n\nhttps://pretalx.northbaypython.org/nbpy-2025/talk/UCXDAC\n\nNeurodivergent brains can excel at tech, but excelling in formal employment can be more difficult! Most jobs are designed for the mythical neurotypical brain, and many are a particularly poor fit for even well-qualified neurodivergent brains. Learn about strategies that might work for different kinds of neurodivergent brains to adapt these neurotypical-centric jobs to neurodivergent brains. Knowing what adaptations can actually help and how to get those adaptations is important! This talk will give some examples and strategies to shape a job to fit a neurodivergent brain better. It will also encourage those with lead, partnership, or management responsibility to consider alternatives to the ways we've always done things, to allow more people to do amazing work in tech.\n\nThis talk will draw from 25 years of professional experience both in tech and in neurodivergent community. It will go beyond simple answers to neurodiverstiy in the workplace (\"Wear noise cancelling headphones!\") and talk about what a job that actually fits some neurodivergent brains might look like. How do we communicate/collaborate with coworkers? Get feedback? Use technology and scripting to assist us? I will mix tech solutions and non-tech solutions to the problems with neurotypical-centric employment.\n\nSun Apr 27 13:40:00 2025 at Reis River Ranch\n\nProduced by NDV: https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1",
  "duration": 1612,
  "language": "eng",
  "recorded": "2025-04-27",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pretalx.northbaypython.org/nbpy-2025/schedule/"
    },
    {
      "label": "Full playlist",
      "url": "https://www.youtube.com/playlist?list=PLaeNpBNgqQWui7JJJ4_M_AdlGQi_IpPym"
    }
  ],
  "speakers": [
    "Joelle Maslak"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/5VZTdZhE94o/maxresdefault.jpg",
  "title": "A Neurodivergent Career--Making Work Fit Us",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5VZTdZhE94o"
    }
  ]
}
