{
  "copyright_text": "",
  "description": "Oliver Rew\n\nhttps://pretalx.northbaypython.org/nbpy-2025/talk/XQKFNR\n\nWhen code finally leaves your IDE, the destination is often not the cloud or a PC, but an embedded device in a home, office, or even the wild. However, developing applications for the embedded space comes with its own unique set of challenges and pitfalls. Whether designing for the home or enterprise, embedded devices require additional considerations for usability, reliability, and maintainability.\n\nIn this talk, we'll explore real-world challenges of embedded Python development and provide practical solutions drawn from both DIY projects and enterprise deployments. You'll learn strategies for:\n\n- Ensuring system reliability through power failure tolerance and fault handling\n- Building secure remote access and upgrade capabilities\n- Implementing effective monitoring and observability\n- Managing hardware constraints and system resources\n- Designing flexible configuration systems that work in the field\n\nWhether you're a hobbyist looking to make your home automation more robust or a professional developer designing industrial systems, you'll walk away with concrete patterns and best practices to build more reliable embedded Python applications.\n\nSun Apr 27 15:45:00 2025 at Reis River Ranch\n\nProduced by NDV: https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1",
  "duration": 1374,
  "language": "eng",
  "recorded": "2025-04-27",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pretalx.northbaypython.org/nbpy-2025/schedule/"
    },
    {
      "label": "Full playlist",
      "url": "https://www.youtube.com/playlist?list=PLaeNpBNgqQWui7JJJ4_M_AdlGQi_IpPym"
    }
  ],
  "speakers": [
    "Oliver Rew"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/lx5IKpgdEDo/maxresdefault.jpg",
  "title": "Python Untethered: Building Robust Embedded Systems",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lx5IKpgdEDo"
    }
  ]
}
