{
  "copyright_text": "",
  "description": "Parul Gupta\n\nhttps://pretalx.northbaypython.org/nbpy-2025/talk/BSDCJQ\n\nLooking to make your scientific code faster and more efficient for training and prototyping? In the AI era, computing requirements and expenses are outpacing available resources. To stay ahead, efficient code is no longer a luxury - it has become a NECESSITY.\n\nWe will delve into the best practices and techniques for an optimized utilization of Python scientific libraries, including NumPy, Pandas, and SciPy highlighting common pitfalls and failure modes that can hinder performance. By going through some live demos (\"what could possibly go wrong?\" - North Bay Python 2024), we will learn how simple changes to our code can lead to significant optimizations, resulting in faster and more capacity-friendly solutions. We will gain insights into advanced programming concepts, such as NumPy vectorization, column-based vs row-based data frames and arrays, and many more.\n\nWhether you're a data scientist, machine learning engineer, researcher, or software engineer, we will showcase tips and strategies that can improve the efficiency of your code and accelerate your AI projects.\n\nSat Apr 26 13:40:00 2025 at Reis River Ranch\n\nProduced by NDV: https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1",
  "duration": 1308,
  "language": "eng",
  "recorded": "2025-04-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pretalx.northbaypython.org/nbpy-2025/schedule/"
    },
    {
      "label": "Full playlist",
      "url": "https://www.youtube.com/playlist?list=PLaeNpBNgqQWui7JJJ4_M_AdlGQi_IpPym"
    }
  ],
  "speakers": [
    "Parul Gupta"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/glkTprUyJEM/maxresdefault.jpg",
  "title": "Python Scientific Sorcery With Efficient Code",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=glkTprUyJEM"
    }
  ]
}
