{
  "copyright_text": "",
  "description": "Joe Kaufeld\n\nhttps://pretalx.northbaypython.org/nbpy-2025/talk/VMJR8F\n\n### Where'd that yellow schoolbus come from?\n\nThere are many things we're told aren't worth building because experts have done them already. Cryptography? Let the experts handle it. Algorithms? Same. Web frameworks? Yep. As a professional web developer focusing on arcane uses of Django (and others) for arcane purposes, it occurred to me a little while ago that I didn’t actually know how a web framework _worked_. How does routing route? How does middleware work? How do variables in URLs work without regex? (Spoiler: they don't.)\n\nSo... I wrote one.\n\n_The Tangled Web We Weave_ is a love letter to learning and to doing things they tell you aren't worth your time. Come and get some inspiration on learning the answers to questions you don't know either... even if some folks say it's silly.\n\n### What to expect\n\n - Tips on how to tackle giant problems\n - Three big takeaways learned while designing a WSGI web framework from the ground up\n - Support and encouragement\n\n### Who's this for?\n\nAnyone who's feeling like they need a push to learn something new, anyone who wants to know some weird facts about web frameworks, and anyone who wants to learn a little bit about the beautiful science of learning with Python.\n\nSun Apr 27 10:15:00 2025 at Reis River Ranch\n\nProduced by NDV: https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1",
  "duration": 1465,
  "language": "eng",
  "recorded": "2025-04-27",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pretalx.northbaypython.org/nbpy-2025/schedule/"
    },
    {
      "label": "Full playlist",
      "url": "https://www.youtube.com/playlist?list=PLaeNpBNgqQWui7JJJ4_M_AdlGQi_IpPym"
    }
  ],
  "speakers": [
    "Joe Kaufeld"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/uhz6byRVyB4/maxresdefault.jpg",
  "title": "The Tangled Web We Weave: Continuing Education Through Silly Projects",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uhz6byRVyB4"
    }
  ]
}
