{
  "copyright_text": "",
  "description": "Kattni\n\nhttps://pretalx.northbaypython.org/nbpy-2025/talk/HTYFFA\n\nParticipating in online open source communities can be a positive experience, but it isn't necessarily so for everyone. Stories abound of mistreatment of project maintainers and community contributors, including bullying, doxing, even acts of outright violence. But those negative experiences don't have to happen! Creating a safe and welcoming environment for open source development begins with you. Discover how you can affect positive change in your own project space and the spaces of others within the open source community through practical and achievable actions. You will gain a better understanding of the problem, and the changes necessary to begin addressing it. Unfortunately, there may always be those who are not interested in being a part of this solution. You will learn ways to ensure you are able to take care of yourself within this reality, while breaking the pattern of negativity within the spaces willing to accept a positive change. You play a critical role in building and maintaining communities that are welcoming, inclusive, and safe. Explore how you, and your communities, will benefit from changing things for the better.\n\nSat Apr 26 15:45:00 2025 at Reis River Ranch\n\nProduced by NDV: https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1",
  "duration": 1445,
  "language": "eng",
  "recorded": "2025-04-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pretalx.northbaypython.org/nbpy-2025/schedule/"
    },
    {
      "label": "Full playlist",
      "url": "https://www.youtube.com/playlist?list=PLaeNpBNgqQWui7JJJ4_M_AdlGQi_IpPym"
    }
  ],
  "speakers": [
    "Kattni"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/nvRgeJQ3v5U/maxresdefault.webp",
  "title": "The Source of Change: Bettering Online Open Source Communities Can Begin with You",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nvRgeJQ3v5U"
    }
  ]
}
