{
  "id": 734, 
  "category": "PyCon US 2012", 
  "slug": "34-crosscompute-is-a-web-platform-where-users-ca", 
  "title": "34. CrossCompute is a web platform where users can run algorithms", 
  "summary": "Have you developed a mathematical model or computational / visualization\nalgorithm? Your algorithm could be useful worldwide to people who face a real-\nworld problem but do not want to write code. Professionals in industry,\nscientists in other fields or researchers in developing countries can quickly\napply your work to their domain with a web-based cloud-computing platform like\nCrossCompute.\n\n", 
  "description": "CrossCompute is a site where you can run mathematical models and algorithms\nsubmitted by researchers. If you are a researcher and you submit your\nalgorithm, you'll get paid each time it runs. We'll send you a URL where users\ncan run your model on their data as many times as they want. More users mean\nmore feedback that you can use to improve your model.\n\nHere is an example: Suppose a mathematician in the US develops an operations\nresearch model for placing schools in a community given the locations of\nexisting schools and households, and decides to charge ten cents each time it\nruns. Then a business owner in Ghana runs the model over the internet to place\nstores in his district, and saves money because he didn't have to hire a\nconsulting firm or buy a software package. Meanwhile, the mathematician in the\nUS uses the algorithm revenue to fund research to improve the model.\n\nNow is an exciting time to get involved in data analytics for your city or\nlocal government. Governments need to prioritize limited resources like\nemergency response firefighters, police officers and city inspectors. I urge\nyou to contact your local Mayor's office to learn about the challenges they\nare facing. Then, create a tool to make their life easier. You can send the\ntool to support@crosscompute.com where it will join a growing collection of\nanalytics for the public good. You will get the credit for the algorithm, the\nrevenue and users from around the world.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "", 
  "thumbnail_url": "http://img.youtube.com/vi/U1Y5Uxn2Rcw/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=U1Y5Uxn2Rcw", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=U1Y5Uxn2Rcw", 
  "tags": [], 
  "speakers": [
    "Roy Hyunjin Han"
  ], 
  "recorded": "2012-03-11"
}