{
    "copyright_text": "CC BY",
    "description": "The Python community has been making efforts in improving the diversity\nand representation among its members. There are examples of success\nstories such as PyCon US Charlas, PyLadies, Djangonaut, and Django\nGirls. Yet in the Python podcast community, women are still\nunderrepresented, making up only 17% of invited guests among the popular\npodcast series. Being a guest in a podcast is a privilege, and an\nopportunity to influence the Python community. There are many women and\nunderrepresented group members who have made impactful contributions to\nthe Python community globally, and they deserve the recognition and to\nbe heard by the rest of us. Disheartened by the lack of representation\nby women on Python podcasts, and inspired by others who have shown us\nhow diversity in the community can be improved through intentionality,\nwe decided to start a podcast with a goal to highlight their voices so\nthat they could receive the recognition they deserve. In this talk,earn\nabout them, and about our podcast series. We’ll also share how you can\nfurther help out cause in improving representation and diversity in the\nPython community.\n\nGoal\n----\n\nTo raise awareness of the underrepresentation of certain groups,\nespecially women. To acknowledge the progress made by the Python\ncommunity and what can be done further to continue the improvement.\n\nTarget Audience\n---------------\n\nAnyone who cares about the diversity and inclusion progression in the\nPython community. Community leaders who want to be allies.\n",
    "language": "eng",
    "recorded": "2024-05-17",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/94/"
        }
    ],
    "speakers": [
        "Cheuk Ting Ho",
        "Georgi Ker",
        "Mariatta",
        "Tereza Iofciu"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/Gdv2_nZbSQE/hqdefault.jpg",
    "title": "Acknowledging Women’s Contributions in the Python Community Through Podcast",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=Gdv2_nZbSQE"
        }
    ]
}
