{
    "copyright_text": "CC BY",
    "description": "Escuchamos que Apache Arrow se ha convertido en un estándar de facto\npara la representación eficiente de datos columnares en memoria.\n\n¡¿Pero, qué significa esto realmente?!\n\nBasado en la documentación de Apache Arrow: - es una plataforma de\ndesarrollo para análisis en memoria - permite que los sistemas de big\ndata procesen y muevan datos rápidamente - especifica un formato de\nmemoria en columnas estandarizado e independiente del idioma para datos\nplanos y jerárquicos.\n\nHay un poco más de información ahí, pero todavía no es fácil de digerir,\n¿verdad?\n\nEn esta charla pretendemos arrojar algo de luz sobre los conceptos\nbásicos de Apache Arrow como formato de columnas. Revisaremos los\ndiferentes diseños de memoria física y los tipos lógicos, profundizando\nen ellos.\n\nEsta charla también cubrirá los conceptos básicos de serialización y\ncomunicación entre procesos (IPC), junto con los tipos de extensión\ncanónica y otras estructuras de datos como matrices multidimensionales\ntensoriales.\n\nLa charla pretende ser un ejercicio para comprender la representación\nfísica de los datos. Proporcionará ejemplos y mostrará cómo se\nrepresentan realmente los buffers en la memoria.\n",
    "language": "spa",
    "recorded": "2024-05-17",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/47/"
        }
    ],
    "speakers": [
        "Raúl Cumplido"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/imeDI1jWppo/hqdefault.jpg",
    "title": "Apache Arrow - El format columnar! Lo cualo?",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=imeDI1jWppo"
        }
    ]
}