{
    "copyright_text": "CC BY",
    "description": "Join us at PyCon US 2024 for an exciting tutorial 🎓, where we'll dive\ninto the world of web APIs using Python's beloved Django framework and\nthe Django Rest Framework. This session is perfect for Python\nenthusiasts 🐍 eager to expand their web development skills in a\npractical, hands-on environment.\n\n**What You Will Learn**\n\n-  🔍 Introduction to API Development with Django: Understand the basics\n   of API construction and the role of Django and Django Rest Framework\n   in modern web development.\n-  📊 Django Models: Explore how to create and utilize Django models,\n   the backbone of data handling in Django applications.\n-  🔗 URL Mapping and Views: Master URL configuration for efficient API\n   endpoint creation and discover how Django views and ViewSets drive\n   your API's functionality.\n-  🔄 Serializers in Action: Learn to implement serializers for\n   converting data formats, a critical step in RESTful API development.\n-  💻 Practical Application: Engage in hands-on coding to apply these\n   concepts in building a functional API from scratch.\n\n**Why This Tutorial?**\n\nThis tutorial is tailored for those ready to step into API development\nwith Django. We focus not just on theoretical knowledge but also\nemphasize practical skills. By the end of this session, you'll have a\nclear understanding of the essential components of Django for API\ndevelopment and hands-on experience in building an API.\n\nAre you already navigating the Django landscape and seeking to deepen\nyour expertise? 🌱 This tutorial provides an immersive opportunity to\nadvance your web development skills and explore the intricacies of API\ndevelopment using Django and the Django Rest Framework. 🚀 Join us for\nan enriching journey as we delve into mastering the art of building\npowerful APIs with Django!\n",
    "language": "eng",
    "recorded": "2024-05-15",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/58/"
        }
    ],
    "speakers": [
        "Felipe de Morais",
        "Amanda Vieira"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/iL9vp8xuHDw/hqdefault.jpg",
    "title": "🌐 Building Your First API with Django and Django Rest Framework",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=iL9vp8xuHDw"
        }
    ]
}