{
    "copyright_text": "CC BY",
    "description": "La investigación se centra en la clasificación y análisis de audio\nmediante el uso de embeddings para evaluar la severidad de episodios\nauditivos, para lograr esto, se ha desarrollado un proyecto que abarca\nla creación de un dataset específico destinado al entrenamiento de una\nred neuronal diseñada para analizar señales de audio.\n\nEn la primera fase del proyecto, se ha puesto énfasis en la recopilación\ny procesamiento de datos de audio, con el objetivo de construir un\nconjunto de entrenamiento robusto y representativo, este dataset se ha\nutilizado para alimentar una red neuronal especializada capaz de\nclasificar violencia en 5 clases.\n\nAdemás del análisis de audio, se ha explorado el análisis de texto\nutilizando embeddings para determinar la cercanía semántica de las\npalabras y frases asociadas con la agresividad o la intención de\nviolencia, esta dimensión adicional proporciona una perspectiva más\ncompleta, permitiendo una evaluación integral de la violencia en los\nsegmentos auditivos.\n\nLa combinación de técnicas de análisis de audio y texto ha demostrado\nser efectiva para calificar la violencia en episodios auditivos,\nofreciendo un enfoque multidimensional para entender la naturaleza de\nlos contenidos, este método no solo identifica la presencia de\nviolencia, sino que también asigna un grado de severidad, brindando una\nevaluación más precisa y detallada.\n",
    "language": "spa",
    "recorded": "2024-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/121/"
        }
    ],
    "speakers": [
        "Carla Marcela Florida Román"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/jX20gFPf6xI/hqdefault.jpg",
    "title": "Clasificación de violencia mediante análisis de audio y embeddings",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=jX20gFPf6xI"
        }
    ]
}