{
    "copyright_text": "CC BY",
    "description": "En esta charla de 30 minutos, exploraremos la fascinante travesía DEI\ndesde liderar PyLadies Colombia hasta colaborar en los comités DEI del\nProyecto Jupyter y de becas de PyData Global 2023. Descubriremos\nestrategias prácticas para fomentar la diversidad en el mundo del código\nabierto, desde el desarrollo de comunidades hasta la participación en\nproyectos a escala global.\n\nCompartiré experiencias concretas, desde desafíos superados hasta éxitos\ninspiradores, destacando el impacto de las actividades informales, como\ntalleres personales, en la construcción de comunidades inclusivas.\nExploraremos cómo pequeñas acciones pueden tener un impacto\nsignificativo en la promoción de la diversidad, la equidad y la\ninclusión.\n\nEsta charla proporcionará ideas accionables para impulsar la diversidad\nen tu entorno de código abierto y te dará con una visión de cómo\nconstruir puentes DEI sólidos en proyectos y comunidades. ¡Te espero\npara compartir estas experiencias y explorar juntos cómo hacer del\ncódigo abierto un espacio para todos!\n\n**Outline:** 1. Introducción (5 minutos) 1. PyLadies Colombia:\nConstruyendo Comunidades Inclusivas (6 minutos) 1. Rol y contribuciones\nen los comités DEI y de becas a nivel global (6 minutos) 1. Desafíos y\néxitos en la implementación de iniciativas inclusivas a nivel\ninternacional (6 minutos) 1. Acciones Concretas para Impulsar la\nDiversidad en Open Source (6 minutos)\n",
    "language": "spa",
    "recorded": "2024-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/27/"
        }
    ],
    "speakers": [
        "Lucy Jiménez"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/boVwsSAh37M/hqdefault.jpg",
    "title": "Construyendo Puentes en Diversidad, Equidad e Inclusión en Open Source",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=boVwsSAh37M"
        }
    ]
}