{
    "copyright_text": "CC BY",
    "description": "En la presentación titulada \"Desentrañando el Misterio del Distributed\nTracing con Python\", abordaremos la esencia y la importancia del rastreo\ndistribuido en las arquitecturas de microservicios. En un ecosistema\ndonde los sistemas son cada vez más distribuidos y complejos, el rastreo\ndistribuido se ha convertido en una herramienta indispensable para\ncomprender y optimizar el comportamiento y el rendimiento de las\naplicaciones. Esta charla se centrará en cómo Python, gracias a su\nsimplicidad y eficacia, se puede utilizar para implementar soluciones de\nrastreo distribuido en entornos de microservicios.\n\nComenzaremos explorando los fundamentos del rastreo distribuido,\nexplicando cómo y por qué se ha convertido en un componente crítico para\nla supervisión y el diagnóstico en arquitecturas modernas.\nProfundizaremos en cómo Python, con su rica biblioteca de herramientas y\nframeworks, puede ser empleado para construir sistemas de rastreo\ndistribuido eficientes y eficaces. Discutiremos las técnicas clave para\ninstrumentar aplicaciones Python en entornos de microservicios,\nproporcionando insights sobre cómo recopilar, analizar y visualizar\ndatos de rastreo para mejorar la visibilidad y el rendimiento del\nsistema.\n\nLa charla está destinada a desarrolladores de software, ingenieros de\nDevOps y profesionales en TI que buscan profundizar en el distributed\ntracing y su implementación en Python. Al final de la sesión, los\nparticipantes tendrán una comprensión más profunda de cómo el rastreo\ndistribuido puede ser una poderosa herramienta para diagnosticar y\nresolver problemas en sistemas complejos, y cómo Python facilita este\nproceso.\n",
    "language": "spa",
    "recorded": "2024-05-17",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/64/"
        }
    ],
    "speakers": [
        "Israel Blancas"
    ],
    "title": "Desentrañando el Misterio del Distributed Tracing con Python"
}