{
    "copyright_text": "CC BY",
    "description": "“It says the package is not installed?” is a common refrain when working\non software projects, especially in Python. Creating and configuring\nreproducible environments is a major part of modern software development\nand has led to the popularity of tools like Docker to specify where and\nhow code runs. `Development (Dev) Container <https://containers.dev/>`__\nare an open specification that extends Docker images to make it easy to\nconfigure not only the where the code runs, but also the developer\nworkspace in your preferred editors or toolchains like VS Code, PyCharm,\nor DevPod. Setting up Dev Containers for your projects can reduce\nmaintainer overhead of OSS projects, bootstrap contributors, and make\nrunning events like workshops or sprints go more smoothly.\n\nIn this talk, we will briefly cover why setting up container\ninfrastructure can be useful for isolating your project environments and\ndig into how you can extend that with Dev Containers to configure a\ncomplete development experience using VS Code. We will look at two\ncommon OSS project situations, onboarding and workshops, to see how\nworkflows for using Dev Containers and other supporting tools make\nthings easier. No container experience required, brief familiarity with\nVS Code is helpful, but not necessary.\n",
    "language": "eng",
    "recorded": "2024-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/123/"
        }
    ],
    "speakers": [
        "Sarah Kaiser"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/3qUah_nImhY/hqdefault.jpg",
    "title": "Eternal sunshine of the spotless development environment",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=3qUah_nImhY"
        }
    ]
}