{
    "copyright_text": "CC BY",
    "description": "En los últimos años, hemos visto el crecimiento de compañías enfocadas\nal desarrollo de vehículos autónomos, como lo son Tesla ,Waymo o\nKiwibots. Al ver estos grandes proyectos podría pensarse que la lógica\ndetrás de un sistema informático para controlar este tipo de robots es\nmuy complicada. En esta charla vamos a desmitificar un poco el\nfuncionamiento de esta clase de sistemas, aprenderemos sobre algunas\ntendencias en cuanto a frameworks de robótica como ROS, y como es que se\ncomunican los distintos sensores del vehículo para lograr la conducción\nautónoma. Todo desde un punto de vista de ingeniería de software\nenfocada a trabajar con nodos de comunicación en tiempo real. Y por\nsupuesto, todos los ejemplos escritos en Python.\n\nAudiencia\n~~~~~~~~~\n\n--------------\n\nLa audiencia puede ser cualquier persona entusiasmada en temas de\nrobótica o de conducción autónoma, no hace falta tener algún tipo de\nconocimiento previo en algo en particular, ya que la charla está\nenfocada a tocar conceptos teóricos y explicarlos.\n\nEsquema\n~~~~~~~\n\n--------------\n\nIntroducción a los vehículos autónomos (5 minutos)\n\n-  Explicación breve de los tipos de vehículos autónomos.\n-  Explicación sobre el enfoque de la charla y las limitaciones de la\n   misma.\n\nIntroducción a ROS con Python (7 minutos)\n\n-  El framework de robótica ROS y los sistemas en tiempo real.\n-  Los nodos de comunicación y los tipos de mensajes.\n-  Breve analogía entre los sistemas de robótica y los servicios en una\n   nube.\n\nCómo funcionan los sensores de un vehículo autónomo, y el control (10\nminutos)\n\n-  Sensor Fusion (Cámaras, LiDAR, Radar, GPS)\n-  Aprendizaje automático para tomar decisiones\n\nDemo del funcionamiento de un vehiculo autonomo con CARLA Simulator y\nROS2 (10 minutos)\n\n-  Mostrando una aplicación funcional de un vehículo autónomo en el\n   simulador CARLA para visualizar el funcionamiento de ROS y su\n   interacción con los sensores del vehículo.\n\nConclusiones (3 minutos)\n",
    "language": "spa",
    "recorded": "2024-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/93/"
        }
    ],
    "speakers": [
        "Jesus Armando Anaya"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/8kOipdZHkzk/hqdefault.jpg",
    "title": "Explicando el sistema de un vehículo autónomo con Python.",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=8kOipdZHkzk"
        }
    ]
}