{
    "copyright_text": "CC BY",
    "description": "Python packaging can be a scary and confusing endeavor. The ecosystem\ncan be thorny and filled with many decisions around which tool or\napproach to use. You’re also likely to get pricked by an approach or\ntutorial that doesn't work as expected. However, the packaging journey\ndoesn’t have to be prickly - particularly for pure Python packages. By\nbuilding community consensus around user goals and moderating healthy\ndiscussion, pyOpenSci is paving a smooth, thorn-free path for successful\npackaging.\n\nThis talk presents pyOpenSci’s people-first approach to guiding the\nscientific community through thorny packaging decisions. First, we\nengaged with the broader community to understand packaging needs.\nSecond, we brought together packaging experts, tool maintainers, and\nbeginning-to-advanced users to successfully build consensus around tools\nand best practices. Community outreach helped us understand both user\nneeds and the packaging tool ecosystem. Finally, consensus around tools\nand needs was transformed into accessible recommendations in our\ncommunity-driven Packaging Guide. Guidebook pull requests go through\nextensive, open community review with 38 people and thousands of\ncomments contributing to the guidebook’s current state. Careful\nmoderation ensures healthy and productive conversations and also drives\nconsensus-building around beginner-friendly content. Our guidebook’s\ndevelopment process allows us to harness community expertise to create\nan accessible and accurate packaging guide that smooths out the\npackaging path.\n\nYou will will walk away from this talk with a better understanding of:\n\n#. Why consensus-building and user-focused content development is\n   critical for tackling thorny topics such as packaging.\n#. How to decide which packaging tools satisfy your packaging needs.\n#. Where to find more information and support around packaging.\n\n**You don’t have to package alone. The vibrant Python community is here\nto help.**\n",
    "language": "eng",
    "recorded": "2024-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/34/"
        }
    ],
    "speakers": [
        "Leah Wasser"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/mJPoj9Ex9fk/hqdefault.jpg",
    "title": "Friends don't let friends package alone",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=mJPoj9Ex9fk"
        }
    ]
}