{
    "copyright_text": "CC BY",
    "description": "ABSTRACT\n========\n\nIn this tutorial, you’ll dive into the fundamentals of API security for\nPython applications. You’ll learn best practices and patterns for API\nauthentication and authorization and for API security by design.\n\nWe’ll go through the OWASP top 10 API vulnerabilities. We’ll see\npractical examples of how they occur, including examples from real-world\nAPIs. We’ll analyze the vulnerabilities, understand what the attack\nvectors are, and how we address them.\n\nYou’ll learn how Open Authorization (OAuth) and OpenID Connect (OIDC)\nwork for APIs. You’ll learn about the risks and advantages of using\nthese protocols, known vulnerabilities, and best practices to avoid\nthem. You’ll also learn about JSON Web Tokens (JWTs) and how to use them\ncorrectly for access authorization.\n\nFinally, you’ll learn how to automate the process of detecting and\naddressing security vulnerabilities in your APIs using fuzzy testers\nlike schemathesis and design-testing tools like spectral.\n\nThroughout the tutorial, we’ll use examples of OpenAPI specifications,\nand code examples in Flask and FastAPI. You’ll make the best out of the\ntutorial if you have some experience working with APIs.\n\nIf you work with APIs (who doesn’t!), I’d love to welcome you to this\ntutorial to learn how to build and deliver secure APIs!\n",
    "language": "eng",
    "recorded": "2024-05-16",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/5/"
        }
    ],
    "speakers": [
        "Jose Haro Peralta"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/n64VfBhyu9A/hqdefault.jpg",
    "title": "Fundamentals of API security with Python",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=n64VfBhyu9A"
        }
    ]
}