{
    "copyright_text": "CC BY",
    "description": "Python is one of the programming languages that has a huge open-source\nsupply chain. There are over 400,000 Python packages on Python Package\nIndex (PyPI) and many more on other registries like conda-forge, mostly\nfor scientific libraries. Making sure this and the wider Python\necosystem are secure is a huge job and requires consistent\ncontributions.\n\nThanks to OpenSSF’s Alpha-Omega project and AWS, we now have a PSF\nSecurity Developer-in-Residence and PyPI Safety & Security Engineer\nwhose responsibility includes a security audit of the PyPI codebase and\ninfrastructure, improving security practices, and establishing metrics\non security posture to show the impact.\n\nIn this talk, we will go over the work that has been done by the PSF\nsecurity team and what the best practices for Python library maintainers\nand users are.\n\nGoal\n----\n\nThe goal of this talk is to draw awareness of security, especially in\nPython's ecosystem. It highlights how PSF is helping the community, on\nthe other hand, it also provides advice for a user or community member\non what can be done to make sure they are using Python safely.\n\nTarget audiences\n----------------\n\nThs talk is for anyone in the Python community. If you are using Python,\nor your company is using Python. This talk is for you.\n",
    "language": "eng",
    "recorded": "2024-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/83/"
        }
    ],
    "speakers": [
        "Cheuk Ting Ho"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/ELvIJdBh0Os/hqdefault.jpg",
    "title": "Making Python safer than ever",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=ELvIJdBh0Os"
        }
    ]
}