{
    "copyright_text": "CC BY",
    "description": "“If the Internet was a country, it would be the 4th largest polluter”\n[1] The power to make impactful change through technology has never been\ngreater. Doing so starts with understanding the problem space. Our\nworkshop will guide you through the process of quantifying the emissions\nof your Python code and integrating this awareness into your monitoring\nstrategy.\n\nStarting with the basics of observability, an essential part of\noperating a deployed service, you’ll learn why it’s important to monitor\nyour Python code, what makes a good metric, and the common pitfalls to\navoid. We’ll then dive into the practical aspects of exposing and\ncreating custom metrics, scraping and storing them in Prometheus, a time\nseries database, and then visualising them in dashboards using Grafana.\n\nThe workshop will also include an overview of climate-conscious tech,\ndiscussing the tech industry’s contribution to the climate crisis and\nintroducing the principles of green coding. We’ll explore techniques and\nlibraries for extracting metrics for carbon awareness, because \"If you\ncan't measure it, you can't improve it.\" (Peter Drucker) and guide\nattendees through a practical session on instrumenting your Python code\nfor carbon emissions and visualizing this data.\n\nBy attending this workshop, you’ll gain valuable insights and hands-on\nexperience in making your code more carbon-conscious. You’ll learn about\ncarbon-aware workloads, strategies for making your services more energy,\nand carbon efficient, the importance of cloud provider regions and\ntransparency, and how to advocate for change. These skills and knowledge\ncan be integrated into your day-to-day work, making a real difference in\nour world.\n\nJoin us in this journey towards a more sustainable future in tech and a\nbetter planet for everyone.\n\n\\*source: https://www.sustainablewebmanifesto.com/#citation\n",
    "language": "eng",
    "recorded": "2024-05-16",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/38/"
        }
    ],
    "speakers": [
        "Jessica Greene (she/her)",
        "Chioma Onyekpere (She/Her)"
    ],
    "title": "Monitoring carbon emissions: making the impact of your python code visible"
}