{
    "copyright_text": "CC BY",
    "description": "En esta charla, analizaré los conceptos fundamentales de observabilidad\ny cómo se pueden aplicar usando Python. Demostraré qué es la\nobservabilidad y por qué es tan crucial en el desarrollo de software.\nCubriremos los tres pilares esenciales de la observabilidad (registros,\nmétricas y seguimiento) y exploraremos cómo Python, con su simplicidad y\neficacia, encaja perfectamente en este escenario. Veamos ejemplos\nprácticos de cómo implementar el registro básico, recopilar métricas\nsimples y comprender los fundamentos del seguimiento distribuido.\n\nLínea de tiempo: 1. Introducción (3-5 minutos) Bienvenido y sobre mí:\ncontextualice rápidamente su experiencia con Python y la observabilidad.\nResumen de lo que se cubrirá.\n\n#. ¿Qué es la observabilidad? (5 minutos) Definición e importancia:\n   explique de manera concisa qué es la observabilidad y por qué es\n   crucial en el desarrollo de software. Pilares de observabilidad: un\n   vistazo rápido a registros, métricas y seguimiento.\n\n#. Python y observabilidad (5 minutos) ¿Por qué Python? Destacaré la\n   idoneidad de Python para tareas de observabilidad, centrándome en la\n   simplicidad y eficacia. ¿Herramientas? Mencionaré rápidamente algunas\n   herramientas y bibliotecas como el registro y Prometheus.\n\n#. Demostración Práctica (10 minutos) Ejemplo con registro; Introducción\n   a las Métricas; Seguimiento básico;\n\n#. Conclusión (5 minutos) Resumen de la conferencia, repasando palabras\n   clave;\n",
    "language": "spa",
    "recorded": "2024-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/21/"
        }
    ],
    "speakers": [
        "Ana Paula Gonzaga"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/Zm38clV_VE0/hqdefault.jpg",
    "title": "Observabilidad en Python para principiantes",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=Zm38clV_VE0"
        }
    ]
}