{
    "copyright_text": "CC BY",
    "description": "Do you want to learn robotics but are unable to sink thousands of\ndollars into a new hobby? Good news! It turns out that many professional\nroboticists rarely touch hardware at all! Many modern robot developers\nuse simulations, basically fancy video games, to develop the source code\nfor their robots. This new approach to robotics means you too can start\nlearning robotics without ever touching an Allen wrench or a soldering\niron. More importantly, you can transfer your existing Python skills\ninto solving challenging robotics problems.\n\nIn this talk we’ll walk you through getting started with `Robot\nOperating System 2 (ROS 2) <https://ros.org/>`__ and the `Gazebo\nsimulator <https://gazebosim.org/home>`__. ROS 2 and Gazebo are two\nlarge, open-source projects used by thousands of companies, and tens of\nthousands of developers, to build the robots we encounter in our daily\nlives. Better yet, both ROS 2 and Gazebo support Python, making it\neasier than ever to learn robotics fundamentals. In fact, ROS should be\nvery familiar, it draws much of a project structure from Python itself.\nJust like the Python 2 to Python 3 transition. ROS and Gazebo have seen\nsome major changes in the past few years; and now is a good time for\nPython developers to revisit these important tools.\n\nIn this talk we’ll introduce you to ROS 2 and Gazebo using existing open\nsource libraries and robots. We’ll touch on how to get started, the\nPython APIs for both projects, and some of the fiddly bits in between\n(like CLIs, and other file types) that make robotics simulation\npossible. This talk is geared towards novice to intermediate programmers\nwho are ready to branch out and start applying programming fundamentals\nto the domain of robotics.\n",
    "language": "eng",
    "recorded": "2024-05-19",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/87/"
        }
    ],
    "speakers": [
        "Kat Scott"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/YwozYGCslUY/hqdefault.jpg",
    "title": "Open Source Robotics with Python: Learn Robotics with No Robot Required",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=YwozYGCslUY"
        }
    ]
}
