{
    "copyright_text": "CC BY",
    "description": "This is a story of how Python can fit into the physical world around us.\nIt is a story of system design and product development. It is a tale of\ngreat breadth, covering distributed computing, custom printed circuits,\nelectromagnetism, some of the largest hydropower generators in the\nworld, and the software and hardware that brings this all together. This\ntale covers several years of research and development, culminating in a\ncyber physical system built on open-source software and easily\nattainable off-the-shelf products and components.\n\nThe Bureau of Reclamation is the 2nd largest hydropower generator in the\nUnited States and operates 53 hydroelectric plants with 14.7 gigawatts\nof installed capacity. On average, Reclamation plants generate 40\nbillion kilowatt hours of electricity annually. It takes a large fleet\nof rotating machines (generators and pumps) across the western United\nStates to produce this much electricity, and operations and maintenance\nof this fleet is a significant part of Reclamation’s annual budget.\n\nDuring routine diagnostic and maintenance tasks, it is often necessary\nto slowly and precisely turn a machine’s rotor to make measurements at\nvarious rotational positions. This was previously done with many\npersonnel climbing into the machine and pushing (or, for very large\nmachines, complicated crane maneuvers). This is dangerous, inefficient,\nand lacks precision.\n\nWith custom software and intelligent system design, we have developed a\nmodular system that can easily scale to turn even our largest machines\nwith the click of a button. The software can track the machine’s\nrotational position in real time to one thousandth of a degree and can\neasily expand to accommodate future diagnostic test methods. What once\nput personnel at risk and potentially took days to carry out can now be\ndone in hours with little to no risk to personnel.\n",
    "language": "eng",
    "recorded": "2024-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/59/"
        }
    ],
    "speakers": [
        "Jacob Lapenna"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/IxriyZJm9Lg/hqdefault.jpg",
    "title": "Open Source Industrial Control: Turning 2,800 Tons of Metal with Python and Flask",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=IxriyZJm9Lg"
        }
    ]
}