{
    "copyright_text": "CC BY",
    "description": "La reproducibilidad computacional no solo es un asunto de ejecución de\ncódigo, sino, sobre todo, un asunto vinculado a la comunicación. Para\nasegurarnos de que otras personas (nuestro equipo, nuestro yo del\nfuturo, otras colegas, etc.) puedan reproducir nuestros resultados a\npartir de los datos y el código que escribimos, necesitamos que nuestros\nproyectos comuniquen de manera clara para qué sirve cada uno de sus\ncomponentes y dónde encontrar los piezas necesarias para hacer que todo\nfuncione. La charla tiene como audiencia objetivo a personas que usan\nPython para análisis de datos, tanto quienes trabajan en contextos\nacadémicos de investigación, como quienes trabajan como científicos o\ncientíficas de datos en industria. Puede ser de particular interés para\nquienes recién están empezando en esta área y quieren adoptar buenas\nprácticas. Al finalizar la charla, la audiencia tendrá una serie de\nlineamientos prácticos y aplicables que podrán ayudar que sus flujos de\nanálisis de datos con Python sean reproducibles.\n\nLuego de dar algunos ejemplos de la vida real en los que (casi) todo\nsalió mal producto de que el código no era reproducible, se abordarán\nlos siguientes tópicos: - uso de entornos virtuales. - uso de control de\nversiones. - organización de directorios y archivos. - escribir\nfunciones y automatizar tareas - cómo crear documentación útil para\nquienes utilizarán nuestro código en el futuro.\n",
    "language": "spa",
    "recorded": "2024-05-17",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/68/"
        }
    ],
    "speakers": [
        "Riva Quiroga"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/06KsKm_C_O0/hqdefault.jpg",
    "title": "¡Pero si funciona en mi computadora! Cómo lograr que nuestros análisis de datos sean reproducibles",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=06KsKm_C_O0"
        }
    ]
}