{
    "copyright_text": "CC BY",
    "description": "Nos encanta usar Python en nuestro trabajo, pero lamentablemente la base\nde datos de tu empresa donde ejecutas tus ETL (extracción,\ntransformación y carga) te lo previene. Muy probablemente tu base de\ndatos hable SQL, ¿Por qué? Porque SQL está en todos lados, ha estado\npresente durante un largo tiempo, está estandarizado y es conciso.\n\n¿Pero realmente está estandarizado? ¿Y siempre es conciso? ¡No! ¿Aún\nnecesitamos usarlo? ¡Probablemente sí! ¿Qué puede hacer una persona que\ntrabaja con datos? ¿SQL con string-templating (plantilla de cadena de\ncaracteres)? print(f\"Ese camino conduce a {locura}}\".)\n\nMejor, ¡ven y aprende sobre Ibis!\n\nIbis es una biblioteca completamente en Python que ofrece una una\ninterfaz similar a aquellas con estructuras de datos tabulares (data\nframes), que te permite construir queries concisas y componibles que se\npueden ejecutar en una amplia variedad de backends (SQLite, DuckDB,\nPostgres, Spark, Clickhouse, Snowflake, BigQuery, ¡y más!).\n\n¿Alguna vez has tenido que traducir un prototipo de Pandas a PySpark\npara ejecutarlo en \"datos reales\"?\n\n¿O descargar un enorme archivo parquet porque los datos en la fuente son\nel resultado de 500 líneas de SQL denso y tienes miedo de tocarlo?\n\n¿Quieres probar esta cosa llamada \"DuckDB\" pero no quieres aprender SQL?\n\n¿Tienes una relación de amor/odio con SQL porque te permite hacer tu\ntrabajo, pero piensas que debe haber una mejor manera?\n\n¿Te has quedado atascado manteniendo un creciente y amorfo conjunto de\nSQL con plantillas que solo se suponía que se usaría para esa\ndemostración?\n\nBueno, si eres un ingeniero de datos, científico de datos, entusiasta de\nlos datos o cualquier cosa relacionada con los datos, ¡ven y únete a\nnosotros para descubrir lo que Ibis puede hacer por ti!\n",
    "language": "spa",
    "recorded": "2024-05-17",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/117/"
        }
    ],
    "speakers": [
        "Phillip Cloud",
        "Naty Clementi"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/STG0GjjE-YQ/hqdefault.jpg",
    "title": "Porque SQL está en todas partes.",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=STG0GjjE-YQ"
        }
    ]
}