{
    "copyright_text": "CC BY",
    "description": "Teniendo un Raspberry Pi con las características de un mini computador\nbrinda diversas opciones para construir un sistema de seguridad\nutilizando bibliotecas como Tensorflow, ofreciendo varias ventajas sobre\nlos sistemas tradicionales, por lo que es una opción para las personas\nen general con conocimiento en tecnología que buscan la personalización,\nel control, el almacenamiento, el reconocimiento facial entre otros:\n\nPersonalizar las tareas. Actualmente las bibliotecas cuentan con\nreconocimiento facial para accesos autorizados, por lo cual existe una\nposibilidad de integración con otros dispositivos domésticos\ninteligentes, se puede crear un ecosistema interconectado, activando\nluces, cerraduras o alarmas en función de las detecciones de la app.\n\nAlmacenamiento local de datos, esto para mantener las grabaciones y\ndatos privados, evitando problemas de almacenamiento en la nube. Ademas\nde tener acceso a las bibliotecas de código abierto para una mayor\ntransparencia y control.\n\nReconocimiento facial y de objetos, va mas allá de la detección de\nmovimiento básico, identificando intrusos, mascotas u objetos\nespecíficos para respuestas específicas.\n\nMensajes: También se realiza la supervisión y alertas en tiempo real al\ncelular.\n",
    "language": "spa",
    "recorded": "2024-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/133/"
        }
    ],
    "speakers": [
        "Monica Limachi"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/fHUkteRWtKA/hqdefault.jpg",
    "title": "Proyecto Centinela: Seguridad en el hogar usando Raspberry Pi y Tensorflow",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=fHUkteRWtKA"
        }
    ]
}