{
    "copyright_text": "CC BY",
    "description": "This tutorial is aimed at Python programmers new to PyTorch and deep\nlearning. However, even more experienced deep learning practitioners and\nPyTorch users may be exposed to new concepts and ideas when exploring\nother open source libraries to extend PyTorch.\n\nThroughout this 3.5-hour tutorial session, attendees will learn how to\nuse PyTorch to train neural networks for image and text classification.\nWe will discuss the individual strengths and weaknesses of deep learning\nand contrast it with traditional machine learning.\n\nWe will be going over the PyTorch library in detail, exploring it as a\ntensor library, automatic differentiation library, and library for\nimplementing deep neural networks so that you get a solid grasp of how\nPyTorch is structured.\n\nAfter getting a firm grasp of the PyTorch API, we will introduce\nadditional open source libraries, such as PyTorch Lightning, to\nfamiliarize attendees with the modern open source stack for deep\nlearning to take advantage of mixed-precision techniques and multi-GPU\ntraining.\n\nNote that all model code in this tutorial can be run on a laptop\ncomputer, but attendees will also be introduced to using free GPU\noptions for this tutorial via Google Colab and Lightning to get the full\nbenefits of the GPU training sections.\n\nThe tutorial materials and additional information will be uploaded in\nadvance on GitHub at https://github.com/rasbt/pycon2024, which also\ncontains a Discussion Forum for questions before the event.\n",
    "language": "eng",
    "recorded": "2024-05-15",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/32/"
        }
    ],
    "speakers": [
        "Sebastian Raschka"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/0yRsbh1bgtk/hqdefault.jpg",
    "title": "The Fundamentals of Modern Deep Learning with PyTorch",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=0yRsbh1bgtk"
        }
    ]
}