{
    "copyright_text": "CC BY",
    "description": "AI research is more important now than ever. Trust in AI is critical,\nbut it’s hard to build trust without metrics and documentation. How can\nwe make documentation as easy as possible in order to maintain trust in\nthe results from our research? Is there a way to organize our models so\nthat we can ensure reproducibility? How can we save ourselves precious\ndevelopment time by automating parts of the metric tracking process?\n\nIn this talk, we’ll give a brief introduction to a popular metric\ntracking tool, MLFlow, before going into a deep dive on three lesser\nknown features that can enhance collaboration, increase transparency and\nreduce the time wasted reproducing results.\n\nThe three features that we’ll talk about are autologging, MLFlow system\ntags and the MLFlow model registry. We’ll see how using these three\nfeatures can save you tons of time that would have otherwise been wasted\nwriting lines of code, looking for old code or finding the right model\nversion.\n\nBy the end of this talk, you’ll have all the knowledge you need to\nsuccessfully use MLFlow to your best advantage. You’ll be able to\nautomatically log every parameter and metric according to your framework\nof choice, link the version of code to the metrics that version produced\nfor faster reproducibility and have a process that you can reliably use\nto write helpful documentation quickly.\n",
    "language": "eng",
    "recorded": "2024-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/74/"
        }
    ],
    "speakers": [
        "Krishi Sharma"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/BYYDVHoYiks/hqdefault.jpg",
    "title": "Trust Fall: Three Hidden Gems in MLFlow",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=BYYDVHoYiks"
        }
    ]
}