{
    "copyright_text": "CC BY",
    "description": "En esta charla hablaré sobre cómo compartir soluciones y fomentar el uso\nde Python en tareas cotidianas cuando trabajas dentro de una compañía\nque usa métodos tradicionales como Word y Excel. Es importante entender\nque, si bien existe un importante desarrollo de tecnologías a gran\nescala que nos permiten trabajar con Inteligencia Artificial, Big Data,\nAplicaciones Web, etc. en el mundo real, especialmente en instituciones\nde carácter público, se siguen utilizando y exigiendo métodos\ntradicionales para compartir y almacenar la información. En este trabajo\n“a pequeña escala”, existen desafíos como la generación de reportes\nautomáticos en formato Word, el relleno de formularios en planillas\nExcel para la entrega de información oficial y la generación de\naplicaciones que ayuden a las personas que no programan a realizar\nprocesos repetitivos. Presentaré ejemplos de reportes reproducibles con\nQuarto, relleno automático de formatos oficiales en planillas Excel con\nPandas+xlwings y generación de aplicaciones con Streamlit y Shiny.\nTambién entregaré algunos consejos sobre cómo trabajar colaborativamente\ncon personas que no programan y cómo desarrollar soluciones con Python\nque puedan ser utilizadas dentro del contexto del trabajo de oficina\ndiario.\n",
    "language": "spa",
    "recorded": "2024-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/96/"
        }
    ],
    "speakers": [
        "Steph Orellana Bello"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/bjyKwfwGeXQ/hqdefault.jpg",
    "title": "Usando Python en una oficina tradicional",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=bjyKwfwGeXQ"
        }
    ]
}