{
    "copyright_text": "CC BY",
    "description": "Southeast Alaska is a temperate rainforest, and landslides have been\nhappening here for thousands of years. But shifting rainfall patterns\nhave increased the frequency of landslides, with catastrophic results.\nIn the last 8 years, three different towns in our region have\nexperienced fatal landslides.\n\nAfter a major landslide in 2015, a number of local people with\nexperience in the outdoors and in various scientific fields noticed a\npossible correlation between river levels and landslide activity. Our\nmain river has a small watershed, so it responds rapidly to periods of\nheavy precipitation. Using Python, I was able to investigate the\nquestion we all kept coming back to:\n\n*Is the correlation between changing river levels and landslide activity\nstrong enough to serve as the basis for predicting landslides?*\n\nUsing historical readings from a local river gage, a set of conditions\nwas identified that correlate meaningfully with landslide activity. In\nabout 12 events where the river met those conditions, at least 5 were\nassociated with known landslides.\n\nI posted a landslide-risk monitoring tool in 2021, which provides a\nvisual indication of when the river is behaving in a way that correlates\nwith previously known landslide events. This tool is used by many\ncommunity members to assess the ongoing risk of landslide activity\nduring heavy rain events. Just as importantly, it helps people let go of\nanxiety when we're experiencing rain that feels heavy, but isn't\nactually associated with landslide risk.\n\nThis talk will show how Python's vast ecosystem supports the entire\ncitizen-scientist lifecycle, from idea to public-facing resource.\n",
    "language": "eng",
    "recorded": "2024-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/54/"
        }
    ],
    "speakers": [
        "Eric Matthes"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/s-0TjHkVEBw/hqdefault.jpg",
    "title": "Using Python to assess landslide risk: A matter of life and death",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=s-0TjHkVEBw"
        }
    ]
}