{
    "copyright_text": "CC BY",
    "description": "As we are in an era of big data where large groups of information are\nassimilated and analyzed, for insights into human behavior, data privacy\nhas become a hot topic. Since there is a lot of private information\nwhich once leaked can be misused, all data cannot be released for\nresearch. So, how should privacy be protected in the environment where\ndata is stored and shared at such an escalating pace? One might think\nthat simply making personally identifiable fields in the dataset\nanonymous might be useful, but this can lead to the entire dataset\nbecoming useless and not fit for analysis. And research has proven that\nby statistically studying both the datasets, private information can\neasily be re-extracted!\n\nThe session will start with a brief on the current standards of privacy,\nand the possible risks of handling customer data. This will lay the\nfoundation for introducing Differential Privacy, a cutting-edge\ntechnique of cybersecurity that claims to preserve an individual’s\nprivacy, by manipulating data in such a way as to not render it useless\nfor data analysis. Attendees will gain an insight into the concept of\nDifferential Privacy, how it is employed to minimize the risks\nassociated with private data, its practical applications in various\ndomains, and how Python eases the task of employing it in our models\nwith PyDP. As the talk progresses, a walkthrough of a real-life\npractical example, along with a nifty visualization will acquaint the\naudience with PyDP, and how differential private results come out to be\nin approximation to what unfiltered data would have provided.\n",
    "language": "eng",
    "recorded": "2024-05-17",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2024/schedule/presentation/108/"
        }
    ],
    "speakers": [
        "Vikram Waradpande"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/_OT398icmCA/hqdefault.jpg",
    "title": "You've got trust issues, we've got solutions: Differential Privacy",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=_OT398icmCA"
        }
    ]
}
