{
  "id": 3132, 
  "category": "PyCon AU 2014", 
  "slug": "graphs-networks-and-python-the-power-of-interc", 
  "title": "Graphs, Networks and Python:  The Power of Interconnection by Lachlan Blackhall", 
  "summary": "", 
  "description": "Graph and network structures are everywhere and can be found in social, biological and technological networks that impact us on a daily basis. Understanding, and exploiting, graphical structures creates opportunities for obtaining new analytic insights, implementing new computational paradigms, and better defining the relationship between objects of any sort.\r\n\r\nPython provides access to these graph and network structures using the fantastic NetworkX library (http://networkx.github.io/) .  In this presentation we will give an introduction to the NetworkX library, showing how easy it is to build and exploit simple graphical and network structures.\r\n\r\nFrom that starting point we will then discuss a number of more complicated, real world examples of how the NetworkX library can be used to:\r\n - Analyse social networks to extract valuable information about people / entities within those networks.\r\n - Implement reconfigurable processing pipelines (something we refer to as computational graphs) for data capture, processing and analytics.\r\n - Easily track the relationship between Python objects in a variety of other interesting and useful scenarios.\r\n\r\nThis presentation will be targeted at intermediate developers and no prior experience with graphs, networks or NetworkX is required. This presentation will offer an easy introduction to the world of networks and graphs in Python and will illustrate real world uses of this powerful and useful paradigm.", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/", 
  "thumbnail_url": "http://i.ytimg.com/vi/1q7FBxy1Rds/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://mirror.linux.org.au/pub/pycon-au/pyconau2014/29-out.ogv", 
      "length": null, 
      "type": "ogv"
    }, 
    {
      "url": "http://www.youtube.com/watch?v=1q7FBxy1Rds", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=1q7FBxy1Rds", 
  "tags": [], 
  "speakers": [
    "Lachlan Blackhall"
  ], 
  "recorded": "2014-08-09"
}