{"whiteboard": "needs editing", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon AU 2014", "speakers": ["Arthur Street"], "title": "Science MiniConf: Monte Carlo Business Case Analysis with pandas by Arthur Street", "quality_notes": "", "video_flv_length": null, "recorded": "2014-08-11", "video_mp4_length": null, "description": "Pandas is increasingly becoming a standard tool in scientific computing.  Could it also have a role in the CFO's office?\r\n \r\nCFOs regularly need to analyse the impact of different projects or business cases, and they almost universally do this using spreadsheets.  Spreadsheets have many advantages - they have a low barrier to entry and are easy for most people to understand.  However as they get more complicated, disadvantages start to appear; in particular, they can be inflexible and highly error-prone.\r\n \r\nIn this talk I will explain how business case analysis can be done using python and pandas.  The python version has several advantages over spreadsheets: it is more flexible as the business structure changes; formulas only need to be changed in a single place, reducing the chance of error; and report-ready plots are quick to produce.  I'll go through a way of structuring the problem for some simple business logic, and ways to visualise the results.\r\n \r\nThe example I’ll discuss is made more interesting and useful by being “Monte Carlo” analysis. Traditional business case analysis takes single point estimates of sales, costs and prices, and calculates a single profit forecast. Everybody knows the profit will not turn out to be exactly equal to the forecast.  But it is not clear what the range of profits might be, or how likely a loss is.  \"Monte Carlo\" analysis solves this problem by allowing ranges or distributions on the assumptions; the forecast is then a range of outcomes.\r\n \r\nIn short, I’ll demonstrate how you can use pandas to analyse high-impact business decisions, and dodge many of the problems of using spreadsheets.", "video_mp4_url": "", "tags": [], "copyright_text": "http://www.youtube.com/t/terms", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=KcMaO2f7ww4", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "http://mirror.linux.org.au/pub/pycon-au/pyconau2014/98-out.ogv", "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://i.ytimg.com/vi/KcMaO2f7ww4/hqdefault.jpg", "video_flv_url": ""}