{
  "description": "A Platform to Enable Data Science At Scale in Tesco\nSpeakers: Andrew Garrow, Benjamin Lehne\n\nSummary\nData Science at Tesco spans a variety of business areas and use cases, covering everything from online and stores through to logistics and trading. This talk will provide an overview of our data science platform, giving a detailed view of how this enables Tesco to deliver personalisation to our customers.\n\nDescription\nData Science at Tesco spans a variety of business areas and use cases, covering everything from online and stores through to logistics and trading.\n\nIn data science engineering, we aim to enable data scientists across the entire data science life cycle, from building new predictive models to getting them into a production setting and maintaining. We want to do this faster, better, cheaper. For this purpose we are building a Data Science Framework, where capabilities and components can be reused across projects. This framework spans across several platforms including an on prem big data Spark platform, cloud environments and edge. The primary language used by data science and engineering teams is Python.\n\nIn this talk, we will provide an overview of the platform, giving a detailed view of how this enables Tesco to deliver personalisation to our customers. This includes the development of a Feature Store, model training and evaluation and other aspects of our MLOps stack.\n\nAndrew Garrow's Bio\nAndrew’s main interest is in taking machine learning applications from the lab into production. As Head of Data Science Engineering at Tesco, he is involved in projects ranging from supply chain and logistics through to in-store and online, with technologies covering computer vision, edge computing and big data.\nLinkedIn: https://www.linkedin.com/in/andrew-garrow/\n\nBenjamin Lehne's Bio\nI am a Data Science Manager at Tesco, with a focus on recommender systems. Before I was a commercial Data Scientist, I spent ten years researching genetics and genomics in academia.\nLinkedIn: https://www.linkedin.com/in/benjamin-lehne/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1346,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/in/andrew-garrow/",
      "url": "https://www.linkedin.com/in/andrew-garrow/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://www.linkedin.com/in/benjamin-lehne/",
      "url": "https://www.linkedin.com/in/benjamin-lehne/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/xuCOY7lLdOE/maxresdefault.jpg",
  "title": "A Platform to Enable Data Science At Scale in Tesco | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xuCOY7lLdOE"
    }
  ]
}
