{
  "description": "Anyone GAN Do This: Solving the Minority Class Imbalance Problem Once and for All\nSpeakers: Dipam Paul, Alankrita Tewari\n\nSummary\nIn this talk, our mission is to highlight and try to solve one of the most pressing problems that exist in the world of training and deploying Neural Networks. This problem is called the 'Minority Class Imbalance Problem'. Our proposed technique comprising Deep Generative Models would not just solve the problem but would also show a way to how one can seamlessly attain state-of-the-art accuracy!\n\nDipam Paul's Bio\nCommonly referred to as ‘The Boy from Kolkata’ - Dipam is a recent Engineering graduate with a major in Electronics and Telecommunication from KIIT University, India.\n\nCurrently, he has joined Accenture, India as a Software Engineer. Prior to this, he was working as a Research Assistant @ School of Computer Science, Carnegie Mellon University. He primarily worked on Object Detection problems concerning 3D-Cryo ET data and areas of Deep Active Learning with focus on Dynamically Expandable Networks.\n\nHe has previously worked in and collaborated with labs at Georgia Institute of Technology, Universidade Federal de Sao Paulo, and IIT-Bombay in various roles and capacities.\n\nHaving always been fascinated by the wonders one can do using Python and Data, his periphery of interest largely lies in Deep Learning, Computer Vision, and Intelligence Theory related problems.\n\nIn the pandemic, he spends his days toying around with Deep Generative Models and fine-tuning Neural Nets when he is not eating, raconteuring, or engaging in a lively debate about Geopolitics or Football!\n\nGitHub: https://github.com/dipampaul17//\nTwitter: https://twitter.com/theboyfrom_kol/\nLinkedIn: https://www.linkedin.com/in/dipam-paul-36672b15b/\nWebsite: https://thisisdipam.github.io//\n\nAlankrita Tewari's Bio\n--\nLinkedIn: https://www.linkedin.com/in/alankrita-tewari-a6a82b168/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1225,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/dipam-paul-36672b15b/",
      "url": "https://www.linkedin.com/in/dipam-paul-36672b15b/"
    },
    {
      "label": "https://twitter.com/theboyfrom_kol/",
      "url": "https://twitter.com/theboyfrom_kol/"
    },
    {
      "label": "https://github.com/dipampaul17//",
      "url": "https://github.com/dipampaul17//"
    },
    {
      "label": "https://www.linkedin.com/in/alankrita-tewari-a6a82b168/",
      "url": "https://www.linkedin.com/in/alankrita-tewari-a6a82b168/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://thisisdipam.github.io//",
      "url": "https://thisisdipam.github.io//"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/8UQSyDZzlyI/maxresdefault.jpg",
  "title": "Anyone GAN Do This: Solving the Minority Class Imbalance Problem | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8UQSyDZzlyI"
    }
  ]
}
