{
  "description": "Behind the Black Box: How to Understand Any ML Model Using Shap\nSpeaker: Jonathan Bechtel\n\nSummary\nThis workshop explains how to take the highest performing ML models such as gradient boosting and neural networks and understand what contributes to their predictions at a local and global level to make their output easily understood by practitioners and non-practitioners alike.\n\nDescription\nPart 1: An Introduction to Interpretable ML\n- Interpretability is why bad models are used more than they ought to be\nThe current state of interpreting non-linear ML models, and their major shortcomings\n- What's currently missing in the toolkit for understanding black box ML models\nPart 2: An Introduction to SHAP\n- A brief history of understanding black box models, and how it lead to the need for SHAP\n- Why SHAP is a theoretically sound application of game theory to understand any ML model, regardless of how it generates predictions\n- A close look at SHAP's source code to understand how it's used to compute its results\nPart 3: SHAP in the Wild\n- How to derive local explanations for a single model prediction (or how to be more like linear regression)\n- Creating odds ratios\n- Using SHAP to understand feature interaction effects among correlated data\n- Using SHAP with neural networks and unstructured data: understanding word contributions to a Transformed NLP model\n- Examples of SHAP being used in production\n\nJonathan Bechtel's Bio\nJonathan Bechtel is the lead data science instructor for General Assembly, a global technology education company. He's delivered over 1,000 workshops and corporate trainings to students on the subjects of data science, programming, and machine learning. His corporate trainings have helped companies in the private equity, consulting, accounting and hedge fund industries incorporate analytical toolchains and realize the power of data-driven decision making and business processes.\nGitHub: https://github.com/jonathanbechtel/\nLinkedIn: https://www.linkedin.com/in/jonathan-bechtel-55648a2b/\nWebsite: https://www.jonathanbech.tel/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 6254,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/jonathan-bechtel-55648a2b/",
      "url": "https://www.linkedin.com/in/jonathan-bechtel-55648a2b/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://github.com/jonathanbechtel/",
      "url": "https://github.com/jonathanbechtel/"
    },
    {
      "label": "https://www.jonathanbech.tel/",
      "url": "https://www.jonathanbech.tel/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "Jonathan Bechtel"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ZAFjWlAnQak/maxresdefault.jpg",
  "title": "Behind the Black Box",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZAFjWlAnQak"
    }
  ]
}
