{
  "description": "Best Practices in Machine Learning Observability\nSpeakers: Ankit Rathi, Yatin Bhatia\n\nSummary\nAs more and more organizations are turning to machine learning (ML) to optimize their businesses, they soon realize that building ML proof of concepts in the lab is very different from making models that work in production. Things keep changing in production, impacting model perfomance. Lets explore ways to keep ML models effective in production using ML observability and its best practices.\n\nAnkit Rathi's Bio\nAnkit Rathi is a data science architect, published author & well-known speaker. His interest lies primarily in building end-to-end data science applications/products following best practices of data engineering and architecture.\n\nAnkit’s work at SITA aero has revolved around building FlightPredictor product & strengthening the CoE capability. Earlier as a Principal Consultant at Genpact HCM, Ankit architected and deployed machine learning pipelines for various clients across different industries like Insurance, F&A. He was previously a Tech Lead at RBS IDC where he designed and developed various data-intensive applications in AML & Mortgages area.\n\nAnkit is a published author for various leading publications (check ankitrathi.com/blog) & he is also a regular speaker at various data science conferences (Kaggle Days, PyData, Amity etc). He actively engages the audience on the core concepts & latest trends in data and AI. He is followed by 35K+ data science practitioners & enthusiasts on LinkedIn.\n\nSpecialties: Data Science, Data Architecture, Data Strategy, Big Data, Cloud Computing\n\nTools/Technologies: SQL, Python, R, Spark, Azure, AWS, TensorFlow, Cassandra, Hadoop, Pig, Hive, Tableau, PowerBI, DevOps, CI/CD\n\nGitHub: https://github.com/ankit-rathi/\nLinkedIn: https://www.linkedin.com/in/ankitrathi/\nWebsite: https://ankitrathi.com//\n\nYatin Bhatia's Bio\n• Associate Director - Data Science at Rxlogix. • 15+ years of IT experience. • 9 years of Experience in Machine Learning, Deep Learning, NLP, Big Data. • Handling End to End Data Science Projects. • Areas of Interest: Machine Learning, Data Mining, Data Analytics, Recommender Systems, Enterprise Software Design, Big Data, Statistical Modeling, Deep Learning, Predictive Modeling, Form Processing, OCR Extraction using Tesseract, Abbyy, Nuance, EpheSoft. • Domains: -- Consumer Electronics, Pharma and BFSI\n\nLinkedIn: https://www.linkedin.com/in/yatin-bhatia-241a996/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1545,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://ankitrathi.com//",
      "url": "https://ankitrathi.com//"
    },
    {
      "label": "https://github.com/ankit-rathi/",
      "url": "https://github.com/ankit-rathi/"
    },
    {
      "label": "https://www.linkedin.com/in/ankitrathi/",
      "url": "https://www.linkedin.com/in/ankitrathi/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://www.linkedin.com/in/yatin-bhatia-241a996/",
      "url": "https://www.linkedin.com/in/yatin-bhatia-241a996/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/vPXMwCXT6rU/maxresdefault.jpg",
  "title": "Best Practices: Machine Learning Observability - Ankit Rathi, Yatin Bhatia | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vPXMwCXT6rU"
    }
  ]
}
