{
  "description": "Bridging Data and Business: Power Plant Output Optimization Based on Electricity Market Price\nSpeaker: Sylvia Lee\n\nSummary\n“Success” in a data project may have different meanings. Learn how to set up the best foundations for success in data projects with a business mindset from experienced data analytic consultants and get a full hands-on experience on the complete data analytic process from data ingestion, modeling, to dashboarding on Digital Hub™, a cloud platform for integrated opensource data science tool stack.\n\nDescription\nBridging Data and Business is a tutorial workshop targeted for data scientists, especially for industry professionals with interests in exploring and entering the realm of data science. This tutorial is not designed to dive deep into specific topic of data science, but rather is a comprehensive business-oriented guide on the general data science processes that can be broadly applied to many problems and usecases.\n\nThe tutorial will showcase machine learning modelling process on a power plant energy output prediction usecase1, extended with a business action recommendation logic based on electricity market forecast data2, and cherry-topped with production grade dashboards to communicate valuable insights and business outcomes. This tutorial session aims to guide data enthusiast newcomers through the data analytic processes for practical productive results and trigger attendees’ thoughts and innovations in how to use data science tools and techniques for the best business outcomes. Attendees will also receive introductory exposure and hands-on experience to Digital Hub™ Platform\n\nApproximate breakdown of materials is as following:\n\n0 - 20 min: Introduction to Digital Hub™ data science platform; set contexts with topics on machine learning best practices; summarized processes in business contexts; and lessons learned from experience data analytic consultant\n20 – 60 min: Walk through of solution development on the usecase, demonstrating the process from data ingestion, data exploration, feature engineering, machine learning model fitting, hyperparameter tuning, model validations, and outcome data ingestion into a Postgres database. Showcase extended business analysis with feeding the machine learning predictions into a recommendation engine with energy market forecast price.\n60 – 70 min: Building production grade dashboards in Digital Hub™ Platform\n70 – 90 min: Discussion and Q&A\nThe tutorial will be performed on Digital Hub™ which is a platform that aims to minimize the technical entry barriers to data science by automating the integrations of opensource toolstacks for a complete end-to-end data science pipeline. Users may use the platform with a free-tier subscription3 to follow along the tutorial and get exposure to opensource toolstacks.4\n\n1 Data retrieved from UCI Machine Learning Repository- Combined Cycle Power Plant Data Set\n2 Data retrieved from Alberta Electric System Operator (AESO) Historical Market Reporting\n3 Free-tier subscription includes 40 hours application runtime and 5 GB storage. Any additional usage will induce extra charges\n4 Opensource tool stacks will include JupyterLab, Apache Superset, Grafana and PostgreSQL. Highly technical attendees may choose to install themselves but help on installations and integration problems may receive limited aids in the tutorial.\n\nSylvia Lee's Bio\nI am a data scientist at Integra Data and Analytic Solutions Corp. with a passion for technical research and innovation. I transitioned into data science from biology and hold a Master's Degree in Data Science from UBC. Experiencing the transition firsthand drives my passion for developing Digital Hub™ which aims to simplify this transition by reducing technical barriers.\nLinkedIn: https://www.linkedin.com/in/sylvialee19/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 5032,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/sylvialee19/",
      "url": "https://www.linkedin.com/in/sylvialee19/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/B0MgNqYn15I/maxresdefault.jpg",
  "title": "Bridging Data and Business - Sylvia Lee | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=B0MgNqYn15I"
    }
  ]
}
