{
  "description": "Building a Data-Driven Product from Scratch, How Hard Can It Be?\nSpeaker: Adam Webber\n\nSummary\nAt Blue Yonder we are about to introduce a new data-driven product called Luminate Cognitive Inventory. Leading the data-science team’s contribution to this endeavor, I would like to share some of our experiences gained during the journey from ideation to go-live. Using this real-world example, I will walk you through the various technical and organisational challenges we have faced.\n\nDescription\nAt Blue Yonder we are about to introduce a new data-driven product called Luminate Cognitive Inventory. Leading the data-science team’s contribution to this endeavor, I would like to share some of our experiences gained during the journey from ideation to go-live. Using this real-world example, I will walk you through the various technical and organisational challenges we have faced. Starting with a business problem statement, we must navigate and balance the demands of data wrangling, model building, a customer facing proof-of-concept, and finally a production implementation. To make you curious, let me just mention one piece of advice we would give before you embark on a similar journey yourself: Don’t try to build a product without a first real customer. But if you have such a customer, it is very easy to slip into the trap of building a customer project instead of a product. Balancing this thin line will have much bigger impact on the success of the product than some few percent of model accuracy improvement.\n\nAdam Webber's Bio\nAdam joined Blue Yonder in in 2014 after completing his PhD in particle physics. Back then, Blue Yonder was exploring solutions in a variety of industries in an attempt to find real-world problems that would benefit from a scientific solution. Adam worked as a data-scientist, and subsequently a data-science team lead, delivering proof-of-value projects with close customer interaction. Most notably he led the optimization and onboarding effort for a demand forecasting and auto-replenishment system at Morrisons supermarkets in the UK.\n\nShortly prior to the acquisition of Blue Yonder by JDA in 2018, Adam left the company to explore a role in medical data-science, building solutions to predict rare undiagnosed disease in human populations. But when the dust had settled following the acquisition by JDA (who subsequently re-branded to Blue Yonder), Adam decided to return home to Blue Yonder in 2020 and accepted a role as Senior Staff Data Scientist, with the goal of introducing new data-driven products. Why did he come back? The people, the customers, the tech-stack, and the data. It is a data-scientist’s playground.\n\nLinkedIn: https://www.linkedin.com/in/adam-webber-5728294a/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1752,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/adam-webber-5728294a/",
      "url": "https://www.linkedin.com/in/adam-webber-5728294a/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/bLssuEI8PhU/maxresdefault.jpg",
  "title": "Building a Data-Driven Product from Scratch, How Hard Can It Be? | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bLssuEI8PhU"
    }
  ]
}
