{
  "description": "Building a Sign-to-speech Prototype With Tensorflow and Deepstack: How It Happened & What I Learned\nSpeaker: Steven Kolawole\n\nSummary\nBuilding an E2E working prototype that detects sign language meanings in images/videos and generate equivalent, realistic voice of words communicated by the sign language, in real-time, won't be completed in a day's work. Here I'd explain how it happened and what I learned in the process.\n\nDescription\nI built an end-to-end working prototype that uses Computer Vision to detect sign language meanings in images/live videos and generate equivalent, realistic voice of words communicated by the sign language, while also using Machine Translation to map the returned texts to local African languages (in progress), all in real-time. It was fun. And it was stressful too.\n\nIn this talk, I'd talk about the highs and lows of working on this project while also elaborating on the groundwork, the process, the results, and the future scope of the project.\n\nSteven Kolawole's Bio\nSteven has a skillset in the intersection between Data Science and Software Engineering…So he is, most times, a Machine Learning Engineer, with a strong bias for ML Research these days.\n\nHe is and has been heavily involved in varieties of ML subfields including ML Research, ML Engineering, Software Engineering, Data Engineering, and Data Science/Analytics.\n\nSteven is big on knowledge sharing via community mentorship and collective growth, open-source development, meetups facilitation, speakership, technical writing, ML Research, and passionate about helping tech muggles find their feet.\n\nMoreover, Steven has been trying to gain new hobbies (outside tech) recently. For instance, watching dance tutorials on YouTube, even though he has failed miserably so far.\n\nGitHub: https://github.com/stevekola/\nTwitter: https://twitter.com/steveddev/\nLinkedIn: https://www.linkedin.com/in/steven-kolawole-80/\nWebsite: https://stevenkolawole.medium.com/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1447,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://github.com/stevekola/",
      "url": "https://github.com/stevekola/"
    },
    {
      "label": "https://stevenkolawole.medium.com/",
      "url": "https://stevenkolawole.medium.com/"
    },
    {
      "label": "https://www.linkedin.com/in/steven-kolawole-80/",
      "url": "https://www.linkedin.com/in/steven-kolawole-80/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://twitter.com/steveddev/",
      "url": "https://twitter.com/steveddev/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/OntJWcWP6k0/maxresdefault.jpg",
  "title": "Building a Sign-to-speech Prototype With Tensorflow and Deepstack | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OntJWcWP6k0"
    }
  ]
}
