{
  "description": "Building Linear Programs With Ortools\nSpeaker: Ross Hart\n\nSummary\nLinear programming (LP) and mixed integer linear programming (MILP) are important tools for solving large scale optimisation problems. In this tutorial, the key concepts LP/MILP will be described, and I will walk through an example showing how one might identify and formulate a solution to such a problem. I will then demonstrate how to find an optimal solution using the open source ORTools suite.\n\nDescription\nThe ability to solve mathematical optimisation programs is an important tool for implementing end-to-end Data Science solutions. There are a number of techniques one can use to solve such problems, and one of the most well-known is linear programming, or LP. By formulating an optimisation problem as a set of linear constraints with an objective function to minimise or maximise, one can find an optimal solution to optimisation problems very quickly using LP. This tutorial is aimed at beginners to optimisation/operations research type problems and will introduce participants to LP, and also mixed integer programming (MILP). I will describe the key components of LP/MILP problems, discussing how one might identify such a problem in a Data Science project and how one might try to solve it. I will then walk through a full example solving an LP problem by first formulating the problem on paper before converting the program to machine-solvable code. I will show how one can use the open source ORTools package in Python to interface with a number of free open source MILP/LP solvers to find optimal solutions to operations research problems quickly. At the end of the session, newcomers to optimisation problems should have a firm understanding of how to formulate and solve real world LP/MILP problems, and have hands on experience writing out and solving an example of an LP.\n\nRoss Hart's Bio\nSenior Data Scientist at Tesco, based in Welwyn Garden City in the UK. I studied for a PhD in astrophysics between 2014 and 2018 (which I loved doing), but decided to pursue a career in Data Science after the PhD finished. I have enjoyed working on lots of projects in Data Science, but in the last year I have become particularly interested in mathematical optimisation techniques. I've enjoyed learning about optimisation problems and applying some interesting techniques to solving them in my daily work with the UK-based supermarket Tesco, and I'm looking forward to sharing what I've leanred to a wider audience at pyData this year.\nTwitter: https://twitter.com/RossEHart/\nLinkedIn: https://www.linkedin.com/in/ross-hart-data-scientist/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 4961,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/ross-hart-data-scientist/",
      "url": "https://www.linkedin.com/in/ross-hart-data-scientist/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://twitter.com/RossEHart/",
      "url": "https://twitter.com/RossEHart/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/rA4QHmjqo1c/maxresdefault.jpg",
  "title": "Building Linear Programs With Ortools - Ross Hart | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rA4QHmjqo1c"
    }
  ]
}
