{
  "description": "Collaborative Editing in Jupyter Notebook\nSpeaker: Kevin Jahns\n\nSummary\nJupyter Notebook now allows collaborative editing similar to Google Docs. We are going to talk about how we made Jupyter Notebook collaborative using the Yjs CRDT and about the opportunities, this opens up for extension authors of JupyterLab.\n\nDescription\nCollaborative editing - à la Google Docs - is one of the most requested features in JupyterLab since 2012. There have been many iterations on implementing this feature. In 2021, we finally culminated at a general purpose solution that was merged into JupyterLab.\n\nThe solution we agreed is based on the Yjs CRDT. In this talk we are going to give an overview of the past efforts and the solution we arrived on. We are also going to talk about our future plans that include features like versioning, commenting, and offline editing with JupyterLab.\n\nKevin Jahns's Bio\nI'm an open-source developer working to make the web more collaborative. I authored Yjs - a tool for state synchronization - and I built several extensions that make (rich-) text editors real-time collaborative. This year I worked with Quantstack to make Jupyter Notebooks collaborative.\nGitHub: https://github.com/dmonad/\nTwitter: https://twitter.com/kevin_jahns/\nLinkedIn: https://www.linkedin.com/in/kevin-jahns/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1636,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/dmonad/",
      "url": "https://github.com/dmonad/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/kevin-jahns/",
      "url": "https://www.linkedin.com/in/kevin-jahns/"
    },
    {
      "label": "https://twitter.com/kevin_jahns/",
      "url": "https://twitter.com/kevin_jahns/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/QtoJsK8QYNk/maxresdefault.webp",
  "title": "Collaborative Editing in Jupyter Notebook - Kevin Jahns | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QtoJsK8QYNk"
    }
  ]
}
