{
  "description": "conda-forge in 2021\nSpeaker: Eric Dill\n\nSummary\nConda-forge had its sixth birthday this year and has grown dramatically in those six years. You may already be familiar with conda-forge, you may have contributed a recipe, you may not know what conda-forge is or anything else in-between. This talk is for everyone. In this informative talk we will cover a handful of things: the current statistics and metrics for conda-forge; a brief history of con\n\nDescription\nConda-forge had its sixth birthday this year and has grown dramatically in those six years. You may already be familiar with conda-forge, you may have contributed a recipe, you may not know what conda-forge is or anything else in-between. This talk is for everyone. In this informative talk we will cover a handful of things: the current statistics and metrics for conda-forge; a brief history of conda-forge including why it exists in the first place; all of the different components of conda-forge; and why you might want to get involved and how to do so. There’s really no required knowledge for this talk, though some familiarity with using conda and conda-build will help. By the end of this talk you should feel more comfortable with the conda-forge ecosystem and community. You should feel comfortable knowing where to get started participating in this amazing community.\n\nEric Dill's Bio\nEric is a member of the conda forge core team and has been involved since it’s beginnings at scipy 2015. Professionally, he is currently at Voltron Data product managing their enterprise offering. Previously he has held a variety of roles including Director of data science platform at DTN, Principal Solutions Architect at Anaconda, computational engineer in ad-tech at MaxPoint and assistant scientist and post doc at Brookhaven National Lab. He holds a PhD in Chemistry though was not a particularly good chemist and is much better suited to tech.\nGitHub: https://github.com/ericdill/\nTwitter: https://twitter.com/Chemisist/\nLinkedIn: https://www.linkedin.com/in/eric-d-dill/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1507,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://github.com/ericdill/",
      "url": "https://github.com/ericdill/"
    },
    {
      "label": "https://twitter.com/Chemisist/",
      "url": "https://twitter.com/Chemisist/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/in/eric-d-dill/",
      "url": "https://www.linkedin.com/in/eric-d-dill/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/N2XwK9BkJpA/maxresdefault.webp",
  "title": "conda-forge in 2021 - Eric Dill | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=N2XwK9BkJpA"
    }
  ]
}
