{
  "description": "Cutting Edge Hyperparameter Tuning Made Simple With Ray Tune\nSpeaker: Antoni Baum\n\nSummary\nHyperparameter tuning is a major bottleneck in the machine learning pipeline. We will overview both standard and cutting-edge methods for tuning. Then, we will showcase Ray Tune and its sklearn-wrapper - tune-sklearn - which provide a unified framework for distributed hyperparameter optimization allowing for easy integration within existing scikit-learn based pipelines.\n\nDescription\nModern ML model performance is very dependent on the choice of model hyperparameters and hyperparameter tuning is a major bottleneck in the machine learning pipeline. ML models have hyperparameters that can alter the predictive quality, while gradient boosting models, the current state of the art for tabular data, have multiple hyperparameters that can drastically affect their working.\n\nIn this talk, we will overview standard methods for hyperparameter tuning: grid search, random search, and bayesian optimization. We will also showcase the cutting edge methods such as BOHB, BlendSearch and HyperSched. We will discuss the challenges of using diverse libraries and algorithms in order to experiment and implement cutting edge optimization. Then, we will showcase Ray Tune and its sklearn-wrapper, tune-sklearn, which present a unified API for distributed hyperparameter optimization and how simple tune-sklearn is to use and integrate within existing scikit-learn based pipelines.\n\nThis talk is catered towards data scientists/engineers familiar with the machine learning development process. Newcomers to the field are welcome.\n\nAntoni Baum's Bio\nI'm a Computer Science, Data Science and video game modding enthusiast and a tinkerer at heart. I hold a BSc in Computer Science and Econometrics. I am currently a MSc student at AGH UST in Kraków. I am interested in Machine Learning and how to make it more approachable.\n\nCurrently, I am a Software Engineering Intern @ Anyscale.\n\nAside from my own projects, I have contributed to or took a leading role in several open source projects. The most notable include:\n\n- PyCaret, an open source, low-code machine learning library in Python\n- Ray, an open source framework for building distributed applications\n- tune-sklearn, a scikit-learn API on Ray Tune\n- xgboost-ray, distributed XGBoost on Ray\n- lightgbm-ray, distributed LightGBM on Ray\n- hpbandster-sklearn, a scikit-learn API wrapper for HpBandSter\n\nGitHub: https://github.com/Yard1/\nLinkedIn: https://www.linkedin.com/in/yard1/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1685,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/in/yard1/",
      "url": "https://www.linkedin.com/in/yard1/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/Yard1/",
      "url": "https://github.com/Yard1/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/-uZN_m_pgqw/maxresdefault.jpg",
  "title": "Cutting Edge Hyperparameter Tuning Made Simple With Ray Tune - Antoni Baum | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-uZN_m_pgqw"
    }
  ]
}
