{
  "description": "Darts for Time Series Forecasting\nSpeakers: Julien Herzen, Francesco Lässig\n\nSummary\nThis talk will give an introduction to Darts (https://github.com/unit8co/darts), an open-source library for time series processing and forecasting. Darts provides a wide variety of models and tools under a unified and user-friendly API. We will give a high level introduction to both time series forecasting and the main features of Darts.\n\nDescription\nTime series are everywhere in science and business, and the ability to forecast them accurately and efficiently can provide decisive advantages. Darts is an open-source Python library, which provides a wide variety of forecasting models and tools under a single and user-friendly API. It puts emphasis on reducing the experiment cycle duration and improving the ease of using, comparing and combining different models; from ARIMA to deep learning models.\n\nThis talk will give a tour of Darts and some of its main features, such as: quick creation and comparison of forecasting models, backtesting, ML-based models applied to time series forecasting, training forecasting models on multiple time series, producing probabilistic forecasts and integrating external data. We will go over a few toy examples, and see how to address them in a few lines of code.\n\nGoals of the talk:\n\nIntroduce how one can tackle forecasting problems\nObtain great results quickly in few line of codes\nPre-requisites:\n\nBasic knowledge of Python\nBasic knowledge of data science & machine learning\nKey take-aways:\n\nQuickly create forecasts with your own data\nCompare and select the best models for your tasks\nPotentially integrate additional data such as weather forecasts, GDP, ... into your forecasts to improve them\n\nJulien Herzen's Bio\nJulien is the Lead Data Scientist at Unit8, a Swiss Data Science company. His technical specialties are Machine Learning, algorithms and computational techniques. He is a core developer (and creator) of Darts (https://github.com/unit8co/darts), a time series library, and VeGANs (https://github.com/unit8co/vegans), a generative modelling library. Julien has a PhD in Computer Science from EPFL in Lausanne.\nGitHub: https://github.com/hrzn/\nTwitter: https://twitter.com/jlhrzn/\nLinkedIn: https://www.linkedin.com/in/herzen/\nWebsite: https://hrzn.ch//\n\nFrancesco Lässig's Bio\nFrancesco is a Data Scientist at Unit8 with experience in ML/AI projects in various industries, such as finance, pharma and energy. During his time at Unit8 he has also had the opportunity to become one of the main contributors to the Darts open-source library.\nGitHub: https://github.com/pennfranc/\nLinkedIn: https://www.linkedin.com/in/francesco-laessig/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1696,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://github.com/unit8co/vegans",
      "url": "https://github.com/unit8co/vegans"
    },
    {
      "label": "https://www.linkedin.com/in/francesco-laessig/",
      "url": "https://www.linkedin.com/in/francesco-laessig/"
    },
    {
      "label": "https://github.com/hrzn/",
      "url": "https://github.com/hrzn/"
    },
    {
      "label": "https://github.com/unit8co/darts",
      "url": "https://github.com/unit8co/darts"
    },
    {
      "label": "https://www.linkedin.com/in/herzen/",
      "url": "https://www.linkedin.com/in/herzen/"
    },
    {
      "label": "https://twitter.com/jlhrzn/",
      "url": "https://twitter.com/jlhrzn/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://hrzn.ch//",
      "url": "https://hrzn.ch//"
    },
    {
      "label": "https://github.com/pennfranc/",
      "url": "https://github.com/pennfranc/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/Kf6b5falv0M/maxresdefault.webp",
  "title": "Darts for Time Series Forecasting - Julien Herzen, Francesco Lässig | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Kf6b5falv0M"
    }
  ]
}
