{
  "description": "Dask for Everyone\nSpeaker: Hugo Bowne-Anderson\n\nSummary\nDask has transformed what is possible with Python and Data Science.\n\nHowever, while Dask has solved many of the technical challenges of parallelism, there remain challenges for institutional adoption. How does this get deployed? Is it supported? Is it secure?\n\nThis talk describes Coiled, a company based around Dask, and how it strives to enable the use of Dask by everyone, everywhere.\n\nDescription\nDask has transformed what is possible with Python and Data Science.\n\nHowever, while Dask has solved many of the technical challenges of parallelism, there remain challenges for institutional adoption. How does this get deployed? Is it supported? Is it secure? These questions are relevant for other parts of an organization like management and IT, and have not yet been solved by the open source community.\n\nThis talk describes Coiled, a company based around Dask, and how it strives to enable the use of Dask by everyone, everywhere. We'll dive into the opportunities and challenges of OSS/for-profit collaboration, how Coiled has worked in this space so far, and discuss our roadmap for the future.\n\nHugo Bowne-Anderson's Bio\nHugo Bowne-Anderson is Head of Data Science Evangelism at Coiled, a company that makes it simple for organizations to scale their data science seamlessly. He has extensive experience as a data scientist, educator, evangelist, content marketer, and data strategy consultant at DataCamp, the online education platform for all things data. He also has experience teaching basic to advanced data science topics at institutions such as Yale University and Cold Spring Harbor Laboratory, conferences such as SciPy, PyCon, and ODSC and with organizations such as Data Carpentry. He has developed over 30 courses on the DataCamp platform, impacting over 500,000 learners worldwide through his own courses. He also created the weekly data industry podcast DataFramed, which he hosted and produced for 2 years. He is committed to spreading data skills, access to data science tooling, and open source software, both for individuals and the enterprise.\nGitHub: https://github.com/hugobowne/\nTwitter: https://twitter.com/hugobowne/\nLinkedIn: https://www.linkedin.com/in/hugo-bowne-anderson-045939a5/\nWebsite: http://hugobowne.github.io//\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1525,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://github.com/hugobowne/",
      "url": "https://github.com/hugobowne/"
    },
    {
      "label": "https://twitter.com/hugobowne/",
      "url": "https://twitter.com/hugobowne/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/hugo-bowne-anderson-045939a5/",
      "url": "https://www.linkedin.com/in/hugo-bowne-anderson-045939a5/"
    },
    {
      "label": "http://hugobowne.github.io//",
      "url": "http://hugobowne.github.io//"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/nsYPezDZjxg/maxresdefault.jpg",
  "title": "Dask for Everyone - Hugo Bowne-Anderson | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nsYPezDZjxg"
    }
  ]
}
