{
  "description": "Dask: From POC to Production\nSpeaker: April Rathe\n\nSummary\nDask is a popular library for parallelizing computations in the PyData ecosystem. While we found it easy to demonstrate performance gains in POCs, it was more challenging to use Dask widely across our team. In this talk, we’ll describe our experiences integrating Dask into our environment. We'll provide a roadmap of decisions, development and patterns for taking Dask from POC to production.\n\nDescription\nQuickly analyzing large historical datasets is key to our quantitative investment research efforts. These efforts can be constrained when working with datasets bigger than available memory or by long-running, complex computations. Dask offers easy-to-learn interfaces for parallelizing computations for researchers already familiar with NumPy and Pandas. Library selection was easy; widespread use was harder. There are limited guides available to help navigate the options, decisions and patterns to successfully integrate Dask. In this talk, we aim to provide an example guide for teams looking to enable the use of Dask across their team.\n\nApril Rathe's Bio\nApril Rathe has been developing software in finance for over 15 years. She has extensive experience in designing and developing data platforms and data-intensive applications for investment banks and investments funds. April leads the Research data science platform at Arrowstreet Capital, providing researchers with the latest technologies and techniques in data exploration, analysis, computation, and visualization.\nGitHub: https://github.com/aprilrathe/\nLinkedIn: https://www.linkedin.com/in/april-rathe-2920752/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1548,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/in/april-rathe-2920752/",
      "url": "https://www.linkedin.com/in/april-rathe-2920752/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://github.com/aprilrathe/",
      "url": "https://github.com/aprilrathe/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/5KN5aBMQT18/maxresdefault.webp",
  "title": "Dask: From POC to Production - April Rathe | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5KN5aBMQT18"
    }
  ]
}
