{
  "description": "Data and Tools to Model Pv Systems\nSpeakers: Kevin Anderson, Mark Mikofski, Abhishek Parikh, Silvana Ovaitt\n\nSummary\nPhotovoltaic technology provides 3% of our energy worldwide. From development aspects to deployment and management of assets, PV modeling is a very interesting area with challenges and use of big data from weather to performance monitoring. Modeling tools for all aspects of photovoltaic systems are rapidly growing. This tutorial will focus on teaching attendees PV modeling with open-source python.\n\nDescription\nPhotovoltaic technology currently provides 3% of our energy worldwide, and this clean energy source is projected to continue increasing. From development aspects to deployment and management of assets, PV modeling is a very interesting area with challenges and use of big data from weather to performance monitoring. Modeling tools for all aspects of photovoltaic systems are rapidly growing, and there are solutions for many of the things you might want to simulate. Python is becoming one of the scientific languages of choice, and many open-source tools are available for PV modeling. This tutorial will focus on teaching attendees PV modeling in python through the use of PVlib.\n\nIn this interactive tutorial we will go from getting acquainted with some common data used or measured in pv systems (i.e. weather), to modeling the AC energy output of a single-axis tracker system. This includes learning and simulating sun position, plane of array irradiances, single-diode models, temperature models, and inverter output. We will review common vocabulary around python and common PV data aggregation by hour, week, month, and visualization. The tutorial will finalize with an overview of other available open-source tools for other aspects of modeling PV systems, as well as novel ideas on data science in the PV field.\n\nBios\n[Mark Mikofski] -- I am a principal solar engineer at DNV and product manager for SolarFarmer. I research, analyze, and predict PV system performance, degradation, and reliability. I have contributed to a few Python projects like pvlib python, PVMismatch, and SciPy\n\n[Kevin Anderson] -- I am a research scientist at NREL doing cool stuff! I have contributed to work on slope aware backtracking, clipping loss errors in hourly yield estimates, and am a maintainer for pvlib python and a frequent contributor to RdTools.\n\n[Abhishek Parikh] -- I am Abhi, a solar analyst at DNV. Like many, I love python and try not to miss any opportunity to deploy it’s terrific power in handling the data challenges renewables analytics offer. I want to promote and be a part of collaborations between the amazing worlds of data science and renewables.\n\n[Silvana Ayala] (she/her/ella) -- I am a researcher at the National Renewable Energy Laboratory. I focus on modeling and understanding the performance and reliability of PV modules. In particular, I work a lot with bifacial photovoltaic technology. I am also developing a framework to quantify circularity choices effects on material needs, waste, installed capacity and energy demands for PV.\nLinkedIn: https://www.linkedin.com/in/silvana-ayala/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 5108,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/in/silvana-ayala/",
      "url": "https://www.linkedin.com/in/silvana-ayala/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/sweUakFg3I8/maxresdefault.jpg",
  "title": "Data and Tools to Model Pv Systems | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sweUakFg3I8"
    }
  ]
}
