{
  "description": "Data Engineering for Successful Machine Learning\nSpeaker: Vini Jaiswal\n\nSummary\nFrom this session, you will be able to learn: - Concepts of designing a pristine data pipeline for Machine Learning applications - Evolution of data landspace from Base to ACID, datawarehouse to lakehouses - Overview of modern data technologies like Apache Spark, cloud services like AWS/GCP/Azure, Delta Lake etc - Best practices for Data Engineering and ML lifecycle\n\nDescription\nFor any data applications, data engineering is a critical component to enhance the Machine learning, data science or analytics projects. For Machine Learning or any downstream applications, if you get the data right, most of your problems are solved at the beginning of designing the pipeline. In this talk, we’ll discuss the concepts of databases and data warehousing and how modern applications have evolved to use lakehouses. This talk will focus on some core concepts of designing data pipelines, explanation of under the hood processings like ACID, MVCC algorithm, data formats, as well as some of the best practices that guarantees a pristine data lake for successful Machine Learning applications. For the attendees from software engineering background, they can get a view of how the data engineering world goes through similar process of SDLC like implementation, assessment, change, and improvement of the data life cycle process itself.\n\nVini Jaiswal's Bio\nVini Jaiswal is a Senior Developer Advocate at Databricks, where she helps data practitioners to be successful in building on technologies like Apache Spark, Delta Lake, Databricks, MLflow, and other data technologies. She has extensive experience of 9+ years in the Data world and has worked with Unicorns, Digital Natives, and some of the Fortune 500 companies for successful implementation of Data and AI use cases in production at scale for on-premise and cloud deployments. Prior to Databricks, Vini was Citi’s VP Engineering Lead for Data Science, where she drove the product engineering efforts to architect a highly scalable Data Science Platform, microservice architecture on Global cloud deployment leading many projects to successful completion. She also interned as a Data Analyst at Southwest Airlines and holds an MS in Information Technology and Management from the University of Texas at Dallas. Currently, she is co-authoring a Data engineering book called \"Delta Lake: The Definitive Guide\" by O'Reilly.\n\nIn addition, during the Covid-19 pandemic, she volunteered as a technical advisor for DS4C (Data Science for Covid-19), a non-profit organization founded by data analysts and machine learning researchers (PhDs) who wanted to contribute to fighting COVID-19.\n\nGitHub: https://github.com/vinijaiswal/\nTwitter: https://twitter.com/vini_jaiswal/\nLinkedIn: https://www.linkedin.com/in/vinijaiswal/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1942,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://www.linkedin.com/in/vinijaiswal/",
      "url": "https://www.linkedin.com/in/vinijaiswal/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/vini_jaiswal/",
      "url": "https://twitter.com/vini_jaiswal/"
    },
    {
      "label": "https://github.com/vinijaiswal/",
      "url": "https://github.com/vinijaiswal/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "Vini Jaiswal"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ogkC1bp117c/maxresdefault.jpg",
  "title": "Data Engineering for Successful Machine Learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ogkC1bp117c"
    }
  ]
}
