{
  "description": "Data Science in the Enterprise: A Holistic Approach\nSpeaker: Gaby Lio\n\nSummary\nAs a data scientist, it is paramount to establish cross-functional teams who are champions of what you are building. In this talk, we address common challenges and what to do about them, with a focus on data science methodologies, patterns, and best practices. We also address how to structure and position your team to successfully move a project from an exploratory phase to production-facing.\n\nDescription\nEven after successful exploratory analysis, a vast majority of data science projects still do not make it to production. No matter how outstanding the technical merit and capability, data science projects must also focus and deliver in two key areas – people and process – to truly make a valuable business impact. It takes an entire team who is educated, accountable, and focused on driving value to deliver a data science project past an exploratory phase and into production.\n\nIn this talk, you will learn about the challenges of building data science solutions in large enterprises, including the criticality and methods to achieve buy-in across all levels of an organization. Then you will learn about the key differences between exploratory and production model building approaches, which focus on engaging the right team and adapting techniques for engagement. We will wrap up by walking through a real-world example, showcasing a recent project focused on anomaly detection with IoT data.\n\nGaby Lio's Bio\nGaby Lio is a Sr. Data Scientist who helps lead the AI and Automation team at CGI. Her experience spans many industries including healthcare, pharmaceuticals, and oil and gas. She uses her knowledge in data analytics and predictive modeling to transform immense amounts of data into information, enabling her clients to more effectively draw conclusions, build models, and report findings through visualizations.\n\nAside from implementing data driven solutions, she also acts as a thought leader guiding her clients through analytic strategy discussions and sharing her knowledge with the community.\n\nGitHub: https://github.com/gabriellalio/\nLinkedIn: https://www.linkedin.com/in/gabriella-lio-a1721895/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1739,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://github.com/gabriellalio/",
      "url": "https://github.com/gabriellalio/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/gabriella-lio-a1721895/",
      "url": "https://www.linkedin.com/in/gabriella-lio-a1721895/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/OAbjGlyHDhA/maxresdefault.webp",
  "title": "Data Science in the Enterprise: A Holistic Approach - Gaby Lio | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OAbjGlyHDhA"
    }
  ]
}
