{
  "description": "Data Analysis with Pandas and NumPy\nSpeakers: Nimrita Koul\n\nSummary\nThe tutorial demonstrates how to use the Pandas and NumPy libraries for effective data analysis.\n\nDescription\nWe will walk through a Python Data Analysis Project demonstrating following tasks - - Creation of Multi-dimensional Arrays using NumPy We will create Ndarray using built-in NumPy methods taking data from basic Python objects like lists, dictionaries and sets. - Perform Arithmetic Operations on Arrays We will perform the arithmetic operations on Ndarray and store the results - Perform Slicing and Indexing on Arrays We will demonstrate integer based and Boolean indexing on Ndarray as well as methods for slicing - Creation of Data frames and Series Objects using Pandas We will demonstrate creation of Data Frames from basic Python objects, CSV and Excel Files. And creation of Series objects. - Perform Data Pre-Processing on a Data Frame We will demonstrate operations like handling of missing values, normalization, standardization, categorical encoding of data in a Data Frame. - Visualize Data in a DataFrame We will plot regression and correlation plots to demonstrate the relationships in data columns in a data frame.\n\nNimrita Koul's Bio\nNimrita Koul is an Assistant Professor in the School of Computer Science and Engineering, REVA University, Bangalore, India. She is B.E (Computer Science and Engineering, Gold Medalist), M.Tech (Computer Science and Engineering, Gold Medalist) and pursuing her research in Computational Cancer Biology. Nimrita has an academic experience of 15years with 35 peer reviewed publications and 1 patent. Her research interests include Machine Learning and Bioinformatics. She is an investigator for two research projects funded by Department of Science and Technology, Government of India.\nLinkedIn: https://www.linkedin.com/in/nimritakoul/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 5273,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://www.linkedin.com/in/nimritakoul/",
      "url": "https://www.linkedin.com/in/nimritakoul/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/T4SR8pBvMLU/maxresdefault.webp",
  "title": "Data Analysis with Pandas and NumPy - Nimrita Koul | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=T4SR8pBvMLU"
    }
  ]
}
