{
  "description": "Deep Learning-aided Drug Discovery\nSpeaker: Magdalena Wiercioch\n\nSummary\nDuring our presentation we will share the results and experiences connected with implementing state-of-the-art model for cheminformatics process development using deep neural networks.\n\nDescription\nThe accurate prediction of molecular properties is a critical ingredient toward the societal and technological progress since it could speed up much research progress, such as drug designing and substance discovery. Also, it would cause more initiatives towards a personalized medicine. However, complete exploring “chemical universes” that potentially include infinite sets of compounds seems to be computationally intractable. Obviously, researchers and pharmaceutical industries around the world have brought various methodologies to explore the chemical space that can be categorized into two groups, i.e., in silico and in vitro that includes combinatorial libraries, or high throughput screening. In recent years, advances in the development of deep learning models have spawned a mass of promising methods to address the molecular property prediction task. During our presentation we will introduce the related background and share the experiences connected with implementing one of the models that learns and predicts molecular properties on unseen data. Furthermore, we will also provide the results and compare them with the state-of-the-art results from other works.\n\nMagdalena Wiercioch's Bio\nMy name is Magdalena Wiercioch. I am a software engineer and a machine learning scientist. In particular, I am interested in:\n\ndeveloping & applying machine learning techniques to enhance drug discovery;\nunderstanding the process of natural language learning, including embedding spaces and how they relate to language concepts;\nexplainable ML to extract human-understandable insights from any machine learning model behavior.\n\nGitHub: https://github.com/magdalenawi/\nTwitter: https://twitter.com/mkwiercioch/\nLinkedIn: https://www.linkedin.com/in/magdalena-wiercioch/?originalSubdomain=pl\nWebsite: https://sites.google.com/view/mwier/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1626,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/magdalena-wiercioch/?originalSubdomain=pl",
      "url": "https://www.linkedin.com/in/magdalena-wiercioch/?originalSubdomain=pl"
    },
    {
      "label": "https://github.com/magdalenawi/",
      "url": "https://github.com/magdalenawi/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://twitter.com/mkwiercioch/",
      "url": "https://twitter.com/mkwiercioch/"
    },
    {
      "label": "https://sites.google.com/view/mwier/",
      "url": "https://sites.google.com/view/mwier/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/tya5Wf8b1vA/maxresdefault.jpg",
  "title": "Deep Learning-aided Drug Discovery - Magdalena Wiercioch | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tya5Wf8b1vA"
    }
  ]
}
