{
  "description": "Deep Neural Deduplication\nSpeaker: Marcin Mosiolek\n\nSummary\nEffective identification of duplicated content is inherent in processing large amounts of text documents, such as web pages, articles or contracts. Recently, our team has developed a solution exploiting contrastive learning techniques to find duplicated content among thousands of construction documents in a blink of an eye. The talk shares our experience and introduces into contrastive learning.\n\nDescription\nOne of our clients is a company processing a tremendous amount of unstructured data collected from the Internet. They fetch construction-related articles to be the first to know about new opportunities and further share this information with construction firms. This way, they offer the most up-to-date information regarding the market, and their customers get immediate and high-quality news regarding bids that might be of interest to them.\n\nAs the company collects the information from different sources, some inconsistencies may appear in the collected data. The same construction investment might be expressed in varying words or slightly altered data fields depending on the data source. It's just like one asked two different persons to describe the same situation - probably each description would be somewhat different than the other.\n\nIn such circumstances, duplicates are expected. It means the same bid or project may appear multiple times in moderately different forms coming from other data sources. Therefore, there is a need for an efficient deduplication algorithm to ensure the high quality of the offered information. This talk explains how we built one by leveraging deep neural networks and contrastive learning. Moreover, it provides a gentle introduction into the concepts of contrastive techniques.\n\nMarcin Mosiolek's Bio\nMarcin is an AI Architect with over ten years of experience collected in various machine learning projects, including natural language processing and computer vision. In his daily job, he converts the latest academic research into operating products and leads teams of AI experts. Marcin is currently working on an unstructured documents understanding and semantic search engine for the polish language. Both projects touch multiple areas of NLP, such as coreference resolution, unsupervised learning for sentence embeddings, document deduplication, etc. Previously, he built AI solutions for medical documents verification and many computer vision projects, such as the perception module of an autonomous car.\nLinkedIn: https://www.linkedin.com/in/marcinmosiolek/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1766,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://www.linkedin.com/in/marcinmosiolek/",
      "url": "https://www.linkedin.com/in/marcinmosiolek/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/yOAmZ6ebKkI/maxresdefault.webp",
  "title": "Deep Neural Deduplication - Marcin Mosiolek | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yOAmZ6ebKkI"
    }
  ]
}
