{
  "description": "Lessons Learned From Deploying Machine Learning in an Old-fashioned Heavy Industry\nSpeaker: Robert Meyer\n\nSummary\nThe road from prototype Machine Learning models in a notebook to a full-fledged pipeline running 24/7 in a production environment is long and winding. I present tough lessons we had to learn while developing and deploying ML in the old-fashioned industry of cement production. These range from how less time is spent on models vs. infrastructure to unexpected interactions of customers with ML.\n\nDescription\nIn December 2018 my co-founder and I launched alcemy, a Machine Learning startup for the cement and concrete supply chain. I experienced first hand moving from a simple proof of concept, a ML model inside a Jupyter notebook, to a full-fledged pipeline running 24/7 and steering massive amounts of cement production in real plants. I can tell you the road was long and winding. I want to share some of the hard lessons we learned along the way with you. If you are an aspiring ML or Software Engineer, Data Scientist, Entrepreneur, or you are just wondering how Machine Learning applied in the wild looks like this talk is for you. No prior knowledge is required except some familiarity with basic concepts and terminology of Machine Learning.\n\nRobert Meyer's Bio\nI am a Data Scientist and Neuroscience researcher by training. I did my PhD at TU Berlin and simulated parts of the cat brain. A small Python open source package of mine to help with any numerical simulation can be found here: https://github.com/SmokinCaterpillar/pypet\n\nI am interested in a variety of topics such as Machine Learning for NLP (https://www.youtube.com/watch?v=zFScws0mb7M), cryptocurrencies (https://www.youtube.com/watch?v=sVxT11xJuC4) or combining both: https://github.com/SmokinCaterpillar/TrufflePig.\n\nAfter working for the German unicorn Flixbus for 2 and half years building an automated bus ticket pricing pipeline, I co-founded alcemy, a Machine Learning startup for the cement and concrete supply chain.\n\nThe cement industry is one of the biggest CO2 emitters in the world, responsible for about 8% of worldwide emissions. Releasing carbon into the atmosphere is inherent to the process of cement production and cannot simply be remedied by switching from fossil fuels to renewable energy sources. Hence, to reduce emissions, CO2 heavy ingredients of cement - these are burnt limestone and slag - need to be substituted with low-carbon materials, such as limestone powder (which isn't burnt, and therefore doesn't release carbon into the atmosphere). Together with our partners we are currently piloting a novel concrete with a 60% reduced carbon footprint. However, adding low-carbon materials makes cement and concrete production much harder (!) as low-carbon mixtures require much more precision and oversight at every production step. Thus, at alcemy - besides cement and concrete recipe know-how - we provide cloud infrastructure, data intelligence, and predictive control software to enable the cement and concrete supply chain to produce low carbon building materials at scale.\n\nGitHub: https://github.com/SmokinCaterpillar/\nLinkedIn: https://www.linkedin.com/in/robert-meyer-alcemy/\nWebsite: https://alcemy.tech/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1702,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.youtube.com/watch?v=sVxT11xJuC4",
      "url": "https://www.youtube.com/watch?v=sVxT11xJuC4"
    },
    {
      "label": "https://github.com/SmokinCaterpillar/",
      "url": "https://github.com/SmokinCaterpillar/"
    },
    {
      "label": "https://www.youtube.com/watch?v=zFScws0mb7M",
      "url": "https://www.youtube.com/watch?v=zFScws0mb7M"
    },
    {
      "label": "https://github.com/SmokinCaterpillar/pypet",
      "url": "https://github.com/SmokinCaterpillar/pypet"
    },
    {
      "label": "https://www.linkedin.com/in/robert-meyer-alcemy/",
      "url": "https://www.linkedin.com/in/robert-meyer-alcemy/"
    },
    {
      "label": "https://github.com/SmokinCaterpillar/TrufflePig.",
      "url": "https://github.com/SmokinCaterpillar/TrufflePig."
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://alcemy.tech/",
      "url": "https://alcemy.tech/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/lt-ABfIWv1M/maxresdefault.jpg",
  "title": "Deploying ML in an Old-fashioned Heavy Industry - Robert Meyer | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lt-ABfIWv1M"
    }
  ]
}
