{
  "description": "Designing Functional Data Pipelines for Reproducibility and Maintainability\nSpeaker: Chin Hwee Ong\n\nSummary\nDesigning reliable and extensible data pipelines at scale is often a challenge, as testing and debugging across compute units are often complex and time-consuming due to dependencies at runtime. In this talk, I will be exploring how the use of functional programming design patterns in Python/Spark enables us to build production-ready data pipelines that are reproducible and maintainable at scale.\n\nDescription\nWhen building data pipelines at scale, it is crucial to design data pipelines that are reliable, scalable and extensible according to evolving business needs. Designing data pipelines for reproducibility and maintainability is a challenge, as testing and debugging across compute units (threads/cores/computes) are often complex and time-consuming due to dependencies and shared states at runtime. In this talk, I will be sharing about common challenges in designing reproducible and maintainable data pipelines at scale, and exploring the use of functional programming in Python and Apache Spark to build scalable production-ready data pipelines that are designed for reproducibility and maintainability. Through analogies and realistic examples inspired by data pipeline designs in production environments, you will learn about:\n\nWhat is Functional Programming, and how it differs from other programming paradigms\nKey Principles of Functional Programming\nHow \"control flow\" is implemented in Functional Programming\nFunctional design patterns for data pipeline design in Python and Apache Spark, and how they improve reproducibility and maintainability\nWhether it is possible to write a purely functional program\nThis talk assumes basic understanding of building data pipelines with functions and classes/objects. While the main target audience are data scientists/engineers and developers building data-intensive applications, anyone with hands-on experience in imperative programming (including Python) would be able to understand the key concepts and use-cases in functional programming.\n\nChin Hwee Ong's Bio\nChin Hwee Ong is a data engineer and aspiring polymath who happens to have a background in aerospace engineering and computational modelling. As a 90% self-taught programmer, Chin Hwee is currently learning Scala for functional programming and has a not-so-secret wish of making data pipelines run faster.\nGitHub: https://github.com/hweecat/\nTwitter: https://twitter.com/ongchinhwee/\nLinkedIn: https://www.linkedin.com/in/ongchinhwee/\nWebsite: https://ongchinhwee.me/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1698,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://twitter.com/ongchinhwee/",
      "url": "https://twitter.com/ongchinhwee/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://ongchinhwee.me/",
      "url": "https://ongchinhwee.me/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/ongchinhwee/",
      "url": "https://www.linkedin.com/in/ongchinhwee/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://github.com/hweecat/",
      "url": "https://github.com/hweecat/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/FD6RJrqTZ2Q/maxresdefault.jpg",
  "title": "Designing Functional Data Pipelines for Reproducibility and Maintainability | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FD6RJrqTZ2Q"
    }
  ]
}
