{
  "description": "🦉DVC Showcase – Who Moved My Data? 🗂\nSpeaker: Dean Pleban\n\nSummary\nBuilding fully versioned & reproducible machine learning projects is important, but it's not an easy task. It can help you connect to your production pipelines, make sense of your data, and work more effectively as a team. If you want to learn how to use DVC to achieve reproducible & versioned ML projects, not just at a theoretical level, but how it actually works in reality, this talk is for you!\n\nDescription\nBuilding fully versioned & reproducible machine learning projects is important, but not an easy task.\n\nOne tool that can help you get there is DVC. DVC is one of the most widely adopted solutions to manage data, model, and artifact versions, as well as build reproducible data pipelines. Its community has over 8000 members, and it's used by organizations all over the world.\n\nIf you always wanted to understand how DVC works, when to use it, and how it can help your data science or machine learning workflow – this talk is for you.\n\nIn this talk, I will give an overview of the data science workflow, and focus on the challenge of reproducibility and versioning. I will present DVC, an open source tool built to handle these issues in data science projects. I'll explain the simple operating principles of the tool, and the benefits gained from using it. Then, I'll pop the hood and present some of the internals of DVC, to make sure you get a good grasp of how it works. I'll discuss DVC's pros and cons, and present another open source tool called FDS, which combines Git and DVC into one, easier to use solution.\n\nDean Pleban's Bio\nAlways learning and a builder at heart. Dean has worked on quantum optics and communication, computer vision, software development, and design – taking a multi-disciplinary approach and applying it to build products for data scientists and machine learning engineers.\n\nDean is currently the CEO & Co-Founder of DagsHub, a platform for data scientists and machine learning engineers, combining popular open-source tools and formats, to version their data, models, experiments, and code.\n\nGitHub: https://github.com/deanp70/\nTwitter: https://twitter.com/DeanPlbn/\nLinkedIn: https://www.linkedin.com/in/deanpleban/\nWebsite: https://dagshub.com/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 5376,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/deanpleban/",
      "url": "https://www.linkedin.com/in/deanpleban/"
    },
    {
      "label": "https://dagshub.com/",
      "url": "https://dagshub.com/"
    },
    {
      "label": "https://github.com/deanp70/",
      "url": "https://github.com/deanp70/"
    },
    {
      "label": "https://twitter.com/DeanPlbn/",
      "url": "https://twitter.com/DeanPlbn/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/S_NEOdlGCrY/maxresdefault.webp",
  "title": "🦉DVC Showcase – Who Moved My Data? 🗂 - Dean Pleban | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=S_NEOdlGCrY"
    }
  ]
}
