{
  "description": "Enterprise Machine Learning Pipelines with Unstructured Image Data\nSpeakers: Jacqueline Nolis, Chase Ginther\n\nSummary\nLearn to build a machine learning data pipeline that trains a convolutional neural network to classify images. This talk will describe new technologies to aid machine learning practitioners in managing and using unstructured data and discuss applications to real-world business scenarios.\n\nDescription\nWhile many machine learning tasks work well with tabular data, data scientists in many industries and sectors need to model other types of data, such as images and videos, to achieve business goals. For example, retail businesses frequently need to serve appropriate, relevant visuals to customers in the online purchasing funnel. Using machine learning to support this can reduce human toil and allow business to scale at a click, but at the same time if the data is poorly managed it can cause compliance, reproducibility, and security problems.\n\nIn this talk, attendees will learn how to effectively manage and use unstructured data for machine learning in enterprise settings. The data pipeline will use new Snowflake storage technology connected with the Saturn Cloud platform to train a convolutional neural network to classify images. The machine learning demonstrations will use GPUs and Dask clusters to highlight performance possibilities while also relating to real-world business use cases.\n\nAttendees will leave with practical skills for applying image classification to their business, including using unstructured data storage and cloud based machine learning tools. This session is recommended for attendees with some experience using Python for machine learning, but no experience with the other tools is necessary to get value from the talk.\n\nJacqueline Nolis's Bio\nDr. Jacqueline Nolis has over 15 years of experience in managing data science teams and projects at companies ranging from DSW to Airbnb. She currently is the Head of Data Science at Saturn Cloud where she helps design products for data scientists. Jacqueline has a PhD in Industrial Engineering and coauthored the book Build a Career in Data Science. For fun she likes to use data science for humor—like using deep learning to generate offensive license plates or making an R package to send physical postcards.\nGitHub: https://github.com/jnolis/\nTwitter: https://twitter.com/skyetetra/\nLinkedIn: https://www.linkedin.com/in/jnolis/\nWebsite: https://jnolis.com/\n\nChase Ginther's Bio\nChase Ginther has spent his career working on a wide variety of machine learning projects and is particularly passionate about MLOps and ML platforms. Prior to joining Snowflake, he was the engineering manager leading Deloitte’s AI Center of Excellence platform engineering team. There he was responsible for building an internal best of breed ML platform based on open source tools. He also spent significant time in Deloitte’s Government and Public Sector practice where he helped found and build Deloitte’s Fraud, Waste, and Abuse / Program Integrity product. Prior to Deloitte, Chase was at Nielsen, where he researched and developed demographic models to predict the demographics of households based on television viewing data. He later helped architect this solution and build it in AWS to enable the future of dynamically inserted advertisements for live TV. Throughout his career as an engineer, he has acquired deep technical experience in Python, Docker, Kubernetes, AWS (EC2, Redshift, Sagemaker, ECS, Lambda, among others), Pytorch, Tensorflow, and most recently Snowflake.\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1579,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://jnolis.com/",
      "url": "https://jnolis.com/"
    },
    {
      "label": "https://twitter.com/skyetetra/",
      "url": "https://twitter.com/skyetetra/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/jnolis/",
      "url": "https://github.com/jnolis/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://www.linkedin.com/in/jnolis/",
      "url": "https://www.linkedin.com/in/jnolis/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/Ihsx268EkMo/maxresdefault.webp",
  "title": "Enterprise Machine Learning Pipelines with Unstructured Image Data | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ihsx268EkMo"
    }
  ]
}
