{
  "description": "Feature Stores: an Operational Bridge Between Machine Learning Models and Data\nSpeakers: Jules S. Damji, Danny Chiao\n\nSummary\nFeature stores have emerged as a pivotal component in the modern machine learning stack, as more data scientists and engineers work together to operationalize ML. Associated with this task are some operational challenges. The toughest challenges for operationalizing ML is data: how to compute and select features, store, validate serve, discover and share them.\n\nDescription\nFeature stores have emerged as a pivotal component in the modern machine learning stack, as more data scientists and engineers work together to operationalize ML. Associated with this task are some operational challenges. The toughest challenges for operationalizing ML is data: how to compute and select features, store, validate serve, discover and share them.\n\nIn this talk you will learn:\n\nwhat key problems feature stores solve to operationalize ML\nwhy features stores are a pivotal components in the model machine learning stack\ncommon key use cases and deployment patterns for feature stores observed by the MLOps and ML practitioners\nhow feature stores are playing a transformational role with the rise of modern data platforms\nget a glimpse into a popular open source feature store Feast\n\nJules S. Damji's Bio\nJules S. Damji is a staff developer advocate at Tecton Inc and an MLflow contributor. He is a hands-on developer with over 25 years of experience and has worked at leading companies, such as Sun Microsystems, Netscape, @Home, Opsware/LoudCloud, VeriSign, ProQuest, Hortonworks, and Databricks, building large-scale distributed systems. He holds a B.Sc and M.Sc in computer science (from Oregon State University and Cal State, Chico respectively), and an MA in political advocacy and communication (from Johns Hopkins University).\nGitHub: https://github/dmatrix/\nTwitter: https://twitter.com/2twitme/\nLinkedIn: https://www.linkedin.com/in/dmatrix/\n\nDanny Chiao's Bio\nDanny Chiao is an engineering lead at Tecton/Feast Inc and a Feast contributor. Previously, Danny was a technical lead at Google working on end to end machine learning problems within Google Workspace, helping build privacy-aware ML platforms / data pipelines and working with research and product teams to deliver large-scale ML powered enterprise functionality. Danny holds a Bachelor’s degree in Computer Science from MIT.\nGitHub: https://github.com/adchia/\nLinkedIn: https://www.linkedin.com/in/danny-chiao/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1629,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/in/danny-chiao/",
      "url": "https://www.linkedin.com/in/danny-chiao/"
    },
    {
      "label": "https://twitter.com/2twitme/",
      "url": "https://twitter.com/2twitme/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/adchia/",
      "url": "https://github.com/adchia/"
    },
    {
      "label": "https://github/dmatrix/",
      "url": "https://github/dmatrix/"
    },
    {
      "label": "https://www.linkedin.com/in/dmatrix/",
      "url": "https://www.linkedin.com/in/dmatrix/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/_omcXenypmo/maxresdefault.jpg",
  "title": "Feature Stores: an Operational Bridge Between ML Models and Data | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_omcXenypmo"
    }
  ]
}
