{
  "description": "Football Analytics Using Hierarchical Bayesian Models in PyMC\nSpeaker: Meenal Jhajharia\n\nSummary\nWe deconstruct the basics of Bayesian hierarchical modeling and then use Fantasy Premier League statistics to construct a model in PyMC that tries to guess the remaining season's results. Along the way, we talk about crucial modeling choices,\n\nDescription\nSports analytics is a growing arena for data analysts nowadays, and obviously, the Bayesians are coming for it! We will take a good look at data and figure out what matters for predicting points. No worries if you are not a football fan: we will take a quick look at the rules. In this talk we demystify partial pooling, priors, and other fancy terms statisticians use. Once we have some imperfect but somewhat functional predictive outcomes, we try to understand our results and takeaways. If you want to get started with (or build a bit on) Bayesian statistics or if you are just excited about football, this will be fun.\n\nMeenal Jhajharia's Bio\nMeenal is a 19 year old CS and Math Undergrad. She spent this summer extending time series modeling capabilities in PyMC under the Google Summer of Code, she is also a core contributor of the PyMC project\nGitHub: https://github.com/mjhajharia/\nTwitter: https://twitter.com/meenaljhajharia/\nLinkedIn: https://www.linkedin.com/in/meenal-jhajharia-a95185190/\nWebsite: https://mjhajharia.com//\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1742,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://twitter.com/meenaljhajharia/",
      "url": "https://twitter.com/meenaljhajharia/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://mjhajharia.com//",
      "url": "https://mjhajharia.com//"
    },
    {
      "label": "https://github.com/mjhajharia/",
      "url": "https://github.com/mjhajharia/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://www.linkedin.com/in/meenal-jhajharia-a95185190/",
      "url": "https://www.linkedin.com/in/meenal-jhajharia-a95185190/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/PPQ7RykrYK8/maxresdefault.jpg",
  "title": "Football Analytics Using Hierarchical Bayesian Models in PyMC | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PPQ7RykrYK8"
    }
  ]
}
