{
  "description": "Foundational Infrastructure to Create a Successful Data Science Team\nSpeakers: Ethan Swan, Brad Boehmke, Gus Powers\n\nSummary\nData scientists in a large team often spend a substantial amount of their time solving a set of common, organization-specific issues: data wrangling, connections to external systems, and logging configuration, among others. At 84.51˚, our team has spent years abstracting away these tasks into common tooling across the organization. We'll share our experience and the best practices we've developed.\n\nDescription\nData scientists in a large team often spend a substantial amount of their time solving a set of common, organization-specific issues: data wrangling, connections to external systems, and logging configuration, among others. While every use case is not identical, foundational tooling that simplifies or abstracts away these common tasks can greatly improve the productivity of data scientists in an organization.\n\nAt 84.51˚, our team is responsible for designing and implementing this infrastructure for a department of over 250 data scientists. We maintain about 15 heavily-used packages, web apps, code templates, and other tools, which are collectively used approximately 5,000 times per day. Through our experience, we've learned the principles of building out (and maintaining!) a rich ecosystem of tooling that users appreciate, and during this talk we'll share our own journey and recommendations for other organizations that could benefit from something similar.\n\nThe majority of this talk will be high level, without much code shared. While we will discuss our internal infrastructure, we'll dedicate the majority of the session to concrete advice and refer to our own experience mainly as supporting evidence.\n\nEthan Swan's Bio\nI'm a data scientist at 84.51˚, the marketing analytics agency of the Kroger grocery chain. There, I build packages and other tools to simplify day-to-day work the other 250 or so data scientists. On the side, I teach Python for data science at the University of Cincinnati and occasionally do some consulting work.\n\nBeyond data science, I tinker with web development and systems administration using Python, and in my time away from a computer, I like running, frisbee, and basketball.\n\nGitHub: https://github.com/augustopher/\nLinkedIn: https://www.linkedin.com/in/august-powers-09717481/\n\nGitHub: https://github.com/eswan18/\nTwitter: https://twitter.com/eswan18/\nLinkedIn: https://www.linkedin.com/in/ethanpswan/\nWebsite: https://ethanswan.com/\n\nBrad Boehmke's Bio\nI am an Associate Director of Data Science at 84.51°, which is the data science \"arm\" of Kroger, the largest supermarket retailer in the US and the second largest general retailer. I lead a small, remote team focused on developing and maintaining internal Python packages and tools that help 84.51°'s data scientist scale their work. I am also an Adjunct Professor at the University of Cincinnati and University of Dayton where I teach various programming and machine learning courses.\nGitHub: https://github.com/bradleyboehmke/\nTwitter: https://twitter.com/bradleyboehmke/\n\nGus Powers's Bio\nLead Data Scientist at 84.51º, on the Advanced Programming and Technology Solutions team. We build and maintain the central tools, including Python packages, used by data scientists and other users throughout the company.\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1985,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://twitter.com/eswan18/",
      "url": "https://twitter.com/eswan18/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://www.linkedin.com/in/ethanpswan/",
      "url": "https://www.linkedin.com/in/ethanpswan/"
    },
    {
      "label": "https://ethanswan.com/",
      "url": "https://ethanswan.com/"
    },
    {
      "label": "https://github.com/bradleyboehmke/",
      "url": "https://github.com/bradleyboehmke/"
    },
    {
      "label": "https://twitter.com/bradleyboehmke/",
      "url": "https://twitter.com/bradleyboehmke/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://github.com/eswan18/",
      "url": "https://github.com/eswan18/"
    },
    {
      "label": "https://www.linkedin.com/in/august-powers-09717481/",
      "url": "https://www.linkedin.com/in/august-powers-09717481/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://github.com/augustopher/",
      "url": "https://github.com/augustopher/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/vM26QPTOPVk/maxresdefault.jpg",
  "title": "Foundational Infrastructure to Create a Successful Data Science Team | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vM26QPTOPVk"
    }
  ]
}
