{
  "description": "From Jupyter Notebooks To JetBrains DataSpell\nSpeaker: Andrey Cheptsov\n\nSummary\nDataSpell is a new IDE by JetBrains built specifically for data scientists. Learn what DataSpell brings for those who are doing exploratory data analysis and prototyping ML models.\n\nDescription\nJetBrains DataSpell is a new IDE from JetBrains. It combines the interactivity of Jupyter Notebooks with the intelligent coding assistance of PyCharm, all within one IDE. In his talk, Andrey, PyCharm Product Manager, will explain how this new IDE is different from PyCharm and Jupyter Notebooks, and what it brings for those who are doing exploratory data analysis and prototyping ML models.\n\nAndrey Cheptsov's Bio\nAndrey Cheptsov is a software engineer who has worked as a product manager at JetBrains for the last ten years. Andrey has worked with multiple teams at JetBrains, including IntelliJ IDEA, DataGrip, GoLand, PyCharm, and now JetBrains DataSpell. Andrey is passionate about data science and the tools that make data scientists happier and more productive.\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1699,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/h13f6oTmy7A/maxresdefault.jpg",
  "title": "From Jupyter Notebooks To JetBrains DataSpell - Andrey Cheptsov | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=h13f6oTmy7A"
    }
  ]
}
