{
  "description": "GPU development with Python 101\nSpeaker: Jacob Tomlinson\n\nSummary\nWriting GPU code in Python is easier today than ever, and in this tutorial, I will share what I’ve learned and how you can get started with accelerating your code. You don't need to learn C++ and you don't need any special tooling. All you need is an NVIDIA GPU, Python and a few libraries (and we'll provide that for the tutorial).\n\nDescription\nWriting GPU code in Python is easier today than ever!\n\nI joined NVIDIA in 2019 and I was brand new to GPU development. In that time, I’ve gotten to grips with the fundamentals of writing accelerated code in Python. I was amazed to discover that I didn’t need to learn C++ and I didn’t need new development tools. Writing GPU code in Python is easier today than ever, and in this tutorial, I will share what I’ve learned and how you can get started with accelerating your code.\n\nWe will work through various materials and examples to get you started with GPU development in Python using open source libraries.\n\nTentative schedule:\n\nIntro to GPUs (20 mins)\nWriting low level GPU code in Python with Numba (30 mins)\nInspecting your GPU usage with pyNVML (10 mins)\nWriting high level GPU code in Python with RAPIDS (30 mins)\nAttendees will be expected to have a general knowledge of Python and programming concepts, but no GPU experience will be necessary. Our key takeaway for attendees will be the knowledge that they don’t have to do much differently to get their code running on a GPU.\n\nJacob Tomlinson's Bio\nJacob Tomlinson is a senior Python software engineer at NVIDIA with a focus on deployment tooling for distributed systems. His work involves maintaining open source projects including RAPIDS and Dask. RAPIDS is a suite of GPU accelerated open source Python tools which mimic APIs from the PyData stack including those of Numpy, Pandas and SciKit-Learn. Dask provides advanced parallelism for analytics with out-of-core computation, lazy evaluation and distributed execution of the PyData stack. He also tinkers with the open source chatbot automation framework Opsdroid in his spare time. Jacob volunteers with the local tech community group Tech Exeter and lives in Exeter, UK.\n\nGitHub: https://github.com/jacobtomlinson/\nTwitter: https://twitter.com/_jacobtomlinson/\nWebsite: https://jacobtomlinson.dev/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 5054,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://jacobtomlinson.dev/",
      "url": "https://jacobtomlinson.dev/"
    },
    {
      "label": "https://github.com/jacobtomlinson/",
      "url": "https://github.com/jacobtomlinson/"
    },
    {
      "label": "https://twitter.com/_jacobtomlinson/",
      "url": "https://twitter.com/_jacobtomlinson/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "Jacob Tomlinson"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/aIFjEK7p9Zw/maxresdefault.jpg",
  "title": "Gpu Development with Python 101",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aIFjEK7p9Zw"
    }
  ]
}
