{
  "description": "Graph Thinking\nSpeaker: Paco Nathan\n\nSummary\nGraph Thinking provides a conceptual framework for solving complex analytics problems with graph technologies. This talk explores this conceptual approach, along with popular open source libraries in Python that provide graph technologies, and the kglab integration project which ties them into the PyData stack. We'll also look at common use cases in industry for graph data science.\n\nDescription\nThis talk explores graph thinking as a way to conceptualize problems that can be solved using graph technologies. Parallels can be found in learning theory, for example how people organize knowledge into graph-like cognitive structures as they progress from novice to practitioner to expert levels in a given field. We'll show a survey of popular open source libraries in Python for different aspects of graph technologies, along with the kglab abstraction layer that integrates these into the PyData stack. To put this all into context, we'll review a set of common use cases in industry and how graph data science practices can be built using Python open source.\n\nPaco Nathan's Bio\nManaging Partner at Derwen. Lead committer PyTextRank, kglab. Core expertise in data science, natural language, cloud computing; ~40 years tech industry experience, ranging from Bell Labs to early-stage start-ups. Advisor for Amplify Partners, Recognai, KUNGFU.AI, Primer. Formerly: Director of Community Evangelism @ Databricks and Apache Spark.\n\nGitHub: https://github.com/ceteri/\nTwitter: https://twitter.com/pacoid/\nWebsite: https://derwen.ai/paco\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1729,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/ceteri/",
      "url": "https://github.com/ceteri/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://twitter.com/pacoid/",
      "url": "https://twitter.com/pacoid/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://derwen.ai/paco",
      "url": "https://derwen.ai/paco"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/bqku2a7ScXg/maxresdefault.jpg",
  "title": "Graph Thinking - Paco Nathan | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bqku2a7ScXg"
    }
  ]
}
