{
  "description": "Graphs for Data Science with NetworkX (pre-recorded)\nSpeaker: Bruno Gonçalves\n\nSummary\nThis tutorial is pre-recorded.\n\nThis tutorial will use Python's NetworkX to build your understanding of graph analysis using real world datasets. You'll see how each algorithm and technique can be applied to extract information in practical setting (airline transportation network, bitcoin transaction network, open street map, twitter social network, etc) so that you can quickly deploy them in your own work.\n\nDescription\nGraphs are simple concepts: a set of individual Nodes (components) connected by Edges (relationships). In this very simplicity lies their power. They can describe the structure of our friendships, connections between airports, the spread of diseases from person to person, the relation of one concept to another, how species interact in an ecosystem or how computers communicate to form the World Wide Web.\n\nNetworks are the fundamental language of our increasingly complex world and the key to successfully understand it. By exploring in detail the way graphs can be used to explore, describe, analyze and understand empirical datasets we will put you at the forefront of this growing field.\n\nIn this tutorial we will use Python's NetworkX to build our understanding of network representations and algorithms by exploring real world network datasets such as the airline transportation network, the bitcoin transaction network, the road network of open street map, etc. Through this practical approach attendees will better understand the fundamental ideas and concepts that lie at the base of our increasingly complex world and take the first steps towards being at the forefront of this growing field.\n\nThe tutorial is split into 4 sections of ~20m each where we learn about specific topics of graph analysis by exploring a real world dataset, from the basic ELT all the way to the final insights and visualizations.\n\nBruno Gonçalves's Bio\nBruno Gonçalves is currently a Senior Data Scientist working at the intersection of Data Science and Finance. Previously, he was a Data Science fellow at NYU's Center for Data Science while on leave from a tenured faculty position at Aix-Marseille Université. Since completing his PhD in the Physics of Complex Systems in 2008 he has been pursuing the use of Data Science and Machine Learning to study Human Behavior. Using large datasets from Twitter, Wikipedia, web access logs, and Yahoo! Meme he studied how we can observe both large scale and individual human behavior in an obtrusive and widespread manner. The main applications have been to the study of Computational Linguistics, Information Diffusion, Behavioral Change and Epidemic Spreading. In 2015 he was awarded the Complex Systems Society's 2015 Junior Scientific Award for \"outstanding contributions in Complex Systems Science\" and in 2018 is was named a Science Fellow of the Institute for Scientific Interchange in Turin, Italy.\nGitHub: http://github.com/DataForScience//\nTwitter: https://twitter.com/bgoncalves/\nLinkedIn: https://www.linkedin.com/in/bmtgoncalves/\nWebsite: https://graphs4sci.substack.com/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 5106,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://www.linkedin.com/in/bmtgoncalves/",
      "url": "https://www.linkedin.com/in/bmtgoncalves/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://twitter.com/bgoncalves/",
      "url": "https://twitter.com/bgoncalves/"
    },
    {
      "label": "http://github.com/DataForScience//",
      "url": "http://github.com/DataForScience//"
    },
    {
      "label": "https://graphs4sci.substack.com/",
      "url": "https://graphs4sci.substack.com/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/9fnBuvV39aY/maxresdefault.webp",
  "title": "Graphs for Data Science with NetworkX - Bruno Gonçalves | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9fnBuvV39aY"
    }
  ]
}
