{
  "description": "Image Classification in Retail: Lessons From the Real World\nSpeakers: Valentina Bono, Paul Klinger\n\nSummary\nDeep learning, and specifically convolutional neural networks, are now standard techniques for tackling computer vision tasks. Their results on benchmarks are impressive, but moving from curated standard datasets to a messy real-world setting still presents challenges. We explore some of the challenges encountered when deploying a grocery products classifier to a live in-store environment.\n\nDescription\nDeep learning, and specifically convolutional neural networks, are now standard techniques for tackling computer vision tasks. Their results on benchmarks are impressive, but moving from curated standard datasets to a messy real-world setting still presents challenges.\n\nIn this talk we explore some of the challenges encountered when deploying a simple model to a live in-store environment, specifically for the task of classifying grocery products.\n\nThe talk will cover: * Difficulties obtaining & preprocessing data, especially when dealing with legacy data sources. * Unanticipated situations encountered in real world data. * Label quality (both from automatic systems and due to differences in interpretation with human labelers) * Dealing with highly imbalanced datasets. * Distribution shift when deploying models to new (even very similar) settings\n\nWe will finish with some future perspectives, looking at the general problem of classifying the whole range of 10s of thousands of products sold in a large store.\n\nValentina Bono's Bio\n--\n\nPaul Klinger's Bio\nData Scientist @ Tesco\nGitHub: https://github.com/PaulKlinger/\nWebsite: https://paulklinger.com/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1674,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/PaulKlinger/",
      "url": "https://github.com/PaulKlinger/"
    },
    {
      "label": "https://paulklinger.com/",
      "url": "https://paulklinger.com/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/QVSdwtFN8uI/maxresdefault.jpg",
  "title": "Image Classification in Retail - Valentina Bono, Paul Klinger | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QVSdwtFN8uI"
    }
  ]
}
