{
  "description": "Impact of Noisy Data on Support Vector Machine and Deep Learning Algorithms on Edge Computing Device\nSpeaker: Dr. Shrirang Ambaji Kulkarni\n\nSummary\nEdge Computing augments the capabilities of cloud computing. In the present talk Raspberry Pi is considered as a edge gateway device with capabilities to process data and build predictive models. Support Vector Machine(SVM) a machine learning algorithm with pipeline architecture will be analyzed with respect to deep learning algorithm in the presence of noise and for computational time.\n\nDescription\nEdge Computing can augment the computational capabilities of cloud computing. It would be possible to build predictive models on the edge for sensitive data. However the underlying dataset may be affected by noise during data collection from the sensors. Noise in data is some unwanted delta random addition to the original data which makes it corrupt or unusable. This has repercussions for machine learning algorithms where by, the presence of noise could lead to trouble in training on the data and may at times lead to overfitting. Also this may reduce the capacity to generalize on the new data. Support Vector Machine (SVM) is a popular machine learning algorithm that is effective in high-dimensional space. The advantages of SVM is its stellar performance and brilliant results. However the downside of it is the training time required and sensitivity to noise. Also the advent of Deep Learning Algorithms has made SVM to take a back-seat. This talk focuses on the performance of Pipelined SVM with Deep-Learning Multi-Layer Perceptron in the presence of white Gaussian noise on a Raspberry Pi. Also the visualization of metrics will provide an interesting insights on the impact of noise on both the algorithms along with computational time used.\n\nDr. Shrirang Ambaji Kulkarni's Bio\nDr. Shrirang A. Kulkarni is currently working as a Post-Doctoral Fellow with the School of Global Health Management and Informatics, University of Central Florida. Before joining UCF he has worked as an Associate Professor with the Department of Computer Science and Engineering at National Institute of Engineering, Mysore, India. He earned his Ph.D. in Computer and Information Science from Visvesvaraya Technological University in the year 2012. His current research work includes developing new algorithms for analysis of healthcare data using machine learning.\nGitHub: https://github.com/drshrirang//\nTwitter: https://twitter.com/shriranga12/\nLinkedIn: https://www.linkedin.com/in/dr-shrirang-kulkarni-a392604b/\nWebsite: https://ccie.ucf.edu/ucf-informatics-lab/team/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1647,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://ccie.ucf.edu/ucf-informatics-lab/team/",
      "url": "https://ccie.ucf.edu/ucf-informatics-lab/team/"
    },
    {
      "label": "https://twitter.com/shriranga12/",
      "url": "https://twitter.com/shriranga12/"
    },
    {
      "label": "https://github.com/drshrirang//",
      "url": "https://github.com/drshrirang//"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://www.linkedin.com/in/dr-shrirang-kulkarni-a392604b/",
      "url": "https://www.linkedin.com/in/dr-shrirang-kulkarni-a392604b/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/EE5AK5FcmYw/maxresdefault.webp",
  "title": "Impact of Noisy Data - Dr. Shrirang Ambaji Kulkarni | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EE5AK5FcmYw"
    }
  ]
}
