{
  "description": "Interpretable ML Models at Scale\nSpeaker: Aishwarya Agrawal\n\nSummary\nIn this talk a participant can expect to understand the following: 1. Building a self service interpretable ML framework for stakeholders 2. Incorporating feedback and autoML workflows 3. Interpretable ML supporting early data/concept drift detection\n\nThis talk will take a deep dive into the thought process involved in the system's design, the application and the importance of designing such.\n\nDescription\nBuilding an interpretable system\nSummarized explanations of the predictions\nRunning multiple inference models in production\nLessons learnt while optimizing interpretable AI at scale\nWith the increase in machine learning models being used in a variety of business applications, the need to make explainable ML inference is ever evident. Reducing risk, ethical ML, avoiding biases, debugging bad predictions etc are usually cited as key reasons for model interpretability. Making it interpretable i.e. approachable to end users makes it more acceptable to anyone involved or affected by the algorithm. Even more critical are ML models built for domains heavy on compliance and low tolerance to false positives - like healthcare.\n\nIn some cases this is not just a drive toward being more ethical but the need of the business itself. We need to be able to showcase where decisions are being made and how they are being made.\n\nEpisource’s Machine learning and NLP platform serves a wide variety of ML based solutions and provides ML inference on healthcare data. Since the model impacts business workflows and revenue outcomes directly, stakeholders deem explanations for each inference as important as the inference itself.\n\nDuring this talk, a participant can expect to understand the following: 1. Building a self service interpretable ML framework for stakeholders 2. Incorporating feedback and autoML workflows 3. Interpretable ML supporting early data/concept drift detection\n\nThis talk will take a deep dive into the thought process involved in the system's design, the application and the importance of designing such a system.\n\nAishwarya Agrawal's Bio\nAishwarya is a data scientist at Episource LLC with 2+ years of experience around building machine learning and data-driven solutions that provide inference on healthcare data. She is now delivering and maintaining end to end ML solutions.\nLinkedIn: https://www.linkedin.com/in/aishwaryaagrawal/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1583,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/aishwaryaagrawal/",
      "url": "https://www.linkedin.com/in/aishwaryaagrawal/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "Aishwarya Agrawal"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/GcMPSdxSjkE/maxresdefault.jpg",
  "title": "Interpretable ML Models at Scale",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GcMPSdxSjkE"
    }
  ]
}
