{
  "description": "Introduction to Distance Metric Learning\nSpeaker: Dor Kedem\n\nSummary\nMetric learning, a supervised branch of representation learning, is a useful dimensionality reduction approach to learn a meaningful representation of your data. It's used both for visualization purposes of high-dimensional datasets, and in several applications in computer vision, NLP & recommendation engines. Join us, and add this useful and underutilized tool to your data scientist's toolkit.\n\nDescription\nIn this tutorial will cover several topics:\n\nDistances: definitions, examples, parameterized distances & the Mahalanobis distance\nGoing from learning meaningful distances to learning meaningful transformations\nManifold learning vs. Distance Metric Learning (DML): Similarities & differences\nLinear (metric-learn) & non-linear (pytorch-metric-learning) metric learning examples\nWe'll combine all that goodness in a notebook, together with an NLP example to classify customer service queries, and using state-of-the-art sentence transformers & an interactive visualization library, we'll showcase how DML can utilize supervision improve on the general-purpose sentence embedding.\n\nDor Kedem's Bio\nDor Kedem is currently managing a data science and engineering team in ING Bank in Amsterdam, dealing with mitigating the financial criminal risk for our bank, detecting money laundry risk and helping our KYC analysts to make our bank more compliant and our society safer.\n\nWith nearly 2 decades of experience working in IT, big data applications and data science, Dor would present an introduction on metric learning, a topic he has researched and utilized in a professional setup.\n\nDor is always happy to have a conversation on interesting topics - so reach out to him before or after the talk to discuss the overlap of engineering and data science, data science use cases in a banking domain and in anti-money-laundering (AML) in specific, or to share opinions on favorite board games, professional wrestling moments, or recommendations of the best cheesecake and tiramisu places in the Amsterdam region.\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 5138,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/vkjwHTpqZfQ/maxresdefault.jpg",
  "title": "Introduction to Distance Metric Learning - Dor Kedem | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vkjwHTpqZfQ"
    }
  ]
}
