{
  "description": "Introduction to Unsupervised and Semi-Supervised Learning in TensorFlow\nSpeaker: Andrew Shao\n\nSummary\nGathering high-quality labelled data in Deep Learning is both difficult and expensive, giving rise to the need for unsupervised and semi-supervised learning, which leverages unlabelled data to solve a variety of problems or improve current models. In this tutorial, we will learn and train models in TensorFlow with many unsupervised and semi-supervised learning methods, such as pseudo-labelling.\n\nDescription\nABSTRACT\nGathering high-quality labelled data in Deep Learning is both difficult and expensive, giving rise to the need for unsupervised and semi-supervised learning, which leverage unlabelled data to solve a variety of problems or improve current models. In this tutorial, we will learn and train models in TensorFlow with many unsupervised and semi-supervised learning methods, such as pseudo-labelling.\n\nDESCRIPTION\nFirstly, we will cover the wide landscape of learning, touching on topics such as supervised learning, unsupervised learning, and semi-supervised learning.\n\nAfterwards, we will cover Unsupervised Learning in a Clustering sense, leveraging Deep Learning to boost performance of the standard KNN algorithm.\n\nIn the second part of the talk, we will dive into Unsupervised Generation of Data, covering Deep Unsupervised GANS, and creating fake data to boost performance\n\nFinally, we will touch on a few semi-supervised techniques, and learn about a few examples where Deep Semi-Supervised Learning has made a large impact on various Kaggle Competitions.\n\nAndrew Shao's Bio\nHey! My Name is Andrew Shao and I'm a High School Deep Learning Practitioner who recently placed Finalists at Hack the North! I specialize in Computer Vision and TensorFlow and am currently studying at Athabasca University!\nLinkedIn: https://www.linkedin.com/in/andrew-shao-7653591b4/\nWebsite: https://www.shaobotics.ca/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1657,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/andrew-shao-7653591b4/",
      "url": "https://www.linkedin.com/in/andrew-shao-7653591b4/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://www.shaobotics.ca/",
      "url": "https://www.shaobotics.ca/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/yjRm174OVq0/maxresdefault.jpg",
  "title": "Introduction to Unsupervised and Semi-Supervised Learning in TensorFlow - PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yjRm174OVq0"
    }
  ]
}
