{
  "description": "Jupyterlite: Jupyter ❤️ Webassembly ❤️ Python\nSpeaker: Jeremy Tuloup, Madhur Tandon, Martin Renou\n\nSummary\nJupyterLite is a JupyterLab distribution that runs entirely in the web browser, backed by in-browser language kernels including the WebAssembly powered Pyodide kernel.\n\nJupyterLite enables data science and interactive computing with the PyData scientific stack, directly in the browser, without installing anything or running a server.\n\nJeremy Tuloup's Bio\nJeremy Tuloup is a Scientific Software Developer at QuantStack and a Jupyter Distinguished Contributor. Maintainer and contributor of JupyterLab, JupyterLite, Voilà, and many projects within the Jupyter ecosystem.\nGitHub: https://github.com/jtpio/\nTwitter: https://twitter.com/jtpio/\n\nMadhur Tandon's Bio\nMadhur has been involved in numerous open source projects in the python scientific ecosystem. Besides core Data Science and Machine Learning, He is also interested in tools that enable and enhance a data scientists' workflow and experience.\n\nHe has previously worked with:\n\nINCF (International Neuroinformatics Coordinating Facility) with Prof. Daniele Marinazzo where he published a python package known as rsHRF (available on pip and docker).\n\nLast summer, he worked with with Mozilla with Michael Droettboom (the ex-lead developer of the matplotlib library). He developed a new backend renderer for matplotlib based on the APIs of HTML5 canvas element.\n\nBased on this work, he was invited to San Francisco to work with Deepnote (YC-S19) with Jakub Jurovych (CEO, Forbes 30 under 30) and served as a technical consultant there.\n\nCurrently, he is working as a Scientific Software Development Engineer with QuantStack, Paris with Sylvain Corlay.\n\nHe has also been a speaker at the PyData Delhi Annual Conference twice, where he spoke about Building a binary adder with RNNs and the plotly dash framework. He also spoke at JupyterCon 2020 on XVega: A C++ backend for the Vega-Lite visualisation system.\n\nA few other experiences also include working with Elucidata, TCS Research, Data Science for India, etc.\n\nGitHub: https://github.com/madhur-tandon/\nTwitter: https://twitter.com/mad_tandon/\nLinkedIn: https://www.linkedin.com/in/madhur-tandon/\n\nMartin Renou's Bio\nMartin Renou is a Scientific Software Developer at QuantStack. Prior to joining QuantStack, Martin also worked as a Software Developer at Enthought. He studied at the French Aerospace Engineering School ISAE-Supaero, with a major in autonomous systems and programming.\n\nAs an open-source developer, Martin has worked on a variety of projects, such as ipygany (a 3-D mesh visualization library for the Jupyter Notebook), ipympl (an interactive Matplotlib backend for Jupyter) and ipycanvas (interactive canvas library).\n\nGitHub: https://github.com/martinRenou/\nTwitter: https://twitter.com/martinRenou/\nLinkedIn: https://www.linkedin.com/in/martin-renou/\n\nThorsten Beier's Bio\nThorsten Beier is a Scientific Software Developer at QuantStack. He got his PhD at the University of Heidelberg (Germany) on Multicut Algorithms for Neurite Segmentation. Thorsten is contributed to various open source projects for image processing and discrete optimization. He is coauthor of OpenGM2, a library for inference in discrete graphical models, author of Nifty, a library for graph based image processing and contributor to VIGRA, a generic image processing library.\nGitHub: https://github.com/DerThorsten/\nTwitter: https://twitter.com/ThorstenBeier/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1755,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/martinRenou/",
      "url": "https://twitter.com/martinRenou/"
    },
    {
      "label": "https://github.com/DerThorsten/",
      "url": "https://github.com/DerThorsten/"
    },
    {
      "label": "https://twitter.com/ThorstenBeier/",
      "url": "https://twitter.com/ThorstenBeier/"
    },
    {
      "label": "https://www.linkedin.com/in/madhur-tandon/",
      "url": "https://www.linkedin.com/in/madhur-tandon/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://github.com/jtpio/",
      "url": "https://github.com/jtpio/"
    },
    {
      "label": "https://twitter.com/jtpio/",
      "url": "https://twitter.com/jtpio/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/in/martin-renou/",
      "url": "https://www.linkedin.com/in/martin-renou/"
    },
    {
      "label": "https://github.com/martinRenou/",
      "url": "https://github.com/martinRenou/"
    },
    {
      "label": "https://twitter.com/mad_tandon/",
      "url": "https://twitter.com/mad_tandon/"
    },
    {
      "label": "https://github.com/madhur-tandon/",
      "url": "https://github.com/madhur-tandon/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/EzclRzL8rt0/maxresdefault.jpg",
  "title": "Jupyterlite: Jupyter ❤️ Webassembly ❤️ Python | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EzclRzL8rt0"
    }
  ]
}
