{
  "description": "Lightning Talks Day 2 Session 1\nSpeakers: Miki Tebeka, Dana Averbuch, Evgeny Karev, hassaku, Ilana Tuil, Jeremy John Selva, Meshva Patel, Nicolo Musmeci, Pranav Kompally, Shivay Lamba\n\nSummary\nLightning Talks are short 5-10 minute sessions presented by community members on a variety of interesting topics.\n\nDescription\nOrder of Presentations\n\nMiki Tebeka - Using IPython as Presentation Tool\nDana Averbuch - Take a Deep Berth and Let’s Dive Into the Matching Algorithm for Marina’s\nJeremy John Selva - Tips and advice when creating a python software for lab members to use in academia\nPranav Kompally - Project Nirvana : A Podcast Summariser\nhassaku - Improving accessibility for data science with graph sonification library\nMeshva Patel - Data Analytics in Healthcare\nIlana Tuil - Productizing Wav2Vec 2.0: challenges and considerations\nShivay Lamba - Tensorflow For the Web : Converting Python Machine Learning Models to Javascript using TFJS Converte\nEvgeny Karev - Livemark: markdown for data journalism and documentation writing\nNicolo Musmeci -Modelling and data visualisation for commodity trading\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 4774,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Ni6-HRKwP4w/maxresdefault.jpg",
  "title": "Lightning Talks Day 2 Session 1 | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ni6-HRKwP4w"
    }
  ]
}
