{
  "description": "Lightning Talks Day 3 Session 1\nSpeakers: Svea Marie Meyer, Abhilash Babu, Achilleas Koutsou, Brian Cechmanek, Christian Juncker Brædstrup, Diego Arenas, Farooq Shaikh, Guzal Bulatova, John McCambridge, Marek Suppa, Michael Sonntag, Mika Pflüger, Sarah Schuhegger, Sebastian M. Ernst\n\nSummary\nLightning Talks are short 5-10 minute sessions presented by community members on a variety of interesting topics.\n\nDescription\nOrder of Presentations\n\nSvea Marie Meyer, Guzal Bulatova - Sktime - a Unified Toolbox for Machine Learning with Time Series Data\nSarah Schuhegger - Automatic body part recognition for medical images with python r\nChristian Juncker Brædstrup - Stau - lightweight job orchestration for data science workloads\nFarooq Shaikh - Building a Meta Forecasting Model with Prophet and LSTM for Time series Forecasting\nAbhilash Babu - Using scikit-learn models in a C/C++ application\nBrian Cechmanek - Pointer Generator Summarisation and Explainability for Legal Documents\nDiego Arenas - Automating the Exploration of Databases for Data Science with AEDA\nMika Pflüger, Achilleas Koutsou, Michael Sonntag - gin@home: run your own research data management platform\nSebastian M. Ernst - Amazing things your (Unix) operating system can do for you: POSIX shared memory\nMarek Suppa - Adapters: A neat (and production-enabling) trick for multi-task and multi-lingual NLP\nJohn McCambridge - Lightweight and Automated Exploratory Data Analysis\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 6572,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    }
  ],
  "speakers": [
    "Svea Marie Meyer",
    "Abhilash Babu",
    "Achilleas Koutsou",
    "Brian Cechmanek",
    "Christian Juncker Brædstrup",
    "Diego Arenas",
    "Farooq Shaikh",
    "Guzal Bulatova",
    "John McCambridge",
    "Marek Suppa",
    "Michael Sonntag",
    "Mika Pflüger",
    "Sarah Schuhegger",
    "Sebastian M. Ernst"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/PsCKG8EZIfw/maxresdefault.jpg",
  "title": "Lightning Talks Day 3 Session 1",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PsCKG8EZIfw"
    }
  ]
}
