{
  "description": "Machine Learning Lifecycle Made Easy with MLflow\nSpeakers: Karishma Babbar, Kalyan Munjuluri\n\nSummary\nBeyond the usual concerns in software development, machine learning development comes with additional challenges. These include trying multiple algorithms and parameters to get the best results, track these runs for reproducibility, and moving the model to diverse deployment environments. This tutorial provides a hands-on experience of managing the complete machine learning lifecycle using MLflow.\n\nDescription\nIn theory, the crux of machine learning (ML) development lies with data collection, model creation, model training, and deployment. In reality, machine learning projects are not so straightforward. They are a cycle iterating between improving the data, model, and evaluation that is never really finished. Unlike in traditional software development, ML developers experiment with multiple algorithms, tools, and parameters to optimize performance, and they need to track these experiments to reproduce work. Furthermore, developers need to use many distinct systems to productionize models.\n\nIn this tutorial, we introduce MLflow, an open-source platform that aims at simplifying the entire ML lifecycle where we can use any ML library and development tool of our choice to reliably build and share ML applications. MLflow offers simple abstractions through lightweight APIs to package reproducible projects, track results, and encapsulate models that are compatible with existing tools, thereby, accelerating ML lifecycle of any size.\n\nWith the help of an example, we will show how using MLflow can ease bookkeeping of experiment runs and results across frameworks, quickly reproducing runs on any platform (cloud or local execution), and productionizing models on diverse deployment tools.\n\nAt the end of this tutorial, you will be familiar with –\n\nKey concepts, abstractions, and components of open-source MLflow\nHow each component of MLflow addresses challenges of ML lifecycle\nHow to use MLflow Tracking during model training to record experimental runs\nHow to use MLflow Tracking User Interface to visualize experimental runs with different tuning parameters and evaluation metrics\nHow to use MLflow Projects for packaging reusable and reproducible models\nHow to use MLflow Models general format to serve models using MLflow REST API\nThe purpose of the tutorial is to introduce the audience to MLflow and give a taste of the ML development lifecycle. It is intended at providing a breadth than depth survey of MLflow platform, and we leave the audience to experiment with it further through a takeaway exercise.\n\nKarishma Babbar's Bio\nKarishma is currently working as a Machine Learning Specialist at S&P Global Market Intelligence, India. Her work is focused on developing data extraction solutions using machine learning and natural language processing generating significant client revenue. She comes from an engineering background with around ~4 years of experience in the data science domain. When she is not in front of a screen, she enjoys volunteering for women empowerment and diversity causes.\nLinkedIn: https://www.linkedin.com/in/karishma-babbar/\n\nKalyan Munjuluri's Bio\nKalyan is a Machine Learning Specialist at S&P Global Market Intelligence with 5 years of experience working at the intersection of Data Science & Automation for various domains. His work involves developing data extraction models and building human-in-the-loop pipelines. He spends his spare time listening to podcasts of Data Skeptic, Joe Rogan, Naval Ravikant and countless more.\nLinkedIn: https://www.linkedin.com/in/kalyanmunjuluri/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 5176,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/karishma-babbar/",
      "url": "https://www.linkedin.com/in/karishma-babbar/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://www.linkedin.com/in/kalyanmunjuluri/",
      "url": "https://www.linkedin.com/in/kalyanmunjuluri/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/WbicniUy_u0/maxresdefault.jpg",
  "title": "Machine Learning Lifecycle Made Easy with MLflow | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WbicniUy_u0"
    }
  ]
}
