{
  "description": "ML in Production – Serverless and Painless\nSpeaker: Oliver Gindele\n\nSummary\nProductionising machine learning pipelines can be a daunting and difficult task for Data Scientists.. In this session, Oliver will walk through some of the best serverless options on how to put python based ML pipelines into operation in the cloud.\n\nDescription\nProductionising machine learning pipelines can be a daunting and difficult task for Data Scientists. Fortunately, many novel tools and technologies have become available in the past years to address this issue and make it easier than ever to deploy ML models into production, without the need to configure servers. In this session, Oliver will walk through some of the best serverless options on how to operationalize ML pipelines within the Tensorflow ecosystem and on Google Cloud Platform, based on actual case studies.\n\nOne of these real-life case studies will dive into the journey of a global cosmetics brand to become packaging-free with the help of ML. The first step towards this goal allows customers to view product information simply by taking a picture. This completely eliminates the need for packaging and labels in stores. However, in order to do this effectively, an accurate image classification model, accessible on mobile phones, is needed. This session will cover the details of the end-to-end machine learning pipeline that was created to deliver and update performance ML models to mobile users.\n\nOliver Gindele's Bio\nOliver Gindele is the Chief Innovation Officer at Datatonic. Oliver is passionate about using computer models to solve real-world problems. Working with clients in retail, finance, and telecommunications, he applies deep learning techniques to tackle some of the most challenging use cases in these industries. He studied materials science at ETH Zurich and holds a PhD in computational physics from UCL.\nTwitter: https://twitter.com/tinyoli/\nLinkedIn: https://www.linkedin.com/in/oliver-gindele-phd-13153540/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1418,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/oliver-gindele-phd-13153540/",
      "url": "https://www.linkedin.com/in/oliver-gindele-phd-13153540/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://twitter.com/tinyoli/",
      "url": "https://twitter.com/tinyoli/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/D8HsQApNKN0/maxresdefault.jpg",
  "title": "ML in Production – Serverless and Painless] - [Oliver Gindele | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=D8HsQApNKN0"
    }
  ]
}
