{
  "description": "Modeling Aleatoric and Epistemic Uncertainty Using Tensorflow and Tensorflow Probability\nSpeaker: Aleksander Molak\n\nSummary\nModeling uncertainty is incredibly useful when we want to understand how sure the model is about its own predictions. In the talk we’ll discuss differences between two types of uncertainty (aleatoric and epistemic) and show how to model them using TensorFlow and TensorFlow Probability. At the end of the talk, you’ll have practical understanding how to apply uncertainty modeling in your own project\n\nDescription\nIs your data scarce? Do you want to understand if adding more will help you solve the problem? These and many other scenarios can benefit immensely from uncertainty modeling. Nonetheless, good understanding of what and how to model is critical to fully enjoy the advantages of this approach. The talk is addressed to people who want to enrich their modeling toolkit. In the talk, we’ll share motivating examples and cover basic theory behind uncertainty modeling. We’ll also briefly introduce basic modules of TensorFlow Probability (TFP). In the main part, we’ll discuss how to model epistemic and aleatoric uncertainty using TFP. We’ll go through a Jupyter notebook, showing the process step-by-step. At the end, I’ll share with you one of my favorite tricks that will allow you to easily model uncertainty in plain TensorFlow. Although the presentation will be focused on tools from TensorFlow universe and therefore might be most rewarding to TensorFlow practitioners, anyone interested in the topic is encouraged to participate. To fully enjoy the content, it’s recommended that you: * Have good understanding of deep learning basics * Have good understanding of Bayes’ theorem * Have practical experience in a contemporary Python deep learning framework (TensorFlow recommended) The goal of this talk is to give you practical understanding of how to apply uncertainty modeling in your own projects.\n\nAleksander Molak's Bio\nInnovation Lead and Machine Learning Researcher at Lingaro\nThe author of #SundayAiPapers - a LinkedIn weekly micro-blog on the latest advancements in NLP, causal inference and more. Certified TensorFlow developer. Interested in NLP, probabilistic modeling and causal inference. ❤ Vegan food and running.\nGitHub: https://github.com/AlxndrMlk/\nTwitter: https://twitter.com/AleksanderMolak/\nLinkedIn: https://www.linkedin.com/in/aleksandermolak/\nWebsite: https://alxndrmlk.github.io/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1752,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/AlxndrMlk/",
      "url": "https://github.com/AlxndrMlk/"
    },
    {
      "label": "https://alxndrmlk.github.io/",
      "url": "https://alxndrmlk.github.io/"
    },
    {
      "label": "https://www.linkedin.com/in/aleksandermolak/",
      "url": "https://www.linkedin.com/in/aleksandermolak/"
    },
    {
      "label": "https://twitter.com/AleksanderMolak/",
      "url": "https://twitter.com/AleksanderMolak/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/KJxmC5GCWe4/maxresdefault.jpg",
  "title": "Modeling Aleatoric and Epistemic Uncertainty - Aleksander Molak | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KJxmC5GCWe4"
    }
  ]
}
