{
  "description": "Abstract:\nNatural Language Processing (NLP) is one of the most exciting fields in AI, with successful applications ranging from personal assistants, to customer service, to healthcare and many more. In the past few years we have witnessed several breakthroughs in different NLP tasks, as well as the improvement and consolidation of the NLP open-source ecosystem. Despite the buzz, building successful and efficient NLP solutions remains a challenging endeavour.\n\nThis session starts with a short presentation that will offer an overview on the advances, challenges and opportunities in NLP technologies, looking at different modelling solutions and at the Python ecosystem. We’ll then continue with a Q&A / round table discussion. By attending this session, you’ll learn about recent trends in NLP as well as old-but-gold approaches, you’ll have the opportunity to ask your burning questions on NLP, and you’ll hopefully leave more confident and better equipped to tackle your NLP problems.\n\nThis event is for ticket holders, you’ll receive your invite by email. You are strongly encouraged to bring questions and discussion topics for the second half of this session.\n\nBio:\nMarco Bonzanini is a Data Science consultant, corporate trainer and author based in London (UK) specialised in the Python for Data Science (PyData) software stack. With 20 years of experience in the tech industry, he provides consulting, coaching and training services in the data science space through his company Bonzanini Consulting Ltd. Backed by a PhD in Information Retrieval, Marco focuses on text analytics applications and he has enjoyed working on a broad range of information management and data science projects, including flight safety, social media data, behavioural data, biomedical data and recruitment data.\nHe’s the author of “Mastering Social Media Mining with Python”, “Data Analysis with Python” and “Practical Python Data Science Techniques”, published by Packt Publishing. He currently serves as chair of the PyData London meetup and conference series (largest Python user group in Europe) and regularly speaks at international tech events.\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 3407,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Y2WZEV-Ds-o/maxresdefault.jpg",
  "title": "Natural Language Processing: Trends, Challenges and Opportunities | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Y2WZEV-Ds-o"
    }
  ]
}
