{
  "description": "Simplification as a Service\nSpeaker: Vasu Sharma\n\nSummary\nYou can stop improving accuracy of your awesome AI product and still gain traction. I spent my initial time at Blue Yonder doubting my own skills - making cool data plots with internal tools, but when something broke, I spent hours figuring out how I messed up. My fault? I was new. Just simplify - provide intuitive interfaces with accessible documentation - and a lot of \"me\" will use your product.\n\nDescription\nYou might find yourself interested if you have ever found a user (ab)using a feature incorrectly because they didn’t understand its intent, if you’ve ever tried using a new cool tech (ahem, AWS) but gave up after struggling just to get a toy example to work, if you’ve ever looked at a fellow developer’s PR and wondered whether it’s the same product you’re working on. This talk is for everyone who works on a piece of software that is not just meant for personal consumption. ML/AI tools especially have the reputation of being opaque, now add to that poor user-experience, and you will have users who curse your product everyday (not you, pandas). I intend to channel all my rants into technical or philosophical tips. No prior knowledge is expected, though we will look briefly into some useful tools like Sphinx, doctests and OpenAPI. I would like to discuss how some low-hanging fruits, if overlooked, can impede a product from being embraced by a wider audience, and how some of these ideas can improve development velocity and increase the „bus factor“ of the team. I would share a few tips on how to address the structural hindrances to maintaining user-friendly interface, particularly documentation (yes, documentation is a part of your user interface). These challenges include how to convince your team lead to invest team resources in this effort, how to keep docs up-to-date systematically, how to attempt to quantify the cost of cryptic or inaccessible documentation, etc. I will not refrain from ranting and will also share some anecdotes when complex interfaces costed me my mental peace (and sometimes my sanity).\n\nVasu Sharma's Bio\nI work as a Senior Data Scientist at Blue Yonder at their Karlsruhe office where I work extensively on AI solutions in Supply Chain Industry. To deliver a scalable and robust product, my work also involves data engineering and software development roles. I have previous data science experience working in financial sector. I like teaching/explaining software/computer science stuff in simple terms to non-techie friends.\nGitHub: https://github.com/tacitvenom/\nLinkedIn: https://www.linkedin.com/in/vasusharma-314/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1816,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/in/vasusharma-314/",
      "url": "https://www.linkedin.com/in/vasusharma-314/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://github.com/tacitvenom/",
      "url": "https://github.com/tacitvenom/"
    }
  ],
  "speakers": [
    "Vasu Sharma"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/GttTziOQl9U/maxresdefault.jpg",
  "title": "Simplification as a Service",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GttTziOQl9U"
    }
  ]
}
