{
  "description": "sktime - A Unified Toolbox for Machine Learning with Time Series\nSpeaker: Markus Löning\n\nSummary\nThis tutorial is about sktime - a unified framework for machine learning with time series. sktime features various time series algorithms and modular tools for pipelining, ensembling and tuning. You will learn how to use, combine and evaluate different algorithms on real-world data sets and integrate functionality from many existing libraries, including scikit-learn.\n\nDescription\nTime series are ubiquitous in real-world applications, but often add considerable complications to data science workflows. Many machine learning libraries (e.g. scikit-learn) focus on non-temporal data. And even though there are many time series libraries, they are often incompatible with each other.\n\nIn this tutorial, we will present sktime - a unified framework for machine learning with time series (https://github.com/alan-turing-institute/sktime). sktime covers multiple time series learning problems, including time series transformation, classification and forecasting, among others. In addition, sktime allows you to easily apply an algorithm for one task to solve another (e.g. a scikit-learn regressor to solve a forecasting problem). In the tutorial, you will learn about how you can identify these problems, what their key differences are and how they are related.\n\nTo solve these problems, sktime provides various time series algorithms and modular tools for pipelining, ensembling and tuning. In addition, sktime is interfaces with many existing libraries, including scikit-learn, statsmodels and fbprophet.\n\nYou will learn how to use, combine, tune and evaluate different algorithms on real-world data sets. We'll work through all of this step by step using Jupyter Notebooks. Finally, you will find out about how to get involved in sktime's community.\n\nMarkus Löning's Bio\nI am one of the core developers of sktime, a unified Python framework for ML with time series. I've recently finished my PhD at UCL and am now working as a data scientist in industry. During my PhD, I spent nine months at the The Alan Turing Institute. My research focuses on ML, time series analysis and software design.\nGitHub: https://github.com/mloning/\nTwitter: https://twitter.com/mloning_/\nLinkedIn: https://www.linkedin.com/in/mloning/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 4867,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/mloning/",
      "url": "https://www.linkedin.com/in/mloning/"
    },
    {
      "label": "https://github.com/alan-turing-institute/sktime",
      "url": "https://github.com/alan-turing-institute/sktime"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://twitter.com/mloning_/",
      "url": "https://twitter.com/mloning_/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://github.com/mloning/",
      "url": "https://github.com/mloning/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ODspi8-uWgo/maxresdefault.jpg",
  "title": "sktime - A Unified Toolbox for ML with Time Series - Markus Löning | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ODspi8-uWgo"
    }
  ]
}
