{
  "description": "Snowflake and Tecton: How to Build Production-ready Machine Learning Pipelines\nSpeakers: Miles Adkins, Kevin Stumpf\n\nSummary\nOperationalizing data is the hardest part of deploying machine learning to production. Most common practice today is for teams to build bespoke pipelines to process model-specific features and serve them in production. In this session, Snowflake and Tecton will present their tightly integrated solution that allows teams to quickly build production-ready features to serve machine learning models.\n\nDescription\nProduction ML pipelines are different from traditional analytics pipelines. They need to process both historical data for training, and fresh data for online serving. They must ensure training/serving parity, and provide point-in-time correctness. Features must be served online at high scale and low latency to support production workloads. These challenges are difficult to tackle with traditional data orchestration tools, and can often add weeks or months to the delivery time of new ML projects.\n\nTogether, Tecton and Snowflake have developed a tightly integrated solution to solve these challenges. The Snowflake Data Cloud provides a central repository of refined analytical data and highly scalable processing resources. The Tecton feature store integrates tightly with Snowflake to provide an operational bridge from Snowflake to ML models. It allows teams to define new features as code, automate the processing of feature values, store historical data for training directly in Snowflake, and serve features online with production-grade service levels. Together, Snowflake and Tecton are the simplest and fastest path to building and serving production-grade features.\n\nMiles Adkins's Bio\nMiles is a Partner Sales Engineer at Snowflake and leads the technical go-to-market for Snowflake's machine learning and data science partners. Miles has spent the entirety of his career in data science and sales engineering positions and specializes in financial markets and technology industries.\n\nKevin Stumpf's Bio\nKevin Stumpf is the co-founder and CTO of Tecton. Tecton is building a next-generation feature store for Operational Machine Learning. Kevin and his co-founders built deep expertise in Operational ML platforms while at Uber. They created the Michelangelo platform that enabled Uber to scale from 0 to 1000's of ML-driven applications in just a few years. Kevin holds an MBA from Stanford University and a Bachelor’s Degree in Computer and Management Sciences from Germany’s University of Hagen. Outside of work, Kevin is a passionate long-distance endurance athlete.\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1627,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/tETMa7xStr4/maxresdefault.jpg",
  "title": "Snowflake and Tecton - Miles Adkins, Kevin Stumpf | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tETMa7xStr4"
    }
  ]
}
