{
  "description": "Software Inspired Workflow for Data Analysis\nSpeaker: Imen Ayari\n\nSummary\nIn Data driven jobs, we tend to have a huge technical debt, especially for beginners, as we mainly focus on data and not methods. We tend to lose an enormous amount of time re-iterating through code and losing ourselves in the endless loop of clean-and-try. The Question is: Is it possible to apply software-inspired methods in Data Analysis to establish new habits? Hopefully, the answer is yes.\n\nDescription\nGeneral\nNaturally people working in Data driven jobs, are focused on having the most cleaned data ever. We can't compromise on the goal since it gets most of us from the bottleneck to continue on advanced tasks in the roadmap, but we can change our methodology to get our goals in a record time. Having an established workflow can save us time, but, HOW?\n\nTraditionally, we go through the data analysis part by submitting our work through Jupyter notebooks and ending up with several versions of cleaned data and not tested code which could give us a headache as soon as we get hurt with a never-seen-case before.\n\nThe answer to this problem is:\n\nDesign pattern\nSoftware dev has taught us that having an easily tested design, can save us the headache of regression afterward.\nTechnical debt is reduced.\nClean code is guaranteed.\nCode is very maintainable, easily handled and easily reused.\nConclusion\nThe main focus of this talk is design patterns and best practices learnt from Software Engineering and applied to Data Analysis. We will go through a quick demo to demonstrate the before and after and how to consolidate what we've learnt in a maintainable workflow.\n\nThe talk is mainly for fresh graduates and beginners as it's simply a share of experience and it's an open discussion for new ideas.\n\nImen Ayari's Bio\nImen Ayari has just had her Master's degree last year in Data Science for Buisness. She is currently working as a lead Data Analyst and Project Manager at Datagram; a french tech company specialized in e-retail and e-commerce analytics. She is mainly working with direct clients to provide custom data analysis and give support to upcoming data issues. She is also for data monitoring workflows and building dashbords.\nGitHub: https://github.com/ImenAyari/\nLinkedIn: https://www.linkedin.com/in/imen-ayari/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1364,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/in/imen-ayari/",
      "url": "https://www.linkedin.com/in/imen-ayari/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://github.com/ImenAyari/",
      "url": "https://github.com/ImenAyari/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/L-XVss5XtLM/maxresdefault.jpg",
  "title": "Software Inspired Workflow for Data Analysis - Imen Ayari | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=L-XVss5XtLM"
    }
  ]
}
