{
  "description": "Storytelling With Data – How To Turn a Basic Dataset Into a Compelling Story\nSpeaker: Meirav Ben Izhak\n\nSummary\nEver stared at a raw, numeric dataset, knowing there are some interesting insights in it, maybe even a story, but not sure how to draw them out? then this talk is for you. In this session I will present my analysis of one UN dataset and share my insights on the entire process from choosing a dataset through analyzing and publishing. Eventually, some practical advice for fruitful EDA will be given.\n\nDescription\nExploratory data analysis is an essential and powerful skill for data scientists but is not the easiest to master. In this session, I will share my insights on the entire process of analyzing a dataset, from choosing one through visualizing, completing the story with qualitative facts and publishing. This talk is for you if you- - Strive to sharpen your EDA (exploratory data analysis) skills. - Want to learn how to tell stories with data but don't know where to start. - Like to go 'behind the scenes' of one interesting data story.\n\nMeirav Ben Izhak's Bio\nMeirav Ben Izhak is a Senior Data Scientist based in Tel Aviv, Israel. During the past 5 years, she had the fortune to analyze various datasets, including but not limited to Microbiome in her MSc, election patterns and Cannabis DNA in her side projects, and authorization management in recent positions. In her spare time, she hosts a podcast about scientific research (www.manehkar.com), promotes women in STEM, goes on hikes, and contributes to stock photography.\nLinkedIn: https://www.linkedin.com/in/meirav-ben-izhak/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1170,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/in/meirav-ben-izhak/",
      "url": "https://www.linkedin.com/in/meirav-ben-izhak/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/dLnUmbUcsN4/maxresdefault.jpg",
  "title": "Storytelling With Data - Meirav Ben Izhak | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dLnUmbUcsN4"
    }
  ]
}
