{
  "description": "Abstract:\nWe’ll review the state of the art in the data science world for common number-crunching tasks on small to big data. Topics we’ll cover include profiling, compilation and data manipulation. We’ll also review the near future for Numba, Pandas, Dask, Vaex, Modin, and Polars and I’ll help you make some pragmatic choices about tools you might invest time in. We’ll have plenty of time to discuss your use cases and problems you might have encountered.\n\nPlease bring questions about tools or processes that we can discuss during this session.\n\nThis event is for ticket holders, you’ll receive your invite by email. You are strongly encouraged to bring questions and discussion topics for the second half of this session.\n\nBio:\nIan Ozsvald is a Chief Data Scientist and Coach, he’s helped co-organize the annual PyDataLondon conference with 700+ attendees and the associated 11,000+ member monthly meetup. He runs the established Mor Consulting Data Science consultancy in London, gives conference talks internationally often as keynote speaker, and is the author of the bestselling O’Reilly book High-Performance Python (2nd edition). He has 19 years of experience as a senior data science leader, trainer, and team coach. For fun, he’s walked by his high-energy Springer Spaniel, surfs the Cornish coast, and drinks fine coffee. Past talks and articles can be found at: https://ianozsvald.com/\n\nhttps://github.com/ianozsvald/\nhttps://twitter.com/ianozsvald\nhttps://www.linkedin.com/in/ianozsvald/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pyda...\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 2992,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/in/ianozsvald/",
      "url": "https://www.linkedin.com/in/ianozsvald/"
    },
    {
      "label": "https://twitter.com/ianozsvald",
      "url": "https://twitter.com/ianozsvald"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://github.com/ianozsvald/",
      "url": "https://github.com/ianozsvald/"
    },
    {
      "label": "https://ianozsvald.com/",
      "url": "https://ianozsvald.com/"
    },
    {
      "label": "https://www.linkedin.com/company/pyda...",
      "url": "https://www.linkedin.com/company/pyda..."
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "Ian Ozsvald"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/zyv0lzr7-6E/maxresdefault.jpg",
  "title": "The State of Higher Performance Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zyv0lzr7-6E"
    }
  ]
}
