{
  "description": "The Prototype Hole and Tools to Help You Out of It\nSpeaker: Irina Vidal Migallón\n\nSummary\nThis talk is meant to look at the (increasingly know?) lifecycle of a product with Machine Learning at its core, step by step. For each of those steps (of which model training and tracking may be just a tiny part of the work), we will look at the pitfalls that may keep it stuck in prototype phase and suggest open source libraries that can help.\n\nDescription\nThis talk uses a single tweet of frustration against \"AI and COVID\" as an excuse to look at the presence of Machine Learning in production. Where are we in 2021 in terms of real world solutions? What does the lifecycle of a product with ML at its core look like and, at each step, what issues get it stuck in prototype phase? For each of those steps, are there tools that can get you in a better position to move to Prod?\n\nIf we're all tracking experiments now, what's missing?\n\nThe response this talk suggests for that last frustrated question is \"Everything else, which often matters a lot more than the model itself. But there's tools for that too\".\n\nThe talk makes quite a few assumptions about the audience: you are likely a developer or researcher (also at a senior level - nobody's clean); you are aware of steps necessary for a Machine Learning project. Trickier yet: you agree that a low product:POC rate is of limited use in the industry, and you would rather use existing tools whenever possible.\n\nWe will look at the full lifecycle first, from conception of the solution to modelling to deployment, including typically forgotten steps like incorporating the user's point of view. More importantly, we'll see prototype pitfalls for each step that can get you stuck and, more importantly, tools and libraries that help you to overcome those faster.\n\nThis cannot be a complete guide, but at the end of the talk you'll hopefully...\n\nknow a bit more of what is holding us back in terms of Machine Learning in Production (that we're not talking about enough), and\nhear of a couple of handy tools that you hadn't considered before. (Even better, you may be prompted to later suggest your own favourites!)\n\nIrina Vidal Migallón's Bio\nIrina is an Electrical Engineer & Biomedical Engineer who specialised in Machine Learning & Vision. Seasoned in different industries —from optical biopsy systems in France to surgical planning tools and Augmented Reality apps in the Berlin start-up scene—, she now works in Siemens Mobility's AI team, dealing with data in different modalities. Even more than waking up Skynet, she's interested in the limits of Natural Intelligence and its decisions over our data.\n\nGitHub: https://github.com/ividal/\nTwitter: https://twitter.com/not_vim/\nLinkedIn: https://www.linkedin.com/in/irinavidal/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1441,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://twitter.com/not_vim/",
      "url": "https://twitter.com/not_vim/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://www.linkedin.com/in/irinavidal/",
      "url": "https://www.linkedin.com/in/irinavidal/"
    },
    {
      "label": "https://github.com/ividal/",
      "url": "https://github.com/ividal/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/nzKrBYhtYGg/maxresdefault.jpg",
  "title": "The Prototype Hole and Tools to Help You Out of It - Irina Vidal Migallón | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nzKrBYhtYGg"
    }
  ]
}
