{
  "description": "Towards Cloud-Native Distributed Machine Learning Pipelines at Scale\nSpeaker: Yuan Tang\n\nSummary\nThis talk presents various best practices and challenges on building large, efficient, scalable, and reliable distributed machine learning pipelines using cloud-native technologies such as Argo Workflows and Kubeflow as well as how they fit into Python ecosystem with cutting-edge distributed machine learning frameworks such as TensorFlow and PyTorch.\n\nDescription\nPresentation slides: https://github.com/terrytangyuan/public-talks/blob/main/talks/towards-cloud-native-distributed-machine-learning-pipelines-at-scale-pydata-global-2021/presentation.pdf\n\nIn recent years, advances in machine learning have made tremendous progress yet large scale machine learning still remains challenging. With the variety of machine learning frameworks such as TensorFlow and PyTorch, it’s not easy to automate the process of training machine learning models on distributed Kubernetes clusters. Machine learning researchers and algorithm engineers with less or zero DevOps experience cannot easily launch, manage, monitor, and optimize distributed machine learning pipelines.\n\nThis talk presents various best practices on building large, efficient, scalable, and reliable distributed machine learning pipelines using cloud-native technologies such as Argo Workflows and Kubeflow as well as cutting-edge distributed machine learning frameworks such as TensorFlow and PyTorch. We will also talk about some of the challenges we had when managing distributed machine learning pipelines in our Kubernetes clusters with tens of thousands of nodes in production.\n\nYuan Tang's Bio\nYuan is currently a founding engineer at Akuity. Previously he was a senior software engineer at Alibaba Group, building AI infrastructure and AutoML platform. He's a PMC member of XGBoost and Apache MXNet, co-chair of Kubeflow, committer of TensorFlow, Argo, Couler, and ElasticDL, as well as author of numerous open source projects. He's the author of Distributed Machine Learning Patterns as well as the co-author of TensorFlow in Practice and Dive into Deep Learning (with TensorFlow).\nGitHub: https://github.com/terrytangyuan/\nTwitter: https://twitter.com/TerryTangYuan/\nLinkedIn: https://www.linkedin.com/in/terrytangyuan/\nWebsite: https://terrytangyuan.github.io/about//\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1674,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://github.com/terrytangyuan/",
      "url": "https://github.com/terrytangyuan/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/TerryTangYuan/",
      "url": "https://twitter.com/TerryTangYuan/"
    },
    {
      "label": "https://www.linkedin.com/in/terrytangyuan/",
      "url": "https://www.linkedin.com/in/terrytangyuan/"
    },
    {
      "label": "https://terrytangyuan.github.io/about//",
      "url": "https://terrytangyuan.github.io/about//"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://github.com/terrytangyuan/public-talks/blob/main/talks/towards-cloud-native-distributed-machine-learning-pipelines-at-scale-pydata-global-2021/presentation.pdf",
      "url": "https://github.com/terrytangyuan/public-talks/blob/main/talks/towards-cloud-native-distributed-machine-learning-pipelines-at-scale-pydata-global-2021/presentation.pdf"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "Yuan Tang"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/dNzb_-JD6T0/maxresdefault.webp",
  "title": "Towards Cloud-Native Distributed Machine Learning Pipelines at Scale",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dNzb_-JD6T0"
    }
  ]
}
