{
  "description": "Unlocking More From Your Audio Data\nSpeaker: Braden Riggs\n\nSummary\nIn this talk we explore how you can unlock more data from your audio media with a variety of python tools accessible for beginners and advanced users alike.\n\nDescription\nIn a world where content capture and creation sits in your pocket, the amount of audio collected and stored has exploded exponentially in recent years creating a goldmine of unstructured data ready to be explored and used. Just one problem, how do we work with all of this audio data and how do we make sure we are utilizing it to its full potential? In this talk we will explore how you can unlock more from your audio data in python, exploring some of our favorite data extraction and analysis tools and how we used them to better understand the world of podcast creation.\n\nAs part of the Dolby.io (https://dolby.io/) team we regularly work with audio data for a variety of data science related projects and are eager to share some of the tips, tricks and tools we've learnt along the way that can help audio data beginners get started and inspire seasoned veterans to rethink how they work in the space.\n\nBraden Riggs's Bio\nOriginally From Australia and now living in San Diego, Braden joined the professional world of tech as a Data Scientist in 2020 working at a variety of companies including startups and semiconductor manufacturers, before joining the Dolby.io team working in Developer Relations. Braden has a passion for python, tinkering away at a range of projects that leverage some of the language's best tools for solving problems in data collection, creation, and machine learning.\nGitHub: https://github.com/Briggs599/\nTwitter: https://twitter.com/BradenRiggs1/\nLinkedIn: https://www.linkedin.com/in/briggs599/\nWebsite: https://bdriggs.medium.com/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 5249,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/Briggs599/",
      "url": "https://github.com/Briggs599/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://twitter.com/BradenRiggs1/",
      "url": "https://twitter.com/BradenRiggs1/"
    },
    {
      "label": "https://bdriggs.medium.com/",
      "url": "https://bdriggs.medium.com/"
    },
    {
      "label": "https://www.linkedin.com/in/briggs599/",
      "url": "https://www.linkedin.com/in/briggs599/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://dolby.io/",
      "url": "https://dolby.io/"
    }
  ],
  "speakers": [
    "Braden Riggs"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/n47Cphwo0U4/maxresdefault.jpg",
  "title": "Unlocking More From Your Audio Data",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=n47Cphwo0U4"
    }
  ]
}
