{
  "description": "What to Do When You Can't Trust Your Labels? A Practical Approach\nSpeaker: Ramiro Caro\n\nSummary\nWhen we start with a ML project, we often consider that all training data is evaluated with 100% accuracy. However, such a scenario is rarely presented to us. In this talk I'll show how we face problems such as missing or unreliable targets, incomplete model feedback or training data quality. And how we used product representations to evaluate label confidence and improve data quality.\n\nDescription\nWhen we talk about an end-to-end workflow in a Machine Learning system in production, we tend to overlook a stage that is critical for success, data labeling. In academic or learning environments, all training data is labelled and the outputs are considered 100% correct, so no further in-depth analysis performed. However, in online production systems, such a scenario is rarely presented to us. Sometimes at the beginning of a project we do not directly have the target values, sometimes we have a fraction of them or some ​​are not correct. At the other end of the pipeline, on the monitoring side, we are presented with a very related problem such as incomplete feedback, that is, many times we will not have visibility of errors made by the model. Which, if not detected, will be perpetuated on the system by reintroducing them as retraining data. All these scenarios lead us to look for methodologies to evaluate the confidence of the labels, in order to maximize the impact of the most reliable ones and to exclude or correct those that generate noise. In this talk I want to show how these problems were attacked within the initiative of moderation of prohibited items in MercadoLibre’s marketplace, and the lessons learned.\n\nRamiro Caro's Bio\nMy name is Ramiro Caro, i'm from Cordoba, Argentina. Currently I'm a Sr. Data Scientist for Mercado Libre, the biggest ecommerce site in Latin America. I have +10 years of experience working with data in different industries as oil/gas, consulting, energy and retail. I have spoken in conferences as PyData Cordoba, SciPy Latam, PyConAr (Argentina) and other Python Community Events. I have a master in Electronic Engineering from Universidad Nacional de Cordoba. In my spare time i love to take long walks in the mountains, play with my dogs and make music with my friends.\nGitHub: https://github.com/ramirojc/\nTwitter: https://twitter.com/RamiroJC_83/\nLinkedIn: https://www.linkedin.com/in/ramirocaro/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1612,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/ramirojc/",
      "url": "https://github.com/ramirojc/"
    },
    {
      "label": "https://www.linkedin.com/in/ramirocaro/",
      "url": "https://www.linkedin.com/in/ramirocaro/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://twitter.com/RamiroJC_83/",
      "url": "https://twitter.com/RamiroJC_83/"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/-IZ3b6m9GgI/maxresdefault.jpg",
  "title": "What to Do When You Can't Trust Your Labels? - Ramiro Caro | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-IZ3b6m9GgI"
    }
  ]
}
