{
  "description": "What's in Your Data: Data Profiler - an Open Source Solution to Explain Your Data\nSpeaker: Austin Walters, Jeremy Goodsitt\n\nSummary\nData understanding is crucial for most machine learning applications. As data scientists and engineers, we need to answer these questions for every project: Is our data secure? What is in our data? How do we monitor data properties over time? The DataProfiler, an open source project from Capital One, is a Python library designed to facilitate data analysis, monitoring and sensitive data detection.\n\nDescription\nDescriptions\nDataProfiler was designed to accept a wide range of data formats including csv, avro, parquet, json, text, and pandas DataFrames. Whether the data is structured, semi-structured or unstructured, the library is able to identify the schema, statistics, entities from the data. In addition, the DataProfiler provides a cutting edge pre-trained deep learning model to efficiently identify sensitive information (or PII, such as customer names, physical addresses, bank account numbers, and credit card numbers). This helps companies detect sensitive data in different data sources and formats. With the ability to interchange the data labeler, DataProfiler can be customized to help users learn what is in their data. This versatility of the data labeler allows models to be modified as needed. Running multiple models on the same dataset is easy since choosing a preexisting data labeler to train and predict takes just a few lines of code.\n\nWe invite data scientists, machine learning engineers, software engineers, from beginner to expert level, to learn how to extract data properties in an efficient way with the DataProfiler.\n\nAustin Walters's Bio\nMachine learning engineer, manager and researcher focused on natural language process and automated machine learning.\nGitHub: https://github.com/lettergram/\nLinkedIn: https://www.linkedin.com/in/austingwalters/\nWebsite: https://austingwalters.com/\n\nJeremy Goodsitt's Bio\nJeremy Goodsitt’s doctoral studies were at the University of Illinois where he worked on improving medical diagnostic techniques through computer vision and optimization techniques. He since joined Capital One in 2017 where he has worked on machine learning optimization infrastructure, NLP model development such as the sensitive data labeler within the DataProfiler, and the engineering design behind the open source library, DataProfiler.\nGitHub: https://github.com/JGSweets/\nLinkedIn: https://www.linkedin.com/in/jeremy-goodsitt/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 4995,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/in/jeremy-goodsitt/",
      "url": "https://www.linkedin.com/in/jeremy-goodsitt/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/lettergram/",
      "url": "https://github.com/lettergram/"
    },
    {
      "label": "https://www.linkedin.com/in/austingwalters/",
      "url": "https://www.linkedin.com/in/austingwalters/"
    },
    {
      "label": "https://austingwalters.com/",
      "url": "https://austingwalters.com/"
    },
    {
      "label": "https://github.com/JGSweets/",
      "url": "https://github.com/JGSweets/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/5jTysneIBZc/maxresdefault.jpg",
  "title": "What's in Your Data: Data Profiler - Austin Walters, Jeremy Goodsitt | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5jTysneIBZc"
    }
  ]
}
