{
  "description": "Wounds Over Time - Tracking Wound Healing via 3D Models\nSpeaker: Sivan Biham\n\nSummary\nMeasurement of changes to the area of chronic wounds over time is the cornerstone for wound management and assessment. In this talk, Sivan will present how she and her team combined several computer vision algorithms, such as 3D modelling, deep learning, and classical algorithms to build a framework that allows clinicians to visually track the wound healing progress over time.\n\nDescription\nMeasurement of changes to the area of chronic wounds over time is the cornerstone for wound management and assessment. In this Sivan will present a new framework to allow clinicians to visually track the healing progress over time. The presented framework artificially creates a consistent timeline from different visits of the same wound, where all views are shown at the same scale, location, and orientation. This framework receives as input a series of video scans and then outputs a consistent timeline of 2D projected images. The resulting timeline allows clinicians to visually monitor the wound healing process for the first time.\n\nSivan Biham's Bio\nSivan Biham is a Computer Vision Researcher and Algorithm Developer in Healthy.io, where she works on healthcare-related products, taking them all the way from the algorithm design stage to a fully implemented product with thousands of users across the world.\n\nSivan holds an M.Sc. in computer science from Weizmann Institute with a specialization in Computer Vision and Deep Learning, and a B.Sc. in both Computer Science and Neuroscience from Bar Ilan University.\n\nShe is enthusiastic about using her algorithmic skills and knowledge for improving people's health and life. As part of her daily work, Sivan places emphasis on designing and implementing maintainable and modular algorithms, with software architecture principles in mind. In her spare time, she loves to run and practice yoga.\n\nLinkedIn: https://www.linkedin.com/in/sbiham/\n\nPyData Global 2021\nWebsite: https://pydata.org/global2021/\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1647,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2021/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.linkedin.com/in/sbiham/",
      "url": "https://www.linkedin.com/in/sbiham/"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://pydata.org/global2021/",
      "url": "https://pydata.org/global2021/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/kPVACg7icS8/maxresdefault.jpg",
  "title": "Wounds Over Time - Tracking Wound Healing via 3D Models - Sivan Biham | PyData Global 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kPVACg7icS8"
    }
  ]
}
