{
  "description": "EuroPython 2022 - Best practices to open source a product and creating a community around it - presented by Adrin Jalali\n\n[Wicklow Hall 1 on 2022-07-15]\n\n\nThere are many aspects of open sourcing a product which are often overlooked yet greatly impact the community and activities around the project. One of the first things people think about is the licence [1], which is very important, but what people don’t often think about is the governance of it, which impacts the speed, decision making processes, and the kind of engagement one can get from contributors to the project who don’t work in the company.\n\nNot every project is open sourced for the same purpose. On one side of the “openness” spectrum some projects are out there to give a bit of visibility to what a team is doing or to showcase a research or another product, and on the other spectrum the creators of a project put it out there to create a user and contributing community so that eventually the community would be active enough for the original creators to become a minority in the contributing and governance team. Depending on what the goals are, one needs to create or use a governance model which matches those goals and needs. One can look at the following categories from this perspective [2]:\n\n- \"\"Do-ocracy\"\"\n- Founder-leader\n- Self-appointing council or board\n- Electoral\n- Corporate-backed\n- Foundation-backed\n\nThen we talk about some practices which can fend people off when they try to join a community, giving concrete detailed examples on how it can look like while interacting with contributors and users online, such as [3]:\n\n- Lack of onboarding\n- Nothing in writing\n- Leadership is a mystery\n- No path to success\n- Poor communication\n- Lack of transparency\n- Not seeing ourselves in others\n\n[1] Licences and Standards, https://opensource.org/licenses\n[2] Understanding open source governance models, https://www.redhat.com/en/blog/understanding-open-source-governance-models\n[3] Brain Proffitt, Seven Deadly Sins of Open Source Communities\"\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1510,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "https://www.redhat.com/en/blog/understanding-open-source-governance-models",
      "url": "https://www.redhat.com/en/blog/understanding-open-source-governance-models"
    },
    {
      "label": "https://opensource.org/licenses",
      "url": "https://opensource.org/licenses"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Adrin Jalali"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/wuS8PTkNHiQ/maxresdefault.jpg",
  "title": "Best practices to open source a product and creating a community around it",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wuS8PTkNHiQ"
    }
  ]
}
