{
  "description": "EuroPython 2022 - Common Python Mistakes with Kubernetes, How They Can Cause Vulnerabilities and How to Solve Them! - presented by Flo Pachinger\n\n[Liffey Hall 2 on 2022-07-14]\n\n\nIn this session, we will have a look at common mistakes in Python, that can cause serious code vulnerabilities, specifically for Kubernetes deployments of the code. We will subsequently have a look at what those vulnerabilities actually can result in and how your containerized application can get \"\"compromised\"\" as a result. We will also discuss how developer and security teams struggle to talk in a common language to prevent and mitigate these vulnerabilities. Lastly, we will see how you can prevent and mitigate these vulnerabilities in real-life using tools like Falco, TUF, Open Policy Agent and Bandit. We will also see how a CI/CD pipeline should look like, to build, test and deploy something in real-life. During this session you will learn a ton, see cool demos and all of the samples will be available to the attendees afterwards.\n\nMy session will benefit the ecosystem by pointing out common mistakes that can be made when writing Python code and deploying this via Kubernetes. This can cause serious breaches when exploited by attackers. The goal of the session is to both educate attendees on these vulnerabilities, as well as on how to fix them.\nI will be talking about multiple open source projects that can secure code and deployment. I will not cover any commercial products.\nFalco\nTUF\nOpen Policy Agent\nBandit (not CNCF)\nGitLab (not CNCF)\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1784,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Flo Pachinger"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/kfh-DDuAx58/maxresdefault.jpg",
  "title": "Common Python Mistakes with Kubernetes",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kfh-DDuAx58"
    }
  ]
}
