{
  "description": "EuroPython 2022 - From pip to poetry - Python (many) ways of packaging and publishing - presented by Vinícius Gubiani Ferreira\n\n[Liffey B on 2022-07-13]\n\n\nEver had issues to manage your python packages and environment? Do you know how to create and share a package to the community? It can be challenging if you've never done it, but it also doesn't have to be hard. There is always a better tool to fit our needs.\n\nIn this presentation, I'd like to discuss how Python's package managers appeared and evolved with time. Discussing pip, pipenv, and poetry, presenting each of their weak and strong points. Also intend to present how to package and publish a simple code with each one of them, and suggest which package manager should you choose, whether you are just starting with python, or feel like there is something bothering and never knew you could solve it easily and painless.\n\nSlides can be accessed here: https://github.com/vinigfer/europython_2022_slides\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1620,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "https://github.com/vinigfer/europython_2022_slides",
      "url": "https://github.com/vinigfer/europython_2022_slides"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/KlvOIuifE5c/maxresdefault.jpg",
  "title": "From pip to poetry - Python ways of packaging and publishing presented by Vinícius Gubiani Ferreira",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KlvOIuifE5c"
    }
  ]
}
