{
  "description": "EuroPython 2022 - How to embed a Python interpreter in an iOS app - presented by Łukasz Langa\n\n[Liffey A on 2022-07-15]\n\n\nCome see how you can make a native mobile app that embeds Python 3.10 to allow users to script app behavior. It's allowed by Apple but is currently underutilized by the app makers. Add superpowers to your iPhone app with Python!\n\nNative mobile applications have many advantages over mobile websites or apps made with cross-platform toolkits. They will use less battery, allow for richer graphics, more consistent UI behavior, and enable more functionality through device-specific APIs. Wouldn't it be great to have access to all this from Python?\n\nIn this talk, we'll marry a native iOS app written in Swift with an embedded Python 3.10 interpreter to allow users to customize what the application is doing. We'll go through the entire process of:\n\n- embedding Python from source;\n- building it into the Swift mobile app in Xcode;\n- adding a few pre-compiled third-party libraries like numpy and Pillow to broaden the scope of what the user can do;\n- running the resulting app on an iPhone 13;\n- modifying the app behavior at runtime thanks to our new Python superpowers!\n\nKnowledge of Swift is not required for attendees of this talk. However, it will be needed later if you're willing to embed Python in an iPhone app. Embedding Python doesn't really let you make an app without knowing Swift. Don't fret though! It's pretty easy to get a hang of Swift when you're fluent in Python.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2690,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/gznPQpZH1Yc/maxresdefault.jpg",
  "title": "How to embed a Python interpreter in an iOS app - presented by Łukasz Langa",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gznPQpZH1Yc"
    }
  ]
}
