{
  "description": "EuroPython 2022 - Is the news media polarized? Or are we being conditioned to think it is? - presented by Aroma Rodrigues\n\n[Liffey Hall 2 on 2022-07-14]\n\n\nThis work is an example of an intersection of a non scientific field with computer science and mathematics, trying to quantify, measure and identify non mathematical phenomena in the language of mathematics. It is important because it could be the basis of the scientific approaches that the next generation policy makers, voters, non profit social organizations and governments could use to make life changing decisions for their citizens. 2 The questions that this study tries to answer is whether a neural network can learn biases from the news media based on perceived bias scores obtained from independent agencies. It also seeks to answer whether any of these political leanings of the news media affect the vulnerability of their consumer when it comes to fake news. The results of this experiment aim to show\n\nConclusions:\n  1. SVMs perform better clustering with respect to the categories than neural networks, however the maximum does not cross 67%\n  2. The most significant conclusion from this work is that though there is a perceived bias when it comes to news agencies, when looked at from a neural networks standpoint, it is negligible. Mainstream news agencies are not able to polarize a neural network with inherent biases in their headlines.\n  3. There may be topical biases that need to be examined by using an Entity linking and bias calculation approach\n  4. Most mainstream news agencies do not make the consumer vulnerable to believing fake news. This study needs to be conducted with data from popular social media ”news” groups or popular TV shows that masquerade as news but may technically not even be news channels.\n  It is safe to conclude that the perceived bias that stems from social media polarization is being extended to news media when their contribution to the polarization may be negligible.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1606,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/X3c08NYtuvM/maxresdefault.jpg",
  "title": "Is the news media polarized? Or are we conditioned to think it is? - presented by Aroma Rodrigues",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=X3c08NYtuvM"
    }
  ]
}
