{
  "description": "EuroPython 2022 - Let's talk about JWT - presented by Jessica Temporal\n\n[Wicklow Hall 1 on 2022-07-14]\n\n\nJSON Web tokens dominated the way we give access to APIs and how we carry data from users, but to use JWTs safely we need to understand how they came to life and how JWTs can be useful.\nIn this talk we will take a closer look at the famous three-part structure that forms a JSON Web Token, and the claims each JWT can carry.\nBut knowing it’s history and structure is not enough, we need also to understand the algorithms used in creating a token and how you can use JWTs as access tokens or as ID tokens.\nAfter understanding JWTs on a deeper level, we will create and validate a JWT together using the PyJWT library and discuss things you should avoid doing to be safer when using JWTs in your projects.\n\n1. How did JWT come to life? Talk about the JOSE specification;\n2. What actually is a JSON Web Token and its structure: header, payload, and signature;\n3. What is a claim and its standardization efforts;\n4. The different types of algorithms that can be used to create JWTs and what is JWKs;\n5. Let's create a token together using PyJWT;\n6. What is an access token and an ID token;\n7. Things to avoid to be safer with JWTs\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1542,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Jessica Temporal"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/4IHbn084Yxg/maxresdefault.jpg",
  "title": "Let's talk about JWT",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4IHbn084Yxg"
    }
  ]
}
