{
  "description": "EuroPython 2022 - Making Python better one error message at a time - presented by Pablo Galindo Salgado\n\n[The Auditorium on 2022-07-13]\n\n\nPython 3.10 has been recently released and among many exciting new features, one of the biggest improvements is the inclusion of a whole new set of changes focused on improving the error messages across the interpreter and the general user experience when dealing with error messages. The new error messages have been one of the most welcomed features from very different sets of users ranging from Python teachers and educators, first-time learners, industry professionals and data scientists.\n\nIn this talk, we will cover:\n\n* What are the new improvements featured in Python 3.10.\n* Exciting new changes and improvements that will feature in Python 3.11.\n* How these improvements are useful to different sets of users from people learning Python to experienced programmers.\n* How the new PEG parser has unlocked adding new custom syntax errors.\n* How these improvements were implemented and what challenges the CPython core team faced to get them working reliably.\n* How users can contribute to adding new error messages: what is the workflow, how the errors are reviewed by the core team and where to find resources and help.\n\nNo matter who you are and what you do with Python, there is an improvement that will probably make you smile.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2735,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Pablo Galindo Salgado"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/aFfyQGa6Me8/maxresdefault.jpg",
  "title": "Making Python better one error message at a time",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aFfyQGa6Me8"
    }
  ]
}
