{
  "description": "EuroPython 2022 - Managing the code quality of your project. Leave the past behind: Focus on new code. - presented by Andrea Guarino\n\n[Wicklow Hall 1 on 2022-07-13]\n\n\nAs developers we often have to deal with legacy projects and, at the same time, we want to keep the quality and security of our deliverables under control.\n\nAs soon as we start running some linter (like Pylint or Flake8) on such a legacy project, there is a huge number of violations. To handle those issues, we might want to start by only looking at the changed files in a pull request instead of the entire project, for example by using _git diff_\n\n_pylint `git diff --name-only --diff-filter=d`_\n\nDuring this talk I’d like to push this concept a bit further and outline an approach and philosophy that can be helpful in dealing with code quality : Clean as you code.\n\n1. What is \"Clean as you code\"?\n- Not only about violations: It can be extended to code coverage and all code metrics in general.\n- The quality you want to measure should be based only on recent changes.\n\n2. \"Clean as you code\" matters?\n- It helps your team stay focused on delivering new features\n- It helps you deal with technical debt incrementally: Sometimes you might need to modify old code, and, at that point, you might be able to fix existing violations\n\n3. How to apply \"Clean as you code\"?\n- Shaping a *quality gate* in order to define code quality standards for the software delivered by your team today\n- Using appropriate tools (like SonarQube)\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1829,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/KK2GZFZ9_uA/maxresdefault.jpg",
  "title": "Managing the code quality of your project. Leave the past behind: Focus on new code - Andrea Guarino",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KK2GZFZ9_uA"
    }
  ]
}
