{
  "copyright_text": "The Orchard Music (on behalf of NorthStar Music); LatinAutorPerf, Kobalt Music Publishing, Public Domain Compositions, Sony Music Publishing, and 6 Music Rights Societies",
  "description": "EuroPython 2022 - Music and Code - presented by Nicholas H.Tollervey\n\n[The Auditorium on 2022-07-13]\n\n\nLearning to code requires a long term investment of time and effort to acquire a set of skills, theory, knowledge and experience in order to effectively make software. Learning to play an instrument requires a long term investment of time and effort to acquire a set of skills, theory, knowledge and experience in order to effectively make music.\n\nI will compare and contrast certain aspects of the worlds of code and music and will explore questions such as: what would music lessons look like if we taught music like we teach coding (and vice versa)? Who are the virtuoso coders we should celebrate as role models? (And why?) How do musicians and coders sustain AND develop their cultures across generations? Is coding an art? Is music a science? What could folks do to cultivate their practice of music and code? How can we tell if someone is an \"expert\", and should we trust their advice?\n\nMost of all, it'll be practical, fun and thoughtful.\n\nI hope to make a space for some interesting and stimulating ideas. Then we can all explore them together in the corridor track.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2916,
  "language": "eng",
  "recorded": "2020-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2022.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "europython-2022",
    "europython-dublin",
    "europython-online",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/j4X8K6pcxuQ/maxresdefault.jpg",
  "title": "Music and Code - presented by Nicholas H.Tollervey",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=j4X8K6pcxuQ"
    }
  ]
}
