{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "EuroPython 2022 - My journey using Docker as a development tool - presented by Haseeb Majid\n\n[Wicklow Hall 1 on 2022-07-13]\n\n\nDocker is a prevalent tool in our industry today, it is widely used for several proposes. In this talk, I would like to describe the journey I have taken with Docker and how I have learnt to use it with Python for local development. The talk will mostly focus on how we can use Docker to run all of our development tasks, so we hardly need to have anything installed locally. To the point where you can work on almost any project with nothing more than an editor, your terminal and Docker. \n\nWe will look at how we can take a simple FastAPI web service and dockerise it. The talk will be a step by step guide, starting of with a simple Docker image and improving it iteratively. \n\n- Firstly use a simple Docker image\n- Then add docker-compose to dockerise its dependencies such as database\n- Then see how we can run tests (and other tasks) directly in our Docker container\n - How to use this with Github Action\n- Then look at multistage builds\n - Then split this into development and production image\n - How can we handle git dependencies that require an SSH key to be injected into the Docker image at build time\n\nI’d be a little more specific. Like, how we handle private pip packages in our docker images. This talk is for you if you are a casual user of Docker and know a few of its features but want to improve your Docker skills.\n \n This is NOT a talk for you if you are an expert in Docker and know most of its features.\n\n\nCode: https://gitlab.com/haseeb-slides/docker-as-a-dev-tool\nSlides: https://docker-as-a-dev-tool.haseebmajid.dev\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1585,
  "language": "eng",
  "recorded": "2020-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2022.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://gitlab.com/haseeb-slides/docker-as-a-dev-tool",
      "url": "https://gitlab.com/haseeb-slides/docker-as-a-dev-tool"
    },
    {
      "label": "https://docker-as-a-dev-tool.haseebmajid.dev",
      "url": "https://docker-as-a-dev-tool.haseebmajid.dev"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "europython-2022",
    "europython-dublin",
    "europython-online",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/JSSG4FqKaGI/maxresdefault.jpg",
  "title": "My journey using Docker as a development tool - presented by Haseeb Majid",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JSSG4FqKaGI"
    }
  ]
}
