{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "EuroPython 2022 - Online voting system used for primary elections for the French Presidential, must be secure right? - presented by Emmanuel Leblond\n\n[The Auditorium on 2022-07-14]\n\n\nSince its inception, online voting has been an appealing but controversial technology.\n\nIndeed, what seems like a modern way of making vote cheaper and more convenient is often considered by activists and researchers as a pandora's box unleashing never-ending privacy and authenticity concerns.\n\nHowever with Covid 19 shrinking our public interaction, many have considered the benefits to overcome the theoretical issues and the online voting systems have skyrocketed like never before...\n\nThe Neovote voting system has been massively used in France: tenths of University, hundreds of private companies, and, more importantly, it was chosen to organize\n3 of the 5 main primary elections for the French Presidential election of 2022 (Primaires de l'Écologie, Les Républicains and Primaire Populaire).\n\nNeovote claims to have the highest possible level of security, the voter being even able to access the final ballot box to do the recount by himself and ensure his own vote has been taken into account!\n\nSo challenge accepted, this talk will walk you through the Neovote voting system to understand why their claims are \"slightly\" exaggerated ;-)\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2724,
  "language": "eng",
  "recorded": "2020-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2022.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "europython-2022",
    "europython-dublin",
    "europython-online",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/PdOzHAWRMbs/maxresdefault.jpg",
  "title": "Online voting system used for primary elections for the French Presidential - presented by E.Leblond",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PdOzHAWRMbs"
    }
  ]
}
