{
  "description": "EuroPython 2022 - Predicting urban heat islands in Calgary - presented by Anand S & Sumedh Ghatage\n\n[Liffey Hall 2 on 2022-07-14]\n\n\nDealing with extreme heatwaves can be challenging, it has become the necessity to understand the land surface temperature (LST) change and its driving factors to reduce the impact and achieve more sustainable planning methods for city growth.\n\nThis module will help you understand how to calculate LST from the openly available satellite imageries and merge it with urban morphological factors (like building height, building count, FSI, building block coverage, etc.) to predict the temperature trend and mitigate the impact.\n\nWe will demonstrate an end-to-end methodology using geospatial Python libraries to understand the use of spatial regression methods taking into account the variation over time. This talk will also throw light upon:\n\n- Getting the large imagery datasets into DL friendly format\n- Spatial aggregation of different variables\n- Understanding correlation between variables for feature engineering\n- Application & comparison of different regression methods on the same data\n- Future scope\n\nWe'll also showcase the geo-visualization portal we created and the technologies used, how you can use Python to convert large GeoJSON output to light vector tiles, and create a seamless experience for the user through an intuitive front-end.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2383,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/vlajpVCBHKs/maxresdefault.jpg",
  "title": "Predicting urban heat islands in Calgary - presented by Anand S & Sumedh Ghatage",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vlajpVCBHKs"
    }
  ]
}
