{
  "description": "EuroPython 2022 - Robyn: An async Python web framework with a Rust runtime - presented by Sanskar Jethi\n\n[Wicklow Hall 1 on 2022-07-14]\n\n\nWith the effort put in at every Python version to increase the runtime performance, we know that throughput efficiency is one of the top priority items in the Python ecosystem.\n\nInspired by the extensibility and ease of use of the Python Web ecosystem and the increased focus on performance, Robyn was born. \n\nRobyn is one of the fastest, if not the fastest Python web framework in the current Python web ecosystem. With a runtime written in Rust, Robyn tries to achieve near-native rust performance while still having the ease of writing Python code. \n\nThis talk will demonstrate the reasons why Robyn was created, the technical decisions behind Robyn, the increased performance by using the rust runtime, how to use Robyn to develop web apps, and most importantly, how the community is helping Robyn grow!\nFinally, I will be sharing the future plans of Robyn and would love to get feedback from the developers to see what they would like to see in it.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1315,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/qhkmg79izOg/maxresdefault.jpg",
  "title": "Robyn: An async Python web framework with a Rust runtime - presented by Sanskar Jethi",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qhkmg79izOg"
    }
  ]
}
