{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "EuroPython 2022 - Scaling scikit-learn: introducing new sets of computational routines - presented by Julien Jerphanion\n\n[Liffey Hall 2 on 2022-07-14]\n\n\nscikit-learn is an open-source scientific library for machine learning in Python.\n\nSince its first release in 2010, the library gained a lot of traction in education, research and the wider society, and has set several standards for API designs in ML software. Nowadays scikit-learn is of one the most used scientific library in the world for data analysis. It provides reference implementations of many methods and algorithms to a userbase of millions.\n\nWith the renewed interest in machine-learning based methods in the last years, other libraries providing efficient and highly optimised methods (such as for instance LightGBM and XGBoost for Gradient-Boosting-based methods) have emerged. Those libraries have encountered a similar success, and have put performance and computational efficiency as top priorities.\n\nIn this talk, we will present the recent work carried over by the scikit-learn core-developers team to improve its native performance.\n\nThis talk will cover elements of the PyData ecosystem and the CPython interpreter with an emphasis on their impact on performances. Computationally expensive patterns will then be covered before presenting the technical choices associated with the new routines implementations, keeping the project requirements in mind. At the end, we will take a quick look at the future work and collaborations on hardware-specialised computational routines.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1949,
  "language": "eng",
  "recorded": "2020-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2022.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "europython-2022",
    "europython-dublin",
    "europython-online",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/TpkZ3WHKgRw/maxresdefault.jpg",
  "title": "Scaling scikit-learn - presented by Julien Jerphanion",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TpkZ3WHKgRw"
    }
  ]
}
