{
  "description": "EuroPython 2022 - The intricate art of making your (internal) clients happy - the story from a Python-centered Infra team - presented by Paulina Winkowska\n\n[Wicklow Hall 1 on 2022-07-13]\n\n\nIf you have ever worked on an internal company project, you may feel it deep in your bones.\nLet’s say that you discovered a need for a generic technological component in your organization’s tech stack. You identified stakeholders, gathered requirements, and started agile iterations on providing it. Then comes a day when you can show the MVP to your internal client! Yet… the client has lost his interest: maybe right now he says that he has already come up with his own temporary solution and he has no intention to switch to another one? Building internal products differs from commercial ones - there is no flow of cash and your clients are fully transparent.\n\nIn this talk, I would like to share with you my experience and tips connected with developing such internal tools and standards. All of this from the perspective of a member of the Machine Learning Infra team that is delivering its solutions to a rapidly growing ML department in a company whose product is used by 300 million unique users per month.\n\nBut let’s be specific! I will talk about:\n\n- Common pitfalls and try to dig up the reasons for why they happen when developing internal solutions\n- How one can approach delivering tools (spoiler: pilot programs, guilds, and more!)\n- Learnings from introducing such approaches (what worked, what didn’t) in our case\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2436,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Paulina Winkowska"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/j4gwORB2lqI/maxresdefault.jpg",
  "title": "The intricate art of making your (internal) clients happy",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=j4gwORB2lqI"
    }
  ]
}
