{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "EuroPython 2022 - What transitioning from male to female taught me about leadership - presented by Ivett Ördög\n\n[Wicklow Hall 1 on 2022-07-15]\n\n\nI’ve been struggling with gender dysphoria (a debilitating sense of disconnect from the gender assigned to someone at birth) for decades, but it took me until not so long ago to realize what it was, and how it could be treated. Nothing has been the same since. Transitioning and the events leading up to it changed my life, and the experiences I had during my transition changed me as a person, and as a leader.\n\nIt’s hard for me to open up about this period in my life, not just because it comes with tremendous vulnerability, not just because it’s very personal, but also because it has been the hardest few months in my life. The decisions I faced were far more consequential and way harder to grapple than any decisions I had to make as a leader or any time during my professional career. However I feel that other people — people who will never go through anything like I did — can learn from my story a lot exactly because it has been a very unusual and difficult problem to solve.\"\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2769,
  "language": "eng",
  "recorded": "2020-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2022.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "europython-2022",
    "europython-dublin",
    "europython-online",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/O5ugv4rk_dU/maxresdefault.jpg",
  "title": "What transitioning from male to female taught me about leadership - presented by Ivett Ördög",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=O5ugv4rk_dU"
    }
  ]
}
