{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "EuroPython 2022 - Working with Audio in Python (feat. Pedalboard) - presented by Peter Sobot\n\n[Liffey B on 2022-07-13]\n\n\nDigital audio has been around for 40 years, but working with audio data can still be complicated, especially in Python. In this talk, we'll talk about how digital audio works from the ground up (from sounds, to bytes, to files), how you can use Python to do a bunch of really neat things with audio, and how a new Python library - Pedalboard - helps make working with audio much easier.\n\nEver used a digital audio workstation (DAW) like GarageBand, Ableton Live, Logic, or Pro Tools? Today's musicians use DAWs as instruments in themselves. But what if you want to combine the power of a DAW with the flexibility of writing your own code?\n\nPedalboard was built to fill this niche: to pull the power of a DAW into your Python code. Pedalboard makes it easy to build and apply audio effects, read and write audio files, and load audio plug-ins (\"\"VSTs\"\") without any complicated dependencies or frameworks. Just `import pedalboard` and go!\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1777,
  "language": "eng",
  "recorded": "2020-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2022.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2022.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "europython-2022",
    "europython-dublin",
    "europython-online",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/NYhkqXpFAlg/maxresdefault.jpg",
  "title": "Working with Audio in Python (feat. Pedalboard) - presented by Peter Sobot",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NYhkqXpFAlg"
    }
  ]
}
