{
  "description": "This tutorial will discuss the use of internal machine learning tooling\nin real self-driving car projects. We'll download a human-annotated\nimage dataset from the Udacity Self-Driving Car Project and discuss how\nstakeholders would approach this data in a real company. Finally we will\nlive-code an app using Streamlit to semantically search and visualize\nthe dataset and run models against it.\n\nWe've all seen poor tooling slow down data science and machine learning\nprojects. In fact, most projects develop their own unique ecosystem of\nbug- ridden and unmaintainable internal tools to analyze data, often\nthrough a patchwork of Jupyter Notebooks and Flask apps.\n\nIn this workshop, we'll discover a new workflow to write ML tools as\nPython scripts using Streamlit, the first app framework for ML\nengineers.\n\nPart one will be a whirlwind tour of Streamlit, creating apps, UIs, and\ndata caches. Then we'll download a human-annotated image dataset from\nthe Udacity Self-Driving Car Project and explore it.\n\nPart two will be about product management. We'll discuss how\nstakeholders would approach this data in a real self-driving car\nproject. How would a machine learning engineer or product manager want\nto understand this data? We'll then live-code a Streamlit app to\nfacilitate their needs.\n\nPart three will get nerdier! We'll integrate an object detection model\n(YOLO v3) into our app to explore the potential tooling benefits from\ninteractive inference.\n\nAt the end of the workshop you will have (1) a beautiful demo to show\noff to friends, and (2) a new weapon to tackle tooling problems in your\nown projects.\n\nSee the GitHub: https://github.com/streamlit/demo-self-driving\n",
  "duration": 4130,
  "language": "eng",
  "published_at": "2019-12-29T22:27:04.000Z",
  "recorded": "2019-12-03",
  "speakers": [
    "Adrien Treuille"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/0It8phQ1gkQ/hqdefault.jpg",
  "title": "Turn Python Scripts into Beautiful ML Tools",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0It8phQ1gkQ"
    }
  ]
}
