{
  "description": "Volunteer data scientists have converted 5 years of data about sheltered\nhomeless people in Downtown San Diego from hand-marked paper maps to a\ndetailed geographic dataset, using a combination of machine vision\ntools, Python programs and manual work. This talk will review how we\ncreated the dataset and how we are working with government and\nuniversities to use the dataset to inform social policy.\n\nFor the last 7 years, the `Downtown San Diego\nPartnership <https://downtownsandiego.org/>`__ has been conducting\nmonthly counts of homeless in the Downtown neighborhood. The data is\nrecorded on paper maps, which are `compiled into a\nspreadsheet. <https://downtownsandiego.org/wp-%20content/uploads/2019/02/January-2019-Unsheltered-Homeless-Sleep-Count-Web-%20Version-Final-003.pdf>`__\nThis is a fantastic dataset which would be even more useful if the\nhand-recorded paper maps were digitized. This project involves\ncollecting and digitizing 5 years of the monthly maps, to produce a\ngeographic dataset, whcih we will analyze for time trends and for the\nassociation between homeess movements, geography and the built\nenvironment.\n\nThis talk is suitable for people with an interest in using data to solve\nsocial issues any level of skill.\n\nThis talk will:\n\n-  Describe the scope of the homeless problem in San Diego and present\n   the opportunities for data science to inform homeless policy.\n-  Detail the process we used to convert the hand-marked maps, both the\n   manual process and use of machine vision\n-  Show the analysis of the final dataset, with specific emphasis on\n   geographic analysis using Geopandas and Jupyter.\n-  Demonstrate the data management process, using Metatab to package\n   data and publish it to Wordpress\n-  Present how we are training volunteer analysts in the PyData tools to\n   answer data questions posed by researchers.\n\nAttendees will learn important aspects of an important social problem\nand how to use data to solve these problems using a range of Python\ntools.\n",
  "duration": 2501,
  "language": "eng",
  "published_at": "2019-12-23T21:05:03.000Z",
  "recorded": "2019-12-05",
  "speakers": [
    "Eric Busboom"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/vHWa34WewNk/hqdefault.jpg",
  "title": "Tackling Homelessness with Open Data",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vHWa34WewNk"
    }
  ]
}
