{
  "description": "Buckminster Fuller said, “If you want to teach people a new way of\nthinking, don’t bother trying to teach them. Instead, give them a tool,\nthe use of which will lead to new ways of thinking.” This profound\ninsight shaped the way I build my organization. We will look at some\ntools that enable us to think like a data-driven organization.\n\nBuckminster Fuller said, “If you want to teach people a new way of\nthinking, don’t bother trying to teach them. Instead, give them a tool,\nthe use of which will lead to new ways of thinking.” This profound\ninsight shaped the way I build my organization. We will look at some of\nthe tools that enable us to think like a data-driven organization.\n\nTeams are built out of three things: \\* People \\* Processes \\* Resources\n\nThere is a 3 step process we can deploy. We start by focusing on\nresources, then processes, and lastly people. With each step we climb\nthe ladder of value.\n\nWith resources, we have tools. By choosing specific tools, we can being\nto shape our thinking. We can create mental pathways that intentionally\ntake us in a particular direction.\n\nAfter we establish the tools, we focus on our processes. These are our\nworkflows and in many ways, our philosophies. How we think things should\nproceed. This could be kanban and how we move work from left to right\nthrough the pipeline, and it can be kaizen and belief in small,\ncontinuous improvement. Processes can be considered tools as much as\nresources.\n\nOnce we have resources and processes, we can free up bandwidth with our\npeople. People are most creative and dynamic at this stage once friction\nis removed and adding business value can go from one-off fixes to\nbecoming part of the organization itself.\n\nTools that facilitate a data-driven culture: \\* Mental models \\* Kanban\nand Kaizen \\* Opinionated, structured data science like Kedro \\* OKRs \\*\nKPIs\n",
  "duration": 2523,
  "published_at": "2019-12-23T21:02:50.000Z",
  "recorded": "2019-12-04",
  "speakers": [
    "Franklin Sarkett"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/RG0h3pyFpd8/hqdefault.jpg",
  "title": "Building a Data Driven Organization",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RG0h3pyFpd8"
    }
  ]
}
