{
  "description": "Embedding techniques like word2vec and doc2vec are taking over the\nworld. An up and coming technique for embedding numeric data is UMAP.\nHow would you go about applying UMAP to real word data? How about text\ndata? What about malware? In this talk we’ll learn how to MAP all the\nthings!\n\nEmbedding techniques are taking over the world. From word2vec to embed\nwords, all the way to Latent Dirichlet Allocation and doc2vec to embed\ndocuments. All these techniques are really about turning non-numeric\ndata into vector space data suitable for either machine learning or\nvisualization. An up and coming technique for embedding numeric data is\n`UMAP <https://github.com/lmcinnes/umap>`__. How would you go about\napplying UMAP to word data? How about text data? What about malware? In\nthis talk we’ll learn how to MAP all the things!\n\nWe’ll introduce you to a new technique called WordMAP for generating\nvery low dimensional word embeddings by making use of UMAP. With this\ntechnique in hand one can generalize to a document embedding algorithm\nwe're calling DocMAP. This approach ultimately only requires sequences\nof tokens and thus can apply to much broader classes of problems. We’ll\ndemonstrate this by applying a variation of DocMAP to the problem of\nmapping the space of malware based on it’s behaviour.\n\nWhile the math behind UMAP might be challenging to some this talk will\nfocus more on how to apply it in novel situations and take a more\npractical approach to things. If you have problems that can fit in this\nframework you should come and learn how to MAP all the things!\n",
  "duration": 2908,
  "published_at": "2019-12-24T02:48:25.000Z",
  "recorded": "2019-12-05",
  "speakers": [
    "John Healy"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/OtVR_ZnXLu4/hqdefault.jpg",
  "title": "MAP all the things",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OtVR_ZnXLu4"
    }
  ]
}
