{
  "description": "This workshop serves as an introduction to reinforcement learning where\nthe participants will implement a Pac-Man agent. The Pac-Man agent will\nlearn how to solve different maps using Q-learning and Deep Q-learning.\nWe start out by exploring Q-learning, before diving into deep\nQ-learning, which utilizes neural networks. Jupyter notebook and GPUs\nwill be used to aid us in our work.\n\nOver the past few years, reinforcement learning (RL) has achieved\npromising results and it is currently being explored in a wide range of\nfields. In areas such as self driving cars, gaming and medicine, RL is\nthe frontier of state- of-the-art results. In this workshop we will\nexplore what the fuss is all about!\n\nThis workshop serves as an introduction to reinforcement learning where\nthe participants will implement a Pac-Man agent. The Pac-Man agent will\nlearn how to solve different maps using Q-learning and Deep Q-learning.\nWe start out by exploring Q-learning, a cornerstone in RL. Expanding\nfurther, we continue on to deep Q-learning, which utilizes neural\nnetworks. The code is executed in the cloud on Jupyter notebooks, and\nfor training the neural networks we use GPUs in the cloud. Everything is\nwritten in Python.\n\nNo prior knowledge of reinforcement learning is necessary.\n\nIf reinforcement learning has been a mysterious domain to you, this\nsession will most likely leave you with a greater understanding of the\nprocess and aid you in how to set up projects of your own.\n\n| **Optional preparation for the tutorial**\n| The tutorial will be much like a walkthrough, so it is quite fine to\n  just follow along without programming yourself. If you do, however,\n  want to interact with the actual code, it is recommended that you\n  clone the project and set up the Python environment beforehand. While\n  most of the tutorial will be in Jupyter Notebook, some setup is also\n  required on local machines. Since we only have 1.5 hours, we will not\n  have time to help individual participants setting up the project\n  during the actual tutorial, but if you do face issues you can send us\n  an email ahead of the tutorial. We will be happy to help!\n\n| Project repository: https://github.com/knowit/ml-pacman\n| Manu: `[email protected] </cdn-cgi/l/email-protection>`__\n| Malte: `[email protected] </cdn-cgi/l/email-protection>`__\n",
  "duration": 5456,
  "published_at": "2019-12-23T21:00:35.000Z",
  "recorded": "2019-12-03",
  "speakers": [
    "Manu Gopinathan",
    "Malte Loller-Andersen"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/NKUg2jgxu8E/hqdefault.jpg",
  "title": "Reinforcement Learning: Pac-Man",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NKUg2jgxu8E"
    }
  ]
}
