{
  "description": "Serverless apps are everywhere these days, but how do you get started?\nHow do you decide which provider to go with? I have created the same\nPython app with 3 services, AWS, Google Cloud & Microsoft Azure. I will\ngo over the highlights and lowlights, and how to judge what’s right for\nyour project.\n\nServerless apps are everywhere these days, but how do you get started?\nHow do you decide which provider to go with? I have created the same\nPython based app with 3 services, AWS, Google Cloud & Microsoft Azure. I\nwill go over the highlights and lowlights, and how to judge what’s right\nfor your project.\n\nMy goal for creating this app was to answer these questions. What\nservices are available for which languages, but especially Python? How\nfast can I get to coding? How do I programmatically define the\ninfrastructure? How do I test everything? How is their CI/CD pipeline?\nHow do I secure the app? How can I monitor what is going on?\n\nDuring my research I ran into a common problem. There are guides on how\nto use the UI to create samples. There is technical documentation that\nwill give you the name of the flag you are looking for. There is rarely\na user story to help you go from nothing to a running application. My\nuser story is that I wanted an endpoint that allows you to add data to\npersistent storage, get, edit and delete that data. Seems\nstraightforward, but there is a steep learning curve that had me tearing\nmy hair out. This talk is not just to give you a better understanding of\nserverless offerings, but to keep you from getting discouraged at the\ninevitable blockers. At the end of this talk you’ll walk out with the\nconfidence to create your first serverless microservice and smash any\nwalls you hit along the way.\n",
  "duration": 2331,
  "published_at": "2019-12-23T21:03:14.000Z",
  "recorded": "2019-12-04",
  "speakers": [
    "Michelle Brenner"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/1UX7oBDDJGg/hqdefault.jpg",
  "title": "Ahead in the Clouds: How to get started with serverless on Google, Amazon & Microsoft",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1UX7oBDDJGg"
    }
  ]
}
