{
  "description": "Named Entity Recognition (NER) is foundational for many downstream NLP\ntasks. The Open Source NERDS toolkit provides algorithms that can be\nused to quickly build and evaluate NER models from labeled data such as\nIOB. New algorithms can be added with minimal effort. This presentation\nwill demonstrate how to create and evaluate new NER models using NERDS,\nas well as add new NER algorithms to it.\n\nNamed Entity Recognition (NER) is foundational for many downstream NLP\ntasks such as Information Retrieval, Relation Extraction, Question\nAnswering, and Knowledge Base Construction. While many high-quality\npre-trained NER models exist, they usually cover a small subset of\npopular entities such as people, organizations, and locations. But what\nif we need to recognize domain specific entities such as proteins,\nchemical names, diseases, etc? The Open Source Named Entity Recognition\nfor Data Scientists (NERDS) toolkit, from the Elsevier Data Science\nteam, was built to address this need.\n\nNERDS aims to speed up development and evaluation of NER models by\nproviding a set of NER algorithms that are callable through the familiar\nscikit-learn style API. The uniform interface allows reuse of code for\ndata ingestion and evaluation, resulting in cleaner and more\nmaintainable NER pipelines. In addition, customizing NERDS by adding new\nand more advanced NER models is also very easy, just a matter of\nimplementing a standard NER Model class.\n\nOur presentation will describe the main features of NERDS, then walk\nthrough a demonstration of developing and evaluating NER models that\nrecognize biomedical entities. We will then describe a Neural Network\nbased NER algorithm (a Bi-LSTM seq2seq model written in Pytorch) that we\nwill then integrate into the NERDS NER pipeline.\n\nWe believe NERDS addresses a real need for building domain specific NER\nmodels quickly and efficiently. NER is an active field of research, and\nthe hope is that this presentation will spark interest and contributions\nof new NER algorithms and Data Adapters from the community that can in\nturn help to move the field forward.\n",
  "duration": 2071,
  "language": "eng",
  "published_at": "2019-12-24T02:48:31.000Z",
  "recorded": "2019-12-05",
  "speakers": [
    "Sujit Pal"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ilzFiK0nAh8/hqdefault.jpg",
  "title": "Building Named Entity Recognition Models Efficiently using NERDS",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ilzFiK0nAh8"
    }
  ]
}
