{
  "description": "When confronted with large-scale data challenges, we often reach for\ncomplex tools to help solve the problem. In the past 7 years, Ancestry\nDNA has amassed the largest collection of consumer genomic data in the\nworld, creating a new scaling challenge in the genomics world. We'll\nshow how picking simple tools in the Python ecosystem helped us solve\nmassive scaling challenges in production.\n\nWith data sets growing larger by the day, and the number of big-data\ntools growing right along with them, it can be daunting to select the\nright tool for the job. Sometimes, too, it's tempting to apply the\nlatest-and-greatest ones to the problems we're working on. But, more\noften than not, the simplest tool is the right one and, fortunately for\nus, that's where Python shines.\n\nIn a short 7 years, Ancestry has collected nearly 15 million DNA\nsamples. Data of this magnitude has proved to be a massive scaling\nchallenge for the production pipeline that must analyze that data set to\nproduce customer results every single day. This talk will tell the story\nof how that pipeline has evolved over the years, from a manual command\nline process, to a scheduled Hadoop pipeline, and finally into the\nPython-based, event-driven system we use today.\n\nThe talk will give a basic overview of our DNA test and cover our core\nrelative detection and ethnicity algorithms at a high level. I'll then\ndive into the constraints and specific challenges the pipeline presents,\nand how we decided to leverage Python & Celery to solve those problems.\nLastly, I'll describe the benefits of switching to Python, demonstrating\nthe simplicity, performance, and reduction in code it provided.\n",
  "duration": 3056,
  "language": "eng",
  "published_at": "2019-12-23T21:04:39.000Z",
  "recorded": "2019-12-05",
  "speakers": [
    "Tim Orme"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/4PI5iHfO6PE/hqdefault.jpg",
  "title": "Simplicity For Scale: Analyzing 15 Million DNA Samples With Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4PI5iHfO6PE"
    }
  ]
}
