{
  "description": "Some problems contain different types of data, including numerical,\ncategorical and text data. CatBoost is the first Gradient Boosting\nlibrary to have text features support out-of-the box. This talk will\nwalk you through main features of CatBoost library and explain how it\ndeals with text data.\n\nGradient boosting is a powerful machine-learning technique that achieves\nstate-of-the-art results in a variety of practical tasks. For a number\nof years, it has remained the primary method for learning problems with\nheterogeneous features, noisy data, and complex dependencies: web\nsearch, recommendation systems, weather forecasting, and many others.\n\nSome problems contain different types of data, including numerical,\ncategorical and text data. In this case the best solution is either\nbuilding new numerical features instead of text and categories and pass\nit to gradient boosting, or using out-of-the box solutions for that.\n\nCatBoost (https://catboost.ai/) is the first Gradient Boosting library\nto have text features support out-of-the box.\n\nCatBoost is a popular open-source gradient boosting library with a whole\nset of advantages:\n\n1. CatBoost is able to incorporate categorical features and text\n   features in your data with no additional preprocessing.\n\n2. CatBoost has the fastest GPU and multi GPU training implementations\n   of all the openly available gradient boosting libraries.\n\n3. CatBoost predictions are 20-60 times faster then in other open-source\n   gradient boosting libraries, which makes it possible to use CatBoost\n   for latency-critical tasks.\n\n4. CatBoost has a variety of tools to analyze your model.\n\nThis talk will walk you through main features of this library including\nthe way it works with texts.\n",
  "duration": 2243,
  "language": "eng",
  "published_at": "2019-12-23T21:04:00.000Z",
  "recorded": "2019-12-04",
  "speakers": [
    "Anna Veronika Dorogush"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/8IUKk7xSU5g/hqdefault.jpg",
  "title": "Gradient Boosting for data with both numerical and text features",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8IUKk7xSU5g"
    }
  ]
}
