{
  "alias": "video/3307/tsar-the-timeseries-aggregator",
  "category": "PyGotham 2014",
  "copyright_text": "youtube",
  "description": "Twitter depends heavily on real-time event aggregation. Classic\ntimeseries applications include site traffic, service health, and user\nengagement monitoring; these are increasingly complemented by a range of\nproducts and features that surface aggregated timeseries data directly\nto end users. Services that power such features need to be resilient\nenough to ensure a consistent user experience, flexible enough to\naccommodate a rapidly changing product roadmap, and able to scale to\ntens of billions of events per day.\n\nExperience has shown that truly robust real-time aggregation services\nare hard to build; scaling and evolving them gracefully is even harder;\nand, moreover, many timeseries applications call for essentially the\nsame architecture, with slight variations in the data model. Solving\nthis broad class of problems at Twitter has been a multiyear effort. In\nprevious talks we have introduced Summingbird, a high-level abstraction\nlibrary for generalized distributed computation, which provides an\nelegant descriptive framework for complex aggregation problems. In this\ntalk, I will describe how we built a flexible, reusable, end-to-end\nservice architecture on top of Summingbird, called TSAR (the TimeSeries\nAggregatoR).\n\nTSAR uses Python to provide an service toolkit that integrates with\nessential services that provide data processing, data warehousing, query\ncapability, observability, and alerting, automatically configuring and\norchestrating its components.\n",
  "duration": null,
  "id": 3307,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-09-17",
  "slug": "tsar-the-timeseries-aggregator",
  "source_url": "https://www.youtube.com/watch?v=XzHokP3NZu4",
  "speakers": [
    "Anirudh Todi"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/XzHokP3NZu4/hqdefault.jpg",
  "title": "TSAR (the TimeSeries AggregatoR)",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XzHokP3NZu4"
    }
  ]
}