{
  "description": "Women and Non-Binary in PyTorch Breakfast with Quiana Berry, Red Hat\n\nNavigating the AI Revolution Responsibly in the Open Source Community \nAs the AI revolution reshapes the technological landscape, it is imperative to prioritize diversity, equity, and inclusion in open source communities. This engaging breakfast session at the PyTorch Conference invites diverse open source leaders to embark on a reflective journey. Together, we will explore the room for change in the AI ecosystem, establish governance guardrails to shield vulnerable communities from potential harm, and underscore the critical need to protect marginalized voices.\nWith a compelling blend of thought-provoking insights and creative expression, the session will dive into real-world examples, strategies for ethical AI governance, and showcase initiatives that integrate inclusivity into AI development.\nQuiana Berry, a passionate advocate at the intersection of technology and social justice, will present a powerful poetry performance that encapsulates the nuances of the AI revolution and the importance of safeguarding diverse communities.\nJoin us in this transformative dialogue as we collectively envision an AI landscape that not only embraces innovation but also champions the well-being of every community. Let's harness the power of the open source PyTorch community to ignite change and create a future where diversity is at the heart of responsible AI development.\nKey Takeaways:\n1. Gain insights into the potential impact of AI on diverse communities and the need for inclusive AI development.\n2. Understand the significance of ethical AI governance and how open source communities can shape responsible AI practices.\n3. Explore real-life examples and initiatives that prioritize diversity and equity in AI development.\n4. Experience a thought-provoking poetry performance that captures the essence of the discussion and inspires action.",
  "duration": 2456,
  "language": "eng",
  "recorded": "2023-10-16",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pytorch.org/event/pytorch-conference-2023/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/bOKwFEklkUs/maxresdefault.webp",
  "title": "Women and Non-Binary in PyTorch Breakfast with Quiana Berry, Red Hat",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bOKwFEklkUs"
    }
  ]
}
