{
  "description": "The python community has gained and seen improvement in tools because of\nthe various contributions to its open source infrastructure and\nprojects. Research shows most python open source infrastructure and\nprojects are survived by an average of two contributors and yet\ncompanies are building palaces using this python open source\ninfrastructure and projects since it's usually very easy to find the\nupstream source for them.\n\nThis talk shall focus on why python developers need to contribute to the\npython open source infrastructure and projects now more than before, how\none can contribute to python open source Infrastructure and projects and\nwhat prominent python open source Infrastructure and projects are\navailable to contribute to.\n\nDuring this talk, we will discuss what open source really is, the\ndifference between open source software and free software, licenses\ninvolved in open source software, why python project owners need to make\ntheir software open source, why python developers and students need to\ncontribute to python open source Infrastructure and projects now more\nthan ever , what python open source infrastructure Infrastructure and\nprojects contribution opportunities students have during summer. We will\nalso have a walk-through of submitting a pull request to a python open\nsource project using qutebrowser for an example for attendees who have\nnever contributed to open source before.\n",
  "duration": 1299,
  "language": "eng",
  "recorded": "2016-10-06",
  "related_urls": [
    "https://2016.za.pycon.org/talks/65/"
  ],
  "speakers": [
    "Joannah Nanjekye"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/y7SwS7hIb1o/hqdefault.jpg",
  "title": "Contributing to python open source Infrastructure and projects",
  "videos": [
    {
      "type": "youtube",
      "url": "http://youtu.be/y7SwS7hIb1o"
    },
    {
      "type": "archive",
      "url": "https://archive.org/details/pyconza2016-Contributing_to_python_open_source_Infrastructure_and_projects"
    }
  ]
}
