{
  "description": "<p>The python community has gained and seen improvement in tools because of the various contributions to its open source infrastructure and projects. Research shows most python open source infrastructure and projects are survived by an average of two contributors and yet companies are building palaces using this python open source infrastructure and projects since it's usually very easy to find the upstream source for them.</p>\n<p>This talk shall focus on why python developers need to contribute to the python open source infrastructure and projects now more than before, how one can contribute to  python open source  Infrastructure and projects and what prominent python open source Infrastructure and projects are available to contribute to.</p>\n<p>During this talk, we will discuss what open source really is, the difference between open source software and free software, licenses involved in open source software, why python project owners need to make their software open source, why python developers and students  need to contribute to python open source  Infrastructure and projects now more than ever , what python open source infrastructure  Infrastructure and projects contribution opportunities students have during summer. We will also have a walk-through of submitting a pull request to a python open source project using qutebrowser for an example for attendees who have never contributed to open source before.</p>",
  "duration": 1299,
  "recorded": "2016-10-06",
  "related_urls": [
    "https://2016.za.pycon.org/talks/65/"
  ],
  "speakers": [
    "Joannah Nanjekye"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/y7SwS7hIb1o/hqdefault.jpg",
  "title": "Contributing to python open source Infrastructure and projects",
  "videos": [
    {
      "type": "youtube",
      "url": "http://youtu.be/y7SwS7hIb1o"
    },
    {
      "type": "archive",
      "url": "https://archive.org/details/pyconza2016-Contributing_to_python_open_source_Infrastructure_and_projects"
    }
  ]
}
