{
  "description": "<section class=\"section1\"><h1>AUDIENCE</h1>\n<ul>\n<li>data scientists (current and aspiring)</li>\n<li>those who want to know more about data mining, analysis, and processing </li>\n<li>those interested in functional programming</li>\n</ul>\n</section><section class=\"section1\"><h1>DESCRIPTION</h1>\n<p>Data mining is a key skill that involves transforming data found online and elsewhere from a hodgepodge of numbers into actionable information. Using examples ranging from RSS feeds, open data portals, and web scraping, this tutorial will show you how to efficiently obtain and transform data from disparate sources.</p>\n</section><section class=\"section1\"><h1>ABSTRACT</h1>\n<p>Data mining is a key skill that any self proclaimed data scientist should possess. It involves transforming data from disparate sources and a hodgepodge of numbers into actionable information. Tabular data, e.g., csv/excel files, is very common in data mining and greatly benefits from python's functional programming idioms. For better or for worse, the leading python data libraries, Numpy and Pandas, eschew the functional programming style for object-oriented programming. </p>\n<p>Using examples ranging from RSS feeds, the South Africa Data Portal API, raw excel files, and basic web scraping, this tutorial will show how to efficiently locate, obtain, transform, and remix data from the web. These examples will prove that you can do a lot with functional programming and without the need for Numpy or Pandas.</p>\n<p>Finally, it will introduce meza: a pure python, functional, data analysis library and alternative to Pandas.</p>\n<p>IPython notebooks and sample data files will be distributed beforehand on Github to facilitate code distribution.</p>\n</section><section class=\"section1\"><h1>OBJECTIVES</h1>\n<p>Attendees will learn what data and data mining are, why they are important. They will learn some basic functional programming idioms and see how it is ideally suited to data mining. They will also see in what areas the 20lb gorilla (Pandas) shines and when a lightweight alternative (meza) is more practical.</p>\n</section><section class=\"section1\"><h1>ADDITIONAL INFO</h1>\n<section class=\"section2\"><h2>Level</h2>\n<p>Intermediate</p>\n</section><section class=\"section2\"><h2>Prerequisites</h2>\n<p>Students should have at least basic knowledge of python itertools and functional programming paradigms, e.g., map, filter, reduce, and list comprehensions.</p>\n<p>Laptops should have python3 and the following pypi libs installed: bs4, requests, and meza.</p>\n</section><section class=\"section2\"><h2>Format</h2>\n<p>Students will be instructed in the completion of a series of exercises that will explore using python for data mining. It will involve lessons to introduce concepts; demos which implement the concepts using meza, beautiful soup, and requests; and exercises for students to apply the concepts. </p>\n</section></section><section class=\"section1\"><h1>OUTLINE</h1>\n<ul>\n<li>[10 min] Part I<ul>\n<li>[2 min] Intro (lecture)<ul>\n<li>Who am I?</li>\n<li>Topics to cover</li>\n<li>format</li>\n</ul>\n</li>\n<li>[8 min] Definitions (lecture)<ul>\n<li>What is data?</li>\n<li>What is data mining?</li>\n<li>Why is it data mining important?</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>[35 min] Part II <ul>\n<li>[15 min] You might not need pandas (demo)<ul>\n<li>Obtaining data</li>\n<li>Analyzing and Transforming data</li>\n</ul>\n</li>\n<li>[20 min] interactive data gathering (exercise) </li>\n</ul>\n</li>\n<li>[45 min] Part III <ul>\n<li>[10 min] Introducing meza (demo) </li>\n<li>[20 min] interactive data processing (exercise) </li>\n<li>[15 min] Q&amp;A</li>\n</ul>\n</li>\n</ul>\n</section>",
  "duration": 3832,
  "recorded": "2016-10-07",
  "speakers": [
    "Reuben Cummings"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/05C_E1wyT1I/hqdefault.jpg",
  "title": "Data Mining and Processing for fun and profit",
  "videos": [
    {
      "type": "youtube",
      "url": "http://youtu.be/05C_E1wyT1I"
    }
  ]
}