{
  "description": "AUDIENCE\n========\n\n-  data scientists (current and aspiring)\n-  those who want to know more about data mining, analysis, and\n   processing\n-  those interested in functional programming\n\nDESCRIPTION\n===========\n\nData mining is a key skill that involves transforming data found online\nand elsewhere from a hodgepodge of numbers into actionable information.\nUsing examples ranging from RSS feeds, open data portals, and web\nscraping, this tutorial will show you how to efficiently obtain and\ntransform data from disparate sources.\n\nABSTRACT\n========\n\nData mining is a key skill that any self proclaimed data scientist\nshould possess. It involves transforming data from disparate sources and\na hodgepodge of numbers into actionable information. Tabular data, e.g.,\ncsv/excel files, is very common in data mining and greatly benefits from\npython's functional programming idioms. For better or for worse, the\nleading python data libraries, Numpy and Pandas, eschew the functional\nprogramming style for object-oriented programming.\n\nUsing examples ranging from RSS feeds, the South Africa Data Portal API,\nraw excel files, and basic web scraping, this tutorial will show how to\nefficiently locate, obtain, transform, and remix data from the web.\nThese examples will prove that you can do a lot with functional\nprogramming and without the need for Numpy or Pandas.\n\nFinally, it will introduce meza: a pure python, functional, data\nanalysis library and alternative to Pandas.\n\nIPython notebooks and sample data files will be distributed beforehand\non Github to facilitate code distribution.\n\nOBJECTIVES\n==========\n\nAttendees will learn what data and data mining are, why they are\nimportant. They will learn some basic functional programming idioms and\nsee how it is ideally suited to data mining. They will also see in what\nareas the 20lb gorilla (Pandas) shines and when a lightweight\nalternative (meza) is more practical.\n\nADDITIONAL INFO\n===============\n\nLevel\n-----\n\nIntermediate\n\nPrerequisites\n-------------\n\nStudents should have at least basic knowledge of python itertools and\nfunctional programming paradigms, e.g., map, filter, reduce, and list\ncomprehensions.\n\nLaptops should have python3 and the following pypi libs installed: bs4,\nrequests, and meza.\n\nFormat\n------\n\nStudents will be instructed in the completion of a series of exercises\nthat will explore using python for data mining. It will involve lessons\nto introduce concepts; demos which implement the concepts using meza,\nbeautiful soup, and requests; and exercises for students to apply the\nconcepts.\n\nOUTLINE\n=======\n\n-  [10 min] Part I\n\n   -  [2 min] Intro (lecture)\n\n      -  Who am I?\n      -  Topics to cover\n      -  format\n\n   -  [8 min] Definitions (lecture)\n\n      -  What is data?\n      -  What is data mining?\n      -  Why is it data mining important?\n\n-  [35 min] Part II\n\n   -  [15 min] You might not need pandas (demo)\n\n      -  Obtaining data\n      -  Analyzing and Transforming data\n\n   -  [20 min] interactive data gathering (exercise)\n\n-  [45 min] Part III\n\n   -  [10 min] Introducing meza (demo)\n   -  [20 min] interactive data processing (exercise)\n   -  [15 min] Q&A\n\n\n",
  "duration": 3832,
  "language": "eng",
  "recorded": "2016-10-07",
  "related_urls": [
    "https://2016.za.pycon.org/talks/38/"
  ],
  "speakers": [
    "Reuben Cummings"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/05C_E1wyT1I/hqdefault.jpg",
  "title": "Data Mining and Processing for fun and profit",
  "videos": [
    {
      "type": "youtube",
      "url": "http://youtu.be/05C_E1wyT1I"
    },
    {
      "type": "archive",
      "url": "https://archive.org/details/pyconza2016-Data_Mining_and_Processing_for_fun_and_profit"
    }
  ]
}
