{
  "description": "Metrics are highly superior to logging in regards of understanding the\npast, presence, and future of your applications and systems. They are\ncheap to gather (just increment a number!) but setting up a metrics\nsystem to collect and store them is a major task.\n\nYou may have heard of statsd, Riemann, Graphite, InfluxDB, or OpenTSB.\nThey all look promising but on a closer look it’s apparent that some of\nthose solutions are straight-out flawed and others are hard to integrate\nwith each other or even to get up and running.\n\nThen came Prometheus and gave us independence of UDP, no complex math in\nyour application, multi-dimensional data by adding labels to values (no\nmore server names in your metric names!), baked in monitoring\ncapabilities, integration with many common systems, and official clients\nfor all major programming languages. In short: a unified way to gather,\nprocess, and present metrics.\n\nThis talk will:\n\n#. explain why you want to collect metrics,\n#. give an overview of the problems with existing solutions,\n#. try to convince you that Prometheus may be what you’ve been waiting\n   for,\n#. teach how to impress your co-workers with beautiful graphs and\n   intelligent monitoring by putting a fully instrumented Python\n   application into production,\n#. and finally give you pointers on how to migrate an existing metrics\n   infrastructure to Prometheus or how to integrate Prometheus therein.\n\n",
  "duration": 2596,
  "language": "eng",
  "recorded": "2016-10-07",
  "related_urls": [
    "https://2016.za.pycon.org/talks/27/"
  ],
  "speakers": [
    "Hynek Schlawack"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/CDs7o0U2WvA/hqdefault.jpg",
  "title": "Get Instrumented: How Prometheus Can Unify Your Metrics",
  "videos": [
    {
      "type": "youtube",
      "url": "http://youtu.be/CDs7o0U2WvA"
    },
    {
      "type": "archive",
      "url": "https://archive.org/details/pyconza2016-Get_Instrumented_How_Prometheus_Can_Unify_Your_Metrics"
    }
  ]
}
