{
  "description": "<p>We at <a href=\"http://code4sa.org/\">Code For South Africa</a> use technology to facilitate promoting informed decision making for positive social change. This can mean generally being aware of what's going on, as well as deep critical research and analysis. We run the civic tech movement <a href=\"https://codebridge.org.za\">{code}bridge</a> where people come and hack together or on their lonesome on civic tech projects. A quick summary will be given of some outputs of this community in Cape Town and Ethekwini.</p>\n<p>We'll summarise some work we've done using mostly common python tools for the good of South African society. In particular I'll show how I've scraped and mirrored a government website on a tight budget at {code}bridge for better access to public information and seen usage pick up right after the local elections. We'll also show how a little bit of tech can empower citizens to hold government to account, and participate in the governing and development of our infrastructure. How presumably boring government notices really come to life when made accessible and personal.</p>\n<p>This talk is aimed at anyone keen on making a big impact with a little bit of tech, and interested in improving lives. There are many low hanging fruit out there where lives can be improved with technology facilitating the necessary groundwork. I'd like to show you how easy it is to make an impact.</p>\n<p>This is a heavily revised version of a talk given at DebConf 2016 with several new projects matured or launched since.</p>",
  "duration": 2067,
  "recorded": "2016-10-06",
  "related_urls": [
    "https://za.pycon.org/talks/69/"
  ],
  "speakers": [
    "JD Bothma"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/MeT09eAhDpk/hqdefault.jpg",
  "title": "Public Python for the greater good",
  "videos": [
    {
      "type": "youtube",
      "url": "http://youtu.be/MeT09eAhDpk"
    },
    {
      "type": "archive",
      "url": "https://archive.org/details/pyconza2016-Public_Python_for_the_greater_good"
    }
  ]
}