{
  "description": "We at `Code For South Africa <http://code4sa.org/>`__ use technology to\nfacilitate promoting informed decision making for positive social\nchange. This can mean generally being aware of what's going on, as well\nas deep critical research and analysis. We run the civic tech movement\n`{code}bridge <https://codebridge.org.za>`__ where people come and hack\ntogether or on their lonesome on civic tech projects. A quick summary\nwill be given of some outputs of this community in Cape Town and\nEthekwini.\n\nWe'll summarise some work we've done using mostly common python tools\nfor the good of South African society. In particular I'll show how I've\nscraped and mirrored a government website on a tight budget at\n{code}bridge for better access to public information and seen usage pick\nup right after the local elections. We'll also show how a little bit of\ntech can empower citizens to hold government to account, and participate\nin the governing and development of our infrastructure. How presumably\nboring government notices really come to life when made accessible and\npersonal.\n\nThis talk is aimed at anyone keen on making a big impact with a little\nbit of tech, and interested in improving lives. There are many low\nhanging fruit out there where lives can be improved with technology\nfacilitating the necessary groundwork. I'd like to show you how easy it\nis to make an impact.\n\nThis is a heavily revised version of a talk given at DebConf 2016 with\nseveral new projects matured or launched since.\n",
  "duration": 2067,
  "language": "eng",
  "recorded": "2016-10-06",
  "related_urls": [
    "https://2016.za.pycon.org/talks/69/"
  ],
  "speakers": [
    "JD Bothma"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/MeT09eAhDpk/hqdefault.jpg",
  "title": "Public Python for the greater good",
  "videos": [
    {
      "type": "youtube",
      "url": "http://youtu.be/MeT09eAhDpk"
    },
    {
      "type": "archive",
      "url": "https://archive.org/details/pyconza2016-Public_Python_for_the_greater_good"
    }
  ]
}
