{
  "description": "The field of bioinformatics -- using computer technology to store,\nprocess and analyze biological data -- is relatively new, but is\nexpanding rapidly. Many free and commercial tools, both online and\nstand-alone, are available. This presentation will describe the approach\nand tools developed in our research group at the University of the\nWitwatersrand. Although we research hepatitis B virus, many of the tools\ncan be used with any biological sequence data (DNA, RNA or amino acids).\n\nThe tools cover several aspects of typical laboratory research,\nincluding tools to process sequence data, automate analyses and report\nvariations in sequences. The tools were developed to be quick,\nlightweight solutions, which could easily be used routinely by\nresearchers without extensive computer skills. Many of the tools have\nbeen developed in direct response to a specific need.\n\nTopics covered will include the design approach (online, CGI-scripts, no\nframeworks) and the reasons for this approach, as well as the experience\nof working as the only bioinformaticist in a wet laboratory. Mention\nwill also be made of other resources, such as R and SQL, in addition to\nPython.\n\nSeveral of the tools have been described in published papers. The tools\nare all freely available online\n(`http://hvdr.bioinf.wits.ac.za/tools <http://hvdr.bioinf.wits.ac.za/tools>`__)\nand source code for most of the tools is available via GitHub at the\nfollowing address:\n`https://github.com/DrTrevorBell <https://github.com/DrTrevorBell>`__\n",
  "duration": 2495,
  "language": "eng",
  "recorded": "2016-10-06",
  "related_urls": [
    "https://2016.za.pycon.org/talks/25/"
  ],
  "speakers": [
    "Trevor Bell"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/wNQGPJgGSa4/hqdefault.jpg",
  "title": "Python in Viral Bioinformatics Research",
  "videos": [
    {
      "type": "youtube",
      "url": "http://youtu.be/wNQGPJgGSa4"
    },
    {
      "type": "archive",
      "url": "https://archive.org/details/pyconza2016-Python_in_Viral_Bioinformatics_Research"
    }
  ]
}
