{
  "description": "Brand-new challenges have arisen in the field of three-dimensional space\nand form, such as; architecture, geometry, material, and even energy,\nwhich requires in thorough investigation and understanding of the\noutcomes to discover optimum design solutions. However, without this\nunderstanding, analysis and the overlay of interactive data seems\nimpossible and fanciful. Although it was not possible to analyse and use\ndata in traditional architecture, today it is getting real to do with\nthe large volumes of information such as, annual climatic data, sun\npositions, environmental data, energy data etc.\n\nPython is the most adaptable and robust program which we use to analyse,\noverlay and optimise data in the field of architecture. We want to\nunderstand how it works in a three-dimensional program such as Rhino and\nhow it can help us to develop our ideas and utilise the recent\narchitectural design methodology, which is known as parametric\narchitecture, or algorithmic architecture.\n\nWe will demonstrate 3 different experiences in the fields of; geometry,\nenergy, and optimization, and what the approach of each is. Python aids\nthe design of architectural elements through the relation of form to and\ndata simulations. This would be of interest to those who want to see the\nfuture of algorithmic design for; architects, designers, and\nprogrammers. There is no experience needed, we just want to express the\nenjoyment these tools can add to three-dimensional design.\n",
  "duration": 2270,
  "language": "eng",
  "recorded": "2016-10-06",
  "related_urls": [
    "https://2016.za.pycon.org/talks/40/"
  ],
  "speakers": [
    "Navid Hatefnia"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/gXn6J70q8ac/hqdefault.jpg",
  "title": "Python, Pet of Architects",
  "videos": [
    {
      "type": "youtube",
      "url": "http://youtu.be/gXn6J70q8ac"
    },
    {
      "type": "archive",
      "url": "https://archive.org/details/pyconza2016-Python_Pet_of_Architects"
    }
  ]
}
