{
  "description": "SQLite is arguably the most widely used database system if it's website\nis to be believed. From applications in aviation to the cellphone\nindustry.\n\nYet another practical application that has been suggested by it's\ncreator is that of an application file format. To quote the website:\n\"SQLite does not compete with client/server databases. SQLite competes\nwith fopen().\"\n\nIn other words, instead of rolling out your own file format, why not use\na file format that is accessible via a commonly known language (SQL)?\n\nSQLite is included by default in a number of operating systems such as\nBlackberry 10 OS, Google Android, Net/Open/FreeBSD, Oracle Solaris 10,\nApple OSX 10.4+ and Windows 10 amongst others. Programming languages\nwith bindings for SQLite are C, C#, C++, Go, Java, Javascript, PHP,\nPython, Lisp and others. This means that SQLite can be used across a\nvery wide range of the most popular devices and environments. Major\noperating systems support Sqlite out of the box, making it easy to port\nas well without needing to worry about cross-platform compatibility.\n\nOne example of how SQLite and Python could be of use is in incoming\nproduct information processing. We have various CSV or XML product feeds\nthat provides locations to product images via a cabal of bash scripts.\nThe idea would be to convert the information into a common format, ie\nSQLite rows and tables and allow jobs to process these rows, instead of\ncreating bespoke scripts to act directly on the feed files themselves.\n\nThe obvious advantage of using SQLite and Python for this task is that\nit keeps overhead down and has the advantage of better structure,\nexception handling, portability and extensibility\n",
  "duration": 1794,
  "language": "eng",
  "recorded": "2016-10-06",
  "related_urls": [
    "https://2016.za.pycon.org/talks/63/"
  ],
  "speakers": [
    "Stephan Van Ellewee"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/xoh6KHriqT8/hqdefault.jpg",
  "title": "Some less obvious uses of SQLite",
  "videos": [
    {
      "type": "youtube",
      "url": "http://youtu.be/xoh6KHriqT8"
    },
    {
      "type": "archive",
      "url": "https://archive.org/details/pyconza2016-Some_Less_obvious_uses_of_SQLite"
    }
  ]
}
