{
  "description": "Taking the title from the seminal philosphy of mind paper by Thomas\nNagel (What is it like to be a Bat (1974)) this talk looks at the\nproblems surrounding Artificial Intelligence, illustrated with examples\nfrom my own artistic practice.\n\nWhat do we mean by intelligence? How do the limitations of language\nleave us floundering with regards to discussing our relationship with\n‘algorithms’ and emerging machine intelligence? I argue that the\nlimitations in the discourse surrounding AI are remarkably similar to\nthe problems found in psychology and philosophy relating to other minds.\n\nMuch has been said about the forthcoming ‘singularity’, but little\nattention is being paid to the signals and signs already emerging on\nthis path. My artworks play in this space, highlighting the potentials\nand limitations inherent in existing technologies and questioning our\nrelationship with the world of bots.\n\nWe already live in an algorithmically mediated world, though in many\nways we remain blind to the ramifications. The world of the future will\nbe teeming with intelligent systems, though they may not conform to our\nnarrow anthropomorphic perspective on what intelligence is. For us to\nprepare for the future, perhaps we need to change the way we think about\nthinking, just as the machines are changing theirs.\n",
  "duration": 2917,
  "language": "eng",
  "recorded": "2015-06-20",
  "speakers": [
    "Eric Drass"
  ],
  "summary": "What do we mean by intelligence? How do the limitations of language\nleave us floundering with regards to discussing our relationship with\n‘algorithms’ and emerging machine intelligence? I argue that the\nlimitations in the discourse surrounding AI are remarkably similar to\nthe problems found in psychology and philosophy relating to other\nminds.",
  "tags": [
    "keynote"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/-LDXqGFD-Qw/hqdefault.jpg",
  "title": "Keynote: What's it Like to be a Bot?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-LDXqGFD-Qw"
    }
  ]
}
