{
  "description": "Using Pymc and the pydata stack to attack a problem in rugby analytics.\nSimilar to my talk submitted to Berlin. Probabilistic Programming and\nBayesian Methods are called by some a new paradigm. There are numerous\ninteresting applications such as to Quantitative Finance. I'll discuss\nwhat probabilistic programming is, why should you care and how to use\nPyMC and PyMC3 from Python to implement these methods. I'll be applying\nthese methods to studying the problem of 'rugby sports analytics'\nparticularly how to model the winning team in the recent Six Nations in\nRugby. I will discuss the framework and how I was able to quickly and\neasily produce an innovative and powerful model as a non- expert. I will\ngo into more detail than normal, giving a few examples of Bayesian\nProgramming, and a brief introduction to statistics and statistical\nthinking. My technical case study will be the Rugby Analytics, Football\nAnalytics and FinTech friendly Quantitative Finance examples. Technology\nused: PyMC, PyMC3, Pandas, Pydata stack. I recommend Anaconda installed\non your laptops to get everyone off the ground easily. Link to the\nTutorial is here `PyMC\nTutorial <https://github.com/springcoil/TutorialPyMCRugby>`__ I have the\nfollowing dependencies for my tutorial. pip install patsy pandas pip\ninstall pymc - PyMC2 pip install git+https://github.com/pymc-devs/pymc3\n- PyMC3 pip install seaborn\n",
  "duration": 5512,
  "language": "eng",
  "recorded": "2015-06-19",
  "speakers": [
    "Peadar Coyle"
  ],
  "summary": "A discussion and tutorial of how to use pymc to predict rugby\nresults. Also will include an introduction to Bayesian statistics.\n\nProbabilistic Programming and Bayesian Methods are called by some a\nnew paradigm. There are numerous interesting applications such as to\nQuantitative Finance.I'll discuss what probabilistic programming is,\nwhy should you care and how to use PyMC and PyMC3 from Python to\nimplement these methods. I'll be applying these methods to studying\nthe problem of 'rugby sports analytics' particularly how to model the\nwinning team in the recent Six Nations in Rugby. I will discuss the\nframework and how I was able to quickly and easily produce an\ninnovative and powerful model as a non-expert.",
  "thumbnail_url": "https://i.ytimg.com/vi/T7W10mEu6mI/hqdefault.jpg",
  "title": "Probabilistic programming in sports analytics",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=T7W10mEu6mI"
    }
  ]
}
