{
  "description": "Deep Learning is an exciting trend in machine learning, where neural\nnetworks of many layers “deep” can automatically learn features from\nlarge volumes of data, in turn setting new standards for audio, image,\nand language understanding, machine translation, object and face\nrecognition, etc.\n\nThe talk will start with a short overview of Deep Learning, both the\ndeserved praise, as well as some of its criticisms, and explain some of\nthe ways in which both text and vision data can be represented within a\nsingle united model. Such a single model has not only amazingly accurate\nresults for existing language and vision tasks, but also offers new\npossibilities for business and society at large.\n\nIn the second portion of the talk I will tell a bit about how one would\ngo about training a deep neural net for the first time, and what are\nsome of the established practices to follow. We will go over one or more\nof the most widely used python packages (theano, pylearn, caffe) which\nenable machine learning enthusiasts to easily prototype and run deep\narchitectures. Aided by iPython notebook(s) we will do some live coding\nto create and run a deep neural net, and see how it performs in the wild\non a language or vision task.\n",
  "duration": 2589,
  "language": "eng",
  "recorded": "2015-06-21",
  "related_urls": [
    {
      "label": "slides",
      "url": "http://www.slideshare.net/roelofp/python-for-image-understanding-deep-learning-with-convolutional-neural-nets"
    }
  ],
  "speakers": [
    "Roelof Pieters"
  ],
  "summary": "Deep Learning is an exciting trend in machine learning, where neural\nnetworks of many layers “deep” can automatically learn features from\nlarge volumes of data, setting new standards for image, audio and\nlanguage understanding. In this interactive session we will go over\nsome of the most popular python libraries for deep learning and will\ntrain an actual deep neural nets end to end.\n\nSlides available here: http://www.slideshare.net/roelofp/python-for-image-understanding-deep-learning-with-convolutional-neural-nets",
  "thumbnail_url": "https://i.ytimg.com/vi/5FwpxS1AfAY/hqdefault.jpg",
  "title": "Python for Image and Text Understanding: One Model to rule them all!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5FwpxS1AfAY"
    }
  ]
}
