{
  "description": "The `Bokeh data visualization library <http://bokeh.pydata.org/>`__\nallows you to build interactive visualizations for the web in python. It\nhas a range of capabilities from quick \"one-line\" charts to streaming\ndatasets to integrating with your existing plot libraries such as\nmatplotlib or ggplot.\n\nThis training gives a quick hands-on introduction to Bokeh's core\nfeatures. We'll do exercises building up a variety of visualizations and\nfinish up discussing topics and questions from participants related to\ntheir own datasets & needs.\n\nThis is the planned outline:\n\n-  (20 minutes) Bokeh feature walk-through. The relationship between\n   bokeh, bokehjs and bokeh-server. The various API levels of bokeh\n   (models, plotting, charts). And, examples of a variety of\n   visualizations.\n\n-  (20 minutes): Exercises - 1 - The charts & plotting interface. Get\n   quickly plotting in an ipython notebook. Different types of data\n   accepted, and how to customize a plot.\n\n-  (10 minutes): Tips for navigating the Bokeh docs and examples as\n   you're getting up to speed.\n\n-  (20 minutes): Exercises - 2 - (a) The models interface. Build a\n   custom plot from the ground up using the Models API. (b) Quick, yet\n   custom, using the charts interface and models together.\n\n-  (10 minutes): Sharing your plots. Overview of the different ways to\n   share your plots with your colleagues and the world.\n\n-  (20 minutes): Exercises - 3 - Add custom interactivity - Customize\n   your hover and selections. Implement linked selection, brushing, and\n   panning.\n\n-  (20 minutes): open space for questions and interactively solving\n   Bokeh problems on your real-life problems & data as time permits.\n",
  "duration": 4774,
  "language": "eng",
  "recorded": "2015-06-19",
  "speakers": [
    "Sarah Bird",
    "Bryan Van de Ven"
  ],
  "summary": "The Bokeh data visualization library allows you to build interactive\nvisualizations for the web in python. This training gives a quick\nintroduction to Bokeh's unique features. We'll do exercixes building\nup a variety of visualizations and finish discussing topics and\nquestions from participants related to their own datasets & needs.",
  "thumbnail_url": "https://i.ytimg.com/vi/XBiS0oBzX3o/hqdefault.jpg",
  "title": "Getting started with Bokeh / Let's build an interactive data visualization for the web..in Python!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XBiS0oBzX3o"
    }
  ]
}
