{
  "description": "¿Qué determina el precio de una propiedad?, ¿será la cantidad de habitaciones, la superficie total?, ¿o la cercanía a medios de transporte como subtes o metrobuses?, ¿influirá la cantidad de espacios verdes en el barrio?, ¿y que estén próximas a barrios populares? Tomando datos de Properati y varios datasets del gobierno de la Ciudad y de la Nación, se puede utilizar machine learning para predecir el precio de venta de una propiedad en CABA y, además, evaluar cuáles son los atributos que influyen en mayor o menor medida en su determinación. Se agregan nuevas variables, se procesan los datos reales, se encuentran correlaciones e “insights” y, finalmente, se generan modelos que predicen precios de nuevas propiedades. De nuestro análisis se desprenden potenciales aplicaciones en la economía, en la planificación urbana, entre otros. A su vez, se pone en evidencia la importancia de los datos abiertos para poder armar proyectos que puedan explicar comportamientos de movimientos de precios (en un tema tan crucial como es hoy en las ciudades el acceso a la vivienda) y así poder generar políticas públicas basadas en datos.\n\nDisertantes: Lucía Ailén Kasman, Rocío Palacín Roitbarg\nLucía Ailén Kasman es estudiante de Ingeniería Informática en la UBA. Trabaja como Software Engineer en Medallia y desde hace años tiene interés en Data Science y sus aplicaciones. Rocío Palacín Roitbarg estudió Economía en la UBA. Trabaja como Digital Analytics Consultant en Media.Monks. Está realizando la diplomatura en \"Ciencias Sociales Computacionales y Humanidades Digitales\" (UNSAM) y le interesan los temas relacionados con el análisis de datos y sustentabilidad.\n\nhttps://eventos.python.org.ar/events/pyconar2021/activity/474/",
  "duration": 1332,
  "language": "eng",
  "recorded": "2021-10-25",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://eventos.python.org.ar/events/pyconar2021/"
    },
    {
      "label": "https://eventos.python.org.ar/events/pyconar2021/activity/474/",
      "url": "https://eventos.python.org.ar/events/pyconar2021/activity/474/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "pyar",
    "pycon",
    "pyconar",
    "pyconar2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/1uhPYIsJD3s/hqdefault.jpg?sqp=-oaymwEmCOADEOgC8quKqQMa8AEB-AHUBoAC4AOKAgwIABABGGUgZShlMA8=&rs=AOn4CLB-q7rqDccAOA_grOfaCeyfJpktdQ",
  "title": "PyConAr 2021 - ¿Cómo predecir el precio de una propiedad? Machine learning con datos abiertos",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1uhPYIsJD3s"
    }
  ]
}
