{
  "description": "El taller se enfoca en transmitir experiencias de enseñanza realizadas en un contexto de trabajo remoto (por covid-19) con recursos de acceso libre para docentes de diferentes niveles y áreas de estudio. Somos un grupo interdisciplinario que, debido a la necesidad de formar a docentes en el uso de estas herramientas, conformamos un grupo de trabajo donde el rol de los informáticos fue adecuar los contenidos a una metodología que ponga en juego la enseñanza desde un punto de vista dinámica y pedagógica. El trabajo en conjunto entre docentes del área y formados en el aspecto pedagógico permitió que contenidos técnicos fueran posibles de ser incorporados por docentes. Trabajaremos con herramientas y recursos libres (Open Source) tecnológicos accesibles los cuales resultan simples de incorporar para los docentes. A través de su uso y experiencia permiten potenciar la enseñanza de las distintas materias en el nivel secundario (Técnico o no) o primario. Asi como también es aplicable en el nivel universitario para la investigación y docencia. Veremos las herramientas e infraestructuras disponibles en Internet las cuales permiten un trabajo colaborativo y de acceso remoto. En particular el entorno de trabajo Jupyter es una herramienta interactiva y dinámica para lograr participación activa y motivadora de los estudiantes en el proceso de aprendizaje. Hemos generado recursos que permiten replicar estas experiencias, a través de la generación de clases y un video tutorial para armar una infraestructura propia(vps) que permite agrupar los recursos en la nube(https://youtu.be/P8w0OtG2Rdw).\n\nDisertantes: Sofía Martin, Ariel Ramos, Liliana Hurtado, Sebastián Flores Benner\nHemos dictado varios cursos para docentes y estudiantes de diferentes niveles y disciplinas para potenciar la enseñanza a través de herramientas tecnológicas de acceso libre.\n\nhttps://eventos.python.org.ar/events/pyconar2021/activity/478/",
  "duration": 7379,
  "language": "eng",
  "recorded": "2021-10-29",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://eventos.python.org.ar/events/pyconar2021/"
    },
    {
      "label": "https://eventos.python.org.ar/events/pyconar2021/activity/478/",
      "url": "https://eventos.python.org.ar/events/pyconar2021/activity/478/"
    },
    {
      "label": "https://youtu.be/P8w0OtG2Rdw",
      "url": "https://youtu.be/P8w0OtG2Rdw"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "pyar",
    "pycon",
    "pyconar",
    "pyconar2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/L-j9vZdgAOs/maxresdefault.jpg",
  "title": "PyConAr 2021 - Programar y Reprogramar Recursos para Docentes (Python + Jupyter)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=L-j9vZdgAOs"
    }
  ]
}
