{
  "description": "Las enfermedades cardiovasculares (ECV) son la primera causa de muerte global (GBD, 2018), representando el 31.8% del total de las muertes a nivel mundial. Uno de los principales ejes de las investigaciones cardiovasculares se centra en el estudio del manejo de calcio (Ca2+), ya que incluso pequeños cambios en las concentraciones de Ca2+ son capaces de alterar la funcionalidad cardíaca (Bers, 2014). Por esta razón, aunque no resulte trivial el pipeline de procesamiento y análisis, es importante el desarrollo de aplicaciones que permitan trabajar con imágenes de miocitos cardíacos. Aquí presentamos CardIAP, una aplicación Web para el análisis de transitorios de Ca2+ a partir de imágenes de microscopía confocal. Nuestra aplicación también permite al usuario la extracción de datos sobre la dinámica del calcio en tablas y gráficos descargables. CardIAP es una aplicación de código abierto, desarrollada íntegramente en Python e implementada con el framework Voilá, que permite la generación de aplicaciones web independientes y cuadros de mando a partir de cuadernos Jupyter. Se puede acceder y utilizar libremente en http://cardiap.herokuapp.com/. Te contamos cómo dimos una solución sencilla a un problema en particular complejo.\n\nDisertantes: Ana Julia Velez Rueda, Leandro Matías Sommese\nAna Julia Velez Rueda es Becaria Postdoctoral de CONICET y profesora de Bioinformática en la Universidad Nacional de Quilmes. Creadora del proyecto \"La bioinformática va a la escuela\" y co-fundadora de la comunidad Women in Bioinformatics and Data Science LA (WBDS LA). Leandro Matías Sommese es Investigador Asistente de CONICET y Doctor en Ciencias Médicas de la Universidad Nacional de La Plata. Docente y miembro del proyecto de extensión “La Bioinformática va a la Escuela” de la Universidad Nacional de Quilmes.\n\nhttps://eventos.python.org.ar/events/pyconar2021/activity/467/",
  "duration": 1418,
  "language": "eng",
  "recorded": "2021-10-28",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://eventos.python.org.ar/events/pyconar2021/"
    },
    {
      "label": "http://cardiap.herokuapp.com/.",
      "url": "http://cardiap.herokuapp.com/."
    },
    {
      "label": "https://eventos.python.org.ar/events/pyconar2021/activity/467/",
      "url": "https://eventos.python.org.ar/events/pyconar2021/activity/467/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "pyar",
    "pycon",
    "pyconar",
    "pyconar2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/GVuu728P2RU/maxresdefault.jpg",
  "title": "PyConAr 2021 - CardIAP: Una aplicación sencilla para resolver un problema complejo",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GVuu728P2RU"
    }
  ]
}
