{
  "description": "Mi interés por el software libre, las redes y las comunidades vienen desde los '80, cuando participaba en FidoNET, copiaba código de revistas como Commodore World y desarrollaba en casa. Se renueva con Python, su gran atractivo y la vibrante comunidad argentina formada con el lenguaje . Luego, paso a paso, desde la participación casi turística en los primeros eventos, a la cooperación con PR chicos en proyectos muy seleccionados, y dando charlas primero en mi ciudad, luego en otras ciudades y en el exterior, primero en español y luego en inglés, fui cumpliendo las metas propuestas. Finalmente, este año, logré conseguir trabajo como dev remoto usando la tecnología que elegí.\n\nDisertante: María Andrea Vignau\nSoy María Andrea Vignau, Ingeniera en Sistemas de Información, trabajo como developer SemiSenior en Shiphero. Últimamente estoy colaborando con las comunidades de software libre, como socia de Asociación Civil Python Argentina, y coorganizadora de Flisol años 2017,2018,2019, PyDayNEA 2018-2019, Autodefensa Digital 2019, 2020, disertante en PyCon USA 2019, EuroPython 2020 y otros eventos.\n\nhttps://eventos.python.org.ar/events/pyconar2021/activity/489/",
  "duration": 1764,
  "language": "eng",
  "recorded": "2021-10-27",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://eventos.python.org.ar/events/pyconar2021/"
    },
    {
      "label": "https://eventos.python.org.ar/events/pyconar2021/activity/489/",
      "url": "https://eventos.python.org.ar/events/pyconar2021/activity/489/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "pyar",
    "pycon",
    "pyconar",
    "pyconar2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/XVKH45CGVvY/maxresdefault.jpg",
  "title": "PyConAr 2021 - Triunfar con Python: Vivencias y reflexiones de una programadora",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XVKH45CGVvY"
    }
  ]
}
