{
  "description": "PyZombis es un curso virtual completo de introducción a la programación, abierto a la comunidad y gratuito. Podrás dar tus primeros pasos con Python, construir programas sencillos y recorrer aspectos avanzados como utilización de API, interfaces Web MVC, Archivos, Bases de Datos y hasta Juegos con PyGame!!! Vista previa: http://bit.ly/PyZombis Remake de \"Python para Zumbis\": un exitoso curso online abierto y masivo (MOOC) del Profesor Fernando Massanori. En Brasil tuvo gran difusión y decenas de miles de inscriptos: https://speakerdeck.com/fmasanori/python-the-next-brazilian-generation En esta nueva versión colaborativa, se tradujeron los contenidos al Español, en un formato Web interactivo, más ágil y divertido. Además se adaptaron los ejercicios para poder ser realizados completamente en el navegador, sin requisitos especiales ni necesidad de instalar programas en tu computadora. Los ejercicios tienen corrección automatizada para que puedas medir tu progreso al instante, y repasar varios temas de manera fácil e intuitiva. Las actividades incluyen un Interprete Python en el navegador, un Visualizador de código paso a paso y un Entorno de Programación web completo para escribir y correr tus propios programas ¡todo incluido! También invitamos a docentes que quieran conocer más sobre el proyecto, las herramientas, como utilizarlo o contribuir con el desarrollo o difusión.\n\nDisertantes: Mariano Reingart, Nicolas Sandoval y colaboradores\nMariano es un desarrollador de software y docente; ha enseñado programación y computación en universidades y institutos terciarios Nicolas es un entusiasta de python y ha colaborando con el proyecto como mentor para el GSoC y otras actividades de la comunidad\n\nhttps://eventos.python.org.ar/events/pyconar2021/activity/468/",
  "duration": 7065,
  "language": "eng",
  "recorded": "2021-10-27",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://eventos.python.org.ar/events/pyconar2021/"
    },
    {
      "label": "https://eventos.python.org.ar/events/pyconar2021/activity/468/",
      "url": "https://eventos.python.org.ar/events/pyconar2021/activity/468/"
    },
    {
      "label": "https://speakerdeck.com/fmasanori/python-the-next-brazilian-generation",
      "url": "https://speakerdeck.com/fmasanori/python-the-next-brazilian-generation"
    },
    {
      "label": "http://bit.ly/PyZombis",
      "url": "http://bit.ly/PyZombis"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "pyar",
    "pycon",
    "pyconar",
    "pyconar2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/BalC7Bp5AFQ/maxresdefault.jpg",
  "title": "PyConAr 2021 - Taller PyZombis: curso online interactivo de intro a la programación en Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BalC7Bp5AFQ"
    }
  ]
}
