{
  "description": "Talk given at PyTexas 2013 by Kojo Idrissa (@Transition).\n\nSpreadsheets are the \"lingua franca\" of data sharing, espeicially within organizations. Outside of technical circles (IT departments, developers, etc), a spreadsheet is still the way most data is analyzed, visualized or reported. While programmers prefer to work with data in another format, many non-programmers either don't have that option or lack the technical accumen to be aware the option exists. As a result, many non-technical people in organizations are forced to use kludgy, limited data analysis tools in spreadsheets. While spreadsheets are good for *basic* data visualization (i.e., \"What do I have here?\"), they lack flexibility and force their users to jump through hoops. **This** is an opportunity for Python to grow.\n\nMy underlying thesis is that one of Python's best vectors for growth is not converting *current* programmers from other languages to Python (a 'Red Ocean' strategy), but converting current non-programmers *into* programmers by demonstrating Python's utility (a 'Blue Ocean' strategy). In this case, the spreadsheet user (who's already one of the closest things to a programmer in most organizations) is our audience.\n\nThis session focuses on working with data that's in spreadsheets by 'talking' directly to the spreadsheets with Python. There are two main focuses to the session.\n\n- Help grow the Python community by showing spreadsheet users how Python can help them\n\n - speed up or eliminate repetitive tasks\n - provide better and data analysis than a spreadsheet\n\n- Expose Python developers to methods they can use to directly interact with spreadsheets, avoiding the 'delimited text file' intermediary step",
  "duration": 2600,
  "recorded": "2013-08-16",
  "speakers": [
    "Kojo Idrissa"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/BIkJCei9EgY/hqdefault.jpg",
  "title": "Growing Python with Spreadsheets",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BIkJCei9EgY"
    }
  ]
}
