{
  "category": "PyCon CA 2015",
  "copyright_text": "",
  "description": "",
  "duration": 1952,
  "id": 5020,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-11-08",
  "slug": "embrace-the-singularity-mike-fletcher",
  "speakers": [
    "Mike Fletcher"
  ],
  "summary": "Machine Learning has been making fantastic advances lately. Problems of classification, recognition, modelling and prediction are currently being optimized to almost-human-level accuracy. Python is used in many research groups to explore Machine Learning approaches, and provides many libraries that allow novices to code non-trivial networks with minimal work. Large corporations have moved from research to deployment. Machine Learning has proven itself useful, and we seem to be getting tantalisingly close to something that could be a “true” strong A.I.\n\nBut shadowing these achievements there is a rising fear in society that we will open Pandora’s box, that our creation will decide that we need to be eliminated. We cannot dismiss those concerns out-of-hand as our track-record as a profession is littered with cases where we have lacked foresight. We should address the concerns now, before the box is sitting in our hands.\n\nWhere are we on the road to creating a strong A.I.? How would we recognize a strong A.I.? What can we currently do with Machine Learning, what are the approaches we currently use, and where are they likely to lead over the next few years?\n\nAre there fundamental missing pieces that prevent a “human-like” strong A.I. from developing? Are there scale or resources standing in the way? What are the (moral) considerations in developing a strong A.I.? What about in shutting one down? What are the threat models involved in “standing up” a strong A.I.? What can be done to mitigate those threats?\n\nThis talk may include code samples, for which a passing familiarity with Numpy or Theano might be helpful, but the focus for the discussion will be on the algorithms,  epistemology and how we as programmers should approach our attempt to develop an artificial mind.",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/s85jIUaVfeo/maxresdefault.jpg",
  "title": "Embrace the Singularity",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=s85jIUaVfeo"
    }
  ]
}