{
  "copyright_text": null,
  "description": "Para tratar el tema de la distancia entre el desarrollo experimental de un modelo de machine-learning y los desafíos de servirlo como un servicio production-ready, voy a aprovechar una experiencia de la vida real. En Mercadolibre existe Fury: una plataforma de infraestructura y desarrollo, para el despliegue de microservicios. La misma provee features para build, deploy, gestión de entornos de desarrollo, automatización de la creación de infraestructura, monitoreo, métricas, servicios, etc. Es uno de los principales factores que permitió crecer de 400 desarrolladores a los ~3000 que somos ahora, en pocos años.  El problema es que dicha infraestructura no fue diseñada para lidiar con las particularidades asociadas a los sistemas de machine-learning: entornos de experimentación para data-scientists, procesos de ETL, entrenamiento de modelos, acceso a infraestructura específica como GPU, etc. Entonces, en un esfuerzo transversal a la organización, con la colaboración de varios equipos, desarrollamos Fury Data Apps: una extensión a Fury que provee herramientas y servicios para que cualquiera pueda diseñar, experimentar, desarrollar y desplegar sistemas basados en machine-learning, a la escala que Mercadolibre necesita. En esta charla voy a presentar: las características principales de la plataforma los problemas que soluciona el stack tecnológico que la soporta en general, cómo cubre el gap entre un POC y un sistema production-ready",
  "duration": 1896,
  "language": "spa",
  "recorded": "2019-10-09",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://conf.scipyla.org/en/program/schedule/"
    }
  ],
  "speakers": [
    "Carlos De la Torre"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/AQ-ctn7GwWo/maxresdefault.jpg",
  "title": "Del POC a producción - Infraestructura para machine-learning en Mercadolibre",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AQ-ctn7GwWo"
    }
  ]
}
