{
  "copyright_text": null,
  "description": "En este estudio se exploran técnicas de aprendizaje computacional profundo con el fin de predecir las propiedades físicas de los hidrocarburos a partir de firmas espectrales, este tipo particular de información se describe como un vector continuo que mide la reflectancia de la luz sobre cualquier objeto en función del espectro electromagnético, este tipo de dato es usado por la NASA para la identificación de agujeros negros. Por lo que su comprensión y uso en la industria petrolera es fundamental para la identificación y caracterización de manifestaciones de hidrocarburo en superficie (rezumaderos). Por consiguiente se quiere aprovechar el potencial de las firmas espectrales para predecir la propiedad física de la gravedad API, la cual describe la relación de densidades entre el hidrocarburo y el agua. A partir de dicha relación, se puede estimar cómo será el comportamiento de los fluidos en el yacimiento, construyendo las bases para la planeación estratégica de los campos petroleros. La presente propuesta se concibe como una herramienta predictiva compuesta de dos partes. La primera parte, especializada en el pre-procesamiento de firmas espectrales, donde se extraen las bandas más relevantes de acuerdo con técnicas de selección de variables, se realiza un proceso de limpieza e imputación de datos; y la segunda, donde se crean dos modelos de aprendizaje profundo, uno para las firmas espectrales de campo y otro para las firmas de las imágenes del satélite WorldView3. De esta manera, la herramienta tiene el objetivo de aprender los patrones de absorción del hidrocarburo dentro de una firma espectral, generalizando este aprendizaje para predecir dicha propiedad en los rezumaderos de la cuenca en estudio. SpectralNET, fue desarrollada en Python sobre la plataforma Google-Colab usando todo el potencial de este lenguaje en inteligencia artificial, la elegancia de su sintaxis para lograr las mejores eficiencias en el desempeño de los modelos y por su puesto todo el estado del arte en librerías de ETL, modelaje y visualización de datos que han permitido simplicidad y robustez en la investigación. Como resultado se consigue un RMSE de 2.6 para las firmas de campo y RMSE 5.1 para las firmas extraídas de las imágenes, siendo muy satisfactorio si se compara con el error teórico bayesiano calculado en laboratorio de 1.5 grados API, estos resultados permiten la identificación y comprensión de nuevas estructuras petrolíferas, la prevención de desastres ambientales dada la migración vertical de crudo a superficie permitiend o monitorear anticipadamente las microfugas, con ahorros que pueden llegar hasta $2MUSD. Como investigación futura, se propone probar SpectralNet sobre imágenes satelitales de Aster y Landsat, así mismo extrapolar los modelos a otras propiedades físicas e investigar la resolución espectral que puedan llevar a obtener un modelo más parsimonioso y posiblemente más preciso.",
  "duration": 1639,
  "language": "spa",
  "recorded": "2019-10-09",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://conf.scipyla.org/en/program/schedule/"
    }
  ],
  "speakers": [
    "Sergio Castelblanco"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/lfoD3EDAjbg/maxresdefault.jpg",
  "title": "SpectralNET: redes neuronales e hidrocarburos",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lfoD3EDAjbg"
    }
  ]
}
