{
  "copyright_text": null,
  "description": "We develop a set of tools to explore and visualize historical high frequency data for stocks and bonds that trade at Bolsa de Valores de Colombia. We use trade and quote data on the most liquid assets that are observable during the trading day for a period of six months. We show that the Pandas library provides enough flexibility in sampling the time stamp of transactions and hence an important advantage for processing high frequency financial data. After we process the information we develop tools to estimate observable and non-observable market quality parameters for a selection of stocks and bonds. Market quality in financial markets is measured along different dimensions of the prices and the volume of transactions: volatility, liquidity, transaction activity, jump activity and price impact. These measurements are important for market participants and researchers interested in empirical finance, algorithmic trading and market microstructure; however, they are not directly available from financial information providers because of the amount of processing power required to work with intraday data. Some preliminary results with stocks indicate, that as observed in other markets at the beginning of trading hours, liquidity (measured as bid ask spread and depth) is the lowest and price volatility is high. Additionally, we observe that stocks with lower levels of price impact also have the highest levels of depth.",
  "duration": 1376,
  "language": "eng",
  "recorded": "2019-10-10",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://conf.scipyla.org/en/program/schedule/"
    }
  ],
  "speakers": [
    "Carlos Castro"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/oAFzePW9pUc/maxresdefault.jpg",
  "title": "The intraday market at Bolsa de Valores de Colombia",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=oAFzePW9pUc"
    }
  ]
}
