{
  "copyright_text": null,
  "description": "El posicionamiento previo de los suministros de emergencia es un mecanismo para aumentar la preparación ante desastres naturales. Para ello es de gran importancia la selección de proveedores en logística humanitaria y la planeación de la posible distribución de estos artículos después de que ocurra el suceso. En este trabajo se implementa un modelo de optimización estocástica de dos etapas que proporciona una estrategia de pre-posicionamiento de respuesta de emergencia para terremotos en la ciudad de Bogotá y un algoritmo heurístico para resolver instancias del problema a gran escala, ambos métodos utilizando los paquetes Pandas y Gurobi de Python. El desarrollo del proyecto permite ver la flexibilidad que ofrece Python para replicar rápidamente modelos complejos de la literatura para evaluar y comparar su desempeño. Se presenta un caso de estudio para la ciudad de Bogotá en donde se tienen escenarios estadísticamente distribuidos, evidenciando el impacto que genera el modelo y proporcionando insumos para la toma de decisiones. El objetivo de la charla es brindar a la audiencia el contexto necesario sobre problemas operativos en el manejo de riesgo de desastres, así como algunas nociones de optimización para desarrollar las ideas y modelos utilizados en la investigación. Posteriormente se discutirá la implementación computacional en Python, los resultados del proyecto. Particularmente, se discutirá el potencial de los paquetes de Python (e.g., Gurobi) para facilitar y agilizar el desarrollo de prototipos de modelos de optimización, simulación, entre otros.",
  "duration": 1703,
  "language": "spa",
  "recorded": "2019-10-09",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://conf.scipyla.org/en/program/schedule/"
    }
  ],
  "speakers": [
    "Daniel Cuellar"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/MXA6E2xawcY/maxresdefault.jpg",
  "title": "Un modelo de posicionamiento previo de suministros de emergencia para respuesta a sismos en la ciudad de Bogotá utilizando Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MXA6E2xawcY"
    }
  ]
}
