{
  "abstract": "Overview & Purpose\n------------------\n\nRegular expressions are used to define search patterns and are an\nimportant technique for validating data, scraping data, data wrangling,\n(i.e re- formatting.), the content of strings. Additionally, the’re used\nto enable syntax highlighting in some applications. Python provides\nregular expressions via the built in ‘re’ module, and there is a third\nparty ‘regex’ module with added functionality. The problem is, writing\nregex patterns to do what you want is hard, and even when you’ve got\none, figuring out what it is or isn’t going to match can be baffling.\nThis talk will give you two tools conquer regex’s, a mental model,\n(demonstrated with props), of how they work, and a mini-language,\n“Simple Regex Language”, to create readable regex’s that easily\ntranslate into Python’s regex syntax.\n\nA Physical Model of RegEx’s\n---------------------------\n\n1. Picture the string we are searching as a line of tiles, (like those\n   in scrabble), where the character each represent has been routed into\n   its surface.\n2. This lets us talk about the two categories of places a regex start or\n   continue a match:\n3. At a character specified in the regex: (modeled by a vacuum-formed\n   sheet of plastic whose profile can nest in the character’s incised\n   relief).\n4. At a position called an anchor, specified in the regex: (represented\n   by the insertion of a strip of plastic into the crack between tiles)\n\n   1. Note: whether a give ‘crack’ matches the given anchor is\n      determined by what is to its left and right; more specifically,\n      the categories they belong to, i.e. whitespace, printable,\n      alphabetic, numeric, eol, buffer-wall, etc.\n\n5. This model lets us illustrate how the regex engine goes about making\n   a match; e.g., if our pattern wants to match ‘ABC’, and our string\n   contains ‘ABD’, we slide along a piece of plastic with a ‘A’ profile,\n   from the start of the buffer to where we encounter the ‘A’ tile. The\n   plastic will sink into ‘A’ tile, allowing us to swing down ‘B’\n   plastic that is taped the the right edge of ‘A’ overlay which also\n   sinks down flush matching the ‘B’ tile. When we try to swing down the\n   next taped on plastic overlay, ‘C’, it crashes into the surface of\n   the ‘D’ tile and instead levers out the ‘B’ overlay, which levers out\n   the ‘A’ overlay and gets us back to sliding along the ‘A’ overlay\n   looking for the next place to pause and try for a match.\n6. At this point we introduce SRL, (below), then show how its patterns\n   translate into Python regex’s, then we return to this model and\n   extend it to cover all the different regex ‘atoms’ we can now write.\n7. This “Tile and Overlay” model provides a visual metaphor to see how\n   the regex engine works, but there are no tiles and overlay chains in\n   the computer, there are only strings of bytes and double-bytes, (if\n   we are talking UTF-8), so we briefly introduce a model that use\n   height to represent characters. This lets us talk about Unicode\n   strings, and hints at the kind of optimizations compiling regex’s\n   might allow Python to do.\n8. For the presentation, there will be a physical model to show the\n   example in covered in point three above, but to make things\n   manageable, we'll then switch to illustrations done in Skecthup,\n   (maybe even animations).\n\nSRL: Simple Regex Language\n--------------------------\n\n1. SRL is what is known as a “Little Language”, or a “Domain Specific\n   Language” which are built to handle a small problem area. In SRL’s\n   case, the problem is that of the unreadability of regex’s, and that\n   each language has a different way of writing them.\n2. You’d think we could skip this as we are only concerned with Python\n   here, but it is useful to have this level of abstraction, even if you\n   only do Python. You are likely to find that your editor uses a\n   different flavor of regex’s.\n3. An overview, live demos, and documentation can be found at the\n   project’s website, https://simple-regex.com. I won’t duplicate them\n   here,I’ll just say that the exposition of what we need for this talk\n   will follow this source material, and include a SRL to Python cheat\n   sheet that covers their translation and how they are expressed in the\n   “Tile and Overlay” model.\n4. To give reviewers a feel for what the illustration of SRL will look\n   like, I intend either add them to the proposal, or provide a link to\n   them on my github so you can look at them as they are created for\n   this talk.\n",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Regular expressions are used to define search patterns. Python provides\nregular expressions via the built in ‘re’ module, but they are hard to\nread, write, and understand. This talk will give you two tools conquer\nregex’s, a mental model, (demonstrated with props), of how they work,\nand a mini- language, “Simple Regex Language”, to create readable\nregex’s that easily translate into Python regex's.\n",
  "duration": 2047,
  "language": "eng",
  "recorded": "2018-07-29",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2018/schedule/"
    }
  ],
  "speakers": [
    "Tom Fetherston"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/O5gtgUQ0P_8/maxresdefault.jpg",
  "title": "An Intuitive Grasp of RegEx’s in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=O5gtgUQ0P_8"
    }
  ]
}
