{
  "abstract": "Abstract\n--------\n\nWhat does a data scientist’s day look like? On the one hand, people say\nthat a data scientist's day is 5% modeling and 95% cleaning data and\nother stuff. On the other hand, there are many more machine learning\ntutorials and blog posts on modeling than posts on the \"other stuff\"\nwhen I search online. There seems to be a lack of guidance for junior\ndata scientists when they enter into the field who are trying to\ncomplete their first few projects.\n\nIn the last few years, I have worked on several data science projects\nlike this, where the path to success is unclear and the journey is full\nof pitfalls. In this talk, I will provide practical tips on machine\nlearning projects that I learned the hard way. I will give you 2-3 tips\nwith examples in each stage of a machine learning project --- before,\nduring, and after --- that will help junior data scientists or anyone\nworking on a machine learning project navigate through the muddy data\nwaters better.\n\nOutline\n-------\n\nThere are a few stages of a machine learning (ML) project, and I will\ngive a few tips for each.\n\n**Before ML** (7-8 minutes)\n\nWhat kind of questions should I ask to the most out of the preparation\nstage of a machine learning project?\n\n**Starting ML** (8-10 minutes)\n\nHow do I define success and how do I get there? What kind of model\nshould I pick? What are some Python tools that can help me work through\na project?\n\n**Pitfalls** (8-10 minutes)\n\nI will share examples and stories of pitalls I saw or fell into in my\npast projects that I wasn't aware of at the time.\n",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "There is a lot of hype around machine learning, but completing a project\nat work seems to be much harder than what online tutorials had\nadvertised. In this talk, I will provide a few tips for different stages\nof a machine learning project like recognizing pitfalls, that I wished I\nknew when first navigating through my projects as a junior in the field.\n",
  "duration": 1924,
  "language": "eng",
  "recorded": "2018-07-28",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2018/schedule/"
    }
  ],
  "speakers": [
    "Chang Hsin Lee"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/7D8unG3XMzU/maxresdefault.jpg",
  "title": "An Only One Step Ahead Guide for Machine Learning Projects",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7D8unG3XMzU"
    }
  ]
}
