{
  "abstract": "Attendees will get an understanding of key concepts for conversational\ninterfaces which are used to create chatbots, as well as, some examples\nof the python libraries and code which can be used to create them.\n\nConversational interfaces are increasingly becoming a preferred way for\nusers to engage with information. This is particularly true for younger\nusers. Conversational interfaces offer a more personalized user\nexperience, as well as, a means to walk a user through a potentially\ncomplex series of requirements.\n\nThat ability to determine the user’s intent, combined with the ability\nto step them through a series of relevant questions makes it\nparticularly well suited for interfacing with artificial intelligence\nsystems which often require precisely structured input to deliver\nmeaningful insight.\n\nThe presentation will provide an overview of conversational interfaces,\nintegration with front end communications channels, and back end\nartificial intelligence systems.\n\nAn example will be shown which illustrates the end to end concepts\ncovered. The presentation will use RASA Core, an open source Python\nmachine learning based dialogue engine for conversational software, to\nshow the process and benefits for training data on specific domains. The\nexample will show the framework integrated with Twitter and Facebook\nmessenger as communications channels, and the ability to direct actions\nto multiple AI backends.\n",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Attendees will see concepts for conversational interfaces used to create\nchatbots, and python libraries and code used to create them.\nConversational interfaces are increasingly becoming a preferred way for\nusers to engage with information, offering a more personalized user\nexperience. The ability to understand user’s intent and take action\nmakes it a good match for AI.\n",
  "duration": 1449,
  "language": "eng",
  "recorded": "2018-07-28",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2018/schedule/"
    }
  ],
  "speakers": [
    "Don Holloway"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/RoCmJnVdwWo/maxresdefault.jpg",
  "title": "Conversational Interfaces for Chatbots and Artificial Intelligence",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RoCmJnVdwWo"
    }
  ]
}
