{
  "abstract": "Audience: This talk is suited well for all audiences due to the live\ncoding nature of this talk. Since making music with Python is something\nthat beginner programmers can start with and advanced audiences could\nfind interacting with Python in this way meaningful.\n\nAn outline of my talk is as follows:\n\nSet Up This talk will be live coded using the Python. There will also\nsome slides that will be available on my website\njessicagarson.com/Making-Music- with-Python, All code samples will also\nbe up on my GitHub.\n\nIntroduce Myself Quick intro to set up the narrative of my presentation\n- Starting with something like: “Hi, my name is Jessica Garson. I’m\ncurrently teaching Python at NYU. I’m also a live coding DJ know as\nMessica Arson, I’ve performed with Live Code NYC, the Future of Funk\nLabs as part of the DC Funk Parade and Hack && Tell DC ”. I’ll also\ncover administrative topics such where to find slides, and code samples\nfrom today’s talk, and a link to code samples on my GitHub. I’ll also\nprovide my twitter handle. These will be displayed on a slide as well.\n\nThere is Something Magical About Hearing a Computer Make Sounds You Told\nIt To I’ll tell the story about how I started a live coding and discuss\nwhy making music with code is so powerful.\n\nFoxDot Installation We'll discuss how install FoxDot and some errors I\nran into while setting up.\n\nTour of the IDE This will be a walkthrough the IDE.\n\nThe Coolest Part - The Tutorial Is Built In We'll run an example from\nthe tutorial.\n\nBasic Syntax We'll discuss what the syntax looks like and how to create\nsounds easily.\n\np1, s1, d1? We'll discuss what this means and how each channel helps\nlayer sound differently.\n\nErrors What happens when you get errors, how do you solve them.\n\nCreating Our Melody We'll create our melody to our song, and discuss how\nto keep your changes in sync with the flow of your song.\n\nAdding Effects and Changing Our Sound We'll make changes to our sound by\narranging the effects.\n\nUsing Samples We’ll discuss how to use samples. There are a bunch\npre-loaded in and we'll discuss how to find them\n\nAdding Outside Samples I’ll add in a sample of my own voice assigned to\na variable and create a loop which plays this sample.\n\nCreating a Melody I’ll create a loop that creates a melody and explain\nwhat the code is doing to create this sound.\n\nHow does FoxDot compare to the rest of the live coding ecosystem? We'll\ncompare FoxDot to TidalCycles and SonicPi and discuss the future of live\ncoding.\n\nDance Party We will listen to our song we created (hopefully a dance\nparty will break out).\n\nNext Steps I’ll point to a list of resources on my GitHub repository for\nthe talk for learning more about a Python and FoxDot. I’ll also give my\ncontact information for keeping in touch and thank attendees for coming\nto the talk.\n",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Learn how to make music with Python and FoxDot. We’ll go through how to\nmake a song in this live coded adventure. This talk is suited well for\nall audiences.\n",
  "duration": 1272,
  "language": "eng",
  "recorded": "2018-07-28",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2018/schedule/"
    }
  ],
  "speakers": [
    "Jessica Garson"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/OTQTS5aKh7s/maxresdefault.jpg",
  "title": "Generating Music with Python and FoxDot",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OTQTS5aKh7s"
    }
  ]
}
