{
  "abstract": "Natural language processing (NLP) is an exciting branch of artificial\nintelligence (AI) that allows machines to break down and understand\nhuman language. As a data scientist, I often use NLP techniques to\ninterpret text data that I'm working with for my analysis. During this\ntutorial, I plan to walk through text pre-processing techniques, machine\nlearning techniques and Python libraries for NLP.\n\nText pre-processing techniques include tokenization, text normalization\nand data cleaning. Once in a standard format, various machine learning\ntechniques can be applied to better understand the data. This includes\nusing popular modeling techniques to classify emails as spam or not, or\nto score the sentiment of a tweet on Twitter. Newer, more complex\ntechniques can also be used such as topic modeling, word embeddings or\ntext generation with deep learning.\n\nWe will walk through an example in Jupyter Notebook that goes through\nall of the steps of a text analysis project, using several NLP libraries\nin Python including NLTK, TextBlob, spaCy and gensim along with the\nstandard machine learning libraries including pandas and scikit-learn.\n\nSetup Instructions\n------------------\n\n`https://github.com/adashofdata/nlp-in-python-\ntutorial <https://github.com/adashofdata/nlp-in-python-tutorial>`__\n",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "As a data scientist, we are known to crunch numbers, but what happens\nwhen we run into text data? In this tutorial, I will walk through the\nsteps to turn text data into a format that a machine can understand,\nshare some of the most popular text analytics techniques, and showcase\nseveral natural language processing (NLP) libraries in Python including\nNLTK, TextBlob, spaCy and gensim.\n",
  "duration": 6663,
  "language": "eng",
  "recorded": "2018-07-28",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2018/schedule/"
    }
  ],
  "speakers": [
    "Alice Zhao"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/xvqsFTUsOmc/maxresdefault.jpg",
  "title": "Natural Language Processing in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xvqsFTUsOmc"
    }
  ]
}
