{
  "abstract": "We Pythonistas welcome newcomers with the wisdom of Tim Peter's \"import\nthis\". Okay, well maybe. The Zen of Python provides us as a community\ngeneral aphorisms on how to write Python and how to be a good Pythonista\nby offering loose guidelines that promotes discussion. What lessons,\nthen, can the Zen of Python teach us about Data Ethics?\n\nData ethics is a nebulous concept, a necessity in the era of algorithms\nand the data economy. Together we'll review some stories from the\nheadlines about the data economy where there were ethical concerns and\napply the Zen of Python. Starting with the impact of social media likes\non political campaigns to censorship on social media in the #MeToo\nmovement, we'll use big challenges to highlight obvious and not so\nobvious lessons.\n\nUltimately the Zen of Python teaches us that 'Now is Better than Never'\nand we must ask as data practitioners - what principles will we develop\nand champion to respond to ethical dilemmas?\n",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "We Pythonistas welcome newcomers with the wisdom of Tim Peter's \"import\nthis\". The Zen of Python gives us general aphorisms on how to write\nPython and how to be a good Pythonista by offering loose guidelines that\npromotes discussion. What lessons can it teach us about Data Ethics? As\ndata practitioners Now is Better than Never to define what our community\nwill and won't do as it comes to data.\n",
  "duration": 1990,
  "language": "eng",
  "recorded": "2018-07-29",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2018/schedule/"
    }
  ],
  "speakers": [
    "Lorena Mesa"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/8mHMWQCCEdY/maxresdefault.jpg",
  "title": "Now is better than Never: What the Zen of Python can teach us about Data Ethics",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8mHMWQCCEdY"
    }
  ]
}
