{
  "abstract": "The need to clean, manipulate, and visualize data is a skill that is\nincreasingly in demand due to the abundance of data available. There are\nmany methods of performing data analysis, each with its own benefits and\ndrawbacks. Of the many features that can be used to evaluate a data\nanalysis method, we will focus on ease of use and reproducibility.\n\nIt is crucially important for data analysis to be reproducible from\nstarting data. A reproducible workflow allows others to review your work\nand can help catch assumptions, bugs, and steps that are not transparent\nin the final result. Reproducibility improves the transparency of your\nanalysis and therefore makes your results more resistant to\nmisinterpretation.\n\n| Python and, more specifically, Jupyter Notebooks enable workflows to\n  be reproducible with very little overhead. Due to these\n  characteristics, Jupyter Notebooks are the current medium for most\n  data science work.\n| One of largest problems with switching to a reproducible workflow is\n  amount of time you need to sink into converting to the new workflow. I\n  will demonstrate how a data analysis workflow can be modified using\n  python libraries and Jupyter Notebooks.\n",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Python, and more specifically, Jupyter Notebooks enable data analysis\nworkflows to be reproducible without very much overhead. This talk will\ndiscuss how to use Jupyter Notebooks and the python ecosystem to\nincrementally improve the reproducibility, efficiency, and depth of your\nexisting analysis workflow.\n",
  "duration": 1518,
  "language": "eng",
  "recorded": "2018-07-29",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2018/schedule/"
    }
  ],
  "speakers": [
    "Nick Macro"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/bXF8PGMRT4M/maxresdefault.jpg",
  "title": "Pandas on Jupyter: Improving Your Data Analysis Workflow",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bXF8PGMRT4M"
    }
  ]
}
