{
  "abstract": "You're familiar with backend web development in the Python ecosystem,\nFlask, Django, Pyramid, all of it. Things are going smoothly in the\nworld of backend. Great!\n\nOne day you're cruising through HackerNews and all of a sudden see the\nwords \"Serverless Architectures\" pop up. Oh dear. \"Servers? That's where\nbackend code lives!\", you protest, \"what is the racket all about?\"\n\nLucky for us, we know Python. A first-class citizen in the world of\nserverless architectures.\n\nServerless architectures are on the rise, so lets take a look at all the\nmoving pieces that go into making one. We begin our journey in the\nfamiliar land of Flask with a small, but useful, backend application. We\nwill demystify serverless architectures using a very-confusingly-named\nutility called...ahem...Serverless. Piece by piece we will come to\nunderstand ways of doing user authentication, database interaction,\ndeployment, and testing for our new fangled serverless application.\nWe'll explore the pros and the cons of our choices as we make them.\n\nBy the end of our time together serverless architectures will transform\nfrom meaningless buzzword to a valid architecture decision you have all\nthe tools to evaluate.\n",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Serverless architectures are all the rage right now, but why? The cost\nsavings? The developer story? Because it's shiny and new? In this talk I\nwill start with a basic Flask App and show the process of migrating to a\nserverless architecture on AWS using the Serverless framework. Along the\nway, we'll also highlight some of the tradeoffs developers make when\nchoosing a serverless architecture.\n",
  "duration": 2013,
  "language": "eng",
  "recorded": "2018-07-29",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2018/schedule/"
    }
  ],
  "speakers": [
    "Daniel Lindeman"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/mijpESCucRQ/maxresdefault.jpg",
  "title": "Python in Serverless Architectures",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mijpESCucRQ"
    }
  ]
}
