{
  "abstract": "My intent is to present for 30-45 minutes with the primary focus on\nexplaining the pieces and parts of the system, how they come together\nand working through the code to build a data driven flask application\nwhich monitors and records information about a home hydroponic garden\nautonomously.\n\nAlthough most of the presentation will be a guided tour of the project\nfrom beginning to end, there will be hands on demonstrations of the\ncode, including the launching of the flask application and as well as\ncode supporting the graphical plotting of a live data stream.\n\nA major component of this presentation will be the problem-solving\nprocess involved in executing a small-scale IoT project from beginning\nto end, with humbling tails of failure and rebirth while maintaining a\nclear and present focus on Python, Flask and the Raspberry Pi sensor\nplatform as a vehicle for building development skills.\n\nFor a novice programmer this could serve as a first introduction to\nsimple Internet of Things programming, module building and IoT\nintegration in a compact package that most dedicated hobbyists could\naccomplish. It should also, because of the variety in content and\napplication, be interesting to Python enthusiast of varied skill levels\nwho find geeky home projects irresistible.\n\nAs is always the case with my presentations, the absurd could happen,\nand I am shameless about finding humor in my own epic failures, so it\nmight just be amusing. And because I have extensive classroom\nexperience, I can be both patient and engaging even when a live\nexperiment goes awry.\n\nSupporting Materials to be Posted on Github:\n\nFull Parts List (with links to vendors) Step-by-step instructions\nIncluding:\n\nFull Code Files, with Useful Comments Documentation About Major\nDecisions An Integrated Bibliography of Links to Resources (both\nmechanical and programming) Blueprints for a Simple Hydroponic System\n",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "The brilliantly conceived and executed Raspberry Pi platform is a\nwonderful tool for developing simple, cost effective, self-contained\nsensor-driven applications using Python, Flask and a little bit of\ningenuity. This presentation is aimed at beginning to mid-level hobbyist\nwith modest python skills or serious python programmers interested in\nhydroponics sensors.\n",
  "duration": 1990,
  "language": "eng",
  "recorded": "2018-07-28",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2018/schedule/"
    }
  ],
  "speakers": [
    "Bethany Poulin"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/n0r_Jqw_4ck/maxresdefault.jpg",
  "title": "Smart and Simple Data Driven Hydroponic Sensing Applications Using Python, Flask & Raspberry Pi",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=n0r_Jqw_4ck"
    }
  ]
}
