{
  "abstract": "Python has quickly become THE language for network automation and\nprogrammability due to it’s combined simplicity and power. Add to that\nthe robust assortment of tools, libraries and modules related to\nnetworking available to “import\" and I doubt another language will take\nover the title anytime soon. In this session we’ll explore some of the\nmost useful libraries for network engineers and developers looking to\ninteract with the network from a configuration and operational\nperspective. Plenty of code will be shown, and all examples will be\navailable to take away and leverage in your own environments.\n\nThrough the session you'll learn how to leverage the tried and true\ninterfaces of CLI and SNMP to manage your network before we jump up to\nnewer options like NETCONF, RESTCONF and REST APIs. We'll even explore\nfull configuration management solutions and discuss when and how they\nshould fit into your overall automation strategy.\n\nSome of the great modules that will be covered include:\n\n-  netmiko\n-  PySNMP\n-  ncclient\n-  requests\n-  Ansible\n-  NAPALM\n",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Python has quickly become THE language for network automation and\nprogrammability due to it’s combined simplicity and power. If you are a\nnetwork engineer looking to get started with automation and Python, it\ncan be tough to now where to start. This session proposes the modules\nand libraries every engineer should have in their tool bag.\n",
  "duration": 2879,
  "language": "eng",
  "recorded": "2018-07-29",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2018/schedule/"
    }
  ],
  "speakers": [
    "Hank Preston"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/LPx77m4aZqs/maxresdefault.jpg",
  "title": "Useful Python Libraries for Network Engineers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LPx77m4aZqs"
    }
  ]
}
