{
  "abstract": "You know how to code in Python, and you want to learn more about deep\nlearning. This talk will put the tools in your hands to complete your\nfirst deep learning project, and put you on the path to growing your\nknowledge of this exciting field.\n\nAlong the way, we’ll discuss the learning process, and how you can\nleverage what you already know in order to jump start your progress\ntackling something new. I’ll even take a detour to talk (briefly) about\nhow I got started in web development with Rails, and the benefits you\ncan get from open-source frameworks with high levels of abstraction.\n\nI’ll walk through the pieces you can put together to build a powerful\nimage classifier with deep learning: hardware (GPUs), training data,\nmodel architectures and pretrained weights, and software libraries for\nrunning training and prediction with your models. Since all of these\nthings are becoming increasingly available for free on the internet,\nit’s never been a better time to give deep learning a try.\n\nIn the end, you don't need a PhD to get started doing deep learning. You\ncan have fun learning enough to do a simple project, like a cats vs.\ndogs image classifier. From there, you can go wherever your curiosity\ntakes you!\n",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "When I started learning web dev, I dove into building my first Rails\napp. I didn’t know how it all worked, but after hours of hacking I had a\nblogging app running. I imagine many share a similar learning\nexperience. Similarly, you don’t need a PhD to do deep learning, you can\nget started with Python skills and open-source frameworks. It can be fun\nand rewarding, and inspire you to dive deeper.\n",
  "duration": 1946,
  "language": "eng",
  "recorded": "2018-07-28",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2018/schedule/"
    }
  ],
  "speakers": [
    "William Horton"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Vz20AkyV9Y8/maxresdefault.jpg",
  "title": "You Can Do Deep Learning!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Vz20AkyV9Y8"
    }
  ]
}
