{
  "category": "DjangoCon 2013",
  "copyright_text": "",
  "description": "",
  "duration": 2489,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-10-03",
  "slug": "building-rich-applications-with-django-and-ember",
  "speakers": [
    "Gabriel Grant"
  ],
  "summary": "Building Rich Applications with Django and Ember.js\n\nWednesday 2 p.m.--2:45 p.m.\n\nAudience level: Intermediate\n\nDescription\n\nEmber.js is the most advanced client-side JavaScript framework\navailable: it provides optimistic server updates, automatically-updating\ntemplates and sensible defaults to dramatically increase developer\nproductivity. Abstract\n\nLearn how Django and Ember.js can compliment each other: how to\nintegrate them where their functionality overlaps and reconcile the\ndifferences where their approaches contradict.\n\nDjango helps quickly express a data model and handle HTTP requests, but\nusing it alone isn't conducive to building highly-dynamic interfaces.\nEmber, on the other hand, is a client-side framework designed with\nprecisely these interfaces in mind, but doesn't tackle the server-side\nat all.\n\nBoth Django and Ember.js are large, ambitious and opinionated\nframeworks. This is what gives them their power over their more\nminimalist colleagues (Flask and Backbone.js, respectively) but because\ntheir opinions sometimes differ, it can be difficult to make them play\ntogether.\n\nIn this talk, I'll briefly introduce Ember.js, compare and contrast how\nDjango and Ember.js handle the various layers of an application, and\nshow how to bridge between these two worlds.\n\nTopics covered: - Ember's interpretation of MVC in Django terms -\nOverlap in functionality: which pieces of each framework to keep, modify\nand throw away - Compiling Assets - Connecting Ember to Django with\nEmber-data and Django REST framework\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/-QaLzSTxvVk/hqdefault.jpg",
  "title": "Building Rich Applications with Django and Ember.js",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-QaLzSTxvVk"
    }
  ]
}