{
  "category": "DjangoCon 2013",
  "copyright_text": "",
  "description": "",
  "duration": 2368,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-10-03",
  "slug": "database-sharding-with-django",
  "source_url": "https://www.youtube.com/watch?v=bAaoSAoACEI",
  "speakers": [
    "Ash Christopher"
  ],
  "summary": "Database Sharding with Django\n\nWednesday 4 p.m.--4:45 p.m.\n\nAudience level: Intermediate\n\nDescription\n\nDjango works great for single database webapps, but did you know they\ngive us the tools to create webapps with sharded data right out of the\nbox? This talk will go over how we leveraged Django's features to add\nsharding to our webapp infrastructure. Abstract\n\nTopics to cover: 1. Why do you need to shard your data? lots of data\nlots of writes\n\n2.  What should you do before sharding? Scale up - throw money at it.\n    Feature partitioning - split feature data on different databases\n    Sharded databases.\n\n3.  How to set up multiple databases in Django tools that we used at\n    Wave. talk about what Django gives us right out of the box (DB\n    Routers) How database routers work. Gotchas when using South for DB\n    migrations.\n\n4.  The downsides of multi-database systems. what we lose (ForeignKeys,\n    Transactions management, select\\_related(), prefetch\\_related())\n\n5.  Scaling the database via sharding. what does this mean? how do I\n    pick a key to shard on? what makes a good and bad sharding key?\n\n6.  Database routers for sharding.\n7.  New tooling that needs to be written to deal with database\n    migrations. deal with database migrations\n\n8.  How to interact with your data through the ORM when it's sharded.\n9.  Need to start using Globally Unique PK's go over a few different\n    strategies used by other companies. strategy for unique ID\n    generation in Python.\n\n10. Transactions + Sharded data. transactions are only useful on\n    same-shard\n\n11. Balancing sharded data across servers we chose multiple DB's per\n    node. make db migration a DevOps task. downsides (limited db\n    connections).\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/bAaoSAoACEI/hqdefault.jpg",
  "title": "Database Sharding with Django",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bAaoSAoACEI"
    }
  ]
}