{
  "category": "DjangoCon 2013",
  "copyright_text": "",
  "description": "",
  "duration": 1954,
  "language": "English",
  "quality_notes": "",
  "recorded": "2013-10-01",
  "slug": "making-django-play-nice-with-third-party-services",
  "source_url": "https://www.youtube.com/watch?v=iGP8DQIqxXs",
  "speakers": [
    "Matt Makai"
  ],
  "summary": "MAKING DJANGO PLAY NICE WITH THIRD PARTY SERVICES\n\nThursday 10 a.m.--10:45 a.m.\n\nAudience level: Intermediate\n\nDESCRIPTION Modern Django projects combine custom apps with third party\nservices, such as Twilio and Stripe, to create a complete product.\nChoosing the right services for your application can make or break its\nusefulness to users as well as your sanity during maintenance. This talk\nwill show you how to properly evaluate, integrate, and maximize what you\nget out of SaaS products in your Django projects.\n\nABSTRACT THE FOUR STEPS: IDENTIFY, EVALUATE, INTEGRATE, AND MAINTAIN\nIdentify\n\nWhat problem needs to be solved? Finding services and their competitors\nCost model fit - are they successful when you're successful? Identify\nChecklist Evaluate\n\nInstructions and walkthroughs - Stripe example Their platform technology\n- Twilio example Open source community and dev team responsiveness -\nUrban Airship example Long term viability and future service plans -\nIntercom.io example Evaluation checklist Integrate\n\nSettings best practices, environment variables (SECRET\\_KEY) Test versus\nproduction (functional testing) Limiting coupling (code examples) When\nit breaks, how will you break? Integration checklist Maintain\n\nKeeping up with security updates Regression testing Maintenance\nchecklist Conclude\n\nCombined Four Steps Checklist Review Takeaway story: SimpleGeo\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/iGP8DQIqxXs/hqdefault.jpg",
  "title": "Making Django Play Nice with Third Party Services",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iGP8DQIqxXs"
    }
  ]
}