{
  "category": "DjangoCon 2013",
  "copyright_text": "",
  "description": "",
  "duration": 2757,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-10-01",
  "slug": "overcoming-troubles-with-class-based-generic-views",
  "speakers": [
    "Andrew Pinkham"
  ],
  "summary": "OVERCOMING TROUBLES WITH CLASS-BASED GENERIC VIEWS\n\nThursday 2:45 p.m.--3:30 p.m.\n\nAudience level: Intermediate\n\nDESCRIPTION This talk will introduce both Class-based Views (CBV) and\nClass-based Generic Views (CBGV), before moving into how to customize\nCBGV, focusing in particular on data generation at the view and form\nlevel. The talk will further involve the source code for CBGV,\nValidation, and Python's Method Resolution Order.\n\nABSTRACT When tasked with building a Banking website, I set out to build\nthe the site using Class-based Generic View (CBGV). As I built the\nfeatures, I quickly discovered that assumptions I had made about\nValidation and CBGV were wrong, circumventing data generation and\npropagation in the banking app. In this talk, I will detail the\nsolutions I came up with to the various problems I encountered while\nbuilding the site. As such, this talk is an in-depth look at CBGV, that\nwill involve a short tutorial in both Class-based Views (CBV) and CBGV.\nWe will then examine the source code of CBGV, allowing for customization\nof the project's views. Notably, these customizations allow for data\ngeneration in Forms and Views, instead of Models. This talk will also\noffer a short analysis of Validation, and quickly look at Python's\nMethod Resolution Order.\n\nBy the end of the talk, you will have a fundamental understanding of\nboth CBV and CBGV, and you will know which functions to override in\nModels, Forms, and Views to automatically generate data.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/8eEjTwflGlw/hqdefault.jpg",
  "title": "Overcoming Troubles with Class-based Generic Views",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8eEjTwflGlw"
    }
  ]
}