{
  "category": "DjangoCon 2013",
  "copyright_text": "",
  "description": "",
  "duration": 2507,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-10-03",
  "slug": "small-shop-big-solutions-django-and-long-term",
  "source_url": "https://www.youtube.com/watch?v=ghTNAzTOR3o",
  "speakers": [
    "Ben Keating"
  ],
  "summary": "SMALL SHOP / BIG SOLUTIONS: DJANGO AND LONG-TERM THINKING\n\nWednesday 4 p.m.--4:45 p.m.\n\nAudience level: Novice\n\nDESCRIPTION In a small non-profit with a 10,000 year business plan, how\ndoes todays technology play a role? how does it hold up against entropy\nand evolve over long-periods of time? Django has done very well for us\nand I'd like to share some of my stories and lessons. A small shop can\nbuild big solutions that last.\n\nABSTRACT This talk will focus on how Django has helped a small\nnon-profit keep up with the big guys and 3rd party solutions over the\nlong-term. I'll share with you how I stumbled upon it, dove in and\npitched it to the rest of the company. How we (and you, through IRC\n#django!) took our three major sites, all running on different\ntechnoloiges, and migrated them to Django.\n\nThere is so much else out there that we use, of course and I learned\nsome valuable lessons from Django on how to pick out the great ones.\nWe'll get to discuss and share workflow productivity tips. Being a\nnon-profit that takes no sides, I have the special oppourtunity to share\ninside stories and lessons that may be of use to you.\n\nIn smaller shops, full-stack positions are common and thats what I am. I\nthink a lot of us are. It's hard to do so but with the help of tools\nsuch as Django we're able to pick up incredible pace and build awesome\nthings together.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ghTNAzTOR3o/hqdefault.jpg",
  "title": "Small Shop / Big Solutions: Django and Long-Term Thinking",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ghTNAzTOR3o"
    }
  ]
}