{
  "description": "Egor Romanov, Software Engineer at Supabase, provides a talk on “Performance of Vector Databases.”\n\nThe talk delves into vector databases' performance, challenges, and potentialities and discovers their role in advancing AI applications like Retrieval-Augmented Generation (RAG).\n\nHigh-dimensional embeddings are integral to numerous machine learning applications, transforming raw data into compact representations for diverse algorithms. Vector databases are essential in managing and utilizing these vectors. \n\nTheir main purpose includes aiding operations, including distance computations, similarity evaluations, and nearest-neighbor searches within high-dimensional spaces. RAG leverages these embedding stores, unlocking significant potentialities in the AI domain. \n\nDuring the talk, Egor Romanov:\n \n- explores the process of creating a provider for Postgres, integrated with pgvector, within a Python performance evaluation framework,\n- conducts a similarity search test simulation showcasing the latent performance potential.\n\nAccess the talk notes at: https://shorturl.at/CGKL1\n--\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2588,
  "language": "eng",
  "recorded": "2024-01-22",
  "related_urls": [
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://shorturl.at/CGKL1",
      "url": "https://shorturl.at/CGKL1"
    }
  ],
  "speakers": [
    "Egor Romanov"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/-MYYB0QjV6I/maxresdefault.jpg",
  "title": "Performance of Vector Databases",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-MYYB0QjV6I"
    }
  ]
}
