{
  "description": "Gor Hayrapetyan, Lead/Senior Data Engineer at Microsoft, Estonia, and Karen Javadyan, Software Engineer at Snowflake, provide a talk on “Langchain: A Framework for Building Large Language Model Apps.”\n\nThe landscape of Large Language Models (LLM) and the libraries supporting them has recently had rapid evolution.\n\nDuring the talk, you will get a brief introduction to LLMs and learn about the current framework of LLM applications. Following this, you will discover Langchain features and concepts, including:\n- Integrations with different LLM models,\n- Chains,\n- Retrievers, \n- Tools,\n- Agents.\n \nTo put Langchain usage into perspective, the talk will also reflect on the RAG technique to expose LLM to your data.\n\nGitHub Repo: https://github.com/kajarenc/PyData-March-Langchain\n\nSlides: https://shorturl.at/ciovF\n--\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 4235,
  "language": "eng",
  "recorded": "2024-04-12",
  "related_urls": [
    {
      "label": "https://shorturl.at/ciovF",
      "url": "https://shorturl.at/ciovF"
    },
    {
      "label": "https://github.com/kajarenc/PyData-March-Langchain",
      "url": "https://github.com/kajarenc/PyData-March-Langchain"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/YNixBsPt7Ds/maxresdefault.jpg",
  "title": "Gor Hayrapetyan & Karen Javadyan - Langchain: A Framework for Building Large Language Model Apps",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YNixBsPt7Ds"
    }
  ]
}
