{
  "description": "Vahan Huroyan, a Machine Learning Researcher at the YerevaNN research lab, provides a talk on “Recent Developments in Self-Supervised Learning for Computer Vision.”\n\nDuring the talk, you will discover the latest developments in self-supervised learning (SSL) for computer vision and delve into its challenges and future directions in this field.\n\nSelf-supervised learning (SSL) is a powerful tool for training computer vision models without the need for extensive labeled data. SSL methods are designed around pretext tasks that force models to learn valuable representations from the training data. These learned representations can then be transferred to downstream tasks, such as:\n-image classification, \n-object detection, \n-and segmentation, with minimal fine-tuning\n\nThe two main approaches of SSL include Contrastive learning and Masked image modeling:\n\n1. Contrastive learning is a general SSL framework that trains models to distinguish between positive and negative pairs of images.\n2. Masked image modeling is a specific type of SSL that involves masking random patches of an image and training the model to predict the masked pixels.\n--\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2185,
  "language": "eng",
  "recorded": "2023-12-16",
  "related_urls": [
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Vahan Huroyan"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/vICrdSUS9vg/maxresdefault.jpg",
  "title": "Recent Developments in Self-Supervised Learning for Computer Vision",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vICrdSUS9vg"
    }
  ]
}
