{
  "copyright_text": "Standard YouTube License",
  "description": "Tutorial materials found here: https://scipy2017.scipy.org/ehome/220975/493423/\n\nMachine learning is the task of extracting knowledge from data, often with the\ngoal of generalizing to new and unseen data. Applications of machine learning now touch nearly every aspect of everyday life, from the face detection in our phones and the streams of social media we consume to picking restaurants, partners, and movies. Machine learning has also become indispensable to many empirical sciences, from physics, astronomy and biology to social sciences.\n\nScikit-learn has emerged as one of the most popular toolkits for machine learning, and is now widely used in industry and academia. The goal of this tutorial is to enable participants to use the wide variety of machine learning algorithms available in scikit-learn on their own data sets, for their own domains.\n\nThis tutorial will comprise an introductory morning session and an advanced afternoon session. The morning part of the tutorial will cover basic concepts of machine learning, data representation, and preprocessing. We will explain different problem settings and concepts such as supervised learning, unsupervised learning, dimensionality reduction, anomaly detection or clustering, and illustrate them with applications showing with algorithms can be used in each situation. We will cover the different families of methods (nearest-neighbors, kernel machines, tree-based techniques, linear models, neural network) with demos of SVMs, Random Forests, K-Means, PCA, t-SNE, multi-layer perceptrons and others.\n\nIn the afternoon session, we will discuss setting hyper-parameters and how to prevent overfitting. We will go in-depth into the trade-off of model complexity and dataset size, as well as discussing complexity of learning algorithms and how to cope with very large datasets using online methods that support\nout-of-core computations. The session will conclude by stepping\nthrough the process of building machine learning pipelines consisting of feature extraction, preprocessing and supervised learning.",
  "duration": 11646,
  "language": "eng",
  "recorded": "2017-07-12",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://scipy2017.scipy.org/ehome/220975/493422/"
    },
    "https://scipy2017.scipy.org/ehome/220975/493423/"
  ],
  "speakers": [
    "Andreas Mueller",
    "Alexandre Gram"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/WLYzSas511I/maxresdefault.jpg",
  "title": "Machine Learning with scikit learn Part Two",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WLYzSas511I"
    }
  ]
}
