{
  "copyright_text": "Standard YouTube License",
  "description": "MNE-Python to See the Brain at a Millisecond Time-Scale\n\nMNE (http://martinos.org/mne/) is a Python software package for processing electrophysiology signals: magnetoencephalography (MEG), electroencephalography (EEG) and intracranial EEG data which measure the weak electromagnetic signals originating from neural currents in the brain. It provides a full workflow for data preprocessing, forward modeling using boundary element models (BEM), source imaging using distributed source models, time-frequency analysis, non-parametric statistics, and connectivity measures, in both sensor and source space. MNE is developed by an international team of contributors, with particular care on computational efficiency, code correctness and readability, enabling reproducibility of scientific results. MNE-Python is provided under the BSD license and is available on all platform that support the scientific Python stack.\n\nIn this talk I will explain what types of data problem MNE users face and illustrate with code snippets and images how MNE leverages numpy (for data containers and array oriented numerics), scipy (mostly for signal processing, linear algebra and optimization), matplotlib (for plotting also interactively) and mayavi to produce 3D images of the brain with a millisecond resolution.\n\nTalk material will be extracted from the documentation http://martinos.org/mne/dev/documentation.html and our example gallery (http://martinos.org/mne/dev/auto_examples/index.html) powered by sphinx-gallery (https://sphinx-gallery.readthedocs.io/en/latest/).",
  "duration": 1452,
  "language": "eng",
  "recorded": "2017-07-18",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://scipy2017.scipy.org/ehome/220975/493422/"
    },
    {
      "label": "MNE",
      "url": "http://martinos.org/mne/"
    },
    {
      "label": "MNE documentation",
      "url": "http://martinos.org/mne/dev/documentation.html"
    },
    {
      "label": "example gallery",
      "url": "http://martinos.org/mne/dev/auto_examples/index.html"
    },
    {
      "label": "sphinx gallery",
      "url": "https://sphinx-gallery.readthedocs.io/en/latest/"
    }
  ],
  "speakers": [
    "Alexandre Gramfort"
  ],
  "tags": [
    "mne"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/iW0g_KDYIYg/maxresdefault.jpg",
  "title": "MNE Python to See the Brain at a Millisecond Time Scale",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iW0g_KDYIYg"
    }
  ]
}
