{
  "copyright_text": "Standard YouTube License",
  "description": "The Department of Energy’s Atmospheric Radiation Measurement program (ARM) has more than thirty radars spread around the world at three permanent and three mobile sites. These radars come from different manufacturers and operate at different frequencies. This presents some challenges when it comes to monitoring the performance of the entire radar network by the relatively small team. To help with this situation, the radar engineering team has designed a platform for monitoring of multiple instruments at geographically remote sites. This platform, the Watchdog for ARM Radar Network Operations (WARNO), is a multi-level distributed open source set of software that monitors hundreds of different streams of data on each radar. Each installation of WARNO has an extensible and configurable plugin architecture that allows for easy modification of data collection without the need to modify the core code. Each distributed installation communicates with a central monitoring server that accumulates all of the data from each radar installation for ease of comparison. There is an additional plugin architecture for data analytics that allows for higher-level feature detection, as well as warn-on-alarm type features. Data is presented through a robust web interface capable of plotting and statistics on the data, as well as user-based customization. WARNO is written in Python, although plugins can be written in multiple languages.",
  "duration": 1229,
  "language": "eng",
  "recorded": "2017-07-14",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://scipy2017.scipy.org/ehome/220975/493422/"
    }
  ],
  "speakers": [
    "Joseph"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/decg3XX0sCg/maxresdefault.jpg",
  "title": "WARNO - Multi platform Monitoring Framework for Remote Sensing Instrumentation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=decg3XX0sCg"
    }
  ]
}
