{
  "description": "In this talk, I will introduce the audience to the emerging area of\ncomputational social science, focusing on how machine learning for social science differs from machine learning in other contexts. I will present two related models -- both based on Bayesian Poisson tensor decomposition -- for uncovering latent structure from count data. The first is for uncovering topics in previously classified government documents, while the second is for uncovering multilateral relations from country-to-country interaction data. Finally, I will talk briefly about the broader ethical implications of analyzing social data.\n\nHanna Wallach is a Senior Researcher at Microsoft Research New York City and an Adjunct Associate Professor in the College of Information and Computer Sciences at the University of Massachusetts Amherst. She is also a member of UMass's Computational Social Science Institute. Hanna develops machine learning methods for analyzing the structure, content, and dynamics of social processes. Her work is inherently interdisciplinary: she collaborates with political scientists, sociologists, and journalists to understand how organizations work by analyzing publicly available interaction data, such as email networks, document collections, press releases, meeting transcripts, and news articles. To complement this agenda, she also studies issues of fairness, accountability, and transparency as they relate to machine learning. Hanna's research has had broad impact in machine learning, natural language processing, and computational social science. In 2010, her work on infinite belief networks won the best paper award at the Artificial Intelligence and Statistics conference; in 2014, she was named one of Glamour magazine's \"35 Women Under 35 Who Are Changing the Tech Industry\"; in 2015, she was elected to the International Machine Learning Society's Board of Trustees; and in 2016, she was named co-winner of the 2016 Borg Early Career Award. She is the recipient of several National Science Foundation grants, an Intelligence Advanced Research Projects Activity grant, and a grant from the Office of Juvenile Justice and Delinquency Prevention. Hanna is committed to increasing diversity and has worked for over a decade to address the underrepresentation of women in computing. She co-founded two projects---the first of their kind---to increase women's involvement in free and open source software development: Debian Women and the GNOME Women's Summer Outreach Program. She also co-founded the annual Women in Machine Learning Workshop, which is now in its eleventh year. Hanna holds a BA in computer science from the University of Cambridge, an MSc in cognitive science and machine learning from the University of Edinburgh, and a PhD in machine learning from the University of Cambridge.\n\nLinks to materials and sites referenced in Hanna's talk:\nhttp://dirichlet.net/\nhttps://github.com/hannawallach/python-lda\nhttps://github.com/hannawallach/cmpsci691bm\nhttp://mallet.cs.umass.edu/topics.php\nhttps://radimrehurek.com/gensim/\nhttp://scikit-learn.org/stable/modules/generated/sklearn.decomposition.LatentDirichletAllocation.html\nhttps://github.com/aschein/bptf\nhttp://www.fatml.org/\n\nSee the complete SciPy 2016 Conference talk & tutorial playlist here: https://www.youtube.com/playlist?list=PLYx7XA2nY5Gf37zYZMw6OqGFRPjB1jCy6.",
  "recorded": "2016-08-23",
  "speakers": [
    "Hanna Wallach"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/oqfKz-PP9FU/hqdefault.jpg",
  "title": "Keynote: Machine Learning for Social Science",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=oqfKz-PP9FU"
    }
  ]
}
