{
  "description": "The FOSSEE (Free Open Source Software for Science and Engineering Education)\n project (http://fossee.in) is a large project funded by the Ministry of Human Resources and Development, MHRD, (http://mhrd.gov.in) of the Government of India. This project was started in 2009 as a pilot and is part of the MHRD's National Mission on Education through ICT (NMEICT). The NMEICT project is a $1 billion dollar initiative to improve the quality of education in India. As part of this project there have been several initiatives. One sterling example is the NPTEL project which provides content for over 900 courses at\n the graduate and post-graduate level (400 web-based and 500 video-based) online. These are proving to be extremely useful over the country. Other projects include the Spoken Tutorial project (http://spoken-tutorial.org) which has also been previously presented at SciPy 2014. FOSSEE is one such project that is the outcome of the NMEICT funding.\n \n The FOSSEE project is based out of IIT Bombay and has for its goal to eliminate the use of proprietary tools in the college curriculum. In order to do this the efforts are focused towards training students and teachers to use FOSS tools for their curricular activities. This also requires development efforts in order to either enhance existing projects or fill in any areas where FOSS tools are lacking. There are about 10+ PIs actively involved in various sub-projects. Some of the most active projects are Scilab, Python, eSim (an EDA tool), OpenFOAM, Osdag (open source design of steel structures), etc. The website (http://fossee.in) has more details on each of these.\n \n In this talk I will discuss the efforts of the Python group\n (http://python.fossee.in). The Python group currently works on the following major activities:\n \n - Creating Python Spoken tutorials that allow students to teach themselves Python.\n \n - Supporting the creation of textbook-companions. A student picks a standard textbook used in her course and solves all the solved examples using Python. This is done in the form of IPython notebooks and is hosted by us. An honorarium is provided to the students. We have more than 350 textbook companions with many more on the way. These can be seen here: http://tbc-python.fossee.in/ The IPython notebooks can also be edited online by users.\n \n - We have developed a simple online testing tool that allows an instructor to setup programming tests online. https://github.com/FOSSEE/online_test",
  "recorded": "2016-08-23",
  "speakers": [
    "Prabhu Ramachandran"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/6UnuPhTPdnM/hqdefault.jpg",
  "title": "The FOSSEE Python Project",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6UnuPhTPdnM"
    }
  ]
}
