{
  "description": "www.pydata.org\n\nhttps://drive.google.com/file/d/1BFiYjap4t92GR_FtAhHOaK5X_WeiANwX/view?usp=drive_link\n\nAs a community organizer, I have had the privilege of being a part of the Python community for the past ten years.\n\nIn that time, I have seen the community grow and evolve in countless ways. Python evolved from a top 10 language to the top 1 language. Many new people joined the community, new topics as data & AI became part of Python. I'm super proud the preferred language to learn is Python nowadays.\n\nI have also learned a great deal about what it takes to be an effective organizer and how to build and sustain a healthy community. I also experience how not to do it and pulling through in hard times.\n\nI learned a lot about leadership. I learned a lot about myself, my strength and my weaknesses.\nThis helped me also to grow professionally and had a very positive impact on how I work and lead in my day-job as partner in a data and AI consultancy.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2561,
  "language": "eng",
  "recorded": "2023-11-01",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/nyc2023/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://drive.google.com/file/d/1BFiYjap4t92GR_FtAhHOaK5X_WeiANwX/view?usp=drive_link",
      "url": "https://drive.google.com/file/d/1BFiYjap4t92GR_FtAhHOaK5X_WeiANwX/view?usp=drive_link"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/NcO2v6DDH10/maxresdefault.webp",
  "title": "Alexander CS Hendorf - Ten Years of Community Organizer | PyData NYC 2023",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NcO2v6DDH10"
    }
  ]
}
