{
  "description": "www.pydata.org\n\nHave you experienced the frustration of installing a new Python package, only to discover that your existing code and Jupyter notebooks no longer function as expected? Have you found yourself uttering the phrase, \"It works on my computer,\" to a colleague? Have you ever looked at Randal Munroe's five-year-old XKCD comic on Python environments (https://xkcd.com/1987/) and felt torn between laughter and despair?\n\nWell, there's hope on the horizon. In this presentation, we will delve into an open-source tool that enables the creation and management of a set of stable, reproducible, and version-controlled environments right on your laptop, all through an intuitive graphical user interface (GUI).\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2489,
  "language": "eng",
  "recorded": "2023-11-01",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/nyc2023/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://xkcd.com/1987/",
      "url": "https://xkcd.com/1987/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/zQFOZ89RB1k/maxresdefault.jpg",
  "title": "Dharhas Pothina - Taming the toxic python environment on your laptop | PyData NYC 2023",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zQFOZ89RB1k"
    }
  ]
}
