{
  "description": "www.pydata.org\n\nThis talk explores how we create smarter, more reliable economic policies by using a technique called “Robust Control”. Robust control is a technique from control systems engineering focused on driving desired outcomes even when there is a lot of uncertainty about the circumstances and behaviors of the system these policies endeavor to regulate. These methodology assumes we've developed an incomplete structural model of a systems: parts of the system have well defined and enforceable rules, whereas others are models of phenomena outside of our control, such as user behavior. This talk reviews the application of a Robust Control informed workflow to select the parameters of a pricing algorithm. Code and data will be shared from the design and pre-launch tuning work and we will also use data to demonstrate how the real life deployed system did and did not match our models. The goal of this talk to demonstrate how practices from control engineering can be applied in data science applications, especially those where algorithms make decisions with intent to influence human behavior at the user population level.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1686,
  "language": "eng",
  "recorded": "2023-11-01",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/nyc2023/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/vr6sIfjGmLQ/maxresdefault.jpg",
  "title": "Michael Zargham - Crafting Reliable Rules with Robust Control | PyData NYC 2023",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vr6sIfjGmLQ"
    }
  ]
}
