{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2012", "speakers": ["David Sale", "Russell Sherwood"], "title": "Behaviour Driven Development at BSkyB", "quality_notes": "", "video_flv_length": null, "recorded": "2012-07-06", "video_mp4_length": null, "description": "BSkyB is a major player in the broadcasting and telecoms market in the United\nKingdom. Skyâ??s offering of premium sports, movies and entertainment channels\nputs it at the forefront of Television entertainment in more than 10 million\nhomes. Its ample broadband and telephone products have allowed the company to\nexpand its customer base and offer an all round package to its customers. With\na focus on quality and stability in everything Sky produces, testing of\napplications is paramount. As part of this business, the company needs a\nsuccessful and efficient way to sell these products to its customers and as\nsuch the modelling, rules and pricing of packages need to lay a firm\nfoundation for different parts of a sales application to function well.\nTesting plays a key role to ensure that delivery of a product is always as\nincident free as possible. Within the agile framework, unit tests, behaviour\ndriven development (BDD) and continuous integration play a key role in making\nthis possible. Ensuring we discover defects early enables us to deliver\nsoftware fortnightly. BDD tests allow the team to test the application as the\nuser will use it, highlighting any issues from front end through to back end.\nMore importantly with BDD tests written in plain English and python code\nunderneath it allows the Quality Assurance personnel (QAâ??s), developers and\nbusiness owners to work together in constructing and writing tests. This\nbrings together the entire team rather than separating the separate stages of\napplication development. In this EuroPython presentation, we will cover the\nfollowing aspects of BDD: â?¢ The role of BDD in Agile Development â?? a brief\nintroduction to the usage of BDD on a daily basis and the process of QAâ??s\nand developers working together to form quality tests. â?¢ Creating a\nsuccessful and useful BDD test â?? writing the feature file (plain English\ndefinition of what the test will achieve), underlying step definitions and how\nworking collectively can maximize the coverage of routes through the code. â?¢\nBDD usage in continuous integration â?? the movement of code through a\ncontinuous build process, catching defects early and how BDD tests ensure\nconfidence in your application as it moves into production.\n\n", "video_mp4_url": null, "tags": [], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=OMLDHNaUMB8", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2012] Russell Sherwood- David Sale - 5 JULY 2012 in \"Track\nLasagne\"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/OMLDHNaUMB8/hqdefault.jpg", "video_flv_url": null}