{
  "alias": "video/1262/behaviour-driven-development-at-bskyb",
  "category": "EuroPython 2012",
  "copyright_text": "Standard YouTube License",
  "description": "BSkyB is a major player in the broadcasting and telecoms market in the\nUnited Kingdom. Skyâ??s offering of premium sports, movies and\nentertainment channels puts it at the forefront of Television\nentertainment in more than 10 million homes. Its ample broadband and\ntelephone products have allowed the company to expand its customer base\nand offer an all round package to its customers. With a focus on quality\nand stability in everything Sky produces, testing of applications is\nparamount. As part of this business, the company needs a successful and\nefficient way to sell these products to its customers and as such the\nmodelling, rules and pricing of packages need to lay a firm foundation\nfor different parts of a sales application to function well. Testing\nplays a key role to ensure that delivery of a product is always as\nincident free as possible. Within the agile framework, unit tests,\nbehaviour driven development (BDD) and continuous integration play a key\nrole in making this possible. Ensuring we discover defects early enables\nus to deliver software fortnightly. BDD tests allow the team to test the\napplication as the user will use it, highlighting any issues from front\nend through to back end. More importantly with BDD tests written in\nplain English and python code underneath it allows the Quality Assurance\npersonnel (QAâ??s), developers and business owners to work together in\nconstructing and writing tests. This brings together the entire team\nrather than separating the separate stages of application development.\nIn this EuroPython presentation, we will cover the following aspects of\nBDD: â?¢ The role of BDD in Agile Development â?? a brief introduction\nto the usage of BDD on a daily basis and the process of QAâ??s and\ndevelopers working together to form quality tests. â?¢ Creating a\nsuccessful and useful BDD test â?? writing the feature file (plain\nEnglish definition of what the test will achieve), underlying step\ndefinitions and how working collectively can maximize the coverage of\nroutes through the code. â?¢ BDD usage in continuous integration â?? the\nmovement of code through a continuous build process, catching defects\nearly and how BDD tests ensure confidence in your application as it\nmoves into production.\n",
  "duration": null,
  "id": 1262,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-06",
  "slug": "behaviour-driven-development-at-bskyb",
  "speakers": [
    "David Sale",
    "Russell Sherwood"
  ],
  "summary": "[EuroPython 2012] Russell Sherwood- David Sale - 5 JULY 2012 in \"Track\nLasagne\"\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/OMLDHNaUMB8/hqdefault.jpg",
  "title": "Behaviour Driven Development at BSkyB",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OMLDHNaUMB8"
    }
  ]
}
