{
  "alias": "video/1282/camelot-101",
  "category": "EuroPython 2012",
  "copyright_text": "Standard YouTube License",
  "description": "Camelot , as seen on EuroPython 2010 and 2011 is a framework for\ndeveloping desktop database applications at warp speed. It is to desktop\napplications what Django is to web applications. Some see it as a\nreplacement for MS Access, but its tight integration with SQLAlchemy\nenables a vast amount of more advanced features and possibilities. This\ntutorial style course will enable you to get started with your own\nCamelot project. We will tackle the hurdles met when going through the\nlifecycle of a desktop application First Example : We start our little\nCamelot project, have a look at the concepts and terminology used within\nCamelot. We go through the different parts of the application and look\nat the possibilities to customize them. Declarative Models and Views :\nThen we move on by defining a relational model and use introspection\ntogether with a declarative definition of our view to generate table and\nform views. We look at the various options that can be used to create\nand reuse form and table definitions. Actions and Reports : Next we’ll\ndive into the details of actions the user can trigger, we discuss and\nexperiment with the standard actions Camelot offers. One of those\nactions can be the generation of a nicely formatted Word document.\nAdvanced Model Definition : Once an application grows, more advanced\nmodel definition is needed. We will try out some advanced features of\nSQLAlchemy and see how they interact with the graphical interface. Fine\ntuning of the GUI : Here we have a look at how Qt’s model-view-delegate\nframework works and how it is used by Camelot. This will enable us to\nfully customize the graphical interface to our needs. Deployment and\nUsers : The last step of the development process is getting the\napplication to the users. We will discuss the deployment options and\nlist the things to be aware of when submitting an application to its\nusers. Q & A : Throw all Camelot questions you have in the group and try\nto resolve them together.\n",
  "duration": null,
  "id": 1282,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-05",
  "slug": "camelot-101",
  "speakers": [
    "A Cuni",
    "J Dierckx"
  ],
  "summary": "[EuroPython 2012] J Dierckx A Cuni - 4 JULY 2012 in \"Track Pizza Napoli\"\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/x4hec861h2w/hqdefault.jpg",
  "title": "Camelot 101",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=x4hec861h2w"
    }
  ]
}
