{
  "alias": "video/1327/complex-and-social-network-analysis-in-python",
  "category": "EuroPython 2012",
  "copyright_text": "Standard YouTube License",
  "description": "A complex network is a network that has non trivial topological\nproperties, i.e., properties hinting the presence of elaborate\nrelationships among the actors, opposed to simple networks such as\nregular lattices or random graphs. Examples of complex networks are most\nsocial, technological or biological networks, such as the internet, the\nweb, a professional network, the nervous system of an animal or the\ncontact network of any social networking system. Network analysis has\nmany practical applications, e.g., ranking or grouping items on the\nbasis of their position in the network, and is also the basis of some\ncollective intelligence and data mining techniques. Recently network\nanalysis is also applied to security problems in the form of trust\nnetworks. Along with the basic concepts, working Python code is\npresented, both using existing network analysis Python tools and numeric\npackages. The focus is mainly placed on code, which will be shown and\ndiscussed together with the theory, with the idea that running code and\nsimulations are easier to understand that formal maths. Since complex\nnetwork datasets are typically huge, some high-level optimization\ntechniques are also discussed. Although formulas are kept at the\nminimum, some maths skills are required along with basic knowledge of\nthe Python programming language.\n",
  "duration": null,
  "id": 1327,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-04",
  "slug": "complex-and-social-network-analysis-in-python",
  "speakers": [
    "E Franchi"
  ],
  "summary": "[EuroPython 2012] E Franchi - 3 JULY 2012 in \"Track Ravioli\"\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/m4OHUDsNrLo/hqdefault.jpg",
  "title": "Complex and social network analysis in Python",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=m4OHUDsNrLo"
    }
  ]
}
