{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2012", "speakers": ["Andrew Dalke"], "title": "concurrent.futures is here", "quality_notes": "", "video_flv_length": null, "recorded": "2012-07-06", "video_mp4_length": null, "description": "The future is here! Or rather, concurrent.futures became part of the Python\nstandard library with 3.2. This style of asynchronous programming, also known\nas promises, has been around for decades but is only recently becoming popular\nin a number of languages and libraries. My presentation is meant for a Python\nprogrammer who knows nothing about futures. I’ll structure it around\nprocessing web server logs, and show several ways to Python code can make more\neffective use of a multi-core machine. In some cases the multi-threaded\nexecutor is good enough, but in others the right solution is the multi-process\nexecutor. Because of the unified API, it’s a one line change to switch from\none to the other. It isn’t hard to write your own executor for different\ncompute models. I’ll show that by developing a new one which works on top of\nthe PiCloud API. At the end I’ll describe some of the more experimental work\nI’m doing to use promises in a dependency graph, where certain computed\nproperties are dependent on others. Even though concurrent.futures came in\n3.2, Python 2.x users can use the API through Alex Grönholm’s ‘futures’\nbackport.\n\n", "video_mp4_url": null, "tags": [], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=2Ng-UIedZMY", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2012] Andrew Dalke - 5 JULY 2012 in \"Track Spaghetti\"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/2Ng-UIedZMY/hqdefault.jpg", "video_flv_url": null}