{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2012", "speakers": ["Alan Franzoni"], "title": "Language alone won't pay your bills", "quality_notes": "", "video_flv_length": null, "recorded": "2012-07-06", "video_mp4_length": null, "description": "What’s Python like? Is it ready for the “enterprise”? Does it scale well in\nthe “cloud”? How does it stand against its old, bearded enemies like Java, or\nnew threats like Ruby? A lot of work on Python is focused on the language\nitself, making it quite pleasant to read and write, and catering hordes of\nlanguage lovers that swear by it. Nowadays, though, we don’t just choose a\nlanguage: we pick a platform - which includes a runtime, APIs, and a lot of\ntools - along with its strengths and weaknesses, and many factors should be\nconsidered before doing so - mostly because we don’t usually have a “best\nchoice ever” and we must face some sort of tradeoff with each design choice.\nJava is ubiquitous in the “enterprise software” world despite its\ncumbersomeness - why? Is it really just a matter of slow adoption rate, or\ndoes it still stand strong in some fields? We’ll explore where Python already\nworks well and where it falls beyond others, not just in terms of language\nbeauty, but in terms of tools and team productivity. We won’t be able to go\nreally deep into each aspect since time is limited, but questions are welcome.\n\n", "video_mp4_url": null, "tags": [], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=JlNYO4zUDAQ", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2012] Alan Franzoni - 5 JULY 2012 in \"Track Spaghetti\"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/JlNYO4zUDAQ/hqdefault.jpg", "video_flv_url": null}