{
  "alias": "video/1338/permission-or-forgiveness-0",
  "category": "EuroPython 2012",
  "copyright_text": "Standard YouTube License",
  "description": "Grace Murray Hopper’s famous motto, “It’s easier to ask forgiveness than\npermission”, has many useful applications – in Python, in concurrency,\nin networking, as well of course as in real life. However, it’s not\nuniversally valid. This talk explores both useful and damaging\napplications of this principle. I start by introducing the motto “It’s\neasier to ask forgiveness than permission” and the woman who used it,\nRear Admiral Grace Murray Hopper, also known as the “mother of Cobol”\nand the author of the first ever programming-language compiler. I then\nmove on to the Python context, where the motto supports the proper usage\nof exception-catching rather than preliminary checks; and the “rule that\nproves the exception” introduced by abstract base classes. Expanding the\nsubject, I show how “optimistic concurrency” applies that motto (while\nlocking would “ask permission”, in essence, STM “asks forgiveness\"), and\nhow collision-detection focused networking protocols have similarly\ntriumphed over more highly structured, “ask permission” ones like\ntoken-ring. Moving to the fuzzier context of real life, I then show how\nthis daring approach does not work quite as well as in the technical\nrealm – except when applied correctly, in the right circumstances… and I\ntry to evince a general law describing what the right circumstances for\nits application are, comparing and contrasting with the similar issue of\n“do it right the first time” versus “launch and iterate” (and the\nlatter’s cognate “fail, but fail fast” principle).\n",
  "duration": null,
  "id": 1338,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-04",
  "slug": "permission-or-forgiveness-0",
  "speakers": [
    "Alex Martelli"
  ],
  "summary": "[EuroPython 2012 ] Alex Martelli - 2 JULY 2012 in \"Track Spaghetti\"\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/9gbUFyPltDs/hqdefault.jpg",
  "title": "Permission or forgiveness?",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9gbUFyPltDs"
    }
  ]
}
