{
  "alias": "video/1309/pypedia-a-python-development-environment-on-a-wi",
  "category": "EuroPython 2012",
  "copyright_text": "Standard YouTube License",
  "description": "In this talk we present PyPedia. PyPedia is an effort to host a Python\nprogramming environment in a MediaWiki content management system. The\nconcept is similar to any wiki except that each article contains the\ndocumentation, python source code and unit tests for a known and well\ndefined computational problem. Through an article, a user can edit the\nsource code, download it, execute it locally, in a remote computer\nthrough SSH, or in Google App Engine (GAE). Moreover, through a python\npackage users can import PyPedia methods in their local python\nenvironment. In the source code, a developer can simply call a function\nor instantiate a class that is defined in another article. In every code\nedit, the article’s unit-tests are evaluated in GAE before saving. A\nspecial parameters section allows editors to build an HTML form within\nthe article that help fellow users to execute the method as a simple\nonline service. Articles are divided in two categories: User and Main.\nIn User articles, the creator of the article manages the edit privileges\nof each section. Any non-deliberately malicious content is allowed. Main\narticles are selected from the pool of User articles that exhibit highly\nqualitative content and can be edited only by trusted users. All content\nis under the simplified BSD license. The vision of this project is to\ncreate an encyclopedia of documented, executable and verifiable python\nimplementation of common algorithms or computational problems through\nthe development of a vivid community. Specialized or user aware content\nis also encouraged in the User namespace. The source code of PyPedia is\navailable under the GPL v.3 license. Availability:\nhttp://www.pypedia.com Video demonstration:\n`https://www.youtube.com/watch?v=25jMEivICD8 <https://www.youtube%20.com/watch?v=25jMEivICD8>`__\n",
  "duration": null,
  "id": 1309,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-04",
  "related_urls": [
    "http://www.pypedia.com",
    "https://www.youtube%20.com/watch?v=25jMEivICD8",
    "https://www.youtube.com/watch?v=25jMEivICD8"
  ],
  "slug": "pypedia-a-python-development-environment-on-a-wi",
  "speakers": [
    "A Kanterakis"
  ],
  "summary": "[EuroPython 2012] A Kanterakis - 4 JULY 2012 in \"Track Tagliatelle\"\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/di3csK0Wsik/hqdefault.jpg",
  "title": "Pypedia: a python development environment on a wiki",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=di3csK0Wsik"
    }
  ]
}
