{
  "alias": "video/1333/python-white-magic",
  "category": "EuroPython 2012",
  "copyright_text": "Standard YouTube License",
  "description": "Python is a powerful language. Beginners appreciate its surface of\nsimplicity and ease to use, where (almost) everything “just works” (TM)\nas expected. However, under the hood, there is a whole world of rules\nand layers which can be (ab)used by experienced programmers to tweak the\nlanguage in unexpected ways. Often, these techniques are labeled as\n“hacks” or “black magic”, to indicate that they should not used in\nproduction or that you should not look at it unless you are “initiated”\nto some not better specified sorcery. However, if used with care and in\nthe right places, these techniques can lead to better, faster and/or\nmore readable code, or can be extremely useful during debugging, and\nthus deserve the definition of “white magic” which programmers can use\nto improve their code. Moreover, looking at how they are implemented is\na good way to learn about some of the deep corners of the language. This\ntalk presents some of these advanced techniques which I have seen in use\nin real code, e.g. in PyPy or pdb++. Including, but not limited to:\ncreating new functions by reusing existing code objects, instantiating\nmultiple copies of the same module, playing with metaclasses in various\nways, changing the **class** of an object on the fly to get specialized\nbehavior, automatically entering the debugger when a certain event\noccur, etc.\n",
  "duration": null,
  "id": 1333,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-04",
  "slug": "python-white-magic",
  "speakers": [
    "Antonio Cuni"
  ],
  "summary": "[EuroPython 2012] Antonio Cuni - 3 JULY 2012 in \"Track Spaghetti\"\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/WqVMZnefnO8/hqdefault.jpg",
  "title": "Python white magic",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WqVMZnefnO8"
    }
  ]
}
