{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2012", "speakers": ["Armin Rigo", "C Tismet"], "title": "The story of stackless Python", "quality_notes": "", "video_flv_length": null, "recorded": "2012-07-05", "video_mp4_length": null, "description": "This talk gives a good overview of the status of Stackless Python: Its history\nfrom the beginning, its current status and its future development to be\nexpected. A discussion and comparison with similar approaches like Greenlet,\nEventlet and how they relate is also included. Stackless Python 1.0 was\nstarted in 1998 as an implementation of true continuations, with all implied\ncomplications. In 2002, Stackless 2.0 was born, a complete rewrite.\nContinuations were abandoned in favor of the much easier to comprehend\ntasklets - one-shot continuations that could resume their current state just\nonce, like Coroutines. In 2004, Stackless 3.0 was created, which merged the\n2.0 features with a new concept: so-called “Soft-Switching”, which made the\nPickling of Program State” possible. As a consequence, a few recent\napplication make solely use of Program State Pickling, which changes the\npurpose of Stackless Python quite a bit. One example of this is the “Nagare\nWeb Framework” which will be shown in examples. In the light of the popularity\nof a Stackless spin-off, called “Greenlet”, the concept of a new Stackless\nbranch will be depicted: Stackless, written as a pure extension module on top\nof Greenlets, which includes State Pickling - a feature that seemed to be\nimpossible to implement without changing CPython. But the impossible and ways\nto get around it was always a major topic in this project, which is going to\naugment what Stackless on PyPy already can do. Christian Tismer, creator of\nStackless Python Perhaps with Armin Rigo as a guest, talking about Stackless\nstatus in PyPy. Otherwise, I will insert this myself. cheers – Chris\n\n", "video_mp4_url": null, "tags": [], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=pDkrkP0yf70", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2012] C Tismet A Rigo - 4 JULY 2012 in \"Track Spaghetti\"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/pDkrkP0yf70/hqdefault.jpg", "video_flv_url": null}