{
  "alias": "video/1319/tornado-in-depth",
  "category": "EuroPython 2012",
  "copyright_text": "Standard YouTube License",
  "description": "Tornado is a non-blocking light-weight web server and framework. There’s\nbeen many introductory talks about it, and it’s time to look deeper into\nit: not just what Tornado does, but how it does it and what can we learn\nfrom it when designing our own concurrent systems. We’ll cover each\ntopic in two parts: first we’ll see how to use a certain feature in our\napplications; then, we’ll dig into Tornado’s source code to see how it\nreally works. How much time we’ll spend in the “how to use” will depend\non the audience’s knowledge of Tornado. Getting Started: quickly get a\nsimple Tornado application up and running. We’ll keep digging into,\nchanging and poking this Application for most of the talk. An\nApplication Listens: what an Application is, how does Tornado start it\nand how does it process its requests. Application and IOLoop: we’ll look\nat how the IOLoop receives the connections from the users and passes\nthem on to the Applications. Scheduled Tasks: we’ll see how to schedule\ntasks and how the IOLoop will run them. Generators: we’ll learn to use\ngenerators to handle the responses of our asynchronous calls, and how\nthey work with the IOLoop. Websockets: how to use them and how they\nwork. IOStream: how do Tornado’s non- blocking sockets work. Database:\nhow to use non-blocking sockets to connect to a MySQL or MongoDB\ndatabase.\n",
  "duration": null,
  "id": 1319,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-04",
  "slug": "tornado-in-depth",
  "speakers": [
    "O Vilaplana"
  ],
  "summary": "[EuroPython 2012] O Vilaplana - 3 JULY 2012 in \"Track Tagliatelle\"\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/4Ztq-Yz1ero/hqdefault.jpg",
  "title": "Tornado in Depth",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4Ztq-Yz1ero"
    }
  ]
}
