{
  "alias": "video/1328/what-i-learned-from-big-web-app-deployments",
  "category": "EuroPython 2012",
  "copyright_text": "Standard YouTube License",
  "description": "The requirements and expectations towards deployment and operations are\nadvancing at an incredible pace. Especially the DevOps community\nencourages and demonstrates how system administrators can leverage\nmethods from other areas of expertise to achieve classical goals: fewer\noutages, more flexibility, lower cost, higher security standards,\nimproved reproducability and overall increased quality. The hosting of\ncomplex, traffic-intensive web applications nowadays requires a solid\nand flexible infrastructure: you need to take care of all the homework\nfirst before going into the nitty gritty details of your specific\napplication. My talk shall demonstrate the aspects we meet on the\ninfrastructure and service level when deploying and operating complex\nservices. I’ll show-case how we approach the problems we face to prepare\nfor an ever-improving future. As many people and companies are\nexperimenting with different approaches today, I’d love to spawn a\nseparate discussion, maybe in an open space, to talk about why you do\nsomething different from us and what your experiences are. The topics\nwill specifically include: infrastructure versus service, data center\noperations, make-or-buy, automation, virtualisation, monitoring, help\ndesk, SLAs, deployment checklist, staging, secrets, HTTP/S termination,\nload balancing, reporting As you can see, the talk’s topics are mainly\nfocused on methods and lines of thought. However, if you’re interest in\ntools - I will also mention the following on a varying level of detail:\npuppet,\n\n::\n\n    haproxy, nginx, apache, varnish, supervisor, cron, Linux, DELL, ProCurve, KVM, Nagios, RT, fabric, zc.buildout, batou\n\n",
  "duration": null,
  "id": 1328,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-04",
  "slug": "what-i-learned-from-big-web-app-deployments",
  "speakers": [
    "Christian Theune"
  ],
  "summary": "[EuroPython 2012] Christian Theune - 3 JULY 2012 in \"Track Lasagne\"\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ENnI2FU3EV4/hqdefault.jpg",
  "title": "What i learned from big web app deployments",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ENnI2FU3EV4"
    }
  ]
}
