{
    "title": "Apport du langage Python dans un service de recherche hospitalière pour mener des analyses de deep learning",
    "description": "Dans les services hospitaliers de recherche cliniques, l'utilisation de python est peu commune, par rapport à d'autres langages de programmation comme R. Mais le développement du machine learning et du deep learning oriente préférentiellement vers le langage python.\n\nNous montrerons comment le deep learning permet de résoudre des problématiques médicales. Par exemple, dans le cadre de la transplantation d'un rein chez un patient, le médecin surveille le patient et redoute deux événements graves : le décès du patient et le retour en dialyse (=perte du greffon). Lorsque le greffon rénal ne peut plus accomplir sa fonction, une mise sous dialyse est nécessaire ce qui est très lourd pour le patient et cher pour la sécurité sociale. En effet, la dialyse représente plusieurs séances par semaine de plusieurs heures. Des modèles statistiques et de deep learning codés en python que nous avons développés permettent d'anticiper la défaillance du greffon ce qui permettrait au médecin de suivre de manière plus rapprochée les patients si nécessaire et de retarder voire éviter la perte du greffon et le retour en dialyse associé. Les challenges auxquels nous faisons face sont les suivants :\n1) Le machine learning et, a fortiori, le deep learning réclament des puissances de calcul considérables, une mutualisation des ressources et une technologie adaptée sont nécessaires.\n2) Le deep learning est performant pour les gros volumes de données, ainsi l'accès aux données de la Sécurité sociale permettra d'obtenir des modèles plus performants.",
    "duration": 2585,
    "language": "fra",
    "recorded": "2023-02-18",
    "speakers": [
        "Clément Benoist"
    ],
    "videos": [
        {
            "type": "mp4",
            "size": 2128911299,
            "url": "https://dl.afpy.org/pycon-fr-23//Cl%C3%A9ment%20Benoist%20-%20Apport%20du%20langage%20Python%20pour%20mener%20des%20analyses%20de%20deep%20learning.mp4"
        }
    ]
}
