{
    "title": "Apprendre Python, c’est pour tout le monde en 2023 ! 💞",
    "description": "Qui veut apprendre à utiliser Python en 2023 et d'ailleurs pourquoi ce langage ?\nQuels sont les moyens d'apprentissage à notre disposition en 2023 ?\nJe vais essayer de vous décrire tout cela et vous pourrez repartir avec plein de suggestions et d'outils.\n\nDe plus en plus fréquemment, la question d'apprendre un langage de programmation se pose et ce pour des profils très variés.\n\nEn premier lieu, il y a les enfants bien sûr, que ce soit par l'école ou par eux même.\nPas forcément dans l'objectif d'en faire une profession, mais connaître les bases de la programmation est une clé pour appréhender le monde numérique qui les entoure et avoir une chance de comprendre au delà de consommer.\n\nLes adultes ensuite, et là les besoins sont très variés.\nCertain·es seront en reconversion et sont à la recherche d'une nouvelle voie professionnelle ou bien compléteront leurs compétences avec une touche de programmation.\nD'autres auront de nouveaux projets informatiques et auront besoin d'ajouter Python à la liste des languages et outils qu'ils maîtrisent.\n\nA tout ce petit monde, Python permettra d'apprendre à son rythme, en ajoutant peu à peu les concepts, sans jamais fermer de portes pour le futur.\nPython est en effet un langage à la fois simple dans les premiers pas, mais également très complet quand par la suite on souhaite aborder des architectures logicielles complexes dans des domaines aussi variés et différents que des applications web, du Machine Learning ou de l'outillage d'intégration continue...\n\nViendra ensuite la question des outils à notre disposition et là, le temps qui s'écoule a apporté une grande palette de solutions.\nNous verrons ce que l'on peut faire avec des outils graphiques comme Makecode ou Edublocks, puis nous verrons comment effectuer la transition vers le code lui même avec des éditeurs de plus en plus aptes à accompagner l'apprentissage.\nJe vous proposerait également un tour des plateformes permettant d'avoir de véritables curriculum complets le tout dans un environnement riche où textes d'explications et vidéos s'accompagneront parfois de petits jeux pour gravir une à une les marches menant à la connaissance de Python.\n\nVous devriez alors être capable de vous lancer vous même ou bien accompagner les personnes dans votre entourage qui souhaiterai plonger dans cet univers passionnant de la programmation Python.",
    "duration": 1601,
    "language": "fra",
    "recorded": "2023-02-18",
    "speakers": [
        "Thierry Chantier"
    ],
    "videos": [
        {
            "type": "mp4",
            "size": 226446669,
            "url": "https://dl.afpy.org/pycon-fr-23//Thierry%20Chantier%20-%20Apprendre%20Python%2C%20c%27est%20pour%20tout%20le%20monde%20en%202023%20%21.mp4"
        }
    ]
}
