{
    "title": "Nua, un PaaS open source en Python pour l'auto-hébergement de vos applications",
    "description": "#### Résumé\n\nNua est un projet de plateforme cloud open source lancé par Abilian en 2021. Il propose un PaaS (platform as a service) qui peut s'installer facilement sur des serveurs bare metal ou virtualisés, et qui permet de faire tourner des applications web conteneurisées, en gérant leur cycle de vie, les ressources dont elles ont besoin (stockage, bases de données, etc.), les droits d'accès des utilisateurs, les backups, le monitoring, les logs...\n\nNua permet de gérer des applications issues d'un portefeuille applicatif (\"marketplace\"), i.e. packagées et optimisées par les développeurs de la plateforme (ou des tiers). Nua permet aussi de déployer des applications en cours de développement (démo / qualif / prod), y compris plusieurs instances d'une même application, et y compris en déploiement automatique (exemple de use case: créer des instances de démo à la demande de prospects, en optimisant la consommation de ressources).\n\nNua est basé sur les principaux standards du monde open source et du cloud: base de données (Postgres, MySQL, Mongodb, Redis), stockage (S3), OCI, dockerfiles et buildpacks, LDAP et SSO, etc. Nua s'appuie actuellement sur Docker, mais permettra à terme de déployer des applications dans d'autres environnements d'exécution (autres conteneurs, VMs classiques ou légères, SlapOS...).\n\nDocumentation et code source:\n\n- https://nua.rocks\n- https://github.com/abilian/nua\n\n\n#### Plan de la présentation\n\n- Vision et caractéristiques principales du projet\n  - Simplification du packaging et du déploiement multi-instances,\n  - Auto-hébergement, souveraineté numérique\n  - Architecture générale\n\n- Pourquoi python ?\n  - Un runtime python dans le container\n  - Un orchestrateur pilotant les containers\n  - Réutilisation de composants entre le packaging, l'exécution de scripts et l'orchestration\n\n- Exemples et démo\n  - Fichier de configuration (vue du packageur)\n  - Déploiement de configurations (vue CLI de l'utilisateur)\n\n- Roadmap et comment contribuer\n\n#### Take-aways\n\n- Pour les développeurs / devops : comment Nua peut aider à déployer rapidement des versions de dev en phase de dev / préprod / prod, et à gérer les contraintes de la production (backup, upgrades) ?\n- Pour les responsables informatiques: comment Nua permet de déployer et de gérer facilement un portefeuille d'application Web open source (intranet / extranet / Web) ?\n- Pour les développeurs d'applications tierces: comment porter ses applications sous Nua?\n- Pour les contributeurs open source: quelle est la roadmap de Nua et comment y contribuer ?",
    "duration": 1457,
    "language": "fra",
    "recorded": "2023-02-18",
    "speakers": [
        "Jerome Dumonteil"
    ],
    "videos": [
        {
            "type": "mp4",
            "size": 155588018,
            "url": "https://dl.afpy.org/pycon-fr-23//Jerome%20Dumonteil%20-%20Nua%2C%20un%20PaaS%20open%20source%20en%20Python%20pour%20l%27auto-h%C3%A9bergement%20de%20vos%20applications.mp4"
        }
    ]
}
