{
  "copyright_text": "Standard YouTube License",
  "description": "Reemplazar, cambiar o incluso evolucionar una plataforma de software con años de desarrollo ya aplicados nunca es tarea fácil. A su vez, el software tiende a crecer y cambiar como si de un ser vivo se tratara, haciendo cada desarrollo un poco más complejo que el anterior, forzando a llevar documentaciones, wikis, seguir procesos, y ralentizando nuevos proyectos.\n\nEn esta charla hablaremos de cómo en Ticketea, que lleva 7 años funcionando con éxito, estamos acometiendo importantes cambios internos, tanto reescrituras de componentes existentes como nuevas piezas intentando modificar lo menos posible los flujos de negocio actuales, aplicando patrones de diseño como parallel change, event bus, o event sourcing. Pondremos como ejemplo el desarrollo de nuestra nueva API de compras (usando Python 3), la cual escucha determinados sucesos o eventos que suceden en la plataforma principal (construida con PHP y Python 2), gestiona todo el flujo de compra y emite de vuelta los datos para reincorporarlos a dicha plataforma, permitiendo pensar un sistema diferente, tiene las mismas restricciones.\n\nTambién estamos intentando implantar como objetivos o metas para todo proyecto las siguientes ideas y principios:\n\n- Hacer software simple\n- Iterar, iterar, iterar\n- Paridad Desarrollo-Producción\n- Automatización de operaciones (Docker y AWS)",
  "duration": 1517,
  "language": "spa",
  "recorded": "2017-09-23T10:30:00+02:00",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.es.pycon.org/es/schedule/"
    },
    {
      "label": "talk schedule",
      "url": "https://2017.es.pycon.org/es/schedule/high-impact-refactors-while-keeping-the-lights-on/"
    },
    {
      "label": "slides",
      "url": "https://speakerdeck.com/ticketeaeng/high-impact-refactors-keeping-the-lights-on"
    }
  ],
  "speakers": [
    "Diego Muñoz"
  ],
  "tags": [
    "refactoring"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/KFjgXtZs6IY/maxresdefault.jpg",
  "title": "High impact refactors while keeping the lights on",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KFjgXtZs6IY"
    }
  ]
}
