{
  "copyright_text": "Standard YouTube License",
  "description": "Los lenguajes de programación tienden a seguir unos convenios, o unas guías de estilo, que en el caso de Python es PEP8 y se han diseñado herramientas para comprobarlo y evaluarlo (Pylint, pep8, ...)\n\nPor otro lado, cada lenguaje de programación tiene unos determinados \"idioms\", es decir, unas determinadas palabras reservadas y expresiones que son propias de cada lenguaje.\n\nAprender en profundidad un lenguaje de programación, y dichos \"idioms\", puede llevar meses o incluso años. Dicho aprendizaje se adquiere con la práctica, colaborando con expertos en el ámbito y documentándose a partir de libros y otros recursos.\n\nExisten muchos programadores, que aun teniendo experiencia, utilizan Python como si estuvieran programando en otro lenguaje, es decir, sin la utilización de los \"idioms\" que se hacen necesarios.\n\nPor todo ello, hemos creado una herramienta que analiza los proyectos de los usuarios, detecta la utilización de determinados \"idioms\", y de este modo, muestra el nivel de Pythonista y proporciona recursos que ayudan a perfeccionar los conocimientos en Python.",
  "duration": 1426,
  "language": "spa",
  "recorded": "2017-09-23T17:30:00+02:00",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.es.pycon.org/es/schedule/"
    },
    {
      "label": "talk schedule",
      "url": "https://2017.es.pycon.org/es/schedule/herramienta-para-lograr-ser-un-experto-en-python/"
    },
    {
      "label": "slides",
      "url": "https://2017.es.pycon.org/media/keynotes/Pycones.pdf"
    }
  ],
  "speakers": [
    "José Javier Merchante"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/VWt6-qQLqfU/maxresdefault.jpg",
  "title": "Herramienta para lograr ser un experto en Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VWt6-qQLqfU"
    }
  ]
}
