{
  "copyright_text": "Standard YouTube License",
  "description": "El objetivo de estar charla es abordar un problema que parece ser desafortunadamente común entre el material disponible sobre las metaclases: por más que nos lo expliquen nos sigue sin quedar claro qué son las metaclases… o lo olvidamos a los diez minutos. Los ejemplos que se usan para ilustrar esa cosa tan arcana son casi inevitablemente crípticos, solucionando de forma compleja problemas demasiado rebuscados y que no nos hemos encontrado jamás en nuestro día a día. ¿Tienen realmente alguna utilidad práctica, o son sólo una excusa usada por ponentes para parecer r/iamverysmart? ¿Por qué deberían importarme a mí, con mi nivel medio de Python?\n\nLo que vamos a hacer en esta charla es empezar describiendo un problema: queremos implementar el mismo comportamiento (por ejemplo, logging) en todos los métodos de mi clase. Para ello tenemos varias opciones, en creciente orden de complejidad: (a) copiar y pegar la misma línea de código en todos los métodos, (b) usar un decorador en cada método y (c) usar un decorador de clase. Pero ninguna solución es ideal, y la falta de elegancia provoca lamentos y lágrimas. Es ante un problema así cuando las metaclases tienen una función, y agradeceremos que se encuentren en nuestro repertorio de habilidades de Python.\n\nEntendiendo por qué nos hacen falta, procedereremos a explicar cómo crear una: primero repasando brevemente la función de __new__() e __init__() para clases normales, y a continuación mostrando cómo hacer lo mismo con las metaclases. Ilustraremos esto con varios ejemplos, usando metaclases para añadir funcionalidad de auto-logging o compilación just-in-time, como hace Numba, a nuestro código. Por último, y a modo de curiosidad, continuaremos hacia mayores niveles de abstracción, aprendiendo qué son los hooks de metaclases y para qué son útiles los ficheros .pth.",
  "duration": 1475,
  "language": "spa",
  "recorded": "2017-09-23T17:00:00+02:00",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.es.pycon.org/es/schedule/"
    },
    {
      "label": "talk schedule",
      "url": "https://2017.es.pycon.org/es/schedule/metaclases-exactamente-que-y-sobre-todo-por-que/"
    }
  ],
  "speakers": [
    "Pablo Galindo Salgado",
    "Victor Terrón"
  ],
  "tags": [
    "metaclass"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/n2Ma5lT99pM/maxresdefault.jpg",
  "title": "Metaclases: exactamente qué y (sobre todo) por qué",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=n2Ma5lT99pM"
    }
  ]
}
