{
  "copyright_text": "Standard YouTube License",
  "description": "El contenido de esta charla se enfocará en todos los pasos necesarios para hacer que un coche sea capaz de aprender nuestro estilo de conducción en un simulador.\n\nEl esquema aproximado de la charla es el siguiente (aunque puede haber ligeros cambios):\n\n1. Haremos una introducción a las 2 tendencias existentes en los coches autónomos: la perspectiva de la robótica y la perspectiva de la IA.\n2. Tras esa introducción entraremos de lleno en el problema viendo como es el simulador que vamos a utilizar, los datos que genera y como es la problemática que queremos afrontar.\n3. Pasaremos a describir como usaremos Pandas y Matplotlib para hacer una exploración de los datos generados.\n4. Dado que los datos generados no van a ser suficientes ni vamos a tenerlos distribuidos como queremos, aplicaremos técnicas de aumento de datos con Numpy y OpenCV para solucionar esto.\n5. Una vez que ya tenemos todo a punto, es el momento de pasar a Keras (con el Backend de Tensorflow) para crear nuestro modelo de Deep Learning.\n6. ¿Como testeamos el resultado? Veremos que a veces las métricas no lo son todo y es el momento de probar otras cosas.\n7. Por último aprenderemos la importancia de la calidad de los datos y se expondrán algunas de las problemáticas que pueden surgir a lo largo del proyecto.",
  "duration": 1565,
  "language": "spa",
  "recorded": "2017-09-23T12:00:00+02:00",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.es.pycon.org/es/schedule/"
    },
    {
      "label": "talk schedule",
      "url": "https://2017.es.pycon.org/es/schedule/mi-coche-ya-es-mayor-de-edad-creo-que-puede-conducir-el-solito/"
    },
    {
      "label": "slides",
      "url": "https://www.slideshare.net/RicardoGuerreroGmezO/pycones-2017-mi-coche-ya-es-mayor-de-edad-creo-que-puede-conducir-l-solito-ricardo-guerrero-gmezolmedo"
    }
  ],
  "speakers": [
    "Ricardo Guerrero Gómez-Olmedo"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/X2p1b4aNhxA/maxresdefault.jpg",
  "title": "Mi coche ya es mayor de edad, creo que puede conducir solito",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=X2p1b4aNhxA"
    }
  ]
}
