{
  "copyright_text": "Standard YouTube License",
  "description": "El objetivo de la charla es hacer una pequeña demostración del uso de algunas de las bibliotecas más icónicas, hiladas a través del objetivo final de analizar fácilmente un examen tipo test.\n\nNumpy y Matplotlib son dos de las bibliotecas más importantes en el Python científico, usadas para trabajar con arrays y representaciones gráficas respectivamente.\n\nComo una imagen en escala de grises en el fondo no es más que una matriz, usaremos unas pocas manipulaciones básicas con imágenes para mostrar cómo trabajar con funciones de Numpy, hacer slicings, etc.\n\nLa interfaz de Matplotlib más sencilla, Pyplot, es muy útil para realizar muchos gráficos sin hacer un gran esfuerzo. Podemos mostrar un ejemplo sencillo de estas capacidades representando los contornos que detectemos sobre la imagen original.\n\nTambién se presentarán algunas de las funciones más básicas de OpenCV, uno de los paquetes de software más importantes de visión artificial. Usaremos las funciones de desenfoque, umbral y detección de contornos.\n\nSi el tiempo fuera suficiente, echaremos también un vistazo a la librería openpyxl, que nos permitirá importar y exportar datos de tablas de Excel.\n\nPuede ser importante resaltar explícitamente que debido a las limitaciones de tiempo, las librerías no pueden ser mostradas en profundidad, y que probablemente no habrá nada o casi nada de live coding. Sin embargo, todo el código usado, incluso para las imágenes intermedias, será publicado en forma de Notebook de Jupyter a través de Github.",
  "duration": 1434,
  "language": "eng",
  "recorded": "2017-09-23T16:30:00+02:00",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.es.pycon.org/es/schedule/"
    },
    {
      "label": "talk schedule",
      "url": "https://2017.es.pycon.org/es/schedule/corrigiendo-1000-examenes-con-un-pelin-de-opencv/"
    },
    {
      "label": "talk repository",
      "url": "https://github.com/AunSiro/correct-1000-exams-with-opencv"
    }
  ],
  "speakers": [
    "Siro Moreno"
  ],
  "tags": [
    "opencv"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/lnDx1WuS_ao/maxresdefault.jpg",
  "title": "Corrigiendo 1000 exámenes con un pelín de OpenCV",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lnDx1WuS_ao"
    }
  ]
}
