{
  "description": "Considering the current state of art deep learning algorithms, we might\nnot be able to come up with a single algorithm or network which can\nbuild an advanced creative application. But the components of the\napplication can be emulated using individual state of art algorithms.\nThis is called a Multi-model Pipeline architecture for Auria.\n\nBasic outline of the talk\n~~~~~~~~~~~~~~~~~~~~~~~~~\n\n1. Basic Machine Learning Pipelines [3-5mins]\n2. Using multiple models in a Machine Learning Pipeline [5-7mins]\n\n   -  Why multiple models?\n   -  How it is different from the single model pipelines?\n   -  What are the challenges?\n\n3. Case study - Auria Kathi the first poet artist [10-15mins]\n\n   -  Auria Kathi introduction\n   -  Engineering Pipeline of Auria Kathi\n   -  Azure Machine Learning Pipelines\n\n4. Conclusion and Q&A session [2mins]\n\nAuria Kathi - AI Poet Artist\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nAuria Kathi is an artificial artist and poet completely living online.\n\"Auria Kathi\" is an anagram for \"AI Haiku Art\". Auria generates a short\npoem, draws an abstract art based on the poem, and then colors the\npicture depending upon a mood. All these creative tasks are achieved\nusing a multi-model ML pipeline.\n\nWork of Auria is available in both Instagram and Twitter and will be\nposting daily for next year.\n\n-  Instagram Handle: https://www.instagram.com/auriakathi/\n-  Twitter Handle: https://twitter.com/AuriaKathi\n\nThe engineering pipeline of Auria\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n1. An LSTM based language model, trained on 3.5 lakhs Haikus scraped\n   from Reddit. The model is used to generate artificial poetry.\n2. A text to image network, called AttnGAN from Microsoft Research,\n   which converts the generated Haiku to an abstract image.\n3. A photorealistic style transfer algorithm which selects a random\n   style image from WikiArt dataset, and transfer color and brush\n   strokes to the generated image. The WikiArt dataset is a collection\n   of 4k+ curated artworks, which are aggregated on the basis of\n   emotions induced on human beings when the artwork is shown to them.\n\n.. figure:: https://sleebapaul.github.io/assets/auria_aml/auria_pipeline.png\n   :alt: Engineering Pipeline of Auria\n\n   Engineering Pipeline of Auria\n\nAuria on news and publications\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n1. Creative Applications Network -\n   https://www.creativeapplications.net/member-submissions/auria-kathi-an-ai-artist-living-in-the-cloud/\n2. Coding Blues -\n   https://codingblues.com/2019/01/11/fabin-sleeba-and-wonderful-auria/\n3. Creative AI Newsletter -\n   https://us15.campaign-archive.com/?u=c7e080421931e2a646364e3ef&id=d1a15e8502\n4. Towards Datascience -\n   https://towardsdatascience.com/auriakathi-596dfb8710d6\n5. Towards Datascience -\n   https://towardsdatascience.com/auria-kathi-powered-by-microsoft-azure-machine-learning-pipelines-385de55de062\n\nFlorence Biennale 2019\n~~~~~~~~~~~~~~~~~~~~~~\n\nAt the 12th edition of Florence Biennale happens in October 2019, Auria\nis exhibiting her work under the contemporary digital art section. Being\nan international platform for Art, the presence of Auria's work produced\nby AI will be discussed in Florence Biennale with greater importance.\nFurthermore, how creative machines are going to build our future by\ninspiring artists to come up with novel ideas is also a crucial part of\nthe discussion.\n\nCollaboration with Microsoft\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nAuria is a perfect use case of Microsoft envisioned Azure Machine\nLearning Pipelines, where each step can be conceived as a containerized\ncomputation step. Multiple models developed in diverse environments can\nbe incorporated in the reproducible pipelines and it can be easily\ndeployed as an API. Collaborating with Microsoft, Auria's creative\npursuit is coming to a wider audience.\n",
  "duration": 1288,
  "published_at": "2019-10-17T18:19:41.000Z",
  "recorded": "2019-08-03",
  "speakers": [
    "Sleeba Paul"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Hz3cYVu_CFo/hqdefault.jpg",
  "title": "Auria Kathi - The power of Multi Model Machine Learning Pipelines",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Hz3cYVu_CFo"
    }
  ]
}
