{
  "description": "For many, wine is a taste acquired over many years; others use data. In\nthis talk, I recite the story of how I uncovered the constituents of a\ngood wine using Data Visualization while discussing the nuances of\nExploratory Data Analysis (EDA) – the process of taking the first glance\nat data.\n\nIdea Behind The Talk\n^^^^^^^^^^^^^^^^^^^^\n\nWith the rise of tools allowing for smooth implementation of powerful\nalgorithms, it is tempting to skip EDA. However, **EDA is just as\nimportant as any part of a data project; if you don't know your data\nwell enough, you can end up doing very shallow work** , i.e., inaccurate\nmodels, choosing wrong variables, inefficient use of resources, or all\nof the above. Sometimes, EDA uncovers more than what the confirmatory\nstudy would've done otherwise.\n\nExploratory Data Analysis is what one should do when first encountering\na dataset. However, it's not a one-off process: there are setbacks,\nmultiple iterations, and the process sets the tone for a more formal\nanalysis of data in hand. **With a story-like format, the presentation\nmentions the setbacks one faces when performing a real data study.**\n\n**The motivation behind creating this talk is to impart the idea of\nExploratory Data Analysis, and how Data Visualizations help uncover\npatterns (not limited to the findings of the wine study). Moreover, I\nbelieve the format of a sharing a real story with the idea of \"how to\nreach and infer from a specific plot\" would help the audience understand\ndata visualization better than talking about syntactic sugar of a\nparticular visualization library. Moreover, the ideas can be further\ngeneralized to any other visualization library.**\n\nOutline of the Talk\n^^^^^^^^^^^^^^^^^^^\n\n-  History of Wine & Data Science\n-  Introduction to Exploratory Data Analysis (EDA)\n-  Why Data Visualization? – Anscombe's Quartet\n-  The Grammar of Graphics: Why I used ggplot2?\n\nWine Project: Finding Constituents of Good Red & White Wines\n''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''\n\n-  About the Project & How to Replicate It?\n-  How to Quantify ‘Artistic’ Measures?\n-  Principles of Data Visualization to Uncover Patterns\n-  Inspecting Data Using Univariate, Bivariate & Multivariate Plots\n\nAspects of EDA Not Used In the Wine Project\n'''''''''''''''''''''''''''''''''''''''''''\n\n-  How to Prepare Your Dataset? – Data Aggregation\n-  How to Remove Outliers Using Data Visualization\n-  How to Decide the Best Fit During EDA\n-  When to Transform Variables\n",
  "duration": 1171,
  "published_at": "2019-10-17T18:19:41.000Z",
  "recorded": "2019-08-04",
  "speakers": [
    "Pranav Suri"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/T54uP8imSaM/hqdefault.jpg",
  "title": "How I Used Data Visualization in My Quest for the Perfect Wine",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=T54uP8imSaM"
    }
  ]
}
