{
  "description": "In the present world of social networking, image manipulation is the\neasiest and the scariest job! This requires an utter need of efficient\nimage manipulation detection techniques. Moving from the traditional\nimage manipulation detection techniques to the present scenario, CNN can\nbe the perfect deep learning model as the human visual cortex has the\nability to detect tampered areas in an image!\n\nWith the advent of social networking services like Facebook and\nInstagram in the past few decades, the sharing of digital images has\nsubstantially increased. Also, these images can be easily modified these\ndays by using easily available image processing softwares like Adobe\nPhotoshop. These modified images are used for fake news, mob incitement,\netc. Hence there is a crucial need for image authentication schemes that\ncan verify if the image is authentic or manipulated. Earlier, most of\nthe research in this direction has been done in pixel based, format\nbased, camera based, physics based and geometry based schemes. All these\nschemes work upon the visual information of the image. Recently, CNN’s\ncame into picture that are inspired by visual cortex. It was analyzed\nthat it is possible for a human visual cortex to detect tampered areas\nin an image. Thus CNN can be the perfect deep learning model for this\njob! Content to be discussed: Traditional Image Manipulation Detection\nTechniques Various datasets available for Image Manipulation Detection\nExperimentation Learning Rich Features for Image Manipulation Detection\nCNN based Image Manipulation Detection Techniques\n",
  "duration": 960,
  "language": "eng",
  "published_at": "2019-10-17T18:19:41.000Z",
  "recorded": "2019-08-04",
  "speakers": [
    "Sonal Kukreja"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/XE5TCGVMZO8/hqdefault.jpg",
  "title": "Image Manipulation Detection using Neural Networks",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XE5TCGVMZO8"
    }
  ]
}
