{
  "description": "It is very common to get 100s of applicants for a role, which is\nbecoming difficult for recruiters to shortlist the most relevant\ncandidates. We present here a solution developed at dunnhumby that\nleverages Natural Language Processing to assist our recruitment team. By\nsimply providing a reference resume, our tool helps identifying similar\ncandidates, helping us focus on the right candidates.\n\nThe talk presents a real-life example of application of machine learning\nand natural language processing for the industry.\n\nFor every role we advertise, we get 100s if not 1000s of applicants.\nShortlisting the most relevant candidates becomes therefore very\ndifficult, and no recruitment team has the capacity and time to go\nthrough all the CV of the candidates who applied for a role. It also\nincreases the chances to miss the ideal candidate. We present here a\nsolution developed internally that leverages natural language processing\nto shortlist the most relevant candidates.\n\nVery often, the hiring manager provides the recruitment team with a\nreference CV of the ideal profile he or she is looking for. The way we\nhave designed the tool is as follows: The text from all the CVs is\nextracted and converted into a vector format using Word2Vec. This\ngenerates a vector representation of the candidate’s CV, which are then\ncompared using cosine-similarities with the vector of the reference CV.\nThis returns the CV that are the most similar to our reference profile.\n\nThe methodology has proven to give good results, particularly efficient\nat shortlisting the most promising candidates. It still does not replace\nan actual interview, but it has the potential of greatly reducing the\nhiring time and ensuring only the most promising candidates are\ninterviewed, saving time for both the manager and the candidates.\n",
  "duration": 1095,
  "language": "eng",
  "published_at": "2019-10-17T18:19:41.000Z",
  "recorded": "2019-08-03",
  "speakers": [
    "Victor Robin"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/KYogyvGiyHQ/hqdefault.jpg",
  "title": "Intelligent recruitment using NLP and machine learning to identify the most suitable candidates",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KYogyvGiyHQ"
    }
  ]
}
