{
  "description": "Predicting transaction fraud in real-time is an important challenge due\nto large data size, imbalanced target class, ever changing fraud MOs &\nstrict requirement for prediction inference speed which machine learning\nmodels can help to solve. Using open source technologies & distributed\ncomputing, Barclays has been developing solutions to reduce fraud losses\nand limit adverse customer experience.\n\nTransaction Fraud Model Development\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n\nPredicting transaction fraud of debit and credit card payments in\nreal-time is an important challenge, which new technologies and\nstate-of-art supervised machine learning models can help to solve. While\ndifferent supervised learning techniques, like Logistic Regression and\nNeural Networks, have been used for many years, recent developments in\nDeep Learning, Gradient Boosted Machines, and Recurrent Neural Networks,\nhave opened up a wealth of options that can provide significant\nimprovements over the existing models.\n\nAdvantages of Distributed Computing\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n\nWhile the transaction volumes are humongous (billions of transaction per\nyear), non-distributed packages like numpy or pandas easily run out of\nmemory. Distributed computing solves this problem. Spark serves as a\nsolution to Raw data processing, Data Quality and Reconciliation and\nmost importantly Feature engineering where thousands of features are\nbeing created and tested.\n\nReal Challenges with fraud data\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n\nMachine Learning techniques are in general well-suited for transaction\nfraud, however, large data volumes (billions of transaction per year),\nvery imbalanced target class (rare events), ever changing fraud MOs, and\nstrict requirements for the prediction inference speed, mean that some\nmethods are better suited than others. With the help of open source\ntechnologies like python and distributed computing using spark, Barclays\nhas been developing and testing different solutions to reduce fraud\nlosses and limit adverse customer experience.\n\nThe main emphasis of the talk is to show how to train supervised\ntransaction fraud models that can be implemented and how these models\nimprove both customer experience and help to reduce fraud losses. The\npresentation will show results of a machine learning model that is\noperating in production.\n\nThe audience will learn - how real-time transaction fraud models work\nand the main challenges in transactions fraud modelling - how\ndistributed computing can come to an advantage - which supervised\nmachine learning techniques are most applicable\n",
  "duration": 1501,
  "published_at": "2019-10-17T18:19:41.000Z",
  "recorded": "2019-08-03",
  "speakers": [
    "Mayank Jain"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/b4Mv-jaVuNU/hqdefault.jpg",
  "title": "Predicting Real-Time Transaction Fraud Using Python and spark (Sponsored Talk)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=b4Mv-jaVuNU"
    }
  ]
}
