{
  "description": "Abstract\n========\n\ncoala is an Open Source project with well over 400 contributors and more\nthan 50 Google Summer of Code applications this year. What’s behind it?\nHow did it all start? What is the secret sauce to its growth and how do\nwe make a living of it? This talk tells our story with the key takeaways\nand provides a top level story driven insight on those and more topics.\nThis talk is perfect for people who want to live and work for their own\nideas rather than being a gear in a machine.\n\nDescription\n===========\n\ncoala began as a fun project. We never believed there would be anything\nuseful growing out of it - and yet it did. Contributors all over the\nworld came to us and helped creating the community as it is. Eventually\nI became a freelancer and got funding for working on a startup based on\ncoala.\n\nHow did all of this happen? What does this mean for the main\ncontributors? How can we make a living of an open source project?\n\nThis talk tells our story. What we did - good and bad things - so we all\ncan learn from it. From my personal open source contributions over\nfounding an open source project to building a freelance agency and\nfounding a startup.\n\nParticipants will learn how they can grow an open project, automate\nnewcomer processes and gain insights into how they can start making a\nliving of it, possibly founding a company eventually. There is no single\nrecipe for this but we can - and should - exchange the tips and tricks\nwe’ve gained with our ventures. This talk is for entrepreneurs,\nwanna-be-freelancers and future or open source project founders and\ncontributors.\n",
  "recorded": "2017-10-06",
  "related_urls": [
    {
      "label": "talk slides",
      "url": "https://speakerdeck.com/pyconza/from-fun-to-business-how-open-source-can-change-your-life-by-lasse-schuirmann"
    }
  ],
  "speakers": [
    "Lasse Schuirmann"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/j0O1lGFgO10/hqdefault.jpg",
  "title": "From Fun to Business - How Open Source can Change Your Life",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=j0O1lGFgO10"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyconza2017-From_Fun_to_Business_How_Open_Source_can_Change_Your_Life"
    }
  ]
}
