{
  "description": "Once upon a time, sysadmins had cute naming schemes for their boxen,\nand it was good. Suddenly, virtualisation! And the cute names\nwithered as herds of servers were born. Infrastructure automation and\nmanagement became a thing. Helper software was released (without\nwhich a nine person company could not hope to manage 400-odd\nservers.) And it was good again, until the edges showed. Then we\nstarted to build.\n\nIn this talk we’ll discuss the challenges encountered in managing\nhundreds of servers delivering a single product on AWS. Relying on\nSaltStack for deployment, management and diagnostics, we’ve automated\naway painful steps and reduced our attack surface. SaltStack handles\nconfiguration and package management well, but is capable of much more\nonce you start to customise it.\n\nAlong the way we’ll show examples of custom SaltStack modules, runners,\nand event handlers. We’ll describe threats and show how SaltStack helps\nus limit their exposure and impact. We’ll catalogue the lessons we’ve\nfaced in two years of running SaltStack in our production environment.\n\nWe won't rehash content from previous talks, and novice users will get\nto see how the tool can be stretched. If you’re wanting to get more out\nof SaltStack than the builtin modules allow for, this talk is for you.\n",
  "language": "eng",
  "recorded": "2017-10-06",
  "related_urls": [
    {
      "label": "talk slides",
      "url": "https://speakerdeck.com/pyconza/house-of-salt-extending-and-leveraging-saltstack-by-marco-slaviero-and-max-mclaughlin"
    }
  ],
  "speakers": [
    "Marco Slaviero",
    "Max Mclaughlin"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/P9A-MW8haHo/hqdefault.jpg",
  "title": "House of Salt: Extending and leveraging SaltStack",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=P9A-MW8haHo"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyconza2017-House_of_Salt_Extending_and_leveraging_SaltStack"
    }
  ]
}
