{
  "description": "A walk-through of how we practically clean and use a public dataset\nthat is changing people's lives.\n\nThe `Medicine Price Registry <http://mpr.gov.za/>`__ is a spreadsheet\npublished one or more times per year, with the latest prices and active\ningredients for medicines registered for sale in South Africa. Like most\ndata, it's dirty and has limited usability in its original form. We take\nyou through some of the practical steps we take to clean the data and\nmake it easier to analyse and use. This allows us, for example, to\nanalyse how price competition from generics lower medicine prices, or\nnot!\n\nThis is intended as a simple real-world example of how we work around\nthe issues with a dataset using a few common tools. This could be done\nwith any platform, but jupyter notebooks, sqlalchemy, alembic migrations\nand the brevity of python is a nice combination for the iteration needed\nto work with this data and adapt as we get to know it. We start with a\nGUI tool called OpenRefine but it pretty quickly becomes necessary to\nwrite just a bit of code to move quickly.\n\nThere's a lot of material out there on specific tools. I'd like to show\nthe reality of dirty datasets, and the workarounds and approaches we use\nto get value from it nonetheless. One such example is using charts and\nordering to group related data and visually identify interesting events.\nI encourage people to ask questions and offer suggestions. The effort\nput into this project has been limited by time constraints but any\nimprovements can have real world impact.\n\nIf you're interested in trying something like this yourself, you're\ninvited to chat with me about civic technology, perhaps join our civic\ntech community, and help figure out how it can be most effective. You\nmay also be interested in the CodeBridge Community Evening Thursday 5\nOctober at 18:30.\n",
  "recorded": "2017-10-05",
  "related_urls": [
    {
      "label": "talk slides",
      "url": "https://speakerdeck.com/pyconza/making-man-made-medicine-price-data-more-useful-by-jd-bothma"
    }
  ],
  "speakers": [
    "JD Bothma"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/AHhB74ttslM/hqdefault.jpg",
  "title": "Making man-made medicine price data more useful",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AHhB74ttslM"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyconza2017-Making_manmade_medicine_price_data_more_useful"
    }
  ]
}
