{
  "description": "The South Africa mining and metallurgical industry is the bedrock of\nour economy... or it is supposed to be. We are blessed with more\nmineral resources than any other country in the world. Unfortunately\nwe are tending, more and more, to export ore to China and other\ncountries without adding value to it here. The end result is that we\nlose billions of Rand in potential revenue.\n\nComputational modelling plays an important part in helping us understand\nthings better, make better decisions, develop better processes, and be\nmore competitive. In our metallurgical industry processes are mostly\ndescribed with Excel models. These models have many drawbacks, and of\nlimited use. There is another way. We can integrate detailed\nthermochemistry into our models to describe process more accurately.\nThis, however, is fairly difficult, and not many people are able to do\nit. Our challenge is to make this type of modelling easier, and to make\nit more accessible, so that our industry can benefit.\n\nOur journey has been a long one, and has winded through territories like\nC++, VB, VBA, C#.net and others. Eventually we arrived at Python. We\nwill share our experiences in using things like Django, Jinja2, Celery\nand Postgres to move modelling of metallurgical processes into the 21st\ncentury, into the cloud, and to move our industry forward.\n",
  "language": "eng",
  "recorded": "2017-10-06",
  "related_urls": [
    {
      "label": "talk slides",
      "url": "https://speakerdeck.com/pyconza/mixing-metals-with-snakes-moving-an-industry-forward-by-johan-zietsman"
    }
  ],
  "speakers": [
    "Johan Zietsman"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/nhbmFA258AM/hqdefault.jpg",
  "title": "Mixing Metals with Snakes - Moving an Industry Forward",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nhbmFA258AM"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyconza2017-Mixing_Metals_with_Snakes_Moving_an_Industry_Forward"
    }
  ]
}
