{
  "description": "Johan Zietsman\nhttps://2017.za.pycon.org/talks/53/\nThe South Africa mining and metallurgical industry is the bedrock of our economy... or it is supposed to be. We are blessed with more mineral resources than any other country in the world. Unfortunately we are tending, more and more, to export ore to China and other countries without adding value to it here. The end result is that we lose billions of Rand in potential revenue.\n\nComputational modelling plays an important part in helping us understand things better, make better decisions, develop better processes, and be more competitive. In our metallurgical industry processes are mostly described with Excel models. These models have many drawbacks, and of limited use. There is another way. We can integrate detailed thermochemistry into our models to describe process more accurately. This, however, is fairly difficult, and not many people are able to do it. Our challenge is to make this type of modelling easier, and to make it more accessible, so that our industry can benefit.\n\nOur journey has been a long one, and has winded through territories like C++, VB, VBA, C#.net and others. Eventually we arrived at Python. We will share our experiences in using things like Django, Jinja2, Celery and Postgres to move modelling of metallurgical processes into the 21st century, into the cloud, and to move our industry forward.",
  "recorded": "2017-10-06",
  "related_urls": [
    {
      "label": "talk slides",
      "url": "https://speakerdeck.com/pyconza/mixing-metals-with-snakes-moving-an-industry-forward-by-johan-zietsman"
    }
  ],
  "speakers": [
    "Johan Zietsman"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/nhbmFA258AM/hqdefault.jpg",
  "title": "Mixing Metals with Snakes - Moving an Industry Forward",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nhbmFA258AM"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyconza2017-Mixing_Metals_with_Snakes_Moving_an_Industry_Forward"
    }
  ]
}
