{
  "description": "No, really, say \"hello\" to them. The age of voice enabled interfaces\nis already upon us with the rise of driverless cars, ubiquitous\ntechnology and the Internet of Things(IoT), computers no longer need\nto speak in code but they have learnt to speak the human language.\nGoogle home is a voice-activated speaker powered by the google\nassistant similar to other assistants namely Siri, Alexa and Cortana.\n\nIn this talk, I will be looking at developing and deploying Actions\n(Conversations) on the Google home assistant. This will be done by\ncreating an application (web hook) triggered by an action created in\nAPI.AI using a python template.\n\n-  Audience is anyone interested in creating bots using API.AI\n-  Anyone interested in adding customized actions to the google\n   assistant\n-  Anyone interested in learning about voice enabled actions\n\nSpecific aspects I will cover include: - Reasons, voice enabled\ninterfacing is an interesting topic to follow - Simplified overview of\nthe steps to create custom \"conversation actions\" - Going into a bit of\ndetail where the challenges arise - Examples of cool projects out there\ncurrently\n\nI will end with a look into creating your first simplified google\n\"conversational action\" in hopefully less than 10 minutes once all the\nprerequisite software is installed.\n\nLadies and Gentlemen...the software bots have risen.\n",
  "language": "eng",
  "recorded": "2017-10-06",
  "related_urls": [
    {
      "label": "talk slides",
      "url": "https://speakerdeck.com/pyconza/say-hello-to-the-new-wave-of-software-bots-dot-dot-dot-by-irikidzai-muchaneta"
    }
  ],
  "speakers": [
    "Irikidzai Muchaneta"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/1HB3aab-9OM/hqdefault.jpg",
  "title": "Say Hello to the new wave of software bots...",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1HB3aab-9OM"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyconza2017-Say_Hello_to_the_new_wave_of_software_bots"
    }
  ]
}
