{
  "description": "Irikidzai Muchaneta\nhttps://2017.za.pycon.org/talks/72/\nNo, really, say \"hello\" to them. The age of voice enabled interfaces is already upon us with the rise of driverless cars, ubiquitous technology and the Internet of Things(IoT), computers no longer need to speak in code but they have learnt to speak the human language. Google home is a voice-activated speaker powered by the google assistant similar to other assistants namely Siri, Alexa and Cortana. \n\nIn this talk, I will be looking at developing and deploying Actions (Conversations) on the Google home assistant. This will be done by creating an application (web hook) triggered by an action created in API.AI using a python template.\n\n  * Audience is anyone interested in creating bots using API.AI\n  * Anyone interested in adding customized actions to the google assistant\n  * Anyone interested in learning about voice enabled actions\n\nSpecific aspects I will cover include: \\- Reasons, voice enabled interfacing is an interesting topic to follow \\- Simplified overview of the steps to create custom \"conversation actions\" - Going into a bit of detail where the challenges arise \\- Examples of cool projects out there currently\n\nI will end with a look into creating your first simplified google \"conversational action\" in hopefully less than 10 minutes once all the prerequisite software is installed.\n\nLadies and Gentlemen...the software bots have risen.",
  "recorded": "2017-10-06",
  "related_urls": [
    {
      "label": "talk slides",
      "url": "https://speakerdeck.com/pyconza/say-hello-to-the-new-wave-of-software-bots-dot-dot-dot-by-irikidzai-muchaneta"
    }
  ],
  "speakers": [
    "Irikidzai Muchaneta"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/1HB3aab-9OM/hqdefault.jpg",
  "title": "Say Hello to the new wave of software bots...",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1HB3aab-9OM"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyconza2017-Say_Hello_to_the_new_wave_of_software_bots"
    }
  ]
}
