{
  "description": "By: The authors of Tachyonic\n\nIntro: (10 mins)\n~~~~~~~~~~~~~~~~\n\nMeet Bob. Bob is a Network Administrator at a Service Provider. As a\nwell seasoned network engineer, he’s been building packet pushing\nnetworks since the days when IP shared bandwidth with IPX, Appletalk,\nDECnet etc. He is a well rounded network engineer with robust set of\nnetworking skills. He mastered making, shaping of networks with his tool\nset such as Spanning Tree, RAPS, Vlans, VXLAN and MPLS.\n\nHowever, Bob’s world is changing. Networks are not what they used be.\nToday’s networks are growing more rapidly than ever. This means there\nare more devices to manage and also more data produced by these devices\nto work with. Doing things manually just don’t scale anmore. Bob has no\nother option to turn to automation.\n\nIn the Devops world these issues have been and are being addressed. The\nNetworking universe is lagging behind. Standard Bodies and Vendors have\nstarted coming up with solutions such as Openflow and NETCONF, but there\nare limits.\n\nAlso, many Open source projects (most of them written in Python) and\nproprietary solutions have joined the scene, which we will talk about.\n\nSo Bob has options, but… none of them has all the answers. Except for\none!\n\nIntroduction to Tachyonic Open Source Project (10 mins)\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n-  Why Python? \\*\\* (you probably know some of the answer already)\n-  What is Tachyonic? \\*\\* Tachyonic framework is intended to control a\n   large pool of services such as cloud, networking, dns, email managed\n   through a single dashboard. The goal here is to have a “single pane\n   of glass” view. Tachyonic scale is only dependent on the deployment\n   method used and is designed to be massively horizontally scalable.\n   It's all open-source and completely customizable.\n-  Modular - extensible \\*\\* All interfaces such as API endpoints and\n   Dashboard views are fully extensible via plugins/modules. All you\n   need to do is write the bit of python to meet your need, and plug it\n   into the Tachyonic framework. \\*\\* Components and endpoints can run\n   on the same Server, or different ones.\n-  API and UI \\*\\* Tachyonic comes with both a RESTful API, as well as a\n   UI for those who wish to use it. In fact the UI simply uses the API\n   in the back-end\n-  Multi-Tenancy \\*\\* With Tachyonic you get a framework that us\n   Multi-Tenant, and Multi-Tiered. That means you can use it to add\n   customers, and Customers can even be resellers that have their own\n   customers. Tachyonic takes care of who is allowed access to what.\n\nWhat you get (10 mins)\n~~~~~~~~~~~~~~~~~~~~~~\n\nWe have done all the hard work for you:\n\n- User login and RBAC\n- Separate Domains\n- UI\n- API\n- WSGI Framework\n\nWhat you need to code\n~~~~~~~~~~~~~~~~~~~~~\n\nYou may simply write the python you require, and plug it in! Single\nextendable portal, restapi framework does it all!\n\nUse cases\n~~~~~~~~~\n\n-  Build customer portals to provision services in addition to\n   integrated helpdesk and payment gateways.\n-  Build Billing and Telemetry services on top of Python using\n   well-known open-source projects such as Pandas for time series data.\n-  Automate deployment and monitoring of network devices\n-  With knowledge of Python and Tachyonic, you may never have to look at\n   a new system ever again!\n\nWhere can i get more info?\n~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nVisit our site: http://tachyonic.co.za/\n",
  "language": "eng",
  "recorded": "2017-10-06",
  "related_urls": [
    {
      "label": "talk slides",
      "url": "https://speakerdeck.com/pyconza/tachyonic-an-open-source-devops-project-written-in-python-for-the-networking-community-by-allan-swanepoel"
    }
  ],
  "speakers": [
    "Allan Swanepoel"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/fsFihMhmaKI/hqdefault.jpg",
  "title": "Tachyonic: an open source DEVOPS project written in Python for the Networking community",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fsFihMhmaKI"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyconza2017-Tachyonic_an_open_source_DEVOPS_project_written_in_Python_for_the_Networking_community"
    }
  ]
}
