{
  "description": "Allan Swanepoel\nhttps://2017.za.pycon.org/talks/77/\n### By: The authors of Tachyonic\n\n### Intro: (10 mins)\n\nMeet Bob. Bob is a Network Administrator at a Service Provider. As a well seasoned network engineer, he’s been building packet pushing networks since the days when IP shared bandwidth with IPX, Appletalk, DECnet etc. He is a well rounded network engineer with robust set of networking skills. He mastered making, shaping of networks with his tool set such as Spanning Tree, RAPS, Vlans, VXLAN and MPLS.\n\nHowever, Bob’s world is changing. Networks are not what they used be. Today’s networks are growing more rapidly than ever. This means there are more devices to manage and also more data produced by these devices to work with. Doing things manually just don’t scale anmore. Bob has no other option to turn to automation.\n\nIn the Devops world these issues have been and are being addressed. The Networking universe is lagging behind. Standard Bodies and Vendors have started coming up with solutions such as Openflow and NETCONF, but there are limits.\n\nAlso, many Open source projects (most of them written in Python) and proprietary solutions have joined the scene, which we will talk about.\n\nSo Bob has options, but… none of them has all the answers. Except for one!\n\n### Introduction to Tachyonic Open Source Project (10 mins)\n\n  * Why Python? ** (you probably know some of the answer already)\n  * What is Tachyonic? ** Tachyonic framework is intended to control a large pool of services such as cloud, networking, dns, email managed through a single dashboard. The goal here is to have a “single pane of glass” view. Tachyonic scale is only dependent on the deployment method used and is designed to be massively horizontally scalable. It's all open-source and completely customizable.\n  * Modular - extensible ** All interfaces such as API endpoints and Dashboard views are fully extensible via plugins/modules. All you need to do is write the bit of python to meet your need, and plug it into the Tachyonic framework. ** Components and endpoints can run on the same Server, or different ones.\n  * API and UI ** Tachyonic comes with both a RESTful API, as well as a UI for those who wish to use it. In fact the UI simply uses the API in the back-end\n  * Multi-Tenancy ** With Tachyonic you get a framework that us Multi-Tenant, and Multi-Tiered. That means you can use it to add customers, and Customers can even be resellers that have their own customers. Tachyonic takes care of who is allowed access to what.\n\n### What you get (10 mins)\n\nWe have done all the hard work for you: _ User login and RBAC _ Separate Domains _ UI _ API * WSGI Framework\n\n### What you need to code\n\nYou may simply write the python you require, and plug it in! Single extendable portal, restapi framework does it all! \n\n### Use cases\n\n  * Build customer portals to provision services in addition to integrated helpdesk and payment gateways.\n  * Build Billing and Telemetry services on top of Python using well-known open-source projects such as Pandas for time series data.\n  * Automate deployment and monitoring of network devices\n  * With knowledge of Python and Tachyonic, you may never have to look at a new system ever again!\n\n### Where can i get more info?\n\nVisit our site: http://tachyonic.co.za/",
  "recorded": "2017-10-06",
  "related_urls": [
    {
      "label": "talk slides",
      "url": "https://speakerdeck.com/pyconza/tachyonic-an-open-source-devops-project-written-in-python-for-the-networking-community-by-allan-swanepoel"
    }
  ],
  "speakers": [
    "Allan Swanepoel"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/fsFihMhmaKI/hqdefault.jpg",
  "title": "Tachyonic: an open source DEVOPS project written in Python for the Networking community",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fsFihMhmaKI"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyconza2017-Tachyonic_an_open_source_DEVOPS_project_written_in_Python_for_the_Networking_community"
    }
  ]
}
