{
  "description": "ZimboPy is an organic, on-the-ground effort by a local non-profit\norganization and Python developers in the Harare software development\ncommunity to advance the cause of women in technology in Zimbabwe. The\nprogram operates in community centers, universities, high schools and\ntech hubs to make programming accessible to girls regardless of their\nsocio-economic status. Upon initially joining a ZimboPy club, many of\nthe girls would have never used a computer before, let alone code.\n\nIn Zimbabwe, only 17% of computer science undergraduate majors are\nwomen, and in the developing world, women make up less than 20% of the\ninformation and technology workforce. ZimboPy exists to empower\nZimbabwean girls with the skills and confidence necessary to not only\nenter the local tech industry, but to lead it.\n\nIn addition to learning to code, ZimboPy club members also join a global\nnetwork of women in technology that are working to tackle social\nchallenges through human-centered design and computer science.The Python\ncommunity has been a central part of our work. For our mentorship week\nthat was held in April we had python programmers from USA, Italy,\nAustralia and of course Zimbabwe join us in person and virtually. Our\ntalk will outline what we've achieved so far and how anyone who's part\nof the Python community can get involved. We invite developers from\naround the world to help Zimbabwean girls address local problems which\ncan be solved with technology, such as clean water and e-commerce\nsolutions for small shops in towns and villages. Mentors can travel to\nZimbabwe and work with girls as they develop a plan for their\napplications and pair-program with them, answering questions and\nproviding feedback along the way. Overall, ZimboPy looks forward to\nchanging Zimbabwe's future through creativity, collaboration and the\npower of Python programming\n",
  "recorded": "2017-10-05",
  "related_urls": [
    {
      "label": "talk slides",
      "url": "https://speakerdeck.com/pyconza/zimbopy-empowering-zimbabwean-girls-as-change-makers-by-marlene-mhangami-and-ronald-maravanyika"
    }
  ],
  "speakers": [
    "Marlene Mhangami",
    "Ronald Maravanyika"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/8f_TI8kp5zw/hqdefault.jpg",
  "title": "ZimboPy: Empowering Zimbabwean Girls As Change Makers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8f_TI8kp5zw"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyconza2017-ZimboPy_Empowering_Zimbabwean_Girls_As_Change_Makers"
    }
  ]
}
