{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2014", "speakers": ["Ralph Heinkel"], "title": "Combining the powerful worlds of Python and R", "quality_notes": "", "video_flv_length": null, "recorded": "2014-07-25", "video_mp4_length": null, "description": "pyRserve is a small open source project originally developed to fulfill the needs of a German biotech company to do statistical analysis in a large Python-based Lab Information Management System (LIMS). In contrast to other R-related libraries like RPy where Python and R run on the same host, pyRserve allows the distribution of complex operations and calculations over multiple R servers across the network. \r\n\r\nThe aim of this talk is to show how easily Python can be connected to R, and to present a number of selected (simple) code examples which demonstrate the power of this setup.", "video_mp4_url": "", "tags": [], "copyright_text": "http://creativecommons.org/licenses/by/3.0/", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=ucJ2-5a2CAA", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "Although maybe not very well known in the Python community there exists a powerful statistical open-source ecosystem called R. Mostly used in scientific contexts it provides lots of functionality for doing statistical analysis, generation of various kinds of plots and graphs, and much, much more.\r\n\r\nThe triplet [R](http://www.r-project.org \"R\"), [Rserve](https://rforge.net/Rserve/ \"Rserve\"), and [pyRserve](https://pypi.python.org/pypi/pyRserve/ \"pyRserve\") allows the building up of a network bridge from Python to R: Now R-functions can be called from Python as if they were implemented in Python, and even complete R scripts can be executed through this connection.", "thumbnail_url": "http://i.ytimg.com/vi/ucJ2-5a2CAA/hqdefault.jpg", "video_flv_url": ""}