{
  "id": 2980, 
  "category": "EuroPython 2014", 
  "slug": "conversing-with-people-living-in-poverty", 
  "title": "Conversing with people living in poverty", 
  "summary": "[Vumi](http://vumi.org) is a text messaging system designed to reach out to those in\r\npoverty on a massive scale via their mobile phones. It's written in\r\nPython using Twisted. This talk is about how and why we built it and\r\nhow you can join us in making the world a better place.", 
  "description": "43% of the world's population live on less than €1.5 per day.\r\n\r\nThe United Nations defines poverty as a \"lack of basic capacity to\r\nparticipate effectively in society\".  While we often think of the poor\r\nas lacking primarily food and shelter, the UN definition highlights\r\ntheir isolation. They have the least access to society's knowledge and\r\nservices and the most difficulty making themselves and their needs\r\nheard in our democracies.\r\n\r\nWhile smart phones and an exploding ability to collect and process\r\ninformation are transforming our access to knowledge and the way we\r\norganize and participate in our societies, those living in poverty\r\nhave largely been left out. This has to change.\r\n\r\nBasic mobile phones present an opportunity to effect this change\r\n[3]. Only three countries in the world have fewer than 65 mobile\r\nphones per 100 people [4]. The majority of these phones are not\r\nAndroid or iPhones, but they do nevertheless provide a means of\r\ncommunication -- via voice calls, SMSes [6], USSD [7] and instant\r\nmessaging.\r\n\r\nBy comparison, 25 countries have less than 5% internet penetration\r\n[5].\r\n\r\nVumi [1] is an open source text messaging system designed to reach out\r\nto those in poverty on a massive scale via their mobile phones. It's\r\nwritten in Python using Twisted.\r\n\r\nVumi is already used to:\r\n\r\n  * provide Wikipedia access over USSD and SMS in Kenya [8].\r\n  * register a million voters in Libya [10].\r\n  * deliver health information to mothers in South Africa [9].\r\n  * prevent election violence in Kenya [11].\r\n\r\nThis talk will cover:\r\n\r\n  * a brief overview of mobile networking and cellphone use in Africa\r\n  * why we built Vumi\r\n  * the challenges of operating in unreliable environments\r\n  * an overview of Vumi's features and architecture\r\n  * how you can help!\r\n\r\nVumi features some cutting edge design choices:\r\n\r\n  * horizontally scalable Twisted processes communicating using RabbitMQ.\r\n  * declarative data models backed by Riak.\r\n  * sharing common data models between Django and Twisted.\r\n  * sandboxing hosted Javascript code from Python.\r\n\r\nOverview of challenges Vumi addresses:\r\n\r\n*Scalability*: Vumi needs to support both small scale applications (demos, pilot projects, applications tailored for a particular community) and large ones (things that everyone within a country might use). We address this using Twisted workers that exchange messages via RabbitMQ and store data in Riak. Having projects share RabbitMQ and Riak instances significantly reduces the overhead for small projects (e.g. its not cost effective to launch the recommended minimum of 5 Riak servers for a small project).\r\n\r\n*Barriers to entry*: Often the people with good ideas don't have access to one of many things needed to run a production system themselves, e.g. capital, time, stable infrastructure. We address this by providing a hosted Vumi instance that runs sandboxed Javascript applications. All the application author needs is their idea, the ability to write Javascript and upload it to our servers. The target audience here is African entrepreneurs at incubator spaces like iHub (Nairobi), kLab (Kigali), BongoHive (Lusaka) and JoziHub (Johannesburg).\r\n\r\n*Unreliable third-party systems*: It's one thing for parts of ones own system to go down, it's another for crucial third-party systems to go down. Vumi takes an SMTP-like approach to solving this and uses persistent queues so that messages can back up in the queue while third-party systems are down and be processed when they become available again. We also feedback information on whether third-party messaging systems have accepted or reject messages to the application that initiated them.\r\n\r\nVumi is developed by the Praekelt Foundation [2] (and individual contributors!).\r\n\r\n  [1]: <http://vumi.org/> \"Vumi\"\r\n  [2]: <http://praekeltfoundation.org/> \"Praekelt Foundation\"\r\n  [3]: <http://www.youtube.com/watch?v=0bXjgx4J0C4#t=20> \"Spotlight on Africa\"\r\n  [4]: <http://en.wikipedia.org/wiki/List_of_countries_by_number_of_mobile_phones_in_use>\r\n  [5]: <http://en.wikipedia.org/wiki/List_of_countries_by_number_of_Internet_users>\r\n  [6]: <http://en.wikipedia.org/wiki/Short_Message_Service>\r\n  [7]: <http://en.wikipedia.org/wiki/Unstructured_Supplementary_Service_Data\r\n  [8]: <http://blog.praekeltfoundation.org/post/65981723628/wikipedia-zero-over-text-with-praekelt-foundation>\r\n  [9]: <http://blog.praekeltfoundation.org/post/65042080515/mama-launches-healthy-family-nutrition-programme>\r\n  [10]: <http://www.libyaherald.com/2014/01/01/over-one-million-register-for-constitutional-elections-on-final-sms-registration-day/#axzz2sroHcg00>\r\n  [11]: <http://blog.praekeltfoundation.org/post/51210616848/the-texting-will-never-be-done-peace-messages-in-kenya>", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/", 
  "thumbnail_url": "http://i.ytimg.com/vi/Vjslvo8atfw/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=Vjslvo8atfw", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=Vjslvo8atfw", 
  "tags": [], 
  "speakers": [
    "Simon Cross"
  ], 
  "recorded": "2014-07-24"
}