{
  "id": 3042, 
  "category": "EuroPython 2014", 
  "slug": "cutting-edge-apis-using-hypermedia-at-bskyb", 
  "title": "Cutting-edge APIs using hypermedia at BSkyB", 
  "summary": "In this talk I will explain what hypermedia enabled API means, I will give an example of such an API and I will take you through the implementation details and the usage of flask, dougrain and HAL in this context. Also, I will present a brief comparison with an API that is not hypermedia enabled and take you through the advantages of using the hypermedia approach.", 
  "description": "In the technology community at the moment there is a lot of talk about hypermedia enabled APIs and Web as an Architecture model.\r\n \r\n More and more applications nowadays try to adopt the loosely coupled and distributed web like architecture by using hypermedia as an engine of the application state.\r\n \r\nIn Sky we are successfully implementing this approach for some of our components, and we’ve learnt that the major benefit for us is the scalability that it offers: as an increasingly expanding business with a constantly growing product portfolio, scalability of all our systems is crucial.\r\n \r\nIn this talk I will share some of the things we learnt, I will explain what hypermedia enabled API means, I will give an example of such an API and I will take you through the implementation details and the usage of flask, dougrain and HAL in this context.\r\n \r\nAlso, I will present a brief comparison with an API that is not hypermedia enabled and take you through the advantages of using the hypermedia approach.", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/", 
  "thumbnail_url": "http://i.ytimg.com/vi/7rSLyLMaWXQ/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=7rSLyLMaWXQ", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=7rSLyLMaWXQ", 
  "tags": [], 
  "speakers": [
    "Adriana Vasiu"
  ], 
  "recorded": "2014-07-22"
}