{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2014", "speakers": ["Stefan"], "title": "Event discrete simulation with SimPy", "quality_notes": "", "video_flv_length": null, "recorded": "2014-07-25", "video_mp4_length": null, "description": "Simulation is important for the analysis of complex systems or the analysis of\r\nthe impact of certain actions on that systems. They are especially useful if\r\nthe actions are potentially harmful or expensive.\r\n\r\nSimulation is used in various natural scientific and economic areas, e.g., for\r\nthe modeling and study of biological or physical systems, for resource\r\nscheduling and optimization or at the research for the integration of renewable\r\nenergies into the power grid (my personal background). The simulated time can\r\nthereby be seen as continuous or discrete (discrete time or discrete event).\r\n\r\nIn this talk, I want to show why Python is a good choice for implementing\r\nsimulation models and how SimPy can help here.\r\n\r\nStructure of the talk (20min talking + 5min discussion + 5min buffer):\r\n\r\n- Why simulation? (5min)\r\n- History of SimPy (3min)\r\n- How does SimPy work? (9min)\r\n- Conclusion (3min)\r\n\r\nIn the introduction, I’ll briefly explain what simulation is and motivate, why\r\nit is a useful tool.\r\n\r\nThe main part will consist of an introduction and demonstration of SimPy. Since\r\nSimPy is now more then ten years old, I’ll first give a quick overview about\r\nits history and development. Afterwards, I’ll explain SimPy’s concepts and\r\nfeatures by means of simple examples.\r\n\r\nIn the conclusion, I’ll give a short outlook on the future development of\r\nSimPy.\r\n\r\nThe main goal of this talk is to create awareness that simulation is a powerful\r\ntool in a lot of domains and to give the audience enough information to ease\r\ntheir first steps.", "video_mp4_url": "", "tags": [], "copyright_text": "http://creativecommons.org/licenses/by/3.0/", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=Bk91DoAEcjY", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "Often, experiments with real world systems are high-risk, accompanied by high\r\ncosts or not even possible at all. That’s when simulations come into play.\r\nThis talk will give a brief introduction into the topic of simulation. By means\r\nof simple examples, it will demonstrate how you can use SimPy to implement\r\nevent-discrete simulations and which features SimPy offers to help you doing\r\nthat.", "thumbnail_url": "http://i.ytimg.com/vi/Bk91DoAEcjY/hqdefault.jpg", "video_flv_url": ""}