{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2014", "speakers": ["Frank Becker"], "title": "Managing the Cloud with a Few Lines of Python", "quality_notes": "", "video_flv_length": null, "recorded": "2014-07-23", "video_mp4_length": null, "description": "One of the advantages of cloud computing is that resources can be enabled or disabled dynamically. \r\nE. g. is an distributed application short on compute power one can easily add more. But who wants to do that by hand? Python is a perfect fit to control the cloud. \r\nThe talk introduces the package Boto which offers an easy API to manage most of the Amazon Web Services (AWS) as well as a number of command line tools. \r\nFirst some usage examples are shown to introduce the concepts behind Boto. \r\nFor that a few virtual instances with different configurations are launched, and the use of the storage service S3 is briefly introduced. \r\nBased on that a scalable continuous integration system controlled by Boto is developed to show how easy all the required services can be used from Python. \r\nMost of the examples will be demonstrated during the talk. They should be easily adoptable for similar use cases or serve as an starting point for more different ones.", "video_mp4_url": "", "tags": [], "copyright_text": "http://creativecommons.org/licenses/by/3.0/", "related_urls": [{"url": "https://github.com/boto/boto", "description": ""}], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=LbKvCvfWcJc", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "One of the advantages of cloud computing is that resources can be enabled or disabled dynamically. \r\nE. g. is an distributed application short on compute power one can easily add more. But who wants to do that by hand? Python is a perfect fit to control the cloud. The talk introduces the package [Boto](https://github.com/boto/boto \"Boto\") which offers an easy API to manage most of the Amazon Web Services (AWS) as well as a number of command line tools.", "thumbnail_url": "http://i.ytimg.com/vi/LbKvCvfWcJc/hqdefault.jpg", "video_flv_url": ""}