{
  "id": 2966, 
  "category": "EuroPython 2014", 
  "slug": "morepath-a-python-web-framework-with-super-power", 
  "title": "Morepath: a Python Web Framework with Super Powers", 
  "summary": "[Morepath](http://morepath.readthedocs.org) is a server web framework written with modern, rich client web development in mind. Why another new Python web framework in 2014? \r\n\r\nBecause it can be done better: Morepath understands how to construct hyperlinks from models. Writing a generic view in Morepath is like writing any other view. With Morepath, you can reuse, extend and override apps as easily as you can construct them.\r\n\r\nEven if you don't end up using Morepath, you will learn something about how the nature of web frameworks.", 
  "description": "[Morepath](http://morepath.readthedocs.org) is a new server web\r\nframework written with modern, rich client web development in mind.\r\n\r\nIn the talk I will be discussing some core features of Morepath that\r\nmake it different:\r\n\r\n* Its different take on routing and linking. Morepath has support\r\n  to help you construct hyperlinks to models.\r\n* Its view system: plain views, generic views, view composition.\r\n* Morepath's approach to application construction allows application extension and overriding, and composition.\r\n\r\nThis talk will attempt to convince people to try Morepath. For those\r\nunable or unwilling to try, I will communicate some design principles\r\nbehind Morepath which can be of help to any web developer.", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/", 
  "thumbnail_url": "http://i.ytimg.com/vi/gyDKMAWPyuY/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=gyDKMAWPyuY", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=gyDKMAWPyuY", 
  "tags": [], 
  "speakers": [
    "Martijn Faassen"
  ], 
  "recorded": "2014-07-24"
}