{
  "id": 2939, 
  "category": "EuroPython 2014", 
  "slug": "practical-pybuilder", 
  "title": "Practical PyBuilder", 
  "summary": "*PyBuilder* is a software build tool written in pure python which mainly targets \r\npure python applications.\r\nIt provides glue between existing build frameworks, thus empowering you to focus on the big picture of the build process.\r\n\r\nIt will be shown through demonstrations and samples how a simple, \r\nhuman-readable and declarative configuration can lead to an astonishingly \r\nwell-integrated build process which will make maintainers, developers and newcomers happy.", 
  "description": "# Why another build tool\r\nStarting up a simple python project with best practices still takes a lot of boilerplate and glueing (e.G. chaining unit tests and integration tests in the build process, adding a linter, measuring coverage, ...).\r\nIt often results in extremely ugly homebrew scripts and edge-case solutions that are not reusable.\r\nThere are even programs out there (e.G. cookiecutter) that encourage boilerplate code generation!\r\n\r\n# Build orchestration\r\nPyBuilder borrows from the *maven* idea of phases (packaging, verifying, publishing, ...) to set up a fully declarative and automated build that can be run locally and remotely (build servers) in the very same way.\r\nRather than reinventing the wheel, it  provides glue between existing solutions (like unittest, coverage, flake8, ...) through a simple but powerful plugin mechanism.\r\n\r\n# The talk\r\nAfter a more theoretical talk with a colleague at PyConDE 2013, I want to show how it's actually like to work with *PyBuilder*.\r\nThis includes\r\n\r\n * starting up a project\r\n * running builds\r\n * using plugins\r\n * writing a plugin\r\n\r\nThe demo code will be made available on GitHub and I'll probably  have recordings prepped in case something goes wrong.\r\n\r\nReviewer FAQ\r\n===============\r\n\r\n### How does PyBuilder compare to other existing solutions like zc.buildout? \r\n\r\nAs opposed to solutions like zc.buildout which focus on the *building* of complex projects (many parts, complex dependencies) PyBuilder emphasizes the full build process for very simple projects. Undoubtedly, buildout is more powerful for building in that regard and there is no reason to switch to PyBuilder.\r\n\r\nHowever, for simple projects (a few packages, pure python) we believe that PyBuilder is better, especially if you're starting out with Python. The plugin architecture (as opposed to recipes) makes it easier to reason about what is going on. We are able to model dependencies between build phases  (like \"coverage\" needing \"unit tests\" and \"packaging\" needing \"integration tests\") where recipes are not. It also seems (after looking through the recipes available for buildout) that we have more focus on QA as part of the build process (lint code, differentiate between unit/integration tests, code analysis, ...). \r\n\r\nThere is also a special focus on having the build descriptor written in Python (with fluent interfaces where possible) so that it is possible to understand what the configuration is by reading plain english, as opposed to zc.buildout (where the configuration is an ini file, or SCons which is very make-oriented).\r\n\r\nIn the end, a big difference between most build tools and PyBuilder is that PyBuilder is more about orchestration. We didn't reinvent packaging or linting,  we simply use what is already there (setuptools, flake8, pymetrics, ...). This allows users to use the tools they want without having to do the integration themselves, and still get a nice, unified build process out of it.\r\n\r\nA simple example :\r\n\r\nIn buildout, code analysis can be done with \r\n\r\n\r\n```\r\n[buildout]\r\nparts += code-analysis\r\n\r\n[code-analysis]\r\nrecipe = plone.recipe.codeanalysis\r\ndirectory = ${buildout:directory}/src\r\n```\r\n\r\nThis is not readable IMHO.\r\nIn PyBuilder it can look like this :\r\n\r\n```\r\nuse_plugin('python.flake8')\r\nproject.set_property('flake8_include_test_sources', True)\r\nproject.set_property('flake8_ignore', 'E501')\r\nproject.set_property('flake8_break_build', True)\r\n```\r\n\r\n\r\n### \"It provides glue between existing build frameworks\" - which ones ? Could you name (some at least) ?\r\n\r\nCurrently there is only a plugin for building with distutils/setuptools. Should that change (e.G. new contender) it would be easy to switch using PyBuilder.\r\n\r\nExamples where glue is needed : \r\n\r\n* Glue setuptools + unittest, so that no distribution can be shipped if tests fail\r\n* Glue setuptools + coverage + unittest, so that no distribution can be shipped if the statement coverage is too low (configurable ofc)\r\n* Glue setuptools + pip so that cloned projects can be built with their dependencies without needing to pip install manually", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/", 
  "thumbnail_url": "http://i.ytimg.com/vi/iQU18hAjux4/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=iQU18hAjux4", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=iQU18hAjux4", 
  "tags": [], 
  "speakers": [
    "Maximilien Riehl"
  ], 
  "recorded": "2014-07-25"
}