{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2014", "speakers": ["Deni Bertovic"], "title": "Supercharge your development environment using Docker", "quality_notes": "", "video_flv_length": null, "recorded": "2014-07-23", "video_mp4_length": null, "description": "In this talk I am going to show how to utilize light weight lxc containers\r\nusing docker, and make your development process much more straightforward. How to share container images among your development team and be sure that everyone is running the exact same stack. Do all this without hogging too many resources, without the need for complex provisioning scripts and management systems. And above all else, how to do it fast!\r\n\r\nRough Guidelines:\r\n\r\n1. Describe what is LXC  (Linux containers)\r\n2. Benefits of using containers instead of traditional VM's\r\n2. Explain where Docker comes in\r\n3. Show how to build simple containers using Dockefile syntax\r\n4. What are container images and how to share them\r\n5. How to share private container images\r\n6. Tips and tricks on how to automate ", "video_mp4_url": "", "tags": [], "copyright_text": "http://creativecommons.org/licenses/by/3.0/", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=-l9xH1X_rvg", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "These days applications are getting more and more complex. It's becoming\r\nquite difficult to keep track of all the different components an application\r\nneeds to function (a database, an AMQP, a web server, a document store...). It keeps getting harder and harder to setup new development environments and to bring new developers into the team. Stuff works on one dev machine but doesn't on others? Code breaks often when deployed to production even though all tests were passing and it worked on the dev machine?\r\n\r\nThe idea of this talk is to convey how important it is that we have our development environment as close to production as possible. That means setting up all those various services on your laptop/workstation.", "thumbnail_url": "http://i.ytimg.com/vi/-l9xH1X_rvg/hqdefault.jpg", "video_flv_url": ""}