{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2014", "speakers": ["Richard Wall"], "title": "Twisted Names: DNS Building Blocks for Python Programmers", "quality_notes": "", "video_flv_length": null, "recorded": "2014-07-25", "video_mp4_length": null, "description": "# Description\r\n\r\nMy talk will consist of four main sections. Given the 30 minute time constraint,\r\nI may shorten or drop the two introductory parts in favour of the narrative and\r\ndemonstration of interesting new APIs and code examples in the final two\r\nparts. My experience of delivering a similar talk at PyconUK 2013 is that those\r\nare the parts that will most interest the audience and prompt most audience\r\nquestions.\r\n\r\nHere are my proposed sections with rough time allocations and descriptions:\r\n\r\n## Introducing Twisted Names (0-5)\r\n\r\nTwisted includes a comprehensive set of DNS components, collectively\r\nknown as Twisted Names.\r\n\r\n-   <https://twistedmatrix.com/trac/wiki/TwistedNames>\r\n\r\nI will begin the talk with a quick introduction to Twisted Names and its\r\ncapabilities, including one or two simple code examples.\r\n\r\n## Introducing My Project (0-5)\r\n\r\nWith generous funding from The NLnet Foundation I am adding EDNS(0) and DNSSEC\r\nclient support in Twisted Names, including full DNSSEC verification and DANE\r\nsupport.\r\n\r\nIn the talk I will quickly summarise the steps taken and lessons learned in\r\nsecuring that funding, and hope to encourage the audience to seek funding to\r\nsupport there own pet OSS projects.\r\n\r\n## What's New in Twisted Names / Project Progress Report (10)\r\n\r\nMy project plan is divided into the following broad milestones.\r\n\r\n1.  EDNS(0)\r\n\r\n    1.  OPT record\r\n\r\n    2.  Extended Message object with additional EDNS(0) items\r\n\r\n    3.  EDNS Client\r\n\r\n2.  RRSET handling\r\n\r\n    1.  Canonical Form and Order of Resource Records\r\n\r\n    2.  Receiving RRSETs\r\n\r\n3.  DNSSEC\r\n\r\n    1.  New DNSSEC Records and Lookup Methods\r\n\r\n    2.  Security-aware Non-validating Client\r\n\r\n    3.  Validating Client\r\n\r\n4.  DANE\r\n\r\n    1.  A twistd dns authoritative server capable of loading and serving TLSA\r\n        records.\r\n\r\n    2.  A Twisted web client Agent wrapper which performs TLSA lookup and\r\n        verification of a server certificate.\r\n\r\n    3.  A HostnameClientEndpoint which performs TLSA lookup and verification of a\r\n        server certificate.\r\n\r\n    4.  A command line tool for debugging TLSA records and for verifying a\r\n        certificate file against a domain name.\r\n\r\n    5.  A TLSA Record class for encoding and decoding TLSA bytes.\r\n\r\n    6.  A TLSA lookup method which accepts port, protocol and hostname and constructs\r\n        a suitable TLSA domain name.\r\n\r\nIn the talk I will quickly outline these goals, report on my progress so far,\r\nand show running code examples to demonstrate the new APIs.\r\n\r\n## Future Developments (5)\r\n\r\nThe aim of my project is to lay foundations that will eventually allow\r\nend-to-end DNSSEC verification in all the core Twisted networking components,\r\nincluding Twisted Conch (SSH), Mail (SMTP, POP3), Perspective Broker (RPC), Web\r\n(HTTP, XML-RPC, SOAP), Words (XMPP, IRC).\r\n\r\nAdditionally I hope that this foundation work will encourage the development of\r\nend-to-end DNSSEC verification in many of the Open Source and commercial\r\nprojects built on top of Twisted.\r\n\r\nI will end the talk by outlining these exciting possibilities, and demonstrate\r\nsome code examples that illustrate these possibilities.\r\n\r\n## Q & A (5-10)\r\n\r\nI'm determined to leave at least five minutes at the end for audience\r\nquestions. At PyconUK 2013 I was frustrated because I ran out of time and ended\r\nup answering questions outside the lecture theatre; questions which would have\r\nbeen interesting to the whole audience.\r\n", "video_mp4_url": "", "tags": [], "copyright_text": "http://creativecommons.org/licenses/by/3.0/", "related_urls": [{"url": "https://github.com/wallrj/twisted-names-talk", "description": "Notes and examples"}], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=kuSXK4gNYqw", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "In this talk I will report on my efforts to update the DNS components of Twisted\r\nand discuss some of the things I've learned along the way. I'll demonstrate the\r\nEDNS0, DNSSEC and DANE client support which I have been working on and show how\r\nthese new Twisted Names components can be glued together to build novel DNS\r\nservers and clients.\r\n\r\nTwisted is an event-driven networking engine written in Python and\r\nlicensed under the open source MIT license.  It is a platform for\r\ndeveloping internet applications.", "thumbnail_url": "http://i.ytimg.com/vi/kuSXK4gNYqw/hqdefault.jpg", "video_flv_url": ""}