{
  "alias": "video/4033/beginners-guide-to-machine-learning-competitions",
  "category": "PyTexas 2015",
  "copyright_text": "CC-BY",
  "description": "This tutorial will offer a hands-on introduction to machine learning and\nthe process of applying these concepts in a Kaggle competition. We will\nintroduce attendees to machine learning concepts, examples and flows,\nwhile building up their skills to solve an actual problem. At the end of\nthe tutorial attendees will be familiar with a real data science flow:\nfeature preparation, modeling, optimization and validation.\n\nPackages used in the tutorial will include: IPython notebook,\nscikit-learn, pandas and NLTK. We’ll use IPython notebook for\ninteractive exploration and visualization, in order to gain a basic\nunderstanding of what’s in the data. From there, we’ll extract features\nand train a model using scikit-learn. This will bring us to our first\nsubmission. We’ll then learn how to structure the problem for offline\nevaluation and use scikit-learn’s clean model API to train many models\nsimultaneously and perform feature selection and hyperparameter\noptimization.\n\nAt the end of session, attendees will have time to work on their own to\nimprove their models and make multiple submissions to get to the top of\nthe leaderboard, just like in a real competition. Hopefully attendees\nwill not only leave the tutorial having learned the core data science\nconcepts and flow, but also having had a great time doing it.\n",
  "duration": null,
  "id": 4033,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-10-09",
  "slug": "beginners-guide-to-machine-learning-competitions",
  "speakers": [
    "Christine Doig"
  ],
  "summary": "",
  "tags": [
    "tutorial",
    "machine learning",
    "nltk",
    "pandas",
    "scikit-learn",
    "ipython"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ys2usamKyus/hqdefault.jpg",
  "title": "Beginner's Guide to Machine Learning Competitions",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ys2usamKyus"
    }
  ]
}
