{
  "copyright_text": null,
  "description": "Fazendo o uso do cache do nginx, podemos ter melhoria de desempenho de\nAPIs restful e conteúdos de 1000X ou mais. Mas como ter controle do que\nestá no cache e se este conteúdo é coerente com o que está no backend?\n\nCom sistemas de cache utilizando nginx ou varnish, geralmente são\nbaseados em tempo (valid 10 min., 24h, …) mas muitas vezes ao fazer\nmodificações em models do django, seria muito bom que este cache fosse\ninvalidado no momento da modificação (post_save, post_delete, pre_save,\netc).\n\nO django-cache-coherence foi criado para atender esta necessidade. Para\ncada requisição em uma url requisitada e está configurada para fazer\ncache, os dados da requisição são salvos em um banco e registrado um\nsignal para fazer a limpeza deste cache (PURGE). Assim que houver uma\nchamada do signal registrado, é feito uma consulta neste banco de\nrequisições cacheadas, e disparado as limpezas, invalidando o cache\nsomente da informação modificada, deixando integro o restante ndo cache.\n\nPara ativar este tipo de funcionalidade no nginx é utilizado o módulo\n`ngx_cache_purge`_\n\nVou mostrar a configuração do nginx e como fazer inclusive cache de\nAPIs, com e sem autenticação. Mostrando como garantir e entrega com\ncache de informações sensiveis de usuários.\n\nPara a validação de verificação do funcionamento são feitos testes de\nintegração com testes unitários e containers docker.\n\n.. _ngx_cache_purge: https://github.com/FRiCKLE/ngx_cache_purge/",
  "duration": 1740,
  "language": "por",
  "recorded": "2016-10-13",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2016.pythonbrasil.org.br/#schedule"
    }
  ],
  "speakers": [
    "Helber Maciel Guerra"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/XPNqkb1rEBE/maxresdefault.jpg",
  "title": "Coerência de cache de granularidade fina, usando django signals",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XPNqkb1rEBE"
    }
  ]
}
