{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "As we bring on new team members, we want to ensure they can ramp up quickly and have a good experience. They should be able to understand \"the company way\" of accomplishing things and quickly find the tools they need to do their job. Veteran team members should also be able to codify and commoditize the patterns they've developed over time so they can focus on higher-order problems. In large organizations, such tooling might be the purview of a dedicated platform engineering team and have a budget to match. But what if you're a small team, or a team of one, and you want to build something that scales to the whole organization without becoming a full-time job? At ITHAKA, over 100 engineering staff manage hundreds of applications in a handful of languages and frameworks across many teams and products. Despite the variety, most of those engineers still need to perform a core set of tasks when developing, from debugging to traffic routing to feature toggles. Teams are always working on high-priority projects, and it can be difficult to find the time to take stock of things that can be better streamlined or automated. Further, although we have a platform engineering team, as a non-profit we don't have the budget for someone to work on meta-tooling as a full-time job. Over time, several aspects of our development process have become common sources of friction, with a lot of time spent answering questions or debugging local machine setups. In this talk I'll tell the story of my journey to build a tool with a net positive return on investment, from the initial idea to the rollout and adoption. I'll cover the principles that guided my decisions, the tools we use, and the outcomes we've seen so far.",
  "duration": 1501,
  "language": "eng",
  "recorded": "2025-04-13",
  "speakers": [
    "Dane Hillard"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/BbWTiGJQ9X0/maxresdefault.webp",
  "title": "Place-making & productivity: Build maintainable tools with a small team",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BbWTiGJQ9X0"
    }
  ]
}