{
  "description": "Day 2, R0 11:45–12:15\n\nTl; Dr Generative models are making all the big headlines, understand what, how and most importantly why behind these esoteric algorithms. How can you start building one and why are these models the dark horse of artificial intelligence.\r\n\r\nYann LeCun, the man behind Convolution Neural Networks and the frontier of computer vision research, proclaimed that the future of artificial intelligence lies in unsupervised learning.\r\n\r\nWhat are Generative models? These are the machine learning models that can learn the hidden representation of a given dataset and then can extrapolate an accurate data point given certain conditions. If all that was jargon for you - here's a better intuitive understanding, imagine if you were given a white canvas to paint a picture of a bird, what would you do? First, you would imagine a bird and then fill in the colors. Well, Generative models do the same thing! Just with a lot of mathematics and sweet python libraries.\n\nSlides not uploaded by the speaker.\n\nSpeaker: Prakhar Srivastava\n\nGreetings to everyone,\r\n\r\nI'm Prakhar Srivastava, researcher, open source lover, and a student. I have worked on Deep learning models for 3 years now and mentor the deeplearning.ai course on Coursera. I've researched with India's leading research college, IIIT Delhi (http://midas.iiitd.edu.in/team/prakhar.html). I've worked as a student developer in GSoC'18 under OpenAstronomy and as a team leader at Stanford Scholar initiative. I've hosted complete lecture sessions on Deep learning in my college under IEEE. I'm currently working as a Machine learning and research intern at SocialCops, one of India's leading startups.",
  "recorded": "2019-09-21",
  "speakers": [
    "Prakhar Srivastava"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/7weyd-ivkPk/hqdefault.jpg",
  "title": "Draw Me Like One of Your French Girls — Generative Models in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7weyd-ivkPk"
    }
  ]
}
