{
  "description": "Day 3, R1 10:50–11:20\n\n這不是教學。我希望為曾經使用過 web API 的人，不論是哪一種 API，都能帶來一些啟發，以及微笑。\n\n我會先簡述一下過往用 Python 寫裸 API，到 REST API，到目前 GraphQL 的心路歷程，再展示 iCHEF 在 GraphQL 的《**三**》代演進，以及一些後見之明，為來者鋪路。\n\n聽完應該會對 GraphQL 在 web 前後端與 mobile 的應用場景有更多的掌握，在 API 的設計與使用多一些他山之石，以及用 Graphene 與 Django 實作 GraphQL schema 時能預想到一些細節與工具。\n\nIt's NOT a tutorial. Hoping it can bring some delights to people who ever used Python to call the web API, whatever kind that API is.\n\nI will brief my experience of writing Python from raw API, REST API, to current GraphQL API. **3** generations of iCHEF GraphQL will be demonstrated to pave the road of followers.\n\nIt should bring more understanding of GraphQL interaction between web frontend, backend, and mobile clients, more examples of API design & usage, and details of GraphQL schema implement in Graphene & Django.\n\nSlides not uploaded by the speaker.\n\nSpeaker: Keith Yang\n\n最近覺得邊騎室內腳踏車邊用電腦，離開臉書與 IG 的精神（神經？）生活很不賴。讓這隻小白鼠從大眾心理控制實驗學裡喘了一小口氣。\n\nRecently he enjoys skateboard commute, still coffee-achemy, and indoor cycle while programming or gaming, an awesome mind vocation of leaving FB and IG.\n\nKeith is the founder and co-organizer of Taipei.py, largest Python user group in Taiwan, a Lead Software Engineer at iCHEF, and was Chairperson of PyCon APAC 2015. His work mostly focuses on web/backend/cloud services since 2006, and he hands on kernel tools of virtualization on hypervisors in 2016.",
  "recorded": "2019-09-22",
  "speakers": [
    "Keith Yang"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/LBhgBx0WnLQ/hqdefault.jpg",
  "title": "GraphQL with Graphene and Django, Laughters and Tears",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LBhgBx0WnLQ"
    }
  ]
}
