{
  "description": "Day 1, R2 10:50–11:20\n\nSimple scripting, such as Python, Bash, PHP, Perl are all embedded in modern OS. Since Android is also a linux-based OS, it is also possible to write a script. Unfortunately before SL4A arrives, it is impossible to script on Android phone. SL4A provides rich APIs that allow user to access Android intents such as GPS location, Accelerometer and etc. through scripting. Hence with those APIs, the user can build simple scripts to interact with those APIs.\r\n\r\nThis talks demonstrates how android intents can be accessed using python client, hence understanding the interaction between Android and Python API inside SL4A via RPC by dissecting the source code of both Android and Python API inside SL4A. The speaker will then demonstrate how different android intents such as GPS coordinate and gyroscope through a presentation of websocket coded in Python and webapp demo using babylon.js, together with a flask application that allows user to send SMS messages through Rest APIs, using android API.\n\nSlides not uploaded by the speaker.\n\nSpeaker: Ing Wei Tang\n\nIng Wei is the chair for PyCon MY 2019, the co-chair of PyCon MY 2018, and vice president of MyPOP. He has spoken in various PyCons, particularly in PyCon APAC 2018, as well as involving in PyCon communities actively in Malaysia.\r\n\r\nHe uses python a lot in his daily work, especially coding the automation process and flow. During his past time, he likes to experience and perform hacking different things on operating system level.\r\n\r\nApart from programming language, he can also speak 5 different types of languages concurrently in one sentence. Please ask for demo if time permits.",
  "recorded": "2019-09-20",
  "speakers": [
    "Ing Wei Tang"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/uQ7mxSKR33c/hqdefault.jpg",
  "title": "Honey, There Is a Python in My Android Phone!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uQ7mxSKR33c"
    }
  ]
}
