{
  "description": "Day 3, 09:25–10:25\n\nThe programmatic availability of basically any kind of (financial) data has reshaped finance from a theory-driven to a data-driven discipline. Recent advances in AI in combination with the programmatic availability of (financial) data with further change finance to an AI-first discipline. The talk discusses several important aspects in this regard and provides concrete examples in Python.\n\nSlides not uploaded by the speaker.\n\nSpeaker: Yves J Hilpisch\n\nDr. Yves J. Hilpisch is founder and managing partner of The Python Quants (http://tpq.io), a group focusing on the use of open source technologies for financial data science, artificial intelligence, algorithmic trading, and computational finance. He is also founder and CEO of The AI Machine (http://aimachine.io), a company focused on AI-powered algorithmic trading based a proprietary strategy execution platform.\n\nYves has a Diploma in Business Administration, a Ph.D. in mathematical finance and is Adjunct Professor for Computational Finance at Miami Business School (University of Miami). He is the author of four books (http://books.tpq.io):\n\n* Artificial Intelligence in Finance (O’Reilly, current project)\n* Python for Finance (2018, 2nd ed., O’Reilly)\n* Listed Volatility and Variance Derivatives (2017, Wiley Finance)\n* Derivatives Analytics with Python (2015, Wiley Finance)\n\nYves is the director of the first online training program leading to a University Certificates in Python for Algorithmic Trading (http://certificate.tpq.io) and Computational Finance (http://compfinance.tpq.io). He also lectures on computational finance, machine learning and algorithmic trading at the CQF Program (http://cqf.com).\n\nYves is the main author of the financial analytics library DX Analytics (http://dx-analytics.com) and organizes meetups, conferences, and bootcamps about Python, artificial intelligence and algorithmic trading in London (http://pqf.tpq.io), New York (http://aifat.tpq.io), Frankfurt, Berlin and Paris. He has given keynote speeches at technology conferences in the United States, Europe, and Asia.",
  "recorded": "2019-09-22",
  "speakers": [
    "Yves J Hilpisch"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/HkBIV1ZJKrM/hqdefault.jpg",
  "title": "Keynote: Artificial Intelligence in Finance",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HkBIV1ZJKrM"
    }
  ]
}
