{
  "copyright_text": "Standard YouTube License",
  "description": "“So tell me,” my manager said, “what is an average?”\n\nThere’s probably nothing worse than that sinking feeling when you finish an analysis, email it to your manager or client to review, and they point out a mistake so basic you can’t even fathom how you missed it.\n\nThis talk is about mine: how to take an average.\n\nAverages are something we use everywhere - it’s a simple ``np.mean()`` in pandas or ``AVG()`` in SQL. But recently I’ve come to appreciate just how easy it is to calculate this statistic incorrectly. We learn once - in middle school no less - how to take an average, and never revisit it. Then, when we are faced with multidimensional datasets (ie. pretty much every dataset out there), we never reconsider whether we should be taking an average the same way.\n\nIn this talk, we follow my arduous and humbling journey of learning how to properly take an average with multidimensional data. We will cover how improperly calculating it can produce grossly incorrect figures, which can slip into publications, research analyses and management reports.",
  "duration": 1562,
  "language": "eng",
  "recorded": "2018-05-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2018/schedule/talks/"
    },
    {
      "label": "Conference slides (Github)",
      "url": "https://github.com/PyCon/2018-slides"
    },
    {
      "label": "Conference slides (SpeakerDeck)",
      "url": "https://speakerdeck.com/pycon2018"
    },
    {
      "label": "talk schedule",
      "url": "https://us.pycon.org/2018/schedule/presentation/84/"
    }
  ],
  "speakers": [
    "Alex Petralia"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/DlgG0QdrqAU/maxresdefault.jpg",
  "title": "Analyzing Data: What pandas and SQL Taught Me About Taking an Average",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DlgG0QdrqAU"
    }
  ]
}
