{
  "copyright_text": "Standard YouTube License",
  "description": "You maintain an Open Source project with great code? Yet your project isn’t succeeding in the ways you want? Maybe you’re struggling with funding or documentation? Or you just can’t find new contributors and you’re drowning in issues and pull requests?\nOpen Source is made up of many components and we are often better-trained in methods for writing good code, than in methods for succeeding in the other dimensions we want our project to grow.\nIn this talk we’ll explore the different components of an Open Source project and how they work together. After this talk you’ll be well-equipped with a ideas and strategies for growing, cultivating, and nourishing your Open Source project.\n\nFor your project to succeed, all of its non-code components must be well-maintained. What are these different components and what methods can we learn to maintain them?\n\n* Build real relationships with your sponsors and determine ways how both sides can benefit from this relationship, don’t just ask people for money.\n* Establish a good communication system with your contributors: Keep them informed, listen to their feedback and input, make them feel heard.\n* Thank the people who worked on ticket triage or marketing, not just those who wrote code, in your release notes.\n* Make it easy for new contributors to get started: Write and maintain good documentation, answer questions in a friendly and timely manner.\n* Market and evangelize in the right places and at the right time: Give conference talks, organize sprints, keep your project’s Twitter account active, always curate new and interesting content on your blog or website.\n* Implement a Code of Conduct and enforce it if needed: Make your project a safe space to contribute for everyone.\n\nWith these methods and a half-dozen others, you’ll handle beautifully all the components your project needs to succeed.",
  "duration": 1739,
  "language": "eng",
  "recorded": "2018-05-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2018/schedule/talks/"
    },
    {
      "label": "Conference slides (Github)",
      "url": "https://github.com/PyCon/2018-slides"
    },
    {
      "label": "Conference slides (SpeakerDeck)",
      "url": "https://speakerdeck.com/pycon2018"
    },
    {
      "label": "talk schedule",
      "url": "https://us.pycon.org/2018/schedule/presentation/77/"
    }
  ],
  "speakers": [
    "Anna Ossowski"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/GmbaKdd6o6A/maxresdefault.jpg",
  "title": "Flourishing FLOSS: Making Your Project Successful",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GmbaKdd6o6A"
    }
  ]
}
