{
  "copyright_text": "Standard YouTube License",
  "description": "In 2017, I was released from prison after serving 17 years. One of the most transformational experiences I had while incarcerated was learning to code, through a pioneering new program called Code.7370 — the first coding curriculum in a United States prison.\n\nIn this talk, I’d like to share my experiences learning to code in prison and getting a software engineering job after my release, with the goals of:\n\nInspiring new programmers to stick with it and be confident in their abilities\n\nInspiring educators to think about how to support new coders in a broad range of learning environments (there’s no internet in prison!)\n\nInspiring everyone to think about the potential for rehabilitation in prison in a new way\n\n**Abstract**\n\nMy story: My first computer was the Commodore 64. I can still remember writing in Basic when you had to number the lines of code yourself and save everything onto cassette drives. Once the Atari 2600 came on the scene, I traded in my keyboard for a joystick and lost myself in each successive release. From Intellivision to Colecovision and from Nintendo to Playstation, I immersed myself to test my skill and lose myself in these magical digital universes. As I left my teen years behind, I discovered new ways of exciting and losing myself in a sea of alcoholism and drug addiction. As Y2K came and went, American Online and Motorola flip phones were about the hottest thing going and I began dealing drugs to support my reckless lifestyle. This decision would lead me to taking a friend’s life over a six pound suitcase of marijuana. It was the worst decision I’ve ever made in my life and would cost me the next 17 years in prison. While I was in prison, I sat on the sidelines and watched as the world of technology was passing me by. I spent over a decade in prison with no access to computers, the internet, or email. The only glimmers I saw were from commercials on TV and my subscription to Wired magazine. That was until I was accepted to The Last Mile, an entrepreneurial program at San Quentin State Prison. We read books by authors like Guy Kawasaki, Reid Hoffman, and Andy Smith. We also learned to develop business plans for our own entrepreneurial ideas that involved 3 components, 1) something we were passionate about 2) something that involved technology 3) something with a social cause. My idea was for an online life coaching platform called Fitness Monkey that would empower addiction recovery through physical fitness. In 2014, the door to technology was finally opened. The Last Mile started the Code.7370 program where I was accepted and began learning front-end web development. With every line of HTML, CSS, and JavaScript I wrote, I fell in love with coding for its ability to solve problems and create and design solutions that could enhance people’s lives. I carried a coding book with me everywhere I went and my love for coding would propel me to the head of the class. I begin doing breakout sessions with my classmates on coding challenges assigned to us by Hack Reactor, a dev bootcamp in San Francisco. The first class was such a success, they started a Track 2 that taught advanced CSS and went into depth on data structures and algorithms. Later, we began delving into full-stack development with Angular, Node, and WordPress. With so many qualified inside coders, The Last Mile partnered with the Prison Industry Authority to open The Last Mile Works, a dev shop inside the walls of San Quentin. We began developing projects for outside companies like Airbnb and the Coalition for Public Safety. As well as, earning a wage that would provide us with a savings account upon our release to help transition back into society. I was building a resume and gaining real world experience while incarcerated that would enable me to find employment with The Last Mile upon my release. On May 4, 2017, I was released from prison after serving a total of 17 years. I did everything in my power to make sure that this time wasn’t wasted. I was hired for a paid internship with The Last Mile as a Web Developer to build a learning management system that would package the coding program at San Quentin into a piece of software that could be distributed to other prisons throughout California and eventually the entire country. This internship also included our application to Y-Combinator where we pitched our project to Michael Seibel, the CEO and his team of VC’s. We finished the project and it’s currently being tested in San Quentin and two different Women’s prisons. As my internship drew to an end, I began to reach out and see what other opportunities would be available to someone with my experience. I went through a 4 hour interview process with the entire engineering team at FANDOM. I’m not going to say it was as difficult as the parole board, but these guys put me through my paces and in the end offered my a 90 day internship. Here was my chance! When my internship began, I was given quite a few tasks that those in the industry call pixel pushing. Design tweaks and CSS fixes. All of the cards on the project management board were labeled 1-5 on complexity. For the first few weeks, all of my cards were ones. However, with each successive week, I became more familiar with the code base and started to reach for some of the more difficult assignments. I believe one of my strengths was being able to admit when I had no clue what I was doing and courage to ask for help. My time at FANDOM was an amazing experience in learning how to collaborate on an international team that spans eight different countries. I learned how to effectively communicate with different departments within the office in San Francisco. And, one of the most amazing parts was getting to tell my story to the entire company at the all hands meeting. Now, I was not only the ‘old’ intern, but someone who had persevered through adversity and was willing to share his truth of committing a horrible crime, but also of earning a college degree, running marathons, developing business ideas, and learning to code. All of the work paid off this past December, when I was offered a full-time position as a Software Engineer for FANDOM. One of my biggest fears was what would life be like for me once I was released from prison. The answer is nothing short of incredible. The Last Mile’s mantra is ‘Believe in the Process’ and there were times when I wasn’t even quite sure what the process was, but I believed anyway. For every step I took learning and growing, more and more opportunities opened up for me. I found great freedom in defaulting to yes.",
  "duration": 1672,
  "language": "eng",
  "recorded": "2018-05-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2018/schedule/talks/"
    },
    {
      "label": "Conference slides (Github)",
      "url": "https://github.com/PyCon/2018-slides"
    },
    {
      "label": "Conference slides (SpeakerDeck)",
      "url": "https://speakerdeck.com/pycon2018"
    },
    {
      "label": "talk schedule",
      "url": "https://us.pycon.org/2018/schedule/presentation/141/"
    }
  ],
  "speakers": [
    "Chris Schuhmacher"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/dGz-K8x8k5k/maxresdefault.jpg",
  "title": "Coding through Adversity",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dGz-K8x8k5k"
    }
  ]
}
