{
  "copyright_text": "Standard YouTube License",
  "description": "Speakers: Christopher Neugebauer, Josh Simmons, Sam Kitajima-Kimbrel\n\nNew conferences rarely have resources to run the sort of outreach and inclusion programs that big conferences have. It’s hard to guess how much money you’ll have to spend, how many attendees you’ll have, and what your new community will look like. With so many things to worry about, it’s no surprise that most events don’t prioritise outreach until they’ve got a few years under their belt, if at all.\n\nIt doesn’t have to be this way, and it can even be easier to build a new event around outreach and inclusion than it is to build it in later on!\n\nThis talk shares the story of North Bay Python’s inaugural conference, which we planned in under 6 months, ran on a $40,000 budget, and built a welcoming community to make it real. We made inclusivity a founding principle and did so without compromising our speaker lineup while still attracting great sponsorship and hosted an event that almost every attendee wants to return to.\n\nIn this talk, we’re going to share with you how we built a conference, from the ground up, to be as inclusive as we could make it. We’ll touch on early organisation, marketing, and on-the ground logistics. Throughout the talk, you’ll learn:\n\n* How we designed a budget that let us prioritise outreach and inclusion activities\n* How we built the community that we wanted before the conference even started\n* How we ran an event that proved that we meant everything we said\n\nYou too can host a new conference with a great lineup on a shoestring budget and short timeline, and you can do it while being inclusive, welcoming, and putting attendee safety first. Find out how you can have your cake, eat it, and still have lots to share with your new community.",
  "duration": 1868,
  "language": "eng",
  "recorded": "2018-05-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2018/schedule/talks/"
    },
    {
      "label": "Conference slides (SpeakerDeck)",
      "url": "https://speakerdeck.com/pycon2018"
    },
    {
      "label": "talk schedule",
      "url": "https://us.pycon.org/2018/schedule/presentation/135/"
    }
  ],
  "speakers": [
    "Christopher Neugebauer",
    "Josh Simmons",
    "Sam Kitajima-Kimbrel"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/C7ZhMnfUKIA/maxresdefault.jpg",
  "title": "How we designed an inclusivity-first conference on a shoestring budget and short timeline",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=C7ZhMnfUKIA"
    }
  ]
}