{
  "copyright_text": "Standard YouTube License",
  "description": "Speaker: Jake VanderPlas\n\nExploring a new dataset visually can provide quick intuition into the relationships within the data. There are a few well-developed visualization packages in Python, but they often have very imperative APIs that force the user to focus on the mechanics of the visualization – tick locations, axis limits, legends, etc. – rather than the salient relationships within the data.\n\nThis tutorial will introduce data visualization with [Altair](http://altair-viz.github.io), a package designed for exploratory visualization in Python that features a declarative API, allowing data scientists to focus more on the data than the incidental details. Altair is based on the [Vega](https://vega.github.io/) and [Vega-Lite](https://vega.github.io/vega-lite/) visualization grammars, and thus automatically incorporates best practices drawn from recent research in effective data visualization.\n\nThe tutorial will provide an introduction to the Altair package and its API, but more importantly will dive into the core concepts of effective data visualization that can be applied using any visualization package or tool.",
  "duration": 11941,
  "language": "eng",
  "recorded": "2018-05-12",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2018/schedule/talks/"
    },
    {
      "label": "Conference slides (Github)",
      "url": "https://github.com/PyCon/2018-slides"
    },
    {
      "label": "Conference slides (SpeakerDeck)",
      "url": "https://speakerdeck.com/pycon2018"
    },
    "https://vega.github.io/vega-lite/",
    "https://vega.github.io/",
    "https://github.com/PyCon/2018-slides",
    "http://altair-viz.github.io",
    "https://speakerdeck.com/pycon2018"
  ],
  "speakers": [
    "Jake VanderPlas"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ms29ZPUKxbU/maxresdefault.jpg",
  "title": "Exploratory Data Visualization with Vega, Vega-Lite, and Altair",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ms29ZPUKxbU"
    }
  ]
}
