{
  "copyright_text": "Standard YouTube License",
  "description": "There are many awesome tools to learn and teach Python to beginners. You can teach it with games, interactive tutorials and microcontrollers. However, if one is to stay in the world of programming, sooner or later one needs to start using more professional tools such as IDEs, debuggers, profilers, version control systems and databases. Needless to say, the transition from IDLE to PyCharm can be very frustrating.\n\nCreating your own course is a time-consuming process, but after the course has been created you also need to check students' solutions which consumes even more time. Wouldn't it be great to automate checking process and to concentrate on the creative part of content creation and explaining concepts to students?\n\nAs an attempt to solve these problems `EduTools plugin`_ was created.\nIt’s a free open-source plugin that can be installed on PyCharm/IntelliJ\nIDEA IDEs to create and take programming courses right inside the IDE.\nThis way a novice programmer dives into professional environment\nstraight away and an educator gets a tool to automate solution checking.\nNot only the plugin allows to create courses, but it also comes with\nintegration with `Stepik MOOC platform`_.\n\nIn this talk I'd like to demonstrate how one can create a course with automated checks using EduTools plugin, share it with students and connect to Stepik platform to gather solutions and statistics. I'll show how to create a simple course containing theory, code task with feedback prompts and test with choice problems. I'll also show how to use our existing free courses in class with the ability to view your students' solutions.\n\n.. _EduTools plugin: https://plugins.jetbrains.com/plugin/10081-edutools\n.. _Stepik MOOC platform: https://stepik.org",
  "duration": 1545,
  "language": "eng",
  "recorded": "2018-05-10",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2018/schedule/talks/"
    },
    {
      "label": "Conference slides (Github)",
      "url": "https://github.com/PyCon/2018-slides"
    },
    {
      "label": "Conference slides (SpeakerDeck)",
      "url": "https://speakerdeck.com/pycon2018"
    },
    {
      "label": "EduTools plugin",
      "url": "https://plugins.jetbrains.com/plugin/10081-edutools"
    },
    {
      "label": "Stepik MOOC platform",
      "url": "https://stepik.org"
    },
    {
      "label": "talk schedule",
      "url": "https://us.pycon.org/2018/schedule/presentation/212/"
    }
  ],
  "speakers": [
    "Liana Bakradze"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/DG2AAhvh7nk/maxresdefault.jpg",
  "title": "Learning Python like a Pro",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DG2AAhvh7nk"
    }
  ]
}
