{
  "copyright_text": "Standard YouTube License",
  "description": "Optimization can often help to make Python programs faster or use less memory. Developing a strategy, establishing solid measuring and visualization techniques as well as knowing about algorithmic basics and datastructures are the foundation for a successful optimization. The tutorial will cover these topics.\nExamples will give you a hands-on experience on how to approach efficiently.\n\nPython is a great language. But it can be slow compared to other languages\nfor certain types of tasks. If applied appropriately, optimization may reduce\nprogram runtime or memory consumption considerably. But this often comes at a price. Optimization can be time consuming and the optimized program may be more complicated. This, in turn, means more maintenance effort. How do you find out if it is worthwhile to optimize your program? Where should you start?\n\nThis tutorial will help you to answer these questions. You will learn how\nto find  an optimization strategy based on quantitative and objective criteria.\nYou will experience that one's gut feeling what to optimize is often wrong.\n\nThe solution to this problem is: „Measure, Measure, and Measure!“. You will\nlearn how to measure program run times as well as profile CPU and memory.\nThere are great tools available. You will learn how to use some of them.\nMeasuring is not easy because, by definition, as soon as you start to measure,\nyou influence your system. Keeping this impact as small as possible is\nimportant. Therefore, we will cover different measuring techniques.\n\nFurthermore, we will look at algorithmic improvements. You will see that the\nright data structure for the job can make a big difference. Finally, you will\nlearn about different caching techniques.",
  "duration": 12207,
  "language": "eng",
  "recorded": "2018-05-09",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2018/schedule/talks/"
    },
    {
      "label": "Conference slides (SpeakerDeck)",
      "url": "https://speakerdeck.com/pycon2018"
    },
    {
      "label": "talk schedule",
      "url": "https://us.pycon.org/2018/schedule/presentation/61/"
    }
  ],
  "speakers": [
    "Mike Müller"
  ],
  "tags": [
    "profiling",
    "measuring"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/DGrS0uwMuHY/maxresdefault.jpg",
  "title": "Faster Python Programs - Measure, don't Guess",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DGrS0uwMuHY"
    }
  ]
}