{
  "copyright_text": "Standard YouTube License",
  "description": "Speaker: Gregory M. Kapfhammer\n\nReal-world software engineering is collaborative, commonly involving the use of Git, GitHub, and continuous integration with Travis CI. This presentation will explain how to use these technologies and platforms to teach interdisciplinary and introductory courses in computer programming and software engineering. This presentation will first show how to create a GitHub organization connected to a GitHub Classroom with unlimited private repositories that contain instructor solutions and starter kits and assignment submissions for both individual and team-based programming assignments. The talk will next explain how to connect GitHub repositories to continuous integration servers hosted by Travis CI, thus supporting the cloud-based execution of tests and checks.\n\nThe presentation will subsequently introduce a Python program, called [GatorGrader](https://github.com/gkapfham/gatorgrader), that supports the local and cloud-based checking of a student's source code and technical writing for a programming project. GatorGrader can check, for example, that a submission contains the required number of comments and produces the correct number of lines of console output. Suitable for use on either a local workstation or a cloud-based server provided by Travis CI, GatorGrader can, for instance, ensure that a student makes the requisite number of commits to a GitHub repository and structures a program in a specified fashion. GatorGrader can also invoke external programs that ensure the quality of a student's technical writing. Finally, since most of the aforementioned assignments are designed to be completed in teams, this presentation introduces [GatorGrouper](/redirect?event=video_description&v=cxTXJ3N91s0&q=https%3A%2F%2Fgithub.com%2FGatorGrouper%2Fgatorgrouper&redir_token=a6tgZnlKgwNy5ZvcmP1V5lvEhbJ8MTUyNjUwODUxMkAxNTI2NDIyMTEy), another Python program that uses student responses on a Google Form to create suitable groups of students who collaboratively complete programming projects with GitHub.",
  "duration": 1593,
  "language": "eng",
  "recorded": "2018-05-12",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2018/schedule/talks/"
    },
    {
      "label": "Conference slides (Github)",
      "url": "https://github.com/PyCon/2018-slides"
    },
    {
      "label": "Conference slides (SpeakerDeck)",
      "url": "https://speakerdeck.com/pycon2018"
    },
    "https://speakerdeck.com/pycon2018",
    "https://github.com/gkapfham/gatorgrader",
    "https://github.com/PyCon/2018-slides"
  ],
  "speakers": [
    "Gregory M. Kapfhammer"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/cxTXJ3N91s0/maxresdefault.jpg",
  "title": "Using GitHub, Travis CI, and Python to Introduce Collaborative Software Development",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cxTXJ3N91s0"
    }
  ]
}
