{
  "copyright_text": null,
  "description": "На примере студентов второго курса рассказываем о типичных ошибках людей начинающих программировать на Python. Сделаны некоторые выводы после работы с подрастающим поколением разработчиков.\n\nВидео будет полезно с одной стороны для тех кто начинает программировать или переходит в Python из других языков программирования, независимо от предыдущего опыта. С другой стороны, для тех, кто ожидает прихода на свой проект новых сотрудников с малым опытом работы на Python.\n\nPython Meetup - встречи минского сообщества любителей языка программирования Python.\nПрисоединяйся к нам!\nМы на youtube: https://www.youtube.com/channel/UCxI3LMtt1tVSwYs0Vstus8w\nМы на Facebook: https://www.facebook.com/MinskPythonMeetup/\nМы в Telegram: https://t.me/minsk_python\nМы на github: https://goo.gl/n571V7\n\nСпасибо за поддержку сообщества компании iTechArt Group.\niTechArt Group – это более 1200 специалистов в сфере разработки, сервисной поддержки программных продуктов, модернизации и интеграции бизнес-приложений.\nДля iTechArt Python – одна из самых прогрессивных и гибких технологий разработки. В компании было реализовано множество успешных бизнес-приложений в сфере электронной торговли, здоровья и фитнеса, путешествий. Именно поэтому iTechArt не могла остаться равнодушной к будущему сообщества, которое помогает развиваться Python-специалистам, дает возможность найти ответы на волнующие вопросы, обсудить последние тренды и найти правильное решение.\nhttps://www.itechart.by/",
  "duration": 1189,
  "language": "rus",
  "recorded": "2019-10-04",
  "related_urls": [],
  "speakers": [
    "Дмитрий Демидов"
  ],
  "tags": [
    "belarus",
    "minsk"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/RCISpSNoPmk/maxresdefault.jpg",
  "title": "Как я студентов питону учил",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RCISpSNoPmk"
    }
  ]
}
