{
  "alias": "video/2372/encouraging-new-programmers-the-open-tech-schoo",
  "category": "Kiwi PyCon 2013",
  "copyright_text": "",
  "description": "@ Kiwi PyCon 2013 - Sunday, 08 Sep 2013 - Track 1\n\n**Audience level**\n\nIntermediate\n\n**Abstract**\n\nThe Python community may be one of the most welcoming programming\ncommunities, but even the experience of learning Python can be daunting\nfor an outsider.\n\nOpen Tech School (OTS) - http://www.opentechschool.org/ - is one of many\norganisations aiming to introduce people to programming. Our motto: \"We\norganize tech workshops. Hands-on, awesome, and free.\" All content is\npublished online under open licenses, and OTS workshops are run by\nvolunteers at no cost to participants.\n\nJust like arithmetic skills are useful for people with no interest in\nbecoming professional accountants, coding skills can be useful for\npeople with no interest in becoming professional programmers. Many\npeople are faced with menial computer-based tasks in their daily lives.\nMost could be greatly eased with the help of some programming. Not to\nmention that programming can be fun!\n\nIn this talk I'll explain why I think introducing outsiders to\nprogramming skills is important, and why I think every professional\nprogrammer has a reason to benefit from this. I'll also go into some of\nthe details of how OTS workshops function, and the reasons I think most\nOTS beginner workshops use Python. Finally I'll show how you could go\nabout starting OTS in your local community.\n\n**Slides**\n\nhttps://speakerdeck.com/nzpug/angus-gratton-encouraging-new-programmers-the-open-tech-school-model\n",
  "duration": null,
  "id": 2372,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-09-12",
  "related_urls": [
    "http://www.opentechschool.org/",
    "https://speakerdeck.com/nzpug/angus-gratton-encouraging-new-programmers-the-open-tech-school-model"
  ],
  "slug": "encouraging-new-programmers-the-open-tech-schoo",
  "speakers": [
    "Angus Gratton"
  ],
  "summary": "As programmers we should encourage new people to take up our craft.\nCoding skills can benefit a lot of people who aren't inclined to call\nthemselves programmers. In this talk I'll explain why I think this is\nimportant, introduce the free volunteer organisation Open Tech School,\nand describe some of the things we've found that work and why we've\nembraced Python for our beginner workshops.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/MyYs1VGvF-E/hqdefault.jpg",
  "title": "Encouraging new programmers - the Open Tech School model",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MyYs1VGvF-E"
    }
  ]
}
