{
  "alias": "video/2370/out-on-a-lim-automatic-map-generator",
  "category": "Kiwi PyCon 2013",
  "copyright_text": "",
  "description": "@ Kiwi PyCon 2013 - Saturday, 07 Sep 2013 - Track 1\n\n**Audience level**\n\nNovice\n\n**Abstract**\n\nOne important service provided by local councils is the production of\nLIMs (Land Information Memoranda), which collate information and\nconsents pertaining to a specific property. An essential part of the\nprocess is the creation of a series of maps showing the interactions\nbetween the property in question and the other layers of spatial\ninformation.\n\nThese maps can be produced manually, on a case-by-case basis, but this\nis a time-consuming process and leads to discrepancies in map output\nformats between different properties. We built an application that takes\nuser inputs such as the property address, and automatically creates the\nappropriate series of maps for that property. This approach offers\nconsiderable advantages in speed and consistency of outputs in\ncomparison to a more manual method.\n\nThe application is built using only the Python modules that ship with\nArcGIS 10.1, enabling the program to be run without having to install\nextra software on client computers. It references a static map document\nthat holds all the spatial and attribute information. The program is\noperated via a simple tkinter graphical interface, making it easy to use\nfor non-technical staff without knowledge of either Python or of ArcGIS.\n\n**Slides**\n\nhttps://speakerdeck.com/nzpug/natalie-scott-out-on-a-lim-automatic-map-generator\n",
  "duration": null,
  "id": 2370,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-09-12",
  "related_urls": [
    "https://speakerdeck.com/nzpug/natalie-scott-out-on-a-lim-automatic-map-generator"
  ],
  "slug": "out-on-a-lim-automatic-map-generator",
  "speakers": [
    "Natalie Scott"
  ],
  "summary": "Local councils produce a number of maps for each Land Information\nMemoranda (LIM), which can be a time-consuming process. A lightweight\npython application was built to interact with an ArcGIS map to automate\nthis mapping process, giving consistent high quality outputs. The\napplication was built to be used by non-technical staff with no python\nor mapping experience.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/GCD1DUr7aiY/hqdefault.jpg",
  "title": "Out on a LIM - Automatic Map Generator",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GCD1DUr7aiY"
    }
  ]
}
