{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "Kiwi PyCon 2013", "speakers": ["Natalie Scott"], "title": "Out on a LIM - Automatic Map Generator", "quality_notes": "", "video_flv_length": null, "recorded": "2013-09-12", "video_mp4_length": null, "description": "@ Kiwi PyCon 2013 - Saturday, 07 Sep 2013 - Track 1\r\n\r\n**Audience level**\r\n\r\nNovice\r\n\r\n**Abstract**\r\n\r\nOne important service provided by local councils is the production of LIMs (Land Information Memoranda), which collate information and consents pertaining to a specific property. An essential part of the process is the creation of a series of maps showing the interactions between the property in question and the other layers of spatial information.\r\n\r\nThese maps can be produced manually, on a case-by-case basis, but this is a time-consuming process and leads to discrepancies in map output formats between different properties. We built an application that takes user inputs such as the property address, and automatically creates the appropriate series of maps for that property. This approach offers considerable advantages in speed and consistency of outputs in comparison to a more manual method.\r\n\r\nThe application is built using only the Python modules that ship with ArcGIS 10.1, enabling the program to be run without having to install extra software on client computers. It references a static map document that holds all the spatial and attribute information. The program is operated via a simple tkinter graphical interface, making it easy to use for non-technical staff without knowledge of either Python or of ArcGIS.\r\n\r\n**Slides**\r\n\r\nhttps://speakerdeck.com/nzpug/natalie-scott-out-on-a-lim-automatic-map-generator", "video_mp4_url": "", "tags": [], "copyright_text": "", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=GCD1DUr7aiY", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "Local councils produce a number of maps for each Land Information Memoranda (LIM), which can be a time-consuming process. A lightweight python application was built to interact with an ArcGIS map to automate this mapping process, giving consistent high quality outputs. The application was built to be used by non-technical staff with no python or mapping experience.\r\n", "thumbnail_url": "http://i1.ytimg.com/vi/GCD1DUr7aiY/hqdefault.jpg", "video_flv_url": ""}