{
  "alias": "video/2362/rapid-development-of-unified-real-time-communicat",
  "category": "Kiwi PyCon 2013",
  "copyright_text": "",
  "description": "@ Kiwi PyCon 2013 - Sunday, 08 Sep 2013 - Track 2\n\n**Audience level**\n\nIntermediate\n\n**Abstract**\n\nOnline shopping or retail industry of the world is worth trillions of\ndollars. Forrester research estimates that US online industry alone will\nbe worth $279 Billion by 2015!\n\nGiven the scenario, website customers have an ever-growing need of\ncommunicating with customer service representatives in real time with a\nlive chat or media call. Businesses not only view it as an opportunity\nto act quickly and be flexible in delivering specific product\ninformation to customers but also to prevent or recover from service\nfailures & convert leads to sales!\n\nThough critical, development teams have found it difficult to develop,\nmaintain and integrate instant chat or call in their websites.\nScalability and responsiveness of these applications have been a measure\ncause of anxiety. Unavailability or shortage of ready-to-use frameworks\nhas contributed to longer development cycles and made the task seam\nout-of-reach. As a result, integration of real time communication in\nwebsites is often considered 'good-to-have' and doesn't get the due\nimportance.\n\nThis talk discusses first hand experiences of development & integration\nof real-time communication applications in websites. Audiences would get\nan opportunity to appreciate the concept with the help of a working\nprototype. The talk also suggests Python modules foe getting the task\ndone in a rapid & customized way.\n\n**Slides**\n\nhttps://speakerdeck.com/nzpug/chetan-giridhar-rapid-development-of-unified-real-time-communication-for-websites\n",
  "duration": null,
  "id": 2362,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-09-12",
  "related_urls": [
    "https://speakerdeck.com/nzpug/chetan-giridhar-rapid-development-of-unified-real-time-communication-for-websites"
  ],
  "slug": "rapid-development-of-unified-real-time-communicat",
  "speakers": [
    "Chetan Giridhar"
  ],
  "summary": "Development of real time communication channels like instant chat or\nmedia calls has been difficult. Integrating it in a scalable and\nresponsive way for websites has been a bigger concern. This talk\ndescribes how instant chat or media calls can be developed in a rapid\nway with Python modules and demonstrates the concept with a working\nprototype.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/fB_XzU8sRbU/hqdefault.jpg",
  "title": "Rapid development of Unified Real-time communication for Websites",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fB_XzU8sRbU"
    }
  ]
}
