{
  "alias": "video/2371/the-cylc-suite-engine",
  "category": "Kiwi PyCon 2013",
  "copyright_text": "",
  "description": "@ Kiwi PyCon 2013 - Sunday, 08 Sep 2013 - Track 2\n\n**Audience level**\n\nIntermediate\n\n**Abstract**\n\nThe Cylc Suite Engine is a metascheduler or workflow engine that makes\nit relatively easy to construct, monitor, and control large complex\ndistributed suites of interdependent cycling tasks. Cylc was developed,\nentirely in Python, to automate modern environmental forecasting systems\nin an HPC environment at NIWA in New Zealand. Since its release as an\nOpen Source project on GitHub in 2011 cylc has been adopted by the UK\nMet Office to control their large and varied forecasting systems; it is\nalso used by groups at the Marine Meteorology Division of the Naval\nResearch Laboratory in the US, the Max Planck Institute for Meteorology\nin Germany, and others; and it was a finalist in the 2012 NZ Open Source\nAwards. Lead developer Hilary Oliver will give an overview of what cylc\ndoes and how it works, and the particular advantages gained by our\ndecision to use the Python programming language.\n\n**Slides**\n\nhttps://speakerdeck.com/nzpug/hilary-james-oliver-the-cylc-suite-engine\n",
  "duration": null,
  "id": 2371,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-09-13",
  "related_urls": [
    "https://speakerdeck.com/nzpug/hilary-james-oliver-the-cylc-suite-engine"
  ],
  "slug": "the-cylc-suite-engine",
  "speakers": [
    "Hilary James Oliver"
  ],
  "summary": "The Cylc Suite Engine schedules complex distributed suites of cycling\ntasks. Developed for weather forecasting applications at NIWA, cylc has\nsince been adopted by the UK Met Office and others, and was a finalist\nin the 2012 NZ Open Source Awards. Lead developer Hilary Oliver will\ntalk about cylc and the many advantages that the Python programming\nlanguage brought to the project.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/Mv-hBTcncKM/hqdefault.jpg",
  "title": "The Cylc Suite Engine",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Mv-hBTcncKM"
    }
  ]
}
