{
  "alias": "video/1407/about-django-from-the-pyramid-guy",
  "category": "DjangoCon 2012",
  "copyright_text": "Creative Commons Attribution license (reuse allowed",
  "description": "About Django from the Pyramid Guy\n=================================\n\nWho Am I\n--------\n\n-  BBS nerd in the 80s.\n\n-  Bad Perl hacker until Python. Came to Python via Zope in 1999. Worked\n   at Digital Creations (aka Zope Corporation) until 2003.\n\n-  Primary author of: Pyramid web framework, Supervisor UNIX process\n   control system, Deform form system, Repoze collection of middleware,\n   and other unmentionables. Contributor to Zope, WebOb, and lots of\n   other OSS projects.\n\n-  Quoting Glyph: \"I've been doing IRC support for 10 years, so I'm\n   pretty much dead inside.\"\n\nWhat is a Web Framework\n-----------------------\n\n-  A web framework receives a request, calls user code in order to\n   return a response. Everything else is a bonus.\n\n-  Arguments about how a web framework implements \"MVC\" are usually\n   distractions. Django gets this right.\n\nDjango Docs Do It Right\n-----------------------\n\n-  Django docs broke the Python documentation curve.\n\n-  Great resources for multiple audiences.\n\nDjango Views Do It Right\n------------------------\n\n-  No magical globals (request or response).\n\n-  Django view lookup and execution is very fast.\n\nDjango Forms Do It Right\n------------------------\n\n-  Decoupling of models from forms.\n\n-  Optional recoupling via modelforms.\n\nDjango Convenience vs. Explicitness\n-----------------------------------\n\n-  No thread locals.\n\nDjango Extensibility Does It Right\n----------------------------------\n\n-  Replaceable backends for authentication.\n\n-  Replaceable backends for storage.\n\n-  Encourages an environment of plugins at different levels.\n\nDjango Defaults Do It Right\n---------------------------\n\n-  Django provides people with unambiguous ways to solve 80% of their\n   web development problems.\n\n-  Doesn't prevent specialization or use of external libraries.\n\nDjango Reality Does It Right\n----------------------------\n\n-  Can't argue with success.\n\n-  Scores of very successful sites built using Django.\n\nWhat is Pyramid\n---------------\n\n-  Pyramid handles view lookup and execution and provides related\n   convenience APIs. It also allows extensive configuration of these\n   things.\n\n-  Pyramid is a corner of a corner of Django, magnified.\n\n-  James Bennett's PyCon 2012 \"Django In Depth\" tutorial: ~20 minutes\n   out of 3 hours devoted to things that Pyramid actually does:\n   low-level template API, view lookup and execution, HTTP responses,\n   middleware.\n\n-  Pyramid is independent of any particular peristence system. It has no\n   built-in form generation system. It does not prefer any particular\n   templating system. It does not ship with an admininstrative\n   application.\n\n-  Something like Pyramid could be used to build something like Django.\n\nPylons Project\n--------------\n\n-  Project lead consolidation decision.\n\n-  Attempt to get Pylons, TurboGears and ``repoze.bfg`` communities\n   rowing in the same direction.\n\n-  Pylons 1.x web framework shifted into “legacy” status. Maintained\n   indefinitely.\n\n-  New development: Pyramid and related.\n\n-  Turbogears: wildcard.\n\nIs Pyramid a Microframework?\n----------------------------\n\n-  Pyramid is sort of microframework-like. You can write a Pyramid\n   application in a single file.\n\n-  Self-identifying microframeworks tend to suggest application\n   development patterns to its users which promote convenience over\n   explicitness. Pyramid (for better or worse) does not do this, because\n   it needs to be useful in larger systems where these patterns can lead\n   to extensibility problems.\n\n-  In reality, the term \"microframework\" is a marketing term, not a\n   technological term, so whether the answer is yes or no doesn't really\n   matter too much unless you have a stake in the project.\n\nSmall Pyramid Program\n---------------------\n\n::\n\n    from wsgiref.simple_server import make_server\n    from pyramid.config import Configurator\n    from pyramid.response import Response\n\n    def hello_world(request):\n       return Response('Hello %(name)s!' % request.matchdict)\n\n    if __name__ == '__main__':\n       config = Configurator()\n       config.add_route('hello', '/hello/{name}')\n       config.add_view(hello_world, route_name='hello')\n       app = config.make_wsgi_app()\n       server = make_server('0.0.0.0', 8080, app)\n       server.serve_forever()\n\nPyramid and Python 3\n--------------------\n\n-  Pyramid's current release (1.3) supports Python 3.2+ (as well as\n   Python 2.6 and 2.7).\n\n-  Most existing add-ons already ported. When feasible, we port add-on\n   dependencies (``beaker``, ``WebOb``, ``zope.*`` packages).\n\n-  We have a committment to Python 3. It involves lots of whining and\n   bitching.\n\nI'm No Genius\n-------------\n\n-  Pyramid does things wrong. Many parts of Pyramid make me cringe.\n   https://github.com/Pylons/pyramid/wiki/Mistakes\n\n-  The grass is always greener.\n\nPyramid Docs\n------------\n\n-  Culture of documentation (if it's not documented, it's broken).\n\n-  Pyramid itself has ~800 printed pages of narrative and API\n   documentation, plus a few hundred pages of \"cookbook\" material.\n\n-  Comprehensive but pretty dry.\n\nDocs Pain\n---------\n\n-  Many pain points are related to plain old bad docs: our fault. Docs\n   are at least 10X harder to write well than the associated code and\n   take much longer. Most coders hate writing docs. I write lots of\n   documentation but it's often not very good.\n\n-  But other pain points people experience when trying to learn Pyramid\n   from its docs is due to poorly documented dependencies (setuptools).\n   We need to redocument subsystems \"in context\", for better or worse.\n   (HELP!)\n\n-  And some pain points are due to an audience mismatch; narrative\n   documentation assumes people know \"Python\" *and* \"the web\". They\n   often need remedial help in one or both, which the docs don't\n   provide.\n\n-  \"Chipin\" project raised ~$5K for documentation overhaul.\n\nPyramid Friends\n---------------\n\n-  Colander/Deform: form handling.\n\n-  SQLAlchemy: SQL database connectivity and querying.\n\n-  Pyramid-specific add-ons like ``pyramid_mailer``,\n   ``pyramid_zodbconn``, ``pyramid_socketio``, ``pyramid_mongodb``, and\n   so forth.\n\n-  The typical Pyramid application makes use of some combination of\n   add-ons.\n\nScaffolding\n-----------\n\n-  A scaffold renders a project. A project is installable like any other\n   setuptools distribution (it has a ``setup.py``, etc).\n\n-  The project depends on some combination of Pyramid, Pyramid plugins,\n   and other third-party libraries and frameworks.\n\n-  ``zodb``, ``alchemy`` and ``starter`` scaffolds provided by Pyramid\n   itself. Others are contributed to PyPI by third parties.\n\nBindings Packages\n-----------------\n\nA more generic package is specialized for convenient use under Pyramid\nvia use of a bindings package.\n\n-  ``deform`` + ``pyramid_deform``.\n\n-  ``repoze.who`` + ``pyramid_who``.\n\n-  2X documentation burden: document once in general package docs,\n   document again in bindings docs. That's no fun.\n\n-  But this will happen anyway if your code is popular (Celery).\n\nHigher Level Frameworks\n-----------------------\n\n-  ``ptah``\n\n-  ``kotti``\n\n-  ``poolyx``\n\n-  ``substanced``\n\nPackaging Is Like a Blast Shield\n--------------------------------\n\n-  A blast shield helps keep shrapnel out.\n\n-  It can also help keep shrapnel *in*.\n\n-  Shrapnel tends to penetrate anything not within a blast shield.\n\n-  Every piece of software eventually blows up.\n\n-  The more blast shields you have, the more the damage is contained.\n\n-  But blast shields obscure the landscape. More work required for\n   users.\n\n-  More packages add more documentation and conceptual overhead, and\n   more unwanted choice.\n\nDjango Avoids Setuptools\n------------------------\n\n-  Setup.py develop of django doesn't work.\n\n-  Avoidance of setuptools also prevents use of console scripts (e.g.\n   django-admin).\n\n-  Django recreates some of the patterns that setuptools provides (i.e.\n   test discovery hooks).\n\n-  Developers whom are ignorant of distribution issues are very confused\n   when inevitably faced with them.\n\nDjango Avoids Setuptools (2)\n----------------------------\n\n-  Django's defacto avoidance of setuptools is understandable. But it's\n   not helping to improve Python packaging. Python packaging and\n   distribution needs you very badly.\n\n-  Fewer documentation issues to cope with, but contributing to docs for\n   setuptools would float all boats.\n\nSubclassing Is Convenient\n-------------------------\n\n-  You don't have to explain a protocol (the protocol is Python).\n\n-  But offering extensibility via subclassing is often a poorer choice\n   than offering extensibility via composition and very explicit\n   interfaces.\n\n-  Why? People begin depending upon the implementation details of the\n   classes you tell them to subclass. Unless you're extremely clear\n   about what the API of the superclass is, and the social contract to\n   use nothing else but the documented API exists, you'll be pressured\n   into making retroactive APIs. Impossible to recover from without\n   breaking b/w compat.\n\n-  Not uncommon to see a subclass of a subclass of a subclass of a\n   subclass; figuting out how the thing works can be an exercise in pain\n   and multiple editor windows.\n\nGlobals are Convenient\n----------------------\n\n-  You don't have to explain a protocol for obtaining a value (the\n   protocol is ``import``).\n\n-  But the development of circular imports is inevitable.\n\n-  Global registries make it impossible to embed more than one\n   application into the same Python process.\n\nModule-Scope Work Is Convenient\n-------------------------------\n\nFrom Django tutorial, at module scope:\n\n::\n\n    from django.contrib import admin\n    admin.autodiscover()\n\nModule-Scope Work Is Convenient (2)\n-----------------------------------\n\n-  These things can be done at module scope without concern:\n\n-  An import of another module or global.\n\n-  Assignment of a variable name in the module to some constant value.\n\n-  The addition of a function via a def statement.\n\n-  The addition of a class via a class statement.\n\n-  Control flow which may handles conditionals for platform-specific\n   handling or failure handling of the above.\n\n-  Everything else is at least suspect. Test runners and other code\n   scanners can import with abandon, and side effects are often\n   undesirable.\n\nPluggable Apps / Reusable Apps\n------------------------------\n\n-  Pluggable apps probably aren't really that pluggable, reusable apps\n   probably aren't as reusable as you might like.\n\n-  IMO, even a framework as high-level as Django can't really offer such\n   a feature without stretching the truth just a little bit.\n\n-  The only thing that can truly offer pluggable apps: another app. No\n   general-purpose framework can do a great job here. (Examples:\n   Wordpress, Jenkins, Plone).\n\nRendering Is Meta-View\n----------------------\n\n-  ``render_to_response`` using template in view is no fun to test.\n\n-  Returning a dict from a view callable is more fun to test.\n\nUnit Tests\n----------\n\n-  Exclusive use of Django test client for tests will cause test suite\n   to run more slowly than necessary.\n\n-  A slow enough test suite won't be run before commit.\n\n-  Testers who don't understand any type of testing other than \"system\"\n   or \"integration\" testing tend to bring poor testing practices to\n   unrelated systems.\n\n-  Using setuptools provides nice hooks for test discovery and\n   execution.\n\nStatic Files\n------------\n\n-  Python WSGI servers are getting better at serving static files. E.g.\n   Gunicorn supports ``sendfile`` on UNIX.\n\n-  Might be time to reconsider offloading media to a dedicated\n   non-Python server and make use of what's available in WSGI-land.\n\nCommunity\n---------\n\n-  Pyramid community is maybe 10% the size of the Django community.\n\n-  It's growing.\n\n-  Your success is our success. I'd be very pleased to have Pyramid be\n   considered the #2 Python web framework (at least for \"Python\n   people\"). Forever.\n\nCollaboration (Low-Level)\n-------------------------\n\n-  Create adapter for WebOb or Werkzeug that implements the Django\n   request API?\n\n-  Create an adapter for SQLAlchemy that implements the Django ORM API?\n\n-  These are likely losers. They are \"30 year plans\". Things change so\n   fast. Who will pay immediately? Who will benefit immediately?\n\n-  Might be better to try to use common non-domain-specific dependencies\n   (e.g. setuptools, virtualenv, WSGI middleware, etc). It would be a\n   great win to share documentation burden, even if we had to \"fork\" it\n   for our own contextual requirements.\n\nCollaboration (High-Level)\n--------------------------\n\n-  Django is limited by backwards compatibility concerns. It's\n   impractical to make large architectural changes now. Your users would\n   kill you.\n\n-  But I could imagine somebody from the Django community creating a\n   \"Django-NG\" or a Django-like system from whole cloth. Or break Django\n   apart into something that isn't quite bw compatible.\n\n-  It might make sense to consider Pyramid or another smaller framework\n   as a base for such an effort. If you used Pyramid, you'd get URL\n   routing, internationalization, template bindings, configuration\n   extensibility, flexible view lookup and execution, an event system,\n   security, documentation, Python 3 compatibility, and other things.\n   ``ptah`` is such a system right now.\n\n-  Pyramid community is very enthusiastic, friendly, helpful, and\n   experienced.\n\nPromoting Python\n----------------\n\n-  I challenge you to not be complacent.\n\n-  I challenge you to investigate how other frameworks work.\n\n-  I challenge you to embrace existing Python packaging and distribution\n   tools.\n\n-  I challenge you to port quickly to Python 3. Commit to supporting it\n   in your add-ons and helping folks who have existing add-ons port.\n\n-  I challenge you to speak out when folks bash competitors. Haters are\n   everywhere, and when someone bashes Pyramid, Flask, Bottle, or Zope,\n   and nobody defends against it, the hate will eventually come back to\n   harm you.\n\nUnknowns\n--------\n\n-  Django Class-Based Views Might Not Do It Right. ``as_view``. Hmm. All\n   views in Pyramid are potentially generic. They have a context passed\n   to them. Class-based views in Pyramid are not things handed down from\n   \"good devs\" to reuse, they're just normal things.\n\n-  How does Django allow for configuration extensibility? Conflict\n   detection?\n\n-  Event system\n\n-  Alternate templating languages\n\n-  Exception views\n\n-  View predicates\n\n-  Transaction management\n\n\n",
  "duration": null,
  "id": 1407,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-09-06",
  "related_urls": [
    "https://github.com/Pylons/pyramid/wiki/Mistakes"
  ],
  "slug": "about-django-from-the-pyramid-guy",
  "speakers": [
    "Chris McDonough"
  ],
  "summary": "An opinionated recounting of the features Django shares with the Pyramid\nweb framework, and how the two frameworks differ, as well as a\nprescription for collaboration between the Django and Pyramid\ncommunities.\n",
  "tags": [
    "django"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/eN7h6ZbzMy0/hqdefault.jpg",
  "title": "About Django from the Pyramid Guy",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eN7h6ZbzMy0"
    }
  ]
}
