{
  "alias": "video/1408/boosting-teamwork-with-vagrant",
  "category": "DjangoCon 2012",
  "copyright_text": "Creative Commons Attribution license (reuse allowed",
  "description": "In this talk I will present Vagrant, a free open-source tool\nfacilitating the manipulation of virtualized environments, and how it\nmay benefit the development of Django applications. This talk is aimed\nat Django developers of all levels who are interested in getting an\noverview of the great possibilities Vagrant offers to support teamwork\nand quality assurance.\n\nOne major benefit of using Vagrant is with on-boarding. Previously, when\nnew developers joined a project, it could take hours or days for them to\ncorrectly set up their development environment and install all the\nprojects' dependencies (the correct version of Python, the virtualenv,\nthe database server, the caching engine, etc.). With Vagrant, combined\nwith provisioning tools like Chef or Puppet, it is now possible to\neasily create a virtual machine with all the right dependencies properly\npre-installed and pre- configured to allow anyone to be fully\noperational and ready to contribute to the project in a matter of\nminutes.\n\nAnother major benefit of Vagrant is that it gives the opportunity to\ncreate a working environment for all developers that closely matches\nthat of the production server. This in turn allows to anticipate\npotential issues when new code and resources eventually get deployed\nlive.\n\nIn this talk, I will present some key functionalities and workflows\naround the use of Vagrant: - installing Vagrant and Virtualbox. -\ncreating a new virtual machine. - provisioning a virtual machine with\nbasic requirements. - sharing virtual machine specifications with team\nmembers.\n\nThis talk will include a brief introduction to Chef and Puppet. It will\nalso include multiple practical tricks like accessing the VM's database\nserver from the host's machine, setting up useful shell aliases or\nautomatically activating the virtualenv when launching the VM.\n",
  "duration": null,
  "id": 1408,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-09-06",
  "slug": "boosting-teamwork-with-vagrant",
  "speakers": [
    "Julien Phalip"
  ],
  "summary": "In this talk I will present Vagrant, a free open-source tool\nfacilitating the manipulation of virtualized environments, and how it\nmay benefit the development of Django applications. This talk is aimed\nat Django developers of all levels who are interested in getting an\noverview of the great possibilities Vagrant offers to support teamwork\nand quality assurance.\n",
  "tags": [
    "django",
    "vagrant"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/DsYVx-mh3NE/hqdefault.jpg",
  "title": "Boosting teamwork with Vagrant",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DsYVx-mh3NE"
    }
  ]
}
