{"whiteboard": "needs editing", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "DjangoCon 2012", "speakers": ["Amjith Ramanujam"], "title": "Debugging Live Python Web Applications", "quality_notes": "", "video_flv_length": null, "recorded": "2012-09-04", "video_mp4_length": null, "description": "This talk will go over some of the ways in which a monitoring system such as\nNew Relic can be used to focus in on where problems are arising in a Python\nweb application using a framework such as Django. It will also describe how\nyou can then use that information to drill down even further by applying\nseparate debugging tools and techniques rather than monitoring systems.\nDebugging tools aren't generally associated with production systems however\nand even mentioning them in relation to production systems often makes DevOps\npeople rather nervous.\n\nThe main purpose of the talk therefore is to look at a range of debugging\ntools and techniques which can be applied to web applications but also\nseparate them into what might and might not be realistically used on live\nproduction web applications. It will then describe the use of an embedded\ninteractive console port as a gateway into a live web application, how one may\nsetup a set of predefined commands that could be issued against a live web\napplication, or for the brave, how it could be used to fire up an embedded\nPython interpreter prompt or pdb session.\n\nTopics to be touched on would include:\n\n  * Browser viewable error pages.\n  * Browser based debuggers.\n  * Python interactive debuggers.\n  * Post-mortem exception analysis.\n  * Methods for dumping Python stack traces\n  * Methods for dumping C stack traces.\n  * Methods for analyzing thread utilization.\n  * Interactive process introspection tools.\n  * Error reporting and logging services.\n  * Performance monitoring services.\n\n", "video_mp4_url": null, "tags": ["debugging", "django"], "copyright_text": "Creative Commons Attribution license (reuse allowed", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=YM4F6sSAu9k", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "Monitoring tools record the result of what happened to your web application\nwhen a problem arises, but for some classes of problems, monitoring systems\nare only a starting point. Sometimes it is necessary to take more intrusive\nsteps to plan for the unexpected by embedding mechanisms that will allow you\nto interact with a live deployed web application and extract even more\ndetailed information.\n\n", "thumbnail_url": "http://i.ytimg.com/vi/YM4F6sSAu9k/hqdefault.jpg", "video_flv_url": null}