{
  "alias": "video/1380/the-dungeon-masters-guide-to-djangos-orm",
  "category": "DjangoCon 2012",
  "copyright_text": "Creative Commons Attribution license (reuse allowed",
  "description": "Django's database layer is a necessarily complicated piece of code. It\nis a very powerful API that works more or less seamlessly across\nmultiple database storage systems, smoothing over many of the\ninconsistencies and implementation differences that go with the\nterritory. This is great for developers who use Django.\n\nIt's a little less awesome for the maintainers of that code; working in\nthat environment is fairly difficult. Still, we all like a challenge.\nProblem is: where to start? Coming to grips with the ORM code isn't\neasy. The code is well written and documented, but the entry points are\nparticularly well highlighted and, really, the sheer mass of code is an\nobstacle to be overcome.\n\nThis talk will look at the various layers of the ORM, from the public\ngateways, to the semi-public doors into the implementation, to the\ndeeper internals and down to the interaction with databases. In effect,\nfollowing the journey of a couple of adventurous young queries as they\ntraverse the pathways to bring back some data, smelted into just the\nright format.\n\nThe goal is to provide some kind of mental map of the code. Some tips\nfor orienting yourself in the future and how to examine new nooks and\ncorners without losing your mind. We obviously cannot cover everything,\nbut let's go over the common paths and show how the other pieces hang\noff that backbone.\n\nAlong the way, we'll put some of the details into historical\nperspective. Getting inside the mind of previous adventurers might help\nunderstand why things are the way they are.\n",
  "duration": null,
  "id": 1380,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-09-05",
  "slug": "the-dungeon-masters-guide-to-djangos-orm",
  "speakers": [
    "Malcolm Tredinnick"
  ],
  "summary": "If you've ever been curious about Django's ORM implementation, you will\nhave noticed the required learning curve. Some of the code is fairly\ncomplicated. Other bits are worse. Here comes a 30 or 40 minute guided\ntour of the uncharted realms: how the pieces fit together, where to look\nfor things, why the current design is what it is. A portion of this is\nmy fault; I should probably explain myself.\n",
  "tags": [
    "django",
    "django-orm"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/bgV39DlmZ2U/hqdefault.jpg",
  "title": "The Dungeon Master's guide to Django's ORM",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bgV39DlmZ2U"
    }
  ]
}
