{
  "alias": "video/1413/under-the-microscope-evaluating-existing-django",
  "category": "DjangoCon 2012",
  "copyright_text": "Creative Commons Attribution license (reuse allowed",
  "description": "Taking over someone else’s code is an exercise fraught with peril.\nHowever, with the growing popularity of Django, more and more\norganizations are seeking companies and individuals to take over their\nDjango website and support their existing Django codebase. This talk\nwill describe the standardized process Imaginary Landscape has developed\nto evaluate existing code as part of their new client onboarding\nprocess.\n\nCovered topics:\n\n-  Introduction/Overview\n\n-  Top reasons why clients are looking to change vendor\n\n-  Initial assessment\n\n    ::\n\n        * What questions to ask before looking at the code.\n\n-  Where to start when looking at code?\n\n    ::\n\n        * Traversing the code tree to get a feel for how the code is structured\n\n    ::\n\n        * Trying to determine how the previous developer thinks\n\n-  Detailed code review including checklist\n\n    ::\n\n        * Things to look for when evaluating code: Version control, \"Standard\"\n\n    site layout, Settings file, hardcoding, Virtualenv, south, etc.\n\n-  Examples (names have been changed to protect the imperfect)\n\n    ::\n\n        * The good: the kinds of coding and configuration techniques that seem\n\n    to be consistent among well-thought-out projects.\n\n    ::\n\n        * The bad: examples of code and configuration that make onboarding and\n\n    maintenance difficult.\n\n-  Final thoughts\n\n    ::\n\n        * What you can do as a developer taking over a project.\n\n    ::\n\n        * What you can do as a developer hoping to make great code that others\n\n    may someday see.\n\n    ::\n\n        * Exercise your right to say no, it’s your reputation on the line\n\n-  Q&A\n\n",
  "duration": null,
  "id": 1413,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-09-06",
  "slug": "under-the-microscope-evaluating-existing-django",
  "speakers": [
    "Brian Moloney",
    "Joe Jasinski"
  ],
  "summary": "As a Web development firm that specializes in Django, we receive many\ninquiries from organizations looking for assistance with their existing\nDjango websites. This session will describe our process for evaluating\nexisting codebases and deployment structures. The goal is to provide a\nframework for evaluating other people's code and understand the scrutiny\nyour code may someday endure.\n",
  "tags": [
    "django"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/-hma3mlcrD8/hqdefault.jpg",
  "title": "Under the Microscope: Evaluating Existing Django Code When Onboarding a New Client",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-hma3mlcrD8"
    }
  ]
}
