{
  "alias": "video/1405/where-django-caching-busts-at-the-seams",
  "category": "DjangoCon 2012",
  "copyright_text": "Creative Commons Attribution license (reuse allowed",
  "description": "Most mid-sized Django websites thrive by relying on memcached. Though\nwhat happens when basic memcached is not enough? And how can one\nidentify when the caching architecture is becoming a bottleneck? We'll\ncover the problems we've encountered and solutions we've put in place.\n\nThe following highlight the issues we'll discuss during the talk:\n\n-  Cache Warming. For content that will likely be in demand, getting it\n   ready in cache before use is a helpful start.\n-  Two-tier caching. In multi-server environments, certain content that\n   changes infrequently and has high-demand can be cached locally on\n   each server. In these cases, having methods to burn the cache on each\n   server becomes critical.\n-  Categorizing Cache. If good estimates exist for the expected demand\n   of certain cache as well as the frequency of change, this can lead to\n   better insight into when to warm that content as well as whether to\n   cache it locally.\n-  Caching comparison with memcached vs. reddis vs. mongo\n-  Cachemodel. Our open-source, mini-framework for simplifying caching\n   in Django.\n-  Adding servers to memcached. And consistent hashing algorithms to\n   avoid having to burn all cache when the cache cluster changes in\n   size.\n-  Elasticache on AWS.\n\nAs caching problems become more common, better layers and\nmini-frameworks will help simplify and elegantly solve some of these\nproblems.\n",
  "duration": null,
  "id": 1405,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-09-06",
  "slug": "where-django-caching-busts-at-the-seams",
  "speakers": [
    "Kyle Rimkus",
    "Mike Biglan"
  ],
  "summary": "Most mid-sized Django websites thrive by relying on memcached. Though\nwhat happens when basic memcached is not enough? And how can one\nidentify when the caching architecture is becoming a bottleneck? We'll\ncover the problems we've encountered and solutions we've put in place.\n",
  "tags": [
    "caching",
    "django"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/dXDLWGY0Tro/hqdefault.jpg",
  "title": "Where Django Caching Busts at the Seams",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dXDLWGY0Tro"
    }
  ]
}
