{
  "alias": "video/1385/why-the-django-community-sucks",
  "category": "DjangoCon 2012",
  "copyright_text": "Creative Commons Attribution license (reuse allowed",
  "description": "In 2010, Eric Florenzano ignited a fever following his lightfooted and\nlighthearted placement of a mirror in front of the hardest of the\nhardcore in the django community with his presentation, “Why Django\nSucks, and How We can Fix It.” Then, a year later, at DjangCon 2011,\nSteve Holden grasped the self- critique baton with an even steeper\nchallenge, making a claim that he described as “the most outrageous\nthing you can say” - that the Django documentation sucked.\n\nThe Django documentation, already widely considered the best in its\nclass, has responded to the critique and continues to improve daily.\n\nAlso widely viewed as a top strength of Django is its community. While\nDjango enjoys one of the most thoughtful, patient, and responsive\ncommunities in the world of open source web frameworks, it has a special\nopportunity for learning in Washington, D.C., where many of the most\nsuccessful and voracious non- profit advocacy organizations call home.\n\nThis presentation will examine some of their tactics and compare them\nwith those employed by the Django community. Among the topics covered\nwill be mobilization of new troops, building and listening to diverse\ncoalitions, and identifying and reaching out to under-represented\npopulations.\n\nThe presenter comes from a decade of experience in non-profit social\njustice activism. Having been a Django user for 3.5 years and involved\nin the community for 2, will be at only his second DjangoCon.. Freshly\nimported, he has the perspective of a passionate newcomer rather a\nseasoned veteran.\n",
  "duration": null,
  "id": 1385,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-09-05",
  "slug": "why-the-django-community-sucks",
  "speakers": [
    "Justin Myles Holmes"
  ],
  "summary": "Continuing in the tradition of self-deprecation that has made DjangoCon\nfamous, a relative newcomer will outline what the Django community can\nlearn from the world of social activism.\n",
  "tags": [
    "django"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/NrkopXN9sQg/hqdefault.jpg",
  "title": "Why the Django Community Sucks",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NrkopXN9sQg"
    }
  ]
}
