{
  "description": "La investigación operativa es el conjunto de técnicas que permiten modelar de forma matemática un sistema que se adhiere a unas restricciones, maximizando o minimizando una o varias funciones objetivo. Esta poderosa técnica se usa día a día en problemas de logística, asignación de turnos, planificación de la producción, gestión de inventarios, y muchos otros campos.\n\nSin embargo, esta charla aspira a presentar las técnicas aplicándolas a un tema completamente diferente (y quizás un poco más divertido). El Age of Empires 2 es un juego de 1999 que hoy en día se mantiene como uno de los juegos de estrategia con mayor reconocimiento. En él, el jugador debe llevar una civilización al dominio mundial a través de las épocas, recolectando diferentes recursos, progresando con nuevas tecnologías y atacando otras civilizaciones.\n\nUsando este ejemplo, en la charla presentaremos un modelo de optimización aplicado al juego. Sabiendo que en el juego debemos tomar diferentes acciones como recolectar recursos y construir edificaciones para hacer avanzar nuestra civilización, crearemos un modelo que nos defina la serie de acciones óptima para hacerlo. Usando este ejemplo, explicaremos cómo se traslada una realidad a un modelo y enseñaremos las herramientas disponibles en Python y algunos ejemplos de código.\n\n¿Como obtengo el mayor ejercito antes de 20 minutos? ¿Como consigo el mejor castillo antes que mi rival? Estos objetivos pueden ser modelizados mediante la modelización matemática, permitiendo además añadir restricciones a nuestras soluciones para que sean más adecuadas a nuestro objetivo.\n\nEsta charla no solo busca demostrar la aplicabilidad de la investigación operativa en campos tradicionales, sino también su potencial para optimizar otros campos y actividades de entretenimiento como los videojuegos. Al aplicar técnicas de modelado matemático y optimización en el contexto de Age of Empires 2, se ofrece una perspectiva fresca y atractiva sobre cómo estas herramientas pueden ser utilizadas de formas innovadoras.\n--\nPython España: https://es.python.org/\nPython Vigo: https://www.python-vigo.es/\nBlueSky: @es.pycon.org\nTwitter/X: @PyConES",
  "duration": 2109,
  "language": "spa",
  "recorded": "2024-10-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.es.pycon.org/"
    },
    {
      "label": "https://www.python-vigo.es/",
      "url": "https://www.python-vigo.es/"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    }
  ],
  "speakers": [
    "Antonio Rodríguez",
    "Juan Gómez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/lVuhJvhjrxk/maxresdefault.jpg",
  "title": "Una IA para levantar un imperio: optimizando una partida de Age of Empires 2",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lVuhJvhjrxk"
    }
  ]
}
