{
  "description": "¿Estás familiarizado con los términos ‘arquitectura hexagonal’ y ‘TDD’? Probablemente sí. Pero, ¿qué pasa cuando estos conceptos se cruzan con el mundo de MLOps y la integración de modelos de IA en nuestro software?\n\nLa integración de la Inteligencia Artificial en nuestras aplicaciones y servicios puede ser un desafío. Los modelos de IA, a menudo vistos como ‘cajas negras’, pueden complicar el testeo, los despliegues y el mantenimiento del software en general. Sin embargo, con el enfoque correcto, podemos diseñar un software resiliente que no solo integre estos modelos, sino que también sea mantenible y escalable.\n\nEn esta charla, compartiremos nuestra experiencia construyendo soluciones complejas que requieren la integración de modelos de IA. A lo largo de los años, hemos iterado en la forma en que integramos estos modelos en nuestro código, llegando a una solución en la que el software y los modelos de IA pueden evolucionar a ritmos diferentes sin causar fricción ni problemas en el desarrollo.\n\nExplicaremos cómo hemos navegado por este laberinto, las lecciones aprendidas y cómo hemos conseguido que la integración de la IA en nuestro software sea un proceso fluido y eficiente. También discutiremos cómo los principios de MLOps pueden ayudarnos a construir software más resiliente y escalable.\n--\nPython España: https://es.python.org/\nPython Vigo: https://www.python-vigo.es/\nBlueSky: @es.pycon.org\nTwitter/X: @PyConES",
  "duration": 2157,
  "language": "spa",
  "recorded": "2024-10-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.es.pycon.org/"
    },
    {
      "label": "https://www.python-vigo.es/",
      "url": "https://www.python-vigo.es/"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/GAyaxHUzb5o/maxresdefault.jpg",
  "title": "Daniel Pérez Cabo - Construyendo software resiliente y escalable con MLOps",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GAyaxHUzb5o"
    }
  ]
}
