{
  "description": "La oceanografía operacional es una disciplina que se enfoca en la observación, modelado y predicción de las condiciones oceánicas en tiempo real. Utiliza datos de satélites, boyas, vehículos y modelos numéricos para monitorizar y predecir fenómenos como corrientes marinas, temperatura del agua o niveles de salinidad. Su objetivo es proporcionar información útil para la navegación, la pesca, la gestión costera y la respuesta a emergencias en el mar.\n\nLos ROV (Vehículos Operados Remotamente) se utilizan en oceanografía operacional para explorar y estudiar áreas submarinas de difícil acceso para los humanos. Estos dispositivos pueden recopilar datos detallados sobre el fondo marino, la vida marina y las condiciones del agua en tiempo real. Su uso en la oceanografía operacional permite obtener información crucial para la investigación científica, la exploración de recursos marinos y la monitorización del medio ambiente marino.\n\nEstos vehículos normalmente son operados por grandes empresas y caros. Pero desde hace unos años, se ha \"democratizado\" su uso por medio de nuevas empresas que han sacado modelos bajo el concepto de modelo \"abierto\".. mas o menos.\n\nBajo este contexto, lo que se necesita es desarrollar un ecosistema sensórico sobre un vehículo ROV que extienda el uso proporcionado por el modelo base a niveles mas complejos y que proporcione mas información que la integrada y que nos de capacidades de ampliación futura.\n\nHay multitud de sensores en oceanografía, y hay que integrarlos todos para darles cohesión espacio-temporal para posteriormente poder hacer análisis mas completos sobre los datos.\n\nExplicaremos las herramientas necesarias para desarrollar módulos en ROS2 (en python), veremos ejemplos reales de integración y mostraremos como realizar interfaces gráficas que muestren estos datos adquiridos de manera mas amigable.\n\n---\nPython España: https://es.python.org/\nPython Vigo: https://www.python-vigo.es/\nBlueSky: @es.pycon.org\nTwitter/X: @PyConES",
  "duration": 2649,
  "language": "spa",
  "recorded": "2024-10-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.es.pycon.org/"
    },
    {
      "label": "https://www.python-vigo.es/",
      "url": "https://www.python-vigo.es/"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/oBuDZ31MP8A/maxresdefault.jpg",
  "title": "Ignacio González - Python bajo el agua. Aplicaciones Python para vehículos submarinos",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=oBuDZ31MP8A"
    }
  ]
}
