{
  "description": "Casi todas las series temporales tienen ahora algo en común: durante dos años se comportaron de forma extraña por culpa del Covid-19. Da igual que hablemos de las ventas de un supermercado, del consumo eléctrico, del tráfico de una carretera o del precio de la vivienda, todas ellas se han visto impactadas en mayor o menor medida, aunque no tengan directamente que ver con la pandemia. Los patrones temporales de prácticamente todas las series temporales muestran variaciones no predecibles diferentes de las de otros periodos, porque el comportamiento de todos nosotros cambió en muchos y diferentes ámbitos.\nEsos dos años de excepcionalidad, que van desde marzo de 2020 hasta bien entrado 2022, dependiendo de la serie temporal que se analice, hacen que esos datos no sean una buena opción para entrenar modelos sin aplicarles ningún procesamiento adicional, pues los modelos aprenderán patrones que (esperemos) no se van a repetir en el futuro.\nPor si fuera poco, desde que hemos vuelto a la normalidad, tenemos sólo 2 años de datos correctos, lo que es a todas luces insuficiente como para entrenar y validar un modelo en la mayoría de los casos. Los datos anteriores a 2020 sí que pueden ser válidos, dependiendo de la predicción que hagamos, pero tenemos un salto entre ellos y los actuales que evita un uso sencillo de los mismos. En ambos casos, el resultado es que no suele funcionar bien desestimar los datos de los dos años problemáticos.\nEn esta charla analizaremos las alternativas que tenemos para evitar que la predicción de series temporales, que ya de por sí tienen dificultades a superar, se transformen en insalvables por culpa del Covid-19. Veremos qué técnicas pueden servir en diferentes casos y qué técnicas no suelen ser una buena idea. Puede que esto sea un problema temporal hasta que la pandemia quede atrás, y la variación de los datos que supuso deje de afectar, pero hasta entonces nos quedan unos cuantos años de científicos de datos peleándose con series temporales especialmente complicadas.\n\n \nPython España: https://es.python.org/\nPython Vigo: https://www.python-vigo.es/\nBlueSky: @es.pycon.org\nTwitter/X: @PyConES",
  "duration": 1946,
  "language": "spa",
  "recorded": "2024-10-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.es.pycon.org/"
    },
    {
      "label": "https://www.python-vigo.es/",
      "url": "https://www.python-vigo.es/"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    }
  ],
  "speakers": [
    "Jorge Raúl Gómez",
    "Mireya Gutiérrez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/5FnyLEsTuK0/maxresdefault.jpg",
  "title": "Cómo el Covid fastidia la predicción de series temporales y cómo evitarlo",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5FnyLEsTuK0"
    }
  ]
}
