{
  "description": "En primavera de 2024 explotó un clamor: \"Canarias tiene un límite\". Pronto se sucedieron manifestaciones multitudinarias por otras regiones tensionadas: \"Mallorca no se vende\", \"Basta de Ibiza\", \"Cantabria se defiende\".\n\nMientras tanto, en la capital del Reino, se venía fraguando un descontento similar desde hacía años. En mayo de 2024 el Ayuntamiento de Madrid publicó el listado oficial de las 1 008 licencias municipales para viviendas de uso turístico que se habían concedido en la ciudad, congeló temporalmente las nuevas concesiones, y endureció las sanciones.\n\nTodo para hacer oficial una realidad: que había operando muchísimas más de las permitidas.\n\n¿Cuántas? ¿De quién son? Y lo más importante, ¿dónde están?\n\nPara tratar de contestar estas preguntas me armé de valor y me puse a hacer limpieza de datos con Polars, aprendí a hacer joins espaciales de proximidad con GeoPandas, casi me vuelvo loco montando mi propio semáforo asíncrono con AnyIO para poder hacer geocoding con datos de OpenStreetMap, y regresé a mis orígenes leyendo datos vectoriales con Fiona, Shapely, y pyproj.\n\nAcompañadme en esta cruda historia de lucha vecinal aún en curso en la que, una vez más, la tecnología es parte fundamental. En esta charla contaré cómo fue mi primera aproximación a los datos que estaban publicados, las inconsistencias que descubrí al contrastarlos con el nuevo listado, el alborozo de los afectados cuando vieron por primera vez sus pesares reflejados en un mapa, lo que vino después, y cómo tú también puedes ayudar a concienciar de este problema.\n--\nPython España: https://es.python.org/\nPython Vigo: https://www.python-vigo.es/\nBlueSky: @es.pycon.org\nTwitter/X: @PyConES",
  "duration": 1842,
  "language": "spa",
  "recorded": "2024-10-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.es.pycon.org/"
    },
    {
      "label": "https://www.python-vigo.es/",
      "url": "https://www.python-vigo.es/"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/x86_Vuzm90E/maxresdefault.jpg",
  "title": "Juan Luis Cano Rodríguez - Mapeando viviendas turísticas ilegales con Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=x86_Vuzm90E"
    }
  ]
}
