{
  "description": "Los repositorios de código a menudo nos decepcionan, pero seguimos creando otras nuevos con la absurda esperanza de que esta vez sea diferente. Alerta de spoiler: nunca lo es.\n\nEn particular, el código que programamos para investigar tiene la casi imposible tarea de cumplir con el oxímoron de ser robustas para llevar a cabo computaciones gigantes pero al mismo tiempo flexibles y fáciles de utilizar para experimentar rápidamente nuevas ideas.\n\nPero, ¿qué pasaría si hubiera una manera de romper el ciclo y construir código que perdure, incluso para investigaciones pioneras?\n\nEsta charla no trata de dar soluciones mágicas, sino que indaga en de la poderosa conexión entre equipos sanos y código sano. Exploraremos cómo un equipo cohesionado y empoderado mejoró la calidad del código introduciendo de anotaciones de tipo y verificación de tipos en tiempo de ejecución para matrices en JAX.\n\nPrepárate para abandonar el drama y descubrir:\n\n- La fórmula del equipo A: cómo construir un equipo de alto rendimiento que prospere colaborando y como empoderarles a todes.\n- Solucionando los problemas correctos: cómo elegir la (posiblemente) solución perfecta para satisfacer sus necesidades específicas.\n- De la aceptación a la implementación: estrategias para implementar con éxito y fomentar la adopción de los cambios.\n- Más allá del final: Aceptar el inevitable fin de nuestra participación directa en un repositorio y cómo seguir adelante.\n \nPython España: https://es.python.org/\nPython Vigo: https://www.python-vigo.es/\nBlueSky: @es.pycon.org\nTwitter/X: @PyConES",
  "duration": 2223,
  "language": "spa",
  "recorded": "2024-10-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.es.pycon.org/"
    },
    {
      "label": "https://www.python-vigo.es/",
      "url": "https://www.python-vigo.es/"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    }
  ],
  "speakers": [
    "Mai Giménez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ai9nKDxFeNA/maxresdefault.jpg",
  "title": "Código saludable para equipos saludables (¿o al revés?)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ai9nKDxFeNA"
    }
  ]
}
