{
  "description": "Los impresionantes avances en el campo del Deep Learning y redes neuronales basadas en el contexto de visión de los videojuegos han demostrado poder crear controladores de nivel humano en los juegos de Atari 2600 a partir de datos visuales (píxeles). Sin embargo, la mayoría de juegos de Atari 2600 son en tercera persona y en entornos bidimensionales no realistas. Este hecho limita la aplicación de estas tecnologías en otros entornos.\n\nPara superar este desafío, nos complace presentaros ViZDoom, una revolucionaria plataforma de prueba que utiliza información visual pura y ofrece una perspectiva en primera persona en un entorno tridimensional semi-realista. Basada en el legendario juego de disparos en primera persona, Doom, ViZDoom permite desarrollar bots capaces de jugar al juego utilizando únicamente el búfer de pantalla, proporcionando una herramienta ligera, rápida y altamente personalizable.\n\nGracias a la combinación de redes neuronales convolucionales, Q-learning y reproducción de experiencias, hemos logrado entrenar bots altamente competentes. Estos bots no solo muestran comportamientos parecidos a los humanos sino que también confirman la viabilidad del aprendizaje por refuerzo visual en entornos semi-realistas de primera persona en 3D.\n\nDentro de este contexto, contaremos cómo surgió la idea, el motivo de porque se ha elegido Doom y no otros videojuegos, diferentes escenarios de prueba (movimientos básicos, disparos, recolección de objetos en un laberinto), parámetros y resultados, métricas de rendimiento y, finalmente, los usos reales que se le puede dar.\n\n \nPython España: https://es.python.org/\nPython Vigo: https://www.python-vigo.es/\nBlueSky: @es.pycon.org\nTwitter/X: @PyConES",
  "duration": 2004,
  "language": "spa",
  "recorded": "2024-10-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.es.pycon.org/"
    },
    {
      "label": "https://www.python-vigo.es/",
      "url": "https://www.python-vigo.es/"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    }
  ],
  "speakers": [
    "Nadal Llabrés Belmar",
    "Óscar Tienda Beteta"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/0hxHS9hqqNU/maxresdefault.jpg",
  "title": "Aprende Aprendizaje por refuerzo jugando a Doom",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0hxHS9hqqNU"
    }
  ]
}
