{
  "description": "La adopción de modelos fundacionales pre-entrenados con grandes cantidades de datos ha impulsado una transformación radical en prácticamente cualquier disciplina, tanto en el ámbito académico como empresarial. En este sentido, el acceso a estos modelos mediante interfaces de texto ha sido fundamental para ampliar su uso a un amplio espectro de usuarios. Además, estos modelos han demostrado un gran éxito en la identificación de patrones y estructuras complejas del lenguaje humano.\n\nLa integración de interfaces humano-máquina mediante lenguaje natural está impulsando una nueva generación de patrones de diseño y uso. En este enfoque, múltiples inteligencias artificiales colaboran con apoyo humano opcional para iniciar tareas o supervisarlas, logrando así mayor autonomía y eficacia.\n\nLa nueva generación de diseño se ha denominado AI agentic workflows o flujos de trabajo basados en agentes de IA. Estos flujos se fundamentan en cuatro criterios principales: reflexión, uso de herramientas, planificación y colaboración multiagente. En lugar de que un solo modelo (como un gran modelo de lenguaje LLM) genere directamente el resultado final, el objetivo es que el flujo de trabajo realice múltiples solicitudes a ese modelo o a un conjunto colaborativo de modelos especializados, incluyendo el uso de herramientas.\n\nEn esta charla se presentarán casos de uso en los que un flujo de trabajo con agentes de IA puede ser la solución más apropiada. También se abordará cuándo es más eficiente seguir un patrón de ejecución predefinido. Durante la charla, exploraremos flujos de trabajo, el uso de herramientas y la colaboración entre agentes mediante código en Python. Además, se mostrará un ejemplo real de programación en el que diferentes agentes colaboran en tareas como desarrollo, revisión y optimización, aprovechando herramientas como el intérprete de Python y la búsqueda web.\n\nPara esta charla no se requieren conocimientos previos de estadística ni deep learning, y tan sólo unos conocimientos básicos de Python para seguir los fragmentos de código que se expongan. En cualquier caso, cualquier público puede verse beneficiado dado que nuestro objetivo es proporcionar a la audiencia una visión general del estado del arte en el desarrollo de flujos de trabajo utilizando agentes, y ofrecer herramientas y fragmentos de código en Python que puedan inspirar sus propias soluciones.",
  "duration": 1972,
  "language": "spa",
  "recorded": "2024-10-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.es.pycon.org/"
    }
  ],
  "speakers": [
    "Rafael Mena-Yedra",
    "Manuel Díaz",
    "Borja Esteve Molner"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/4NHAyEalfCM/maxresdefault.jpg",
  "title": "Flujos de trabajo con agentes de IA en Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4NHAyEalfCM"
    }
  ]
}
