{
  "description": "Si cada día se consumen millones de contenidos falsos (elecciones, covid, Ucrania, Gaza...) creados con el propósito de manipular nuestra opinión, ¿qué ocurrirá con la explosión provocada por la IA generativa?¿De quién o de qué podremos fiarnos en internet en un futuro en el que nuestros ojos no podrán diferenciar si algo es o no cierto? Si hasta ahora habíamos vivido oleadas de desinformación, deberíamos empezar a prepararnos para el Gran Tsunami que está por venir.\n\nEn un escenario marcado por la creciente dificultad para diferenciar lo que es verdad de lo que no, los verificadores humanos son incapaces de procesar el enorme volumen y la sotisficación de desinformación que circula online. Necesitamos construir soluciones que ayuden en esta tarea y necesitamos hacerlo ya.\n\nMientras que muchas personas ven la IA generativa como el gran peligro, nosotros creemos que es el arma que nos permitirá luchar contra la desinformación de tú a tú. Las capacidades de los nuevos LLMs (GPT, Gemini, Claude…) para razonar sobre el texto y manejar contenido multimodal y/o multilingüe, nos ofrecen una oportunidad única para desarrollar una nueva generación de agentes inteligentes que ayuden a combatir la desinformación.\n\nComo fact-checkers especializados en el desarrollo de tecnología, en los últimos cinco años hemos probado las distintas tecnologías que han ido apareciendo en este ámbito: reglas lingüísticas, frameworks clásicos de NLP, algoritmos de ML tradicional, modelos de Deep Learning y, ahora, LLMs generativos; con un único objetivo: ser capaces de replicar, en parte, el trabajo que hacen en su día a día nuestros compañeros periodistas.\n\nEn esta charla, explicaremos al público cómo hemos implementado nuestros pipelines de datos y análisis/verificación de la desinformación utilizando Python. Nuestro objetivo es mostrar, de manera didáctica y amena, los principales éxitos y fracasos en la construcción de estas tecnologías. Explicaremos cómo pueden trabajar codo a codo periodistas y data scientists en un mismo problema (sin morir en el intento), enseñaremos demos de las PoC desarrolladas hasta la fecha, dedicando un apartado especial a exponer nuestra visión, desde nuestra experiencia en el ámbito, sobre las nuevas soluciones que están por venir en este campo (arquitecturas multi-agente) y cómo pensamos utilizarlas para acabar ganando la batalla contra la desinformación.\n\nEl público se irá de la charla con una idea clara del problema que estamos combatiendo, cómo construir agentes inteligentes con Python y las posibilidades/limitaciones de los sistemas actuales.\n\n--\nPython España: https://es.python.org/\nPython Vigo: https://www.python-vigo.es/\nBlueSky: @es.pycon.org\nTwitter/X: @PyConES",
  "duration": 2621,
  "language": "spa",
  "recorded": "2024-10-04",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.es.pycon.org/"
    },
    {
      "label": "https://www.python-vigo.es/",
      "url": "https://www.python-vigo.es/"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    }
  ],
  "speakers": [
    "Rubén Míguez",
    "Agustín Cañas"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/s9FbRNY3XtQ/maxresdefault.jpg",
  "title": "Cómo la IA generativa puede ayudarnos a ganar la batalla contra las Fake News",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=s9FbRNY3XtQ"
    }
  ]
}
