{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "This talk will provide an overview of the key challenges and trends in\nthe productization of machine learning systems, including concepts such\nas reproducibility, explainability and orchestration. The talk will also\nprovide a high level overview of several key open source tools and\nframeworks available to tackle these issues, which have been identifyed\nputting together the Awesome Machine Learning Operations list\n(https://github.com/EthicalML/awesome-machine-learning-operations).\n\n| The key concepts that will be covered are:\n| \\* Reproducibility\n| \\* Explainability\n| \\* Orchestration of models\n\nThe reproducibility piece will cover key motivations as well as\npractical requirements for model versioning, together with tools that\nallow data scientists to achieve version control of model+config+data to\nensure full model lineage.\n\nThe explainability piece will contain a high level overview of why this\nhas become an important topic in machine learning, including the high\nprofile incidents that tech companies have experienced where undesired\nbiases have slipped into data. This will also include a high level\noverview of some of the tools available.\n\nFinally, the orchestration piece will cover some of the fundamental\nchallenges with large scale serving of models, together with some of the\nkey tools that are available to ensure this challenge can be tackled.",
  "duration": 3698,
  "language": "eng",
  "recorded": "2019-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    }
  ],
  "speakers": [
    "Alejandro Saucedo"
  ],
  "tags": [
    "Architecture",
    "Data",
    "Data Science",
    "Deep Learning",
    "Machine-Learning"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/5ck1wObN65c/maxresdefault.jpg",
  "title": "The state of Machine Learning Operations in 2019",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5ck1wObN65c"
    }
  ]
}
