{
  "description": "A collaboration between the Raspberry Pi Foundation and the European\nSpace Agency put two Raspberry Pi computers augmented with sensor boards\nand camera modules on the International Space Station in 2015. Every\nyear we run a series of competitions for kids in schools around Europe\nto design science experiments using the available sensors.\n\nMission Zero is a low-barrier challenge where students can run a 1\nminute Python program in space to display a message to the astronauts.\nThey have access to the sensors for conditional logic but cannot record\ndata or take photos.\n\nMission Space Lab is a more involved challenge, including planning an\nexperiment, writing and testing code which will run for 3 hours in\nspace, either studying life in space or life on earth (which includes\ntaking photos of Earth out of the ISS window). MSL teams get to keep the\ndata and photo they record in their experiment and are to write a report\nanalysing their findings.\n\nA small tech team at the Raspberry Pi Foundation maintain the operating\nsystem used in flight and work in collaboration with ESA and partners to\nkeep the operation of the Pis running smoothly on the ISS LAN.\n\nAs well as sharing details of the OS maintenance and devops for the\nAstro Pis, I'll share photos taken from space and show findings from\nstudent experiments using opencv, tensorflow, scikit-learn, ephem and\nmore.",
  "language": "eng",
  "recorded": "2019-07-12",
  "related_urls": [
    {
      "label": "slides",
      "url": "https://ep2019.europython.eu/media/conference/slides/asmhHEX-astro-pi-python-on-the-international-space-station.pdf"
    }
  ],
  "speakers": [
    "Ben Nuttall"
  ],
  "tags": [
    "Data",
    "Education",
    "Linux",
    "OpenCV",
    "Raspberry PI"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/MJePVWbu5g4/hqdefault.jpg",
  "title": "Astro Pi: Python on the International Space Station",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MJePVWbu5g4"
    }
  ]
}
