{
  "description": "\"Astro Pi: Python on the International Space Station\n[EuroPython 2019 - Talk - 2019-07-12 - PyCharm]\n[Basel, CH]\n\nBy Ben Nuttall\n\nA collaboration between the Raspberry Pi Foundation and the European Space Agency put two Raspberry Pi computers augmented with sensor boards and camera modules on the International Space Station in 2015. Every year we run a series of competitions for kids in schools around Europe to design science experiments using the available sensors.\n\nMission Zero is a low-barrier challenge where students can run a 1 minute Python program in space to display a message to the astronauts. They have access to the sensors for conditional logic but cannot record data or take photos.\n\nMission Space Lab is a more involved challenge, including planning an experiment, writing and testing code which will run for 3 hours in space, either studying life in space or life on earth (which includes taking photos of Earth out of the ISS window). MSL teams get to keep the data and photo they record in their experiment and are to write a report analysing their findings.\n\nA small tech team at the Raspberry Pi Foundation maintain the operating system used in flight and work in collaboration with ESA and partners to keep the operation of the Pis running smoothly on the ISS LAN.\n\nAs well as sharing details of the OS maintenance and devops for the Astro Pis, I'll share photos taken from space and show findings from student experiments using opencv, tensorflow, scikit-learn, ephem and more.\n\n\n\nLicense: This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2019.europython.eu/events/speaker-release-agreement/",
  "recorded": "2019-07-12",
  "speakers": [
    "Ben Nuttall"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/MJePVWbu5g4/hqdefault.jpg",
  "title": "Astro Pi: Python on the International Space Station",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MJePVWbu5g4"
    }
  ]
}
