{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "The diversity statement quoted as follows: “The Python Software\nFoundation and the global Python community welcome and encourage\nparticipation by everyone. Our community is based on mutual respect,\ntolerance, and encouragement, and we are working to help each other live\nup to these principles. We want our community to be more diverse:\nwhoever you are, and whatever your background, we welcome you.”\n\nDiversity, big deal! As an active members and event organisers (and also\non the minority side of the gender) in the Python community, we have\nalway been concern by the question of: Do we truly have a problem in\ndiversity? Especially, gender diversity. We would like to find out the\ntruth, by data science, and see if we can find a clue why and how we can\nfix it.\n\nFirst, we will show the research others did regarding the representation\nof women in the R and Python communities [1]. Then, we will show the\nresearch that we did based on our experience and statistic. Including\nstatic analysis of the speakers diversity (regarding gender) at major\nPyCon and PyData conferences. Finally, as we all care about diversity\nand want improvements, we would like to find out the reason and what we\ncan do about it. We would propose what we, the minorities and allies,\ncould do against this seemingly unbalance situation and make the\ncommunity better.\n\nThis talk is for all that who cares about diversity in our community.\n\n[1]\nhttps://reshamas.github.io/why-women-are-flourishing-in-r-community-but-\nlagging-in-python/\n\nUpdate: slides at\nhttps://slides.com/cheukting\\_ho/do-we-have-a-diversity-\nproblem-in-python-community",
  "duration": 1868,
  "language": "eng",
  "recorded": "2019-07-10",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    }
  ],
  "speakers": [
    "Cheuk Ho"
  ],
  "tags": [
    "Community",
    "Conferences and Meet-Ups",
    "Data Science",
    "Static Analysis"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/SzGIiUNHN2g/maxresdefault.jpg",
  "title": "Do we have a diversity problem in Python community?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SzGIiUNHN2g"
    }
  ]
}
