{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Infarm is a FaaS, Farming as a Service, and whether you believe it or\nnot, our business is in-house farming at scale.\n\nWe design and build our farms, grow vegetables and sell them, and the\nbackbone of our infrastructure is based on Python.\n\nYou can check this video to see what we do ->\nhttps://twitter.com/christianbarra/status/1096399602159439874\n\nMore than 10 million observations are recorded from our farms, feeding\nour farm management system that allows operators, plant scientists, and\nsupervisors to monitor each farm in real-time.\n\nDuring this talk I will briefly introduce the world's problems we are\ntrying to resolve at Infarm and then talk about our IoT farms,\ninfrastructure, how we use Python and how we plan to improve the\ncapabilities of our farms by adding edge machine learning.\n\nAgenda\n\n| - What are the problems we are trying to solve at Infarm\n| - Our 4 tech pillars\n| - How we started with Python\n| - Issues we are facing while scaling our Python infrastructure to\n  support > 400 farms\n| - How we plan to evolve our software and infrastructure on 4 different\n  levels: consolidate, architecture, cloud native and observability\n| - How Python is going to support our automated farms and its role in\n  making the farms smarter (edge computing with AI)",
  "duration": 2590,
  "language": "eng",
  "recorded": "2019-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    }
  ],
  "speakers": [
    "Christian Barra"
  ],
  "tags": [
    "Big Data",
    "Hardware/IoT",
    "Internet of Things (IoT)",
    "Machine-Learning",
    "Python general"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/QOHBbv2n_hw/maxresdefault.jpg",
  "title": "How software can feed the world 🌱",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QOHBbv2n_hw"
    }
  ]
}
