{
  "description": "\"The world's cheapest, simplest plotter\n[EuroPython 2019 - Talk - 2019-07-11 - Boston]\n[Basel, CH]\n\nBy Daniele Procida\n\nI present an ultra-cheap (total cost of materials :€12.50) plotter that can be built with minimal skills.\n\nAt its heart is a Raspberry Pi Zero and some relatively custom software, driving three servo motors. \n\nThe mechanical hardware can be built from nothing but stiff card, a ball-point pen and some glue. The only tools required are a ruler, a sharp knife, a screwdriver and something to make holes in the card. \n\nAlmost everything required can be found in a desk or kitchen drawer. The entire device can be built with no special skills in about an hour (and much of that time will be spent getting the glue off the kitchen table before you get in trouble).\n\nAs you can see from the following images, the plotter produces images with a distinct charm:\n\n\nhttps://www.dropbox.com/s/s7x3cnxzp1zwnp0/europython.jpg?dl=0\nhttps://www.dropbox.com/s/lzykb02rxh2d9ef/IMG_0065.jpg?dl=0\nhttps://www.dropbox.com/s/8ibihhbfz9gmql0/IMG_0067.jpg?dl=0\nhttps://www.dropbox.com/s/50lemnzw5ismcrq/IMG_0075.jpg?dl=0\n\n\nIt can also function as the world's most inconvenient camera: take a photo using the Raspberry Pi's camera, convert it into lines, and draw it.\n\nThis is fun, but it's much more than that. There are barriers of skill, expense and materials around robotics. This project comes with me to African PyCons, and makes it possible for programmers to explore Python-based robotics, however limited their resources.\n\nThe tools and complete kit of materials to build several plotters can be carried in a small box. The plotter code is published on GitHub: https://github.com/evildmp/PantoGraph. The code for converting bitmaps to cartesian vectors is at https://github.com/evildmp/linedraw/. \n\nI expect this to appeal to anyone who is interested in the idea of Python-driven robotics but is put off by the cost and complexity of hardware required actually to achieve something. \n\nIt will be particularly of interest to people involved in education, or who'd like to explore Python with young people. The code, mathematics and especially the hardware in this project are all simple. \n\nThe code resists the temptation to abstraction, and makes a point of breaking operations down into steps that are as easy as possible to follow. The project shows that doing things with robotics isn't just for people with well-equipped workshops and the engineering skills to use them.\n\n\n\nLicense: This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2019.europython.eu/events/speaker-release-agreement/\n\n    \"",
  "recorded": "",
  "speakers": [
    "Daniele Procida"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Rn4X2ZgZvsk/hqdefault.jpg",
  "title": "The world's cheapest, simplest plotter",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Rn4X2ZgZvsk"
    }
  ]
}
