{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "I present an ultra-cheap (total cost of materials :€12.50) plotter that\ncan be built with minimal skills.\n\nAt its heart is a Raspberry Pi Zero and some relatively custom software,\ndriving three servo motors.\n\nThe mechanical hardware can be built from nothing but stiff card, a\nball-point pen and some glue. The only tools required are a ruler, a\nsharp knife, a screwdriver and something to make holes in the card.\n\nAlmost everything required can be found in a desk or kitchen drawer. The\nentire device can be built with no special skills in about an hour (and\nmuch of that time will be spent getting the glue off the kitchen table\nbefore you get in trouble).\n\nAs you can see from the following images, the plotter produces images\nwith a distinct charm:\n\n-  https://www.dropbox.com/s/s7x3cnxzp1zwnp0/europython.jpg?dl=0\n-  https://www.dropbox.com/s/lzykb02rxh2d9ef/IMG\\_0065.jpg?dl=0\n-  https://www.dropbox.com/s/8ibihhbfz9gmql0/IMG\\_0067.jpg?dl=0\n-  https://www.dropbox.com/s/50lemnzw5ismcrq/IMG\\_0075.jpg?dl=0\n\nIt can also function as the world's most inconvenient camera: take a\nphoto using the Raspberry Pi's camera, convert it into lines, and draw\nit.\n\nThis is fun, but it's much more than that. There are barriers of skill,\nexpense and materials around robotics. This project comes with me to\nAfrican PyCons, and makes it possible for programmers to explore\nPython-based robotics, however limited their resources.\n\nThe tools and complete kit of materials to build several plotters can be\ncarried in a small box. The plotter code is published on GitHub:\nhttps://github.com/evildmp/PantoGraph. The code for converting bitmaps\nto cartesian vectors is at https://github.com/evildmp/linedraw/.\n\nI expect this to appeal to anyone who is interested in the idea of\nPython- driven robotics but is put off by the cost and complexity of\nhardware required actually to achieve something.\n\nIt will be particularly of interest to people involved in education, or\nwho'd like to explore Python with young people. The code, mathematics\nand especially the hardware in this project are all simple.\n\nThe code resists the temptation to abstraction, and makes a point of\nbreaking operations down into steps that are as easy as possible to\nfollow. The project shows that doing things with robotics isn't just for\npeople with well-equipped workshops and the engineering skills to use\nthem.",
  "duration": 1627,
  "language": "eng",
  "recorded": "2019-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    }
  ],
  "speakers": [
    "Daniele Procida"
  ],
  "tags": [
    "Education"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Rn4X2ZgZvsk/maxresdefault.jpg",
  "title": "The world's cheapest, simplest plotter",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Rn4X2ZgZvsk"
    }
  ]
}
