{
  "description": "The goal of this talk is to show the audience a different way of\nthinking about and developing regex statements.\n\nI have been working with UNIX for decades now and, although i always\nmanaged to avoid Perl, i have been intrigued with Regex constructs ever\nsince my first encounter. These weird unreadable things that can\ntransform text like nothing else or can find what i’m looking for in\nmassive files, in no time at all. I’ve created regexes that only appeal\nto the most nerdiest of nerds and i’ve stunned colleagues by fixing\ntheir futile regex attempts in just a few keystrokes. But when Damian\nConway showed me how regexes really work i was awestruck. And now i want\nto share this knowledge.\n\nThis talk is aimed at pythonistas that have some experience with the re\nmodule. I will take some easy examples and explain in plain english how\na regex engine searches for a match. This will show that a regex is not\nsome mysterious incomprehensible pattern description or declarative\nblueprint. Instead it is a small program that is very good at comparing\nsingle characters. Like any programming language it turns out that once\nyou understand the rules and structure it suddenly becomes so much\neasier to use.\n\nWith this new found knowledge we will up the ante and try some more\ndifficult stuff, adding other semantics and some tips and tricks. We’ll\nlook at some pitfalls, maybe compare regex to python solutions and have\na look at some regexes found in the wild (either on my drive or on\ngithub).",
  "recorded": "2019-07-12",
  "related_urls": [
    {
      "label": "slides",
      "url": "https://ep2019.europython.eu/media/conference/slides/A52MJFK-and-now-for-something-completely-different.pdf"
    }
  ],
  "speakers": [
    "Danny Engelbarts"
  ],
  "tags": [
    "Compiler and Interpreters",
    "Mind Bending",
    "Programming",
    "Python Skills",
    "Tooling"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/rXxPpxDQ22s/hqdefault.jpg",
  "title": "And now for something completely different.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rXxPpxDQ22s"
    }
  ]
}
