{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Your data science or machine learning project probably won't just\nproduce a written report. Instead, projects are increasingly expected to\nproduce interactive tools to allow end-users to explore data and results\nwith rich, interactive visualizations. Inevitably, this will be done in\na web browser, meaning you'll need to add a quantitatively trained web\ndeveloper to your team, or have your data scientists spend time learning\nHTML, Javascript and CSS. Dash, a project by the team that makes Plotly,\nsolves some of these problems by allowing data scientists to build rich\nand interactive websites in pure python, with minimal knowledge of HTML\nand absolutely no Javascript.\n\nAt decisionLab, a London-based data science consultancy producing\ndecision tools, we've embraced Dash to produce proof-of-concept models\nfor our projects in alpha. Although we're not officially connected to\nthe plotly/Dash project, by using the library daily across many\nprojects, we've learned many lessons and what we feel are best practises\nwe'd like to share, and hear feedback on!\n\nThis talk will give an overview of Dash, how it works and what it can be\nused for, before outlining some of the common problems that emerge when\ndata scientists are let loose to produce web applications, and web\ndevelopers have to work with the pydata ecosystem. The talk also covers\neffective working practises to start producing cool interactive\nstatistical web applications, fast. We'll also identify some of the\npitfalls of Dash, and how and when to make the decision to stop using\nDash and start building a proper web application.\n\nSlides: http://domweldon-europython-2019-dash.s3.eu-\nwest-2.amazonaws.com/index.html",
  "duration": 1945,
  "language": "eng",
  "recorded": "2019-07-10",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    }
  ],
  "speakers": [
    "Dom Weldon"
  ],
  "tags": [
    "Data Science",
    "JavaScript",
    "Visualization",
    "Web",
    "Web Servers and MicroFWs"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/mMzFhGXGrVc/maxresdefault.jpg",
  "title": "Dash: Interactive Data Visualization Web Apps with no Javascript",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mMzFhGXGrVc"
    }
  ]
}
