{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Many Python developers like Jupyter Notebooks for their flexibility:\nthey are very useful for interactive prototyping, scientific\nexperiments, visualizations and many other tasks. There are different\ndevelopment tools which make working with Jupyter Notebooks easier and\nsmoother, but all of them lack very important feature: visual debugger.\nSince Jupyter Kernel is a usual Python process, it looks reasonably to\nuse one of existing Python debuggers with it. But is it really possible?\n\nIn this talk we’ll try to understand how Python debugger should be\nchanged to work with Jupyter cells and how these changes are already\nimplemented in the PyCharm IDE. After that we’ll look into the whole\nJupyter architecture and try to understand which bottlenecks in it\nprevent creation of universal Jupyter debugger at the moment.\n\nThis talk requires a basic knowledge of Jupyter Notebooks and\nunderstanding of Python functions and objects. It will be interesting\nfor people who want to learn internals of the tools they use every day.\nAlso it might be an inspiration for people who want to implement a\nvisual debugger in their favourite IDE.",
  "duration": 1825,
  "language": "eng",
  "recorded": "2019-07-10",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    },
    {
      "label": "slides",
      "url": "https://ep2019.europython.eu/media/conference/slides/GnkRxNo-visual-debugger-for-jupyter-notebooks-myth-or-reality.pdf"
    }
  ],
  "speakers": [
    "Elizaveta Shashkova"
  ],
  "tags": [
    "Debugging",
    "Jupyter",
    "Python general",
    "Tooling"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/XHNSYfkKnOQ/maxresdefault.jpg",
  "title": "Visual debugger for Jupyter Notebooks: Myth or Reality?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XHNSYfkKnOQ"
    }
  ]
}
