{
  "description": "\"Delta Chat, CFFI, pytest and all the Rust\n[EuroPython 2019 - Talk - 2019-07-12 - Boston]\n[Basel, CH]\n\nBy Holger Krekel\n\nDelta Chat, a new approach to decentralized messaging, uses Python in several ways. Delta Chat is a Whatsapp/Telegram-style messenger app  which uses the existing e-mail server network instead of central servers. There is no address book upload, and no necessity to tie accounts to mobile numbers. We'll live-demo how \"\"Chat over E-mail\"\" works, with random audience members, in real-time. \n\nWe'll then look into how Python is used for automated testing (with pytest) against the messenger core library which is exposed through CFFI. However, the core library will soon be ported to full Rust. Are there better ways to interface Rust with Python than going through C-interfaces?\n\nIn the third part we'll introduce first example Chat Bots, written in Python. Do you want to send an machine-generated system allert to a sysadmin group? Or safely archive all media that is posted to a family group?  Or have your IoT sensor react to commands or send info?  Just do it without registering a bot to some central cite, or by exposing all content information to (e. g. Telegram) servers. A Chat Bot only needs access to a standard IMAP/SMTP account. We'll look at the simple Python API for writing and testing powerful and versatile Chat bots.\n\n\nDelta Chat: https://delta.chat\nCore library and Py bindings: https://github.com/deltachat/deltachat-core\nDeltabot: https://github.com/deltachat/deltabot/\n\n\n\n\nLicense: This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2019.europython.eu/events/speaker-release-agreement/\n\n    \"",
  "recorded": "",
  "speakers": [
    "Holger Krekel"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/prfgtpdeoNA/hqdefault.jpg",
  "title": "Delta Chat, CFFI, pytest and all the Rust",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=prfgtpdeoNA"
    }
  ]
}
