{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "| Getting started with a natural language processing and neural networks\n  is easier nowadays thanks to the numerous talks and tutorials. The\n  goal is to dive deeper for those who already know the basics, or want\n  to expand their knowledge in a machine learning field.\n| The talk will start with the common use cases that can be generalized\n  to the specific problems in a NLP world. Then I will present an\n  overview of possible features that we can use as input to our network,\n  and show that even simple feature engineering can change our results.\n| Furthermore, I will compare different network architectures - starting\n  with the fully connected networks, through convolution neural networks\n  to recursive neural networks. I will not only considering the good\n  parts, but also - what is usually overlooked - pitfalls of every\n  solution.\n| All of these will be done considering number of parameters, which\n  transfers into training and prediction costs and time. I will also\n  share a number of “tricks” that enables getting the best results even\n  out of the simple architectures, as these are usually the fastest and\n  quite often hard to beat, at the same time being the easiest to\n  interpret.",
  "duration": 1745,
  "language": "eng",
  "recorded": "2019-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    },
    {
      "label": "slides",
      "url": "https://ep2019.europython.eu/media/conference/slides/hmyiawy-natural-language-processing-with-neural-networks.pdf"
    }
  ],
  "speakers": [
    "Hubert Bryłkowski"
  ],
  "tags": [
    "Data Science",
    "Deep Learning",
    "Machine-Learning",
    "Natural Language Processing"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/F2LajzvSX18/maxresdefault.jpg",
  "title": "Natural language processing with neural networks.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=F2LajzvSX18"
    }
  ]
}
