{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Do you remember when you used to learn algorithms? It was probably\neither back when you were studying for your degree, or when you were\nbrushing up for a technical interview. If you're like most of the\ndevelopers I know, solving algorithms probably went from being a fun\npast-time, to a bothersome necessity, to a thing of the past. Our life\nhas been greatly improved by our tools and there's little need to know\nall sorting methods out there, or how to search through a tree. Or maybe\nwe're wrong, maybe knowing these things could make a difference in how\nwe write code.\n\nI am going to try to dispel some of the myths surrounding the study of\nalgorithms and competitive programming, and argue that sharpening this\nskill is something that benefits us, as software developers, outside of\npassing technical tests; that knowing many algorithms makes us better\nand faster problem solvers.\n\nLastly, this talk is about resources and ways in which to gamify the\nstudy of algorithms. Going at it the same way as for exams or interviews\nmakes it very bothersome very quickly. It gets easy to lose sight of the\nbiggest picture and to start thinking of algorithms in abstract terms,\noutside their applications. All these are factors that prompt the\nquestion: why should I carry on with it?\n\nTherefore, something needs to be changed in the way we do this.\nAlgorithms are fun and they don't deserve the disdain we give them.\nKnowing algorithms is not only for the geniuses and innovators.",
  "duration": 1831,
  "language": "eng",
  "recorded": "2019-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    },
    {
      "label": "slides",
      "url": "https://ep2019.europython.eu/media/conference/slides/ydmw6o9-gamifying-the-study-of-algorithms.pdf"
    }
  ],
  "speakers": [
    "Iulia Avram"
  ],
  "tags": [
    "Algorithms",
    "Best Practice",
    "Education",
    "Fun and Humor"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/KDb-dW0FqZE/maxresdefault.jpg",
  "title": "Gamifying the study of algorithms",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KDb-dW0FqZE"
    }
  ]
}
