{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Did you ever wonder why development in Python can be x10 faster than\ndevelopment in languages like c++?\n\nObserving my teams’ experimentations, the python community, and reading,\nI have adopted various habits, patterns, and tools. But most importantly\nI learned thinking in Python. I consider thinking in Python a key for\nrapid development and good engineering.\n\nThinking in a programming language affects the amount of information you\nneed to keep in your working memory. It also affects the abstractions\nand tools that pop in your mind and then used in constructing solutions.\n\nLet’s explore what it means to think in Python. Why Python allows you to\nfocus on problem solving, while languages like c++ often distract your\nattention from the problem at hand.\n\nIn this talk I will cover some good and bad practices by examples while\ntrying to consider the amount of effort needed to write it, read it, and\ntalk about it with other team members.\n\nKey Takeaways: Tips for speeding your work without compromising quality,\nand reasoning for using it.\n\n-  The audience should be comfortably familiar with the process of\n   software development, and software problem solving, and experience\n   using Python.",
  "duration": 1883,
  "language": "eng",
  "recorded": "2019-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    },
    {
      "label": "slides",
      "url": "https://ep2019.europython.eu/media/conference/slides/sR2LcEk-how-thinking-in-python-made-me-a-better-software-engineer.pdf"
    }
  ],
  "speakers": [
    "Johnny Dude"
  ],
  "tags": [
    "Best Practice",
    "Development",
    "Software Design",
    "failures/mistakes"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/jGseHScYdSg/maxresdefault.jpg",
  "title": "How Thinking in Python Made Me a Better Software Engineer",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jGseHScYdSg"
    }
  ]
}
