{
  "description": "\"Moving big projects to Python 3\n[EuroPython 2019 - Talk - 2019-07-12 - Boston]\n[Basel, CH]\n\nBy Lennart Regebro\n\nNext year Python 2 is no longer maintained. But you have a monster code base with clever tricks and libraries that don't support Python 2, and your data may be stored in a format that is hard to move Python 3. And that's the easy bit.\n\nThis talk focuses on the process of moving, not the code changes. Because it's the process that is the hard part. How do you get your code in a state where it's ready to move? How do you get the whole team on the boat to Python 3?\n\nAll Python 3 talks I have seen, including those I have given, and all the texts on how to port, including the book I wrote, focus on the code changes. With increasing backwards compatibility in Python 3 and forward-compatibility in Python 2, this actually became a lesser problem for big code bases. \n\n\nThe extra issues of large, old code bases\n\nCan you stop adding features? (1 min)\nSeparate team vs getting everyone on it (2 min)\nPython 2 compatibility: You need it (1 min)\n\nThe steps\n\nFix your development process (2 min)\nReplace old libraries, or take over maintenance and port them (2 min)\nMake sure your tests are solid (1 min)\nRun 2to3 but only backwards compatible fixers (2 min)\nRun tests on Python 3 to stop backsliding (4 min)\n\nRun all tests: Expansive or slow\nStore passed tests\nDetect tests that change\nTurning it off adds a lot of extra work\n\nPort all your little utilities and tool scripts (1 min)\nFix fix fix fix (1 min)\nAdd tests with Python 2 data, to test migration (2 min)\n\nYou might need migration scripts\n\nExtra careful staging tests (1 min)\nProduction: Try, fail, repeat (1 min)\nClean the code up (3 min)\n\n\n\n\n\nLicense: This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2019.europython.eu/events/speaker-release-agreement/\n\n    \"",
  "recorded": "",
  "speakers": [
    "Lennart Regebro"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/jFO1IYEulJM/hqdefault.jpg",
  "title": "Moving big projects to Python 3",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jFO1IYEulJM"
    }
  ]
}
