{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Object Relational Mappers (ORMs) are awesome enhancers of developer\nproductivity. The freedom of having the library write that SQL and give\nyou back a useful, rich model instance (or a bunch of them) instead of\njust a tuple or a list of records is simply amazing.\n\nBut if you forget you have an actual database behind all that\nconvenience, then it'll bite you back, usually when you've been in\nproduction for a while, after you've accumulated enough data that your\nonce speedy application starts slowing down do a crawl.\n\nDatabases work best when you ask them once for (or to do) a bunch of\nstuff, instead of asking them lots of times for small stuff.\n\nWe'll discuss how innocent looking attribute accesses on your model\ninstances translate to sequential queries (the infamous N+1 problem).\n\nThen we'll go through some practical solutions, taken from real cases,\nthat resulted in massive speed ups. We'll cover how changes in Python\ncode resulted in changes to the resulting SQL Queries.\n\nWe'll see solutions not only for queries, but also for inserts and\nupdates, which tend to be less well documented.\n\nThough this talk focuses on SQLAlchemy, the lessons should be applicable\nto most ORMs in most programing languages. The ideas discussed, and\nsolutions proposed are also valid for any storage back-end, not only SQL\ndatabases.\n\nThis talk is geared towards Python developers with systems that talk to\ndatabases. It should be accessible to anyone who already programs in\nPython (early intermediary level), but will be most useful for\ndevelopers with projects talking to SQL databases, specially using an\nORM like SQLAlchemy. Attendees will learn to detect how N+1 query\nsituations arise and how to work around them effectively. They will also\nlearn how to do mass inserts and mass updates with SQLAlchemy.",
  "duration": 2718,
  "language": "eng",
  "recorded": "2019-07-10",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    },
    {
      "label": "slides",
      "url": "https://ep2019.europython.eu/media/conference/slides/xrwMFLx-from-days-to-minutes-from-minutes-to-milliseconds-with-sqlalchemy.pdf"
    }
  ],
  "speakers": [
    "Leonardo Rochael Almeida"
  ],
  "tags": [
    "Debugging",
    "Performance",
    "SQL Alchemy",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Sq1TDj8mIrs/maxresdefault.jpg",
  "title": "From days to minutes, from minutes to milliseconds with SQLAlchemy",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Sq1TDj8mIrs"
    }
  ]
}
