{
  "description": "| Code review is not just boring duty. It's mutual responsibility for\n  the software we're releasing. It's one of the most critical aspects of\n  code quality, and therefore it's the first step of quality assurance.\n  This is also the key to easier programming and better maintainability.\n  Clean code is much easier to debug, and it's much harder to introduce\n  a bug in such code.\n| When you think about code review, you probably think about verifying\n  and examining the code. Reviewing the expert's code may look like a\n  waste of time because he knows what he's doing. Reviewing the code by\n  a beginner may look like a waste of time because he's not able to find\n  as many defects as an experienced developer. Code review is a code\n  quality tool in the first place, but it's also much beyond that. You\n  can teach or help someone, learn from somebody and much more both from\n  the position of reviewer and reviewee.\n| There is much more about the real power of code review which I want to\n  share with you.\n| This talk is also about how to do it the right way and how to not do\n  it based on lessons learned and my experience within the diverse teams\n  of people with a variety of knowledge and experience. I was reviewing\n  the code but, on the other hand, I was also being reviewed. I'd like\n  to pass my observations to people who are reviewing the code both in\n  commercial and open source projects for a while. This talk is also for\n  those who want to start to review the code, but they do not know how\n  to do it.",
  "language": "eng",
  "recorded": "2019-07-12",
  "related_urls": [
    {
      "label": "slides",
      "url": "https://ep2019.europython.eu/media/conference/slides/LjX3u9S-code-review-for-beginners-and-experts-tips-tricks.pdf"
    }
  ],
  "speakers": [
    "Łukasz Kąkol"
  ],
  "tags": [
    "Best Practice",
    "Clean Code",
    "Code Analysis",
    "Development",
    "Programming"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/6JdSrGWodY0/hqdefault.jpg",
  "title": "Code review for Beginners and Experts: Tips & Tricks",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6JdSrGWodY0"
    }
  ]
}
