{
  "description": "\"Code review for Beginners and Experts: Tips & Tricks\n[EuroPython 2019 - Talk - 2019-07-12 - MongoDB]\n[Basel, CH]\n\nBy Łukasz Kąkol\n\nCode review is not just boring duty. It's mutual responsibility for the software we're releasing. It's one of the most critical aspects of code quality, and therefore it's the first step of quality assurance. This is also the key to easier programming and better maintainability. Clean code is much easier to debug, and it's much harder to introduce a bug in such code.\nWhen you think about code review, you probably think about verifying and examining the code. Reviewing the expert's code may look like a waste of time because he knows what he's doing. Reviewing the code by a beginner may look like a waste of time because he's not able to find as many defects as an experienced developer. Code review is a code quality tool in the first place, but it's also much beyond that. You can teach or help someone, learn from somebody and much more both from the position of reviewer and reviewee.\nThere is much more about the real power of code review which I want to share with you.\nThis talk is also about how to do it the right way and how to not do it based on lessons learned and my experience within the diverse teams of people with a variety of knowledge and experience. I was reviewing the code but, on the other hand, I was also being reviewed. I'd like to pass my observations to people who are reviewing the code both in commercial and open source projects for a while. This talk is also for those who want to start to review the code, but they do not know how to do it.\n\n\n\nLicense: This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2019.europython.eu/events/speaker-release-agreement/",
  "recorded": "",
  "speakers": [
    "Łukasz Kąkol"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/6JdSrGWodY0/hqdefault.jpg",
  "title": "Code review for Beginners and Experts: Tips & Tricks",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6JdSrGWodY0"
    }
  ]
}
