{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "| Biology and computing are closer than we usually think, for example\n  many algorithms are inspired in biology patterns, and complementary to\n  that, researchers needs special algorithms to have a better\n  understanding of our environment. Thus, there is a strong relation an\n  dependency.\n| In the past years, Biology has been transformed into computational\n  biology. Therefore\n| technological advances helps us to predict physical interactions\n  between atoms and DNA, because we are being able to integrate\n  information from biology into algorithms.\n\nPython has become a popular programming language in biosciences because\nit has a clean syntax that makes it easy to read language. In addition\nto this, there are many modules (toolkits) extending to different\nbiological domains, like metabolomics, structure analysis,\nphylogenomics, molecular biology and others. Python is currently\nimproving researcher’s workflow, helping us to focus on the theory or\nexperimental part, instead of fighting with old buggy applications.\n\nThis talk aims to be oriented to all audiences (with/without biological\nbackground) since we will go together through an amazing adventure into\nthe natural sciences using tools like Biopython, Bokeh, Networkx, Ecopy\nand much more! Are you brave enough to follow me on this journey?",
  "duration": 1499,
  "language": "eng",
  "recorded": "2019-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    }
  ],
  "speakers": [
    "Maria Molina-Contreras"
  ],
  "tags": [
    "Algorithms",
    "Data Science",
    "Natural Science",
    "Scientific Libraries (Numpy/Pandas/SciKit/...)",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/CHpSsVcrVME/maxresdefault.jpg",
  "title": "“When a biologist met Python”",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CHpSsVcrVME"
    }
  ]
}
