{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Python is widely used to write scripts and tools, but did you know that\nit can also be used to build client-side end-user applications? Crossing\nthe gap from script to app can be challenging: Join us to learn how to\nwrite modern, high quality desktop apps in Python!\n\nAt Dropbox, we’ve been fans of Python from the very beginning: we’ll\ntake you on a tour of our app for Windows/macOS/Linux and share our\n“lessons learned” from over 10 years of development.\n\nWe’ll share best practices and techniques for shipping Python code to\nhundreds of millions of devices: discover how to maximize security,\nimprove performance and guarantee stability.\n\nWe’ll explore the key choices we made and why: learn how we migrated to\nPython 3 by simultaneously shipping both versions, or how we use HTML to\npower our GUI (a la Electron).\n\nWe’ll reveal our favorite tools and libraries: learn how we scaled from\na few engineers to over 100 and added support for other programming\nlanguages (like Rust).\n\n| The goal of this talk is to share our learnings from using Python on\n  Windows, macOS and Linux to encourage the use of Python when building\n  Desktop apps.\n| - We also want to recognize the third-party libraries we’ve used (and\n  their authors) to raise their profile with the overall community.\n| - We hope this will inspire attendees to write more desktop Python\n  code, and raise awareness for this use case with the community as a\n  whole.\n\n| We intend to speak to any Python developer/engineer or enthusiast who\n  makes use of Python in a Desktop environment (or wants to), whether\n  it’s to make scripts, tools or apps.\n| We do not expect knowledge of any specific third-party Python\n  libraries; in fact, we hope to draw attention to and recognize many\n  libraries we’ve found useful.",
  "duration": 2689,
  "language": "eng",
  "recorded": "2019-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    }
  ],
  "speakers": [
    "Max Bélanger"
  ],
  "tags": [
    "Architecture",
    "Best Practice",
    "Cross-Platform-Development",
    "Mac OS X",
    "Windows"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/BS2_DrN0pw4/maxresdefault.jpg",
  "title": "How to ship a Python app to a hundred million desktops",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BS2_DrN0pw4"
    }
  ]
}
