{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "| Reproducibility of research is a common issue in science, especially\n  in computationally expensive research fields e.g. cancer research.\n| A comprehensive picture of the genomic aberrations that occur during\n  tumour progression and the resulting intra-tumour heterogeneity, is\n  essential for personalised and precise cancer therapies. With the\n  change in the tumour environment under treatment, heterogeneity allows\n  the tumour additional ways to evolve resistance, such that\n  intra-tumour genomic diversity is a cause of relapse and treatment\n  failure. Earlier bulk sequencing technologies were incapable of\n  determining the diversity in the tumour.\n| Single-cell DNA sequencing - a recent sequencing technology - offers\n  resolution down to the level of individual cells and is playing an\n  increasingly important role in this field.\n| We present a reproducible and scalable Python data analysis pipeline\n  that employs a statistical model and an MCMC algorithm to infer the\n  evolutionary history of copy number alterations of a tumour from\n  single cells. The pipeline is built using Python, Conda environment\n  management system and the Snakemake workflow management system. The\n  pipeline starts from the raw sequencing files and a settings file for\n  parameter configurations. After running the data analysis, pipeline\n  produces report and figures to inform the treatment decision of the\n  cancer patient.",
  "duration": 1683,
  "language": "eng",
  "recorded": "2019-07-10",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    },
    {
      "label": "slides",
      "url": "https://ep2019.europython.eu/media/conference/slides/pT3C5ZZ-bioinformatics-pipeline-for-revealing-tumour-heterogeneity.pdf"
    }
  ],
  "speakers": [
    "Mustafa Anil Tuncel"
  ],
  "tags": [
    "Algorithms",
    "Analytics",
    "C-Languages",
    "Command-Line",
    "Data Science"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/i0BlJpDQW_U/maxresdefault.jpg",
  "title": "Bioinformatics pipeline for revealing tumour heterogeneity",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=i0BlJpDQW_U"
    }
  ]
}
