{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "This is a case study that documents how a small data science team in a\nbig bank took on the challenge to transform a fragmented sales process\ninto a data-driven one using Python and machine learning.\n\nThis talk outlines the various ways Python has been instrumental in\ndelivering a production solution that serves advisers and relationship\nmanager on a continuous basis.\n\n| The Challenge\n| - A bank has many clients with diverse needs and cost pressures mean\n  fewer advisers resulting in reduced client coverage.\n| - Multiple sales channels and mixed service levels meant sales\n  processes were uncoordinated and driven by heuristics and often very\n  subjective.\n| - And... Excel sheets everywhere!\n\n| Solution\n| - Go data-driven!\n| - Learn from clients and understand product usage\n| - Empower and inform advisers and call centre agents\n| - Build a front-to-back sales process (no more Excels!)\n| - How? With Python!\n\n| The Python Bits\n| - Scikit learn machine learning pipelines that implement two distinct\n  approaches to product affinity in banking and wealth management\n| - SQL Alchemy based API for data engineering and rapid prototyping of\n  analytics\n| - Pandas and Jupyter for development and collaboration\n| - Luigi pipeline for daily processing of millions of transactions and\n  engineering features\n| - Extracting features from text with NLP (Spacy)\n| - Delivering machine learning interpretability in production, e.g.\n  with Random Forests and treeinterpreter\n| - A Python module that we built with all the reusable bits: building\n  training and prediction datasets, developing pipelines, generating\n  monitoring data and enabling explainability",
  "duration": 1880,
  "language": "eng",
  "recorded": "2019-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    }
  ],
  "speakers": [
    "Paul Hughes"
  ],
  "tags": [
    "Business Cases",
    "Data Science",
    "Machine-Learning",
    "Scientific Libraries (Numpy/Pandas/SciKit/...)",
    "Windows"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/4KKjo9WwvVA/maxresdefault.jpg",
  "title": "Building Data-Driven Client Relationship Management in Banking with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4KKjo9WwvVA"
    }
  ]
}
