{
  "description": "Deployment automation, cloud platforms, containerization, short\niterations to develop and release software—we’ve progressed a lot. And\nfinally it’s official: Kubernetes and OpenShift are the established\nplatforms to help us do scaling and zero downtime deployments with just\na few hundred lines of YAML. It’s a great time.\n\nCan we finally put all our eggs into one basket? Identify the cloud\nplatform that fits our needs, and jump on it? That could well backfire:\nVendor lock-in is the new waterfall, it slows you down. In future you’ll\nwant to jump over to the next better platform, in a matter of minutes.\nNot months.\n\nThis talk is about The Art of Writing deployment pipelines that will\nsurvive Kubernetes, OpenShift and the like. It’s for Python developers\nand Kubernetes enthusiasts of all levels – no domain specific knowledge\nrequired, all you need to understand will be explained. You’ll learn how\nto separate application-specific and deployment-specific configuration\ndetails, to maximize your freedom and avoid vendor lock-in.\n\nCome see a demo of a Django project setup that covers everything from\nlocal development to automatic scaling, flexible enough to be deployed\non any of your favorite container platforms. Take home a working,\nfuture-proof setup for your Python applications.",
  "language": "eng",
  "recorded": "2019-07-12",
  "related_urls": [
    {
      "label": "slides",
      "url": "https://ep2019.europython.eu/media/conference/slides/2bwgnvQ-modern-continuous-delivery-for-python-developers.pdf"
    }
  ],
  "speakers": [
    "Peter Bittner"
  ],
  "tags": [
    "Agile",
    "Best Practice",
    "Clean Code",
    "Deployment/Continuous Integration and Delivery"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/MC30D_sVD6Y/hqdefault.jpg",
  "title": "Modern Continuous Delivery for Python Developers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MC30D_sVD6Y"
    }
  ]
}
