{
  "description": "\"Modern Continuous Delivery for Python Developers\n[EuroPython 2019 - Talk - 2019-07-12 - Shanghai]\n[Basel, CH]\n\nBy Peter Bittner\n\nDeployment automation, cloud platforms, containerization, short iterations to develop and release software—we’ve progressed a lot. And finally it’s official: Kubernetes and OpenShift are the established platforms to help us do scaling and zero downtime deployments with just a few hundred lines of YAML. It’s a great time.\n\nCan we finally put all our eggs into one basket? Identify the cloud platform that fits our needs, and jump on it? That could well backfire: Vendor lock-in is the new waterfall, it slows you down. In future you’ll want to jump over to the next better platform, in a matter of minutes. Not months.\n\nThis talk is about The Art of Writing deployment pipelines that will survive Kubernetes, OpenShift and the like. It’s for Python developers and Kubernetes enthusiasts of all levels – no domain specific knowledge required, all you need to understand will be explained. You’ll learn how to separate application-specific and deployment-specific configuration details, to maximize your freedom and avoid vendor lock-in.\n\nCome see a demo of a Django project setup that covers everything from local development to automatic scaling, flexible enough to be deployed on any of your favorite container platforms. Take home a working, future-proof setup for your Python applications.\n\n\n\nLicense: This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2019.europython.eu/events/speaker-release-agreement/",
  "recorded": "2019-07-12",
  "speakers": [
    "Peter Bittner"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/MC30D_sVD6Y/hqdefault.jpg",
  "title": "Modern Continuous Delivery for Python Developers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MC30D_sVD6Y"
    }
  ]
}
