{
  "description": "\"Configuring uWSGI for Production: The defaults are all wrong\n[EuroPython 2019 - Talk - 2019-07-12 - Singapore]\n[Basel, CH]\n\nBy Peter Sperl\n\nTwo years ago, we began migrating from a proprietary service framework to a WSGI-compliant one. We chose uWSGI as our host because of its performance and feature set. But, while powerful, uWSGI's defaults are driven by backward compatibility and are not ideal for new deployments. Powerful features can be overlooked due to the sheer magnitude of its feature set and spotty documentation. As we've scaled up the number of services hosted by uWSGI over the last year, we've had to tweak our standard configuration.\n\nIn this talk, we'll present the base uWSGI configuration we use as a starting point for all services, as well as some tips to avoid known gotchas and provide a base level of defensiveness and high reliability. This base configuration makes use of several \"\"no-cost\"\" uWSGI features that help protect services from common, yet difficult to prevent issues -- some of which we discovered the hard way. We'll also talk about some programmatic uWSGI features which can be leveraged to improve reliability and improve outage response.\n\nSome of the topics we'll cover include:\n- Mitigating memory leaks\n- Mitigating stuck, hung, or infinitely looping processes\n- Preventing misconfigurations\n- Preventing wasted development effort\n- Improving outage response\n\n\n\nLicense: This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2019.europython.eu/events/speaker-release-agreement/",
  "recorded": "2019-07-12",
  "speakers": [
    "Peter Sperl"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/3pNJDhD6v7A/hqdefault.jpg",
  "title": "Configuring uWSGI for Production: The defaults are all wrong",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3pNJDhD6v7A"
    }
  ]
}
