{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Customer lock-in. Dubious “Land and Expand” strategies. We have all\nheard about outsourced software projects that run far past schedule and\nobliterates the budget, yet somehow fail to meet even basic\nrequirements.\n\nHow can this happen. How can your company reduce the risks of delegating\nsoftware development to an external party?\n\nThe Principal–Agent Problem is a well researched dilemma in economic\nliterature. It occurs when a person or entity (“agent”), is tasked to\nwork on behalf of another person or entity (\"principal\"). When the two\nparties have divergent interests, the agent might act contrary to the\nbest interests of the principal.\n\n| Examples of principal-agent relationships are:\n| - Employer vs Employee\n| - Shareholder vs Management\n| - Voter vs Political party\n| - Contractor vs Software Consultant\n\nWhen a firm decides to outsource software development to a third party,\nthere is an economic divergence of interest at play, as both parties\nseek to maximize profit. The contractor wants its requirements met at\nlow cost and on a predictable schedule. The third party, when acting\nnefariously, can maximize its own gains by extending the project,\nutilizing junior or low-cost labor, and creating a relationship of\ndependency.\n\nIn this session we will look into some nefarious techniques and\npractices used in the IT consulting industry and how best to avoid them.\nWe will also learn why it is particularly hard to mitigate the risks of\noutsourced software development.",
  "duration": 1827,
  "language": "eng",
  "recorded": "2019-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    }
  ],
  "speakers": [
    "Sebastian Roll"
  ],
  "tags": [
    "Business",
    "Clients",
    "Ethics",
    "Management",
    "freelancing"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/fuAtAGPp2DM/maxresdefault.jpg",
  "title": "The Dangers of Outsourcing Software Development",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fuAtAGPp2DM"
    }
  ]
}
