{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "I've been programming in Python for over 7 years. And from the time\nsomeone introduced me to IPython, it immediately became my default\nPython REPL. I enjoyed the syntax highlighting, code completion or the\ninstant access to the documentation. Over the years, I've picked up more\nand more tricks that IPython could do: embedding IPython sessions,\nstarting IPython automatically when a test fails, taking advantage of\nthe startup files, not to mention all the various magic functions.\n\nIt took me some time to discover all those features (if there is one\nthing I would like you to take away from this talk, it’s that reading\nthe documentation of a tool that you are using *every day* is probably a\ngood idea) and in this talk, I will give an overview of what you can do\nwith IPython REPL.\n\n| Some of the things I will talk about:\n| - Documentation with ? and ??, running shell functions in IPython,\n  magic functions\n| - Profiles, startup files, configuration file, kernels, and extensions\n| - How to better use IPython for debugging\n| - How to use IPython for profiling\n| - Alternatives to IPython REPL\n\nThis talk is for you if you are a casual user of IPython - you know some\nof its features, but maybe not all of them and instead of reading\nthrough the documentation, you would prefer to see someone giving an\noverview of IPython features and how you can use them.\n\nThis talk is NOT for you if you are up to date with IPython\ndocumentation and you think you know most of its features.",
  "duration": 2541,
  "language": "eng",
  "recorded": "2019-07-10",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    },
    {
      "label": "slides",
      "url": "https://ep2019.europython.eu/media/conference/slides/cBeHNyZ-wait-ipython-can-do-that.pdf"
    }
  ],
  "speakers": [
    "Sebastian Witowski"
  ],
  "tags": [
    "Best Practice",
    "Development",
    "Ipython",
    "Tooling",
    "iPython"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/3i6db5zX3Rw/maxresdefault.jpg",
  "title": "Wait, IPython can do that?!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3i6db5zX3Rw"
    }
  ]
}
