{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "There are many modern terminal tools with vastly improved user\nexperiences as compared to their traditional alternatives. This talk\naims to show off some of those modern terminal tools and compare them\nside by side with the traditional ones.\n\nPython is not only used by software developers with fancy IDEs but also\nby DevOps engineers, administrators, and on remote development machines\nwhere using a GUI is impractical. Therefore, many people are stuck with\na terminal interface only and have to use tools like vim, grep, find,\nwc, cloc, less and many others to explore their way around their Python\nprograms.\n\nHowever, thanks to the advent of many new and improved tools, we can do\nmany of the same tasks better, faster and with nicer ergonomics.\n\nThis talk will show off effective use of vim as an IDE with completions\nand linting provided by LSP, fd (instead of find) for finding files,\nripgrep (instead of grep) for searching strings, tokei (instead of cloc)\nfor counting lines of code, bat (instead of cat) for looking at files,\nhyperfine for microbenchmarking, httpie (instead of curl) for making\nHTTP requests, sd (instead of sed) for text replacement.\n\nThis talk should make terminal work more approachable for all attendees\nby showing off how to do some everyday tasks on the terminal.",
  "duration": 1836,
  "language": "eng",
  "recorded": "2019-07-10",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    },
    {
      "label": "slides",
      "url": "https://ep2019.europython.eu/media/conference/slides/4mhUEPS-become-a-command-line-wizard.md"
    }
  ],
  "speakers": [
    "Sven-Hendrik Haase"
  ],
  "tags": [
    "Command-Line",
    "Linux",
    "System Administration",
    "Tooling",
    "Unix"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/dnzaIeUgH_4/maxresdefault.jpg",
  "title": "Become a command line wizard",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dnzaIeUgH_4"
    }
  ]
}
