{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "| [Replacement talk]\n| This talk was a replacement for Stanislav Geidl's talk: From legacy\n  code to modern code\n\nHonest apologies to anyone whose expectations were subverted, but\nStanislav fell sick and could not attend. Find the updated abstract\nbelow:\n\nThis talk will describe experiences and lessons learned from tackling\nextremely demanding code. How to bring order to mismanaged code and\nelevate the code base to a standard that's acceptable in today's tech\nenvironment.\n\nPython makes wonderful code accessible at our fingertips, but it also\nallows us to take a lot of liberty. When you start, code is beautiful\nand makes sense. With each step you walk on, you find more and more\nhacks showing up. Eventually, the brilliant codebase you've started with\ncan not be seen under the mud.\n\nNot every code-base can be rewritten, not everything can be redone from\nscratch. Cool libraries often take a lot of liberty with code structure\nand make cross-integration difficult, if not impossible. Tests sound\nideal, but in practice, they're just so hard to make right. Why is this,\nand how to change it?\n\n| The talk will tackle the problems in three parts:\n| - The Easy Wins: What to do to instantly increase the code quality in\n  your organisation. How? Why isn't it enough?\n| - Patterns and Antipatterns: How to identify code that \"smells\", how\n  to replace it? How to integrate into old code, better?\n| - The Philosophy: What approach to set down for the future? Why to\n  care? How to write replace-able code. How to prevent history from\n  repeating.\n\nThe talk will close with audience discussion and experiences, questions\nand proposals - building a collection of some on-premise tips and\ntricks.",
  "duration": 1862,
  "language": "eng",
  "recorded": "2019-07-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    },
    {
      "label": "slides",
      "url": "https://ep2019.europython.eu/media/conference/slides/ciMVMXx-from-legacy-code-to-modern-code.pdf"
    }
  ],
  "speakers": [
    "Tin Marković"
  ],
  "tags": [
    "Architecture",
    "Clean Code",
    "Development",
    "Python 3",
    "legacy-code"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/dF9ZH3_fQ-Y/maxresdefault.jpg",
  "title": "Refactoring in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dF9ZH3_fQ-Y"
    }
  ]
}
