{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "In this demo-driven session, we will introduce the Probo package for\nteaching Python programming and concepts from computational finance to\nbeginning programmers in the domain of finance. We'll show how Python is\nthe perfect tool for teaching computational thinking to develop deeper\nquantitative reasoning. Jupyter notebooks, together with Python packages\nsuch as NumPy and Pandas, provide the ideal learning environment.\n\nWe will start by introducing the Probo package for derivative pricing\nand hedging. We will demo the pricing of European and American options\nvia the famous Black-Scholes option pricing model. Other examples\ninclude Monte Carlo simulation and binomial trees. Using Probo, the\nanswers to derivative pricing problems are right at the students'\nfingertips. Students can operationalize their understanding by going\ndirectly from the mathematics of derivative pricing theories to their\nimplementation in clean and simple code.\n\nWe will end with a demonstration using Probo to teach the concept of\ndynamic hedging. Dynamic hedging is perhaps *the* crucial concept in\nmodern financial derivatives theory. It is also one of the most\ndifficult concepts to grasp. We'll show how developing deeper intuition\nis possible with computational thinking via Monte Carlo simulation of\ndelta-hedging. By leveraging the power and simplicity of Python and\nJupyter notebooks, the Probo package provides the ideal learning\nplatform for students of computational finance.",
  "duration": 1637,
  "language": "eng",
  "recorded": "2019-07-10",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2019.europython.eu/schedule/"
    }
  ],
  "speakers": [
    "Tyler Brough"
  ],
  "tags": [
    "Beginners",
    "Business",
    "Business Cases",
    "Education",
    "Jupyter"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/u3vRpKodgiU/maxresdefault.jpg",
  "title": "Using Python to Teach Computational Finance",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=u3vRpKodgiU"
    }
  ]
}
