{
  "description": "AvoPlot is a simple graphical plotting program created by scientists,\nfor scientists. Born out of the frustrations of a multi-disciplinary\nresearch group working in the lab, the field and a desk, it aims to\nsolve some of the greatest remaining problems in scientific data\nhandling, such as:\n\n* \"I hate programming! I wish I could create an interactive plot of\n  this data file without having to write a script.\"\n* \"This plot that matplotlib created is beautiful! But I wish I could\n  just click and drag that title a bit to the left\".\n* \"I have this great bit of data processing code and I'd like to make\n  it available as a graphical application, but I have neither the time\n  nor the programming ability to do so.\"\n* \"Spreadsheets suck! I want to work with my data in a visual way,\n  rather than having to deal with tables of numbers.\"\n\nBuilt on top of Python's excellent matplotlib plotting library,\nAvoPlot is a graphical plotting tool designed for visualising and\nanalysing scientific data. In addition to providing a graphical user\ninterface to many of the capabilities of matplotlib, it also provides\na plug-in framework, allowing users to extend its standard feature\nset to meet their specific requirements. Plug-ins can be written both\nto import different data sets (e.g. binary data), and to provide\nanalysis tools for working with them (e.g. fitting routines,\nbackground subtraction etc.). This talk will take a light-hearted\nlook at some of the data handling problems encountered by scientists,\nand explain how we have brought together the capabilities of many\nwell established Python packages into a single convenient application\nin an attempt to solve them.\n",
  "duration": 1862,
  "language": "eng",
  "recorded": "2014-02-22",
  "speakers": [
    "Kayla Iacovino"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/_Bm8M9IwuFk/hqdefault.jpg",
  "title": "Life after matplotlib: Harder, Better, Faster, Stronger",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_Bm8M9IwuFk"
    }
  ]
}
