{
  "description": "Today's financial market environment demands for ever shorter\ntimes-to-insight when it comes to financial analytics tasks. For the\nanalysis of financial times series or for typical tasks related to\nderivatives analytics and trading, Python has developed to the ideal\ntechnology platform.\n\nNot only that Python provides powerful and efficient libraries for data\nanalytics, such as NumPy or pandas. With IPython there is a tool and\nenvironment available that facilitates interactive, and even real-time,\nfinancial analytics tremendously.\n\nThe tutorial introduces into IPython and shows, mainly on the basis of\npractical examples related to the VSTOXX volatility index, how Python\nand IPython might re-define interactive financial analytics.\n\nQuants, traders, financial engineers, analysts, financial researchers,\nmodel validators and the like all benefit from the tutorial and the new\ntechnologies provided by the Python ecosystem.\n\nBACKGROUND\n----------\n\nFor background information see the Python-based \"VSTOXX Advanced\nServices\" and the related backtesting applications:\n\n- http://www.eurexchange.com/vstoxx/\n- http://www.eurexchange.com/vstoxx/app1/\n- http://www.eurexchange.com/vstoxx/app2/\n\nTECHNICAL REQUIREMENTS\n----------------------\n\nTo follow the tutorial, you should have installed the Anaconda Python\ndistribution on your notebook. Download and follow the instructions\nhere::\n\n  http://continuum.io/downloads\n\nAfter installation, start IPython from the command line interface/shell\nas follows::\n\n  $ ipython notebook --pylab inline\n\nIPython should then start in your default Web browser.\n",
  "duration": 7511,
  "language": "eng",
  "recorded": "2014-02-21",
  "related_urls": [
    {
      "label": "slides",
      "url": "http://www.hilpisch.com/YH_PyData_Eurex_Tutorial.html"
    }
  ],
  "speakers": [
    "Yves Hilpisch"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/8cGvwHp_BQ0/hqdefault.jpg",
  "title": "Eurex Tutorial - Interactive Financial Analytics with Python and IPython -- With Examples Based on the VSTOXX Volatility Index",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8cGvwHp_BQ0"
    }
  ]
}
