{
  "description": "Devcontainers are an open-source specification, which allow you to connect your IDE to a running Docker container and develop right inside it. This has numerous advantages. Because the dev environment is now formally defined, it is reproducible. This means others can easily reproduce your dev environment, too! This makes it much easier for others to join in on your project, and stay updated with changes to the environment.\n\nIn this talk, you will learn: why you might want to use a Devcontainer for your project (or when not 😉), what exactly a Devcontainer is, and how you can build one for your Python project 🐍.\n\nDevcontainers have been gaining traction lately. Whereas previously the technology existed only in the umbrella of Visual Studio Code, it is now released as an open specification. Such, multiple IDE's could all use the same standard specification, promoting reusability and standardisation. That said, Developers are currently hard at work at pushing the technology to become standardised. Especially for these reasons, this is an exciting time to take a closer look at this new specification, and at what the technology can do for us in general.\n\nSo how will I go about this talk? Let's take a look 🙌🏻.\n\n📝 Talk setup\nLet's learn about Devcontainers together. This will be the setup of my talk:\n\nWhy Devcontainers? What problem do they aim to solve? Pro's & Con's.\nBuilding a basic Devcontainer from scratch\nOpening up the Devcontainer\nExtending the Devcontainer with more useful features\nCustom VSCode settings\nRunning your CI task in the Devcontainer\nConnecting as a non-root user\nOpening up a port to the Devcontainer\nGoing further 🔮\nMore useful links & resources\nConcluding ✓\n🏡 What you will take home\nAt the end of the talk, you will be taking home the following:\n- When it makes sense to create one\n- How you can create one\n- Knowledge on how Devcontainers work\n- A template repo for a Python project Devcontainer",
  "duration": 2161,
  "language": "eng",
  "recorded": "2022-12-02",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/eindhoven2022/"
    }
  ],
  "speakers": [
    "Jeroen Overschie"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/SLsaCdRAV0U/maxresdefault.jpg",
  "title": "How to create a Devcontainer for your Python project",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SLsaCdRAV0U"
    }
  ]
}
