{
  "description": "PyData Eindhoven 2022\n\nWith targeted ads becoming more prevalent in the digital landscape, we share how we used Thompson sampling and a Hierarchical Bayesian Algorithm that makes its own decisions and serves the right ad to the right audience.\n\nIn this talk, we want to share how we used Thompson sampling and self-learning models to improve targeted advertising and create modular ads that learn and adapt based on real-time data. We want to share how we built a model, connected it to real-time data, and set it up so that it can change and improve during, rather than after, a campaign. We also discuss some challenges you might face when using these models and how you can overcome them.\n\nTargeted ads are becoming more prevalent in the digital landscape. These ads can be less intrusive for consumers while at the same time helping businesses reach their preferred audience more effectively. In the current day and age, this also touches upon privacy and the soon-to-be cookieless era of the internet. So how does targeted advertising work with all these changes? Can we scale targeted ads, delivering them to a large audience while keeping them personal and relevant to the individual?\n\nWe made this possible by combining the knowledge of Data Scientists, Machine Learning Engineers, Marketing Specialists, Creative Developers, and Designers. Through this collaboration we built a Hierarchical Bayesian Algorithm that makes its own decisions and serves the right ad to the right audience.",
  "duration": 2430,
  "language": "eng",
  "recorded": "2022-12-02",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/eindhoven2022/"
    }
  ],
  "speakers": [
    "Nico van Engelenhoven",
    "Julien Hamerlinck"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/a0p3_Nfkko0/maxresdefault.jpg",
  "title": "Thompson sampling for personalising a car brands advertisements",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=a0p3_Nfkko0"
    }
  ]
}
