{
  "alias": "video/3231/control-all-your-programs-with-midi-controllers",
  "category": "Kiwi PyCon 2014",
  "copyright_text": "CC",
  "description": "**Audience level**\n\nIntermediate\n\n**Description**\n\nMIDI devices are commonly used to provide input to audio applications,\ne.g. to play a synthesizer via a keyboard or to control a mixer in an\naudio workstation. This talk will show you tools for receiving input and\nprocessing messages, and how to control all of your programs with\nminimal configuration effort, the advantage being that not every single\nprogram has to be made natively MIDI aware.\n\n**Abstract**\n\nThis talk will give a quick overview of the MIDI protocol and\ncontrollers which are commonly used to provide input to audio\napplications. These controllers can have the form of a musical keyboard,\na mixer with knobs, sliders and buttons, or a combination of those. Some\nother variants use touch-sensitive trackpads or look like a drum kit.\nThen, the talk will go over the following tools: Python (duh), mididings\n(to receive and manipulate MIDI messages), xte (send keystrokes and\nmouse events to the Linux Xorg server) and some other necessary programs\nsuch as jackd to virtually connected MIDI inputs and outputs. I'll\ndescribe the steps needed to bring all those tools together and make it\nextensible to (hopefully, eventually) work on other OS as well.\n\nmididings provides a Domain Specific Language (DSL) for MIDI processing\nwhich will be introduced as part of this talk. If you are doing anything\nwith MIDI devices (and other external devices apart from keyboards) and\nfeel like they pose some limitations on you (for example not supporting\ndifferent customisable button assignments on the device), this will be\nof interest to you. xte will be used in a very basic way but if you\nhaven't heard of it and want to send events to your X server, this is a\ngreat program. The possibilities are endless and we haven't even\ncombined all the tools yet. This is about to change in the next step of\nthe talk. A live demo/video will demonstrate how it all comes together\ninto one beautiful piece of ingenuity and software engineering.\n\nFinally, I'll discuss pros and cons of this solution versus other\npossible methods including native MIDI device support for various\nprograms.\n\n**Slides**\n\nhttps://speakerdeck.com/nzpug/tobi-wulff-control-all-your-programs-with-midi-controllers\n",
  "duration": 1800,
  "id": 3231,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-09-13",
  "related_urls": [
    "https://speakerdeck.com/nzpug/tobi-wulff-control-all-your-programs-with-midi-controllers"
  ],
  "slug": "control-all-your-programs-with-midi-controllers",
  "speakers": [
    "Tobi Wulff"
  ],
  "summary": "",
  "tags": [
    "talk"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/p2CsRZoatc8/hqdefault.jpg",
  "title": "Control All Your Programs with MIDI Controllers",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtu.be/p2CsRZoatc8"
    }
  ]
}
