{
  "alias": "video/3225/exploring-the-philosophy-of-programming",
  "category": "Kiwi PyCon 2014",
  "copyright_text": "CC",
  "description": "**Audience level**\n\nIntermediate\n\n**Description**\n\nOne man's journey to internalizing the phrase \"computer programs are\njust bits\". It's merely a phrase, but one that can be deeply appreciated\nif time is taken to appreciate it. Talk will roughly be about bytes,\ntypes, computation theory, language design, and some life stories.\n\n**Abstract**\n\nIt all started with a bunch of Python 3 code written in another\nlanguage. What followed were explorations as to what it really means to\nbe programming. Why are some languages easier to learn (Python)? Why is\nit easier to make mistakes in some languages (JavaScript)? And why are\nsome languages totally alien (APL and its family)?\n\nWhat role does familiarity play in being productive in a language? Why\nare there different paradigms in programming? What about the correctness\nof programs? Is one paradigm more correct than others? This talk\nexplores the history of computer science, programming and the potential\nfor the human race.\n\nUltimately, this talk tries to answer the question: is programming for\nhumans or for machines? And what role Python plays in it. The question\non the future is left to the audience to decide.\n\n**Slides**\n\nhttps://speakerdeck.com/nzpug/xuanyi-chew-exploring-the-philosophy-of-programming\n",
  "duration": 1800,
  "id": 3225,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-09-13",
  "related_urls": [
    "https://speakerdeck.com/nzpug/xuanyi-chew-exploring-the-philosophy-of-programming"
  ],
  "slug": "exploring-the-philosophy-of-programming",
  "speakers": [
    "Xuanyi Chew"
  ],
  "summary": "",
  "tags": [
    "talk"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/hUP27HAtSOc/hqdefault.jpg",
  "title": "Exploring The Philosophy of Programming",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtu.be/hUP27HAtSOc"
    }
  ]
}
