{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": 1800, "video_ogv_download_only": false, "category": "Kiwi PyCon 2014", "speakers": ["Francois Marier"], "title": "External dependencies in web apps: system libs are not that scary", "quality_notes": "", "video_flv_length": null, "recorded": "2014-09-13", "video_mp4_length": null, "description": "= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = \r\nFrancois Marier:\r\nExternal dependencies in web apps: system libs are not that scary\r\n= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = \r\n@ Kiwi PyCon 2014 - Saturday, 13 Sep 2014 - Track 2 \r\nhttp://kiwi.pycon.org/\r\n\r\n**Audience level**\r\n\r\nIntermediate\r\n\r\n**Description**\r\n\r\nGoing to production is very different from setting up a development environment. We have great tools like pip and virtualenv for the latter but they lead to maintenance anti-patterns when they are used for production deployments. We don't \"pip install apache\" and instead leverage the QA and integration work of distro developers, so why not rely on distros for more than just the base system?\r\n\r\n**Abstract**\r\n\r\nToday's web applications often have a lot of external dependencies. Start off with a basic framework, sprinkle a couple of handy plugins or python modules and finish with a generous serving of JavaScript front-end libraries.\r\n\r\nWhat you end up is a gigantic mess of code from different sources which follow very different release schedules and policies. Language-specific package managers can automate much of the dependency resolution and package installation, but you're on your own in terms of integration and quality assurance. Also, the minute you start distributing someone else's code with your project, you become responsible for the security of that external code.\r\n\r\nYou could of course decide to avoid the problem by writing it all yourself from scratch. Realistically though, you're not likely to go past the stage of a toy WSGI app using that approach because it's a lot of work.\r\n\r\nThis talk will examine the decision that the Libravatar [1] project made to outsource much of its maintenance burden to the distro by using system packages for almost everything.\r\n\r\n[1] https://www.libravatar.org/\r\n\r\n**Slides**\r\n\r\nhttps://speakerdeck.com/nzpug/francois-marier-external-dependencies-in-web-apps-system-libs-are-not-that-scary", "video_mp4_url": null, "tags": ["talk"], "copyright_text": "CC", "related_urls": [], "video_flv_download_only": false, "source_url": "http://youtu.be/wfDhGAMPS1g", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://i.ytimg.com/vi/wfDhGAMPS1g/hqdefault.jpg", "video_flv_url": null}