{
  "alias": "video/3232/intro-to-flask-security",
  "category": "Kiwi PyCon 2014",
  "copyright_text": "CC",
  "description": "**Audience level**\n\nIntermediate\n\n**Description**\n\nTurning your web app into a webapp-with-users looks like an onerous\nyak-shaving mission, full of DNS and email configuration, password\ndatabases, and so on. We will use the great flask-security metamodule,\nand a little bit of glue, to show just how easy this formerly-annoying\nprocess can be, from go to whoa.\n\n**Abstract**\n\nSay you’re using Flask, and your happy little app now suddenly needs an\nendpoint user-secured, Because Reasons… what do you do?\n\nEither you hardcode a password in, hook up basic-auth, and go home,\n\nOR, you face the fun of users, roles, the users need to sign up, now\nthey’ve forgotten their passwords again, and so on. There’s really no\nmiddle ground.\n\nGoing from \"open season\" to \"i want this function protected with a role\npermission\" is a big old yak-shaving mission, full of DNS configuration,\nthe dismaying realisation that now your app has to send email, and so\non.\n\nIn the spirit of self-sufficiency and ‘DevOps’, this talk takes you from\na bare 'hello world' flask app, through to a bare 'hello world' app with\nrole protection for endpoints. We’ll start with a domain name and a VPS,\nand end with an app that people can sign up to.\n\nWe'll be using the great flask-security metamodule, and a little bit of\nglue, to show just how easy this formerly-annoying process can be, from\ngo to whoa.\n\n**Slides**\n\nhttps://speakerdeck.com/nzpug/beau-butler-intro-to-flask-security\n",
  "duration": 1800,
  "id": 3232,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-09-13",
  "related_urls": [
    "https://speakerdeck.com/nzpug/beau-butler-intro-to-flask-security"
  ],
  "slug": "intro-to-flask-security",
  "speakers": [
    "Beau Butler"
  ],
  "summary": "",
  "tags": [
    "talk"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/g0bZA9K2A84/hqdefault.jpg",
  "title": "Intro to flask-security",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtu.be/g0bZA9K2A84"
    }
  ]
}
