{
  "alias": "video/3240/java-for-python-developers",
  "category": "Kiwi PyCon 2014",
  "copyright_text": "CC",
  "description": "**Audience level**\n\nIntermediate\n\n**Description**\n\nStop looking at me like that.\n\nNo really. Stop it. I'm serious.\n\nCalling Java APIs from CPython is one of the more interesting challenges\nfacing developers who want to get Python working as a first-class\nlanguage for developing apps for Android.\n\nThis talk looks at solutions, past and present, for making the world of\nJava accessible from Python.\n\n**Abstract**\n\nStop looking at me like that.\n\nNo really. Stop it. I'm serious. Why are you looking so confused?\n\nYes. I'm talking about Java at a Python conference. What of it?\n\nOK, well, I'm actually talking about avoiding having to code in Java,\nwhen circumstances almost certainly require you to code in Java… or at\nleast require your applications to run in a Java environment.\n\nOne of the more interesting challenges for Python developers targetting\nAndroid is being able to call Java APIs from CPython. Environments like\nAndroid require developers to use Java to get access to Android's user\ninterface libraries. Perhaps more importantly, Android has APIs for\naccessing hardware features like accelerometers and geolocation, and\nsoftware features like notifications, but all of these have a Java\ninterface.\n\nThis talk looks at how these problems have been solved, and where they\nhaven't, approaches to solutions that might exist.\n\n**Slides**\n\nhttps://speakerdeck.com/nzpug/christopher-neugebauer-java-for-python-developers\n",
  "duration": 1800,
  "id": 3240,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-09-13",
  "related_urls": [
    "https://speakerdeck.com/nzpug/christopher-neugebauer-java-for-python-developers"
  ],
  "slug": "java-for-python-developers",
  "speakers": [
    "Christopher Neugebauer"
  ],
  "summary": "",
  "tags": [
    "talk"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/RfGldwLoiUk/hqdefault.jpg",
  "title": "Java for Python Developers",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtu.be/RfGldwLoiUk"
    }
  ]
}
