{
  "alias": "video/3214/seize-control-of-your-network-with-ryu",
  "category": "Kiwi PyCon 2014",
  "copyright_text": "CC",
  "description": "**Audience level**\n\nIntermediate\n\n**Description**\n\nRyu is an OpenFlow Network Controller written in Python, which provides\na framework to build your own Software Defined Network (SDN) that can\nrun at full wire speed, using modern network switches. Come learn how to\nleverage Python to instruct your network to filter, switch, and route\ntraffic precisely the way you desire.\n\n**Abstract**\n\nOpenFlow [1] is an industry standard protocol for controlling modern\nnetwork hardware (and software switches -- such as Open vSwitch [2] in\nLinux), down to installing specific forwarding or filtering rules\n(\"flows\") into the hardware forwarding plane. Together with a well\nwritten OpenFlow Network Controller it allows you to create an\nintelligent Software Defined Network (SDN).\n\nRyu [3] is a OpenFlow Network Controller framework, written in Python,\nthat is already extremely capable and still being rapidly developed (new\nreleases every month). It has been adopted by the OpenStack [4] project\namongst many others. Ryu implements the OpenFlow wire protocols and\nallows you to write event driven \"apps\" as Python modules, each running\nin their own eventlet. It comes with lots of examples. Your own apps can\ndictate switch forwarding and filtering policy in advance, or respond to\nnew types of packets as they arrive. This gives you fine grained\nprogrammatic control over your network.\n\nThe talk will provide a brief outline of a how a Software Defined\nNetwork using Openflow works, and an introduction to writing your own\nRyu \"app\" in Python. Plus plenty of pointers so you can get started\nexperimenting yourself. Become the mad genius taking total control of\nyour network!\n\n[1] https://www.opennetworking.org/ [2] http://openvswitch.org/ [3]\nhttp://osrg.github.io/ryu/ [4] http://www.openstack.org/\n\n**Slides**\n\nhttps://speakerdeck.com/nzpug/ewen-mcneill-seize-control-of-your-network-with-ryu\n",
  "duration": 1800,
  "id": 3214,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-09-13",
  "related_urls": [
    "http://openvswitch.org/",
    "http://osrg.github.io/ryu/",
    "http://www.openstack.org/",
    "https://speakerdeck.com/nzpug/ewen-mcneill-seize-control-of-your-network-with-ryu",
    "https://www.opennetworking.org/"
  ],
  "slug": "seize-control-of-your-network-with-ryu",
  "speakers": [
    "Ewen McNeill"
  ],
  "summary": "",
  "tags": [
    "talk"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/JKBQ-2uiwcw/hqdefault.jpg",
  "title": "Seize control of your network with Ryu",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JKBQ-2uiwcw"
    }
  ]
}
