{
  "abstract": "As the old saying goes, “you never get a second chance to make a first\nimpression”. When you first meet someone new (not least at a conference\nfor documentarians!), those first few moments set the tone. In exactly\nthe same way, the experience your user has when they first “meet” your\nproduct and get to grips with it will set the tone for your entire\nrelationship with them.\n\nAs documentarians, we so often focus on building detailed and exhaustive\n“reference” documentation, but in doing that, we forget to provide the\nright kind of “getting started” experience for a user brand new to our\nproduct.\n\nAt GoCardless, we spent the first years of the life of our platform\nfocused on building high-quality reference documentation. But in Summer\n2016, we kicked off a big piece of work on a new set of resources: a\n“getting started” guide for our API, getting the user from\nnought-to-sixty on our developer platform.\n\nTo make the right first impression, we had to turn things on their head\nand think from the reader’s perspective. From this perspective, what\nwe’ll write and build looks very different to our “reference”\ndocumentation, seeking not only to teach the user how to use our\nproduct, but also to explain the fundamental concepts behind it and to\nbring the user to the all-important “aha!” moment where they see the\nvalue in what we’re offering.\n\nIn this talk, I’ll go through:\n\n-  the fundamental differences between “reference” and “getting started”\n   documentation\n\n-  the lessons we learnt on the way as we experimented and spent\n   extensive time with end users\n\n-  what we built\n\n-  the results — from our users’ perspective, and in terms of how we\n   build demand within the company for further “getting started” content\n",
  "copyright_text": null,
  "description": "",
  "duration": 1693,
  "language": "eng",
  "recorded": "2017-09-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2017/schedule/"
    }
  ],
  "speakers": [
    "Tim Rogers"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/wqC88GNujWQ/maxresdefault.jpg",
  "title": "\"You never get a second chance to make a first impression\": writing great \"getting started\" documentation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wqC88GNujWQ"
    }
  ]
}
