{
  "abstract": "Nearly everyone agrees that good documentation is important to the\nsuccess of software projects, and yet very few projects actually have\ngood documentation. Even successful projects often have barely adequate\ndocumentation.\n\nOften, it’s not for want of effort - the project’s developers have\nworked hard on it - nor for lack of documentation - the authors have\nproduced a lot of it.\n\nIt simply turns out to be not very good - not helpful enough for the\nusers who should be able to rely on it, and a depressing chore for the\nauthors who have to maintain it.\n\nThe good news is that both these problems can be solved by understanding\nhow documentation works, and that there are four distinct kinds of\ndocumentation - with four distinct functions. The four kinds of\ndocumentation are:\n\n-  learning-oriented tutorials\n\n-  goal-oriented how-to guides\n\n-  understanding-oriented discussions\n\n-  information-oriented reference material\n\nStructuring documentation according to its four distinct functions helps\nensure that each of them is adequately served. It also makes it far\neasier to write and maintain.\n\nUsing real-life examples I’ll draw out the key functions of\ndocumentation, and how they map onto different ways of writing it.\nPutting this into practice is simple when armed with some basic\nguidelines. The benefits are huge, and available with a minimum of\neffort.\n\nI won’t be discussing documentation tools or software or other topics\nthat have been covered amply elsewhere, but some neglected and\npoorly-understood aspects of documentation that will make your software\nprojects and teams more successful.\n",
  "copyright_text": null,
  "description": "",
  "duration": 1748,
  "language": "eng",
  "recorded": "2017-09-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2017/schedule/"
    }
  ],
  "speakers": [
    "Daniele Procida"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/p0PPtdRHG6M/maxresdefault.jpg",
  "title": "The four kinds of documentation, and why you need to understand what they are",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=p0PPtdRHG6M"
    }
  ]
}
