{
  "abstract": "When starting a new project, developers, myself included, usually get\nright into hacking things, like tinkering with libraries, that we would\nlike to learn or solving a particular problem as quickly a possible.\nOccasionally we also decide to publish the resulting project to a\nsoftware repository such as PyPI for Python or NPM for Node.js etc., so\nthat others can use our nifty code, submit a pull request and maybe even\nform a community around the project.\n\nAs the creator, you might be lucky and someone will find your project on\nthe front-page of GitHub or maybe eben Hacker News or Reddit. What\nhappens next is on you really. But what does that mean?\n\nBefore jumping right to the command line and installing your package,\nthose who are interested usually try to find out what problems the\nproject is solving and how it can help them with their own. That's what\nyour README file is for - it's most likely the first thing potential\nusers read, that you control.\n\nA good README briefly and concisely explains what your software does,\nhow it can be installed and what API it exposes. You also want to\nprovide information on the requirements, the license it uses and how the\nproject is managed. Who are you? How to get in touch to report problems\nand give feedback? Where can potential users find the Code of Conduct\nfor your project?\n\nThis talk is for everyone who is interested in working on open source\nprojects and wants to know how documentation can help newcomers and more\nexperienced users use your code and to encourage them to engage in the\ncommunity.\n",
  "copyright_text": null,
  "description": "",
  "duration": 1509,
  "language": "eng",
  "recorded": "2017-09-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2017/schedule/"
    }
  ],
  "speakers": [
    "Raphael Pierzina"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/0z0jquYos90/maxresdefault.jpg",
  "title": "Hi, my name is README!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0z0jquYos90"
    }
  ]
}
