{
  "abstract": "As a former journalist, I tend to think in terms of storytelling. As an\nopen source evangelist, I invite you to do the same. What you share on\nGitHub tells a story about you, your development practices, and your\nopenness to others in the open source community. If you're motivated to\ngain users, contributors, and positive feedback about your projects,\nthen building a compelling, coherent narrative is essential.\n\nIn this presentation, I'll share insights gained from curating Zalando's\nGitHub repository so we can tell a better story. I'll describe how we've\nused GitHub and other tools to create guidelines and processes that\nbring sanity to our storytelling. And I'll talk about how focusing on\nhigher-quality docs has helped us to instill a stronger product mindset\nin our development teams. Writing a README, for example, offers an\nopportunity to tell the world why a project exists, how it works (and\nwhy), what makes it unique, and how it might evolve over time. I'll\ndiscuss how this process not only empowers developers, but also those of\nus who are technical writers and storytellers—offering several real-life\nexamples to (hopefully) inspire you.\n\nFrom 400+ projects of widely differing quality, reliability and\nmaintenance levels, we've winnowed our OSS offerings at Zalando to make\nour highest- quality work more discoverable and user-friendly. If your\norganization is facing GitHub-bloat challenges, looking for ways to\nmanage your repos more effectively, or wondering how better docs can\nhelp your OSS efforts succeed, you might find some help here.\n",
  "copyright_text": null,
  "description": "",
  "duration": 1882,
  "language": "eng",
  "recorded": "2017-09-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2017/schedule/"
    }
  ],
  "speakers": [
    "Lauri Apple"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/9fq3-U9PKAA/maxresdefault.jpg",
  "title": "Telling a Great Story on GitHub",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9fq3-U9PKAA"
    }
  ]
}
