{
  "description": "\"Constraint-Based Causal Discovery using Partial Ancestral Graphs in the presence of Cycles\n\nJoris M. Mooij (University of Amsterdam)*; Tom Claassen (Radboud University Nijmegen)\n\nWhile feedback loops are known to play important roles in many complex systems, their existence is ignored in a large part of the causal discovery literature, as systems are typically assumed to be acyclic from the outset. When applying causal discovery algorithms designed for the acyclic setting on data generated by a system that involves feedback, one would not expect to obtain correct results. In this work, we show that---surprisingly---the output of the Fast Causal Inference (FCI) algorithm is correct if it is applied to observational data generated by a system that involves feedback. More specifically, we prove that for observational data generated by a simple and sigma-faithful Structural Causal Model (SCM), FCI is sound and complete, and can be used to consistently estimate (i) the presence and absence of causal relations, (ii) the presence and absence of direct causal relations, (iii) the absence of confounders, and (iv) the absence of specific cycles in the causal graph of the SCM. We extend these results to constraint-based causal discovery algorithms that exploit certain forms of background knowledge, including the causally sufficient setting (e.g., the PC algorithm) and the Joint Causal Inference setting (e.g., the FCI-JCI algorithm).\"",
  "duration": 485,
  "language": "eng",
  "recorded": "2020-08-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.auai.org/uai2020/"
    }
  ],
  "speakers": [
    "Joris M. Mooij",
    "Tom Claassen"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/luB-U0iph3k/sddefault.jpg",
  "title": "Constraint-Based Causal Discovery using Partial Ancestral Graphs in the presence of Cycles",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=luB-U0iph3k"
    }
  ]
}
