{
  "description": "Flexible Prior Elicitation via the Prior Predictive Distribution\n\nMarcelo Hartmann (University of Helsinki)*; Georgi Agiashvili (University of Helsinki); Paul Bürkner (Aalto University); Arto Klami (University of Helsinki)\n\n  The prior distribution for the unknown model parameters plays a crucial role in the process of statistical inference based on Bayesian methods. However, specifying suitable priors is often difficult even when detailed prior knowledge is available in principle. The challenge is to express quantitative information in the form of a probability distribution. Prior elicitation addresses this question by extracting subjective information from an expert and transforming it into a valid prior. Most existing methods, however, require information to be provided on the unobservable parameters, whose effect on the data generating process is often complicated and hard to understand. We propose an alternative approach that only requires knowledge about the observable outcomes - knowledge which is often much easier for experts to provide.  Building upon a principled statistical framework, our approach utilizes the prior predictive distribution implied by the model to automatically transform experts judgements about plausible outcome values to suitable priors on the parameters. We also provide computational strategies to perform inference and guidelines to facilitate practical use.\n",
  "duration": 474,
  "language": "eng",
  "recorded": "2020-08-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.auai.org/uai2020/"
    }
  ],
  "speakers": [
    "Marcelo Hartmann",
    "Georgi Agiashvili",
    "Paul Bürkner",
    "Arto Klami"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/qj_xdle1UFQ/sddefault.jpg",
  "title": "Flexible Prior Elicitation via the Prior Predictive Distribution",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qj_xdle1UFQ"
    }
  ]
}
