{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "working with graphs using python and the NetworkX package. This will be\na hands on tutorial and will require writing a lot of code snippets. The\nparticipants should be comfortable with basic python (loops,\ndictionaries, lists) and some(minimal) experience with working inside a\njupyter notebook.\n\nBroadly the tutorial is divided into four parts:\n\n* Part A (20 mins)\n\n  -  Basics of graph theory and various examples of networks in real life.\n  -  Introduction to the NetworkX API and various data structures\n\n* Part B (30 mins)\n\n  -  Work with small synthetic networks (generated using random graph\n     generators) to understand the structure of the network.\n  -  Analyse the network and study various properties of the network like\n     centrality, connectivity, shortest paths, cliques.\n\n* Part C (30 mins)\n\n  -    We'll use the various techniques we have learnt so far and model a\n       network out of real world data like co-authorship network(\n       http://www-personal.umich.edu/~mejn/netdata/cond-mat-2005.zip) and\n       study the structure and properties of this network.\n\n* Part D (10 mins)\n\n  -    We'll work on some interesting problems like temporal networks and\n       visualisation of networks. - We'll model the US Airport Network with\n       respect to time and will try to make sense out of it.\n\nBy the end of the tutorial everyone should be comfortable with hacking\non the NetworkX API, modelling data as networks and basic analysis on\nnetworks using python.",
  "duration": 5545,
  "language": "eng",
  "recorded": "2017-08-31",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://www.euroscipy.org/2017/program.html"
    },
    "https://media.ccc.de/v/esp17-8-networkx"
  ],
  "speakers": [
    "Mridul Seth"
  ],
  "tags": [
    "tutorial"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/iTOC8TQrF_U/maxresdefault.jpg",
  "title": "NetworkX",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iTOC8TQrF_U"
    }
  ]
}
