{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Tutorial prerequisites.\n\nEverybody developing code can profit from a version control system, no\nmatter whether it is code written in Python or any other programming\nlanguage or even a paper written, e.g., in LaTeX. A very popular version\ncontrol system, particularly in the development of open source software,\nis Git which this tutorial will be devoted to. We will explore the basic\nworkflow of code development with Git and also take a look at how code\ncan be developed collaboratively with the help of Github.\n\nWhile the example used to gain experience with the Git workflow will be\nbased on Python code, a knowledge of Python is not strictly required for\nthe purpose of this tutorial.\n\nApart from Python, which is only needed if you want to run the script\nused in the example, you will need the Git software to follow the Git\nworkflow on your computer. See\n`git-scm.com/downloads <https://git-scm.com/downloads>`__ for binaries\nfor Mac OS X and Windows as well as installation instructions for Linux\nand Solaris. There is no need to install a Git GUI as all examples will\nbe demonstrated on the command line.\n\nIf you want to follow along the Github workflow at the end of the\ntutorial, you might want to sign up for Github at\n`github.com <https://github.com>`__. This will require you to choose a\nuser name and a password and to provide your email address. Even if you\ndo not sign up for Github, you will still be able to do most of the\nexamples on your computer.\n\nThe tutorial can be obtained from\n`Github <https://github.com/gertingold/euroscipy-git-tutorial>`__. You\ncan get the LaTeX source and the images by downloading a zip file from\n`Github <https://github.com/gertingold/euroscipy-git-tutorial>`__ or by\ncloning the repository once you have Git installed:\n\n::\n\n      git clone https://github.com/gertingold/euroscipy-git-tutorial.git\n\nA PDF file of the presentation is available from\n`Github <https://github.com/gertingold/euroscipy-git-tutorial/blob/master/presentation.pdf>`__.",
  "duration": 5916,
  "language": "eng",
  "recorded": "2017-08-31",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://www.euroscipy.org/2017/program.html"
    },
    {
      "label": "slides",
      "url": "https://github.com/gertingold/euroscipy-git-tutorial/blob/master/presentation.pdfspeakers:"
    }
  ],
  "speakers": [
    "Gert Ingold"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/mkQzl2v7BuI/maxresdefault.jpg",
  "title": "Git",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mkQzl2v7BuI"
    }
  ]
}
