{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "NumPy\n-----\n\nNumPy forms the basis of the scientific ecosystem of Python by providing\na new data type, the ``ndarray``. This type allows to represent\nmulti-dimensional homogeneous data as they appear in many scientific\napplications in the form of vectors and matrices or, for example,\nimages. The use of NumPy arrays allows to significantly speed up\nnumerical calculations in Python and, in addition, permits to write more\nsuccinct and readable code.\n\nIn this tutorial, we will discuss the basic concepts of ``ndarray``\\ s\nand, in particular, how they can be indexed to efficiently work with\nmulti-dimensional data. We will learn how to manipulate ``ndarray``\\ s\nwith NumPy and explore how typical numerical tasks can be solved either\nwith NumPy or other packages from the Python scientific ecosystem like\nSciPy (which will be covered in more detail in a subsequent tutorial).\n\nA basic knowledge of Python, at least on the level of the introductory\ntutorial on Python, is expected. Some familiarity with the slicing\nsyntax of Python lists will be useful.\n\nFor the NumPy tutorial, it will be sufficient to have installed the\npackages mentioned on the top of this page.\n\nTeaching material is available from\n`Github <https://github.com/gertingold/euroscipy-numpy-tutorial/>`__.\nMake sure that you download the `Jupyter\nnotebook <https://raw.githubusercontent.com/gertingold/euroscipy-numpy-tutorial/master/numpy-tutorial-exercises.ipynb>`__\ncontaining the exercises.",
  "duration": 5517,
  "language": "eng",
  "recorded": "2017-08-31",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://www.euroscipy.org/2017/program.html"
    }
  ],
  "speakers": [
    "Gert Ingold"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/sunNXIxIGV8/maxresdefault.jpg",
  "title": "NumPy (2/2)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sunNXIxIGV8"
    }
  ]
}
