{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "In the 1980s Robert Axelrod invited submissions for a computer tournament in\nwhich people submitted strategies for the Iterated Prisoner's dilemma. This\nis a game in which individuals choose to either cooperate or defect\nwith each other. Since then similar work has been used to understand the\nevolution of cooperative behaviour in an evolutionary setting.\n\nLike a large number of early (and sadly ongoing) research code, the code from\nRobert Axelrod's work was lost. Similar ongoing work is often done with poor\nsustainable practice for the software involved. In 2015, a Python library aiming\nto reproduce Axelrod's work was put on github (the Axelrod library). It has\nsince accumulated more than 200 strategies with contributions from Academics and\nhobbyists alike.\n\nThis vast OPEN treasure trove of game theoretic tools is now being used to\nundertake a number of research projects. Including one that looks at an\nevolutionary process called a Moran Process which is a model of a population in\nwhich the makeup of future generations of the population depend on how well\nindividuals of the current generation perform.\n\nIn 2012 a piece of research claimed that there was no advantage to having long\nmemory of interactions. The work this talk will describe demonstrates how that's\nnot true in evolutionary dynamics. Indeed: complex strategies have been trained\nusing reinforcement learning and the huge number of strategies available through\nthe Axelrod library to perform particularly well.\n\nInteresting behavioural aspects also emerge: without external input, the strong\nstrategies evolve \"handshakes\". These handshakes allow them to recognise friend\nor foe in the population and act accordingly.\n\nThis work not only has implications at a game theoretic and reinforcement\nlearning level but can also help\nunderstand how and why complex behaviour can emerge in evolutionary settings.",
  "duration": 1060,
  "language": "eng",
  "recorded": "2017-08-31",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://www.euroscipy.org/2017/program.html"
    }
  ],
  "speakers": [
    "Vince Knight"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/p4t9dMKxZAo/maxresdefault.jpg",
  "title": "Handshakes, Citizen Science and Evolution",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=p4t9dMKxZAo"
    }
  ]
}
