{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "### Abstract\nRecently, a considerable advancemet in the area of Image Segmentation was achieved after state-of-the-art methods based on Fully Convolutional Networks (FCNs) were developed. The objective of Image Segmentation problem is to label every pixel in the image with the class of its enclosing object or region. This problem is extremely challenging because the method should have strong classification and localization properties at the same time. While being very complicated, image segmentation is an important problem as it has many applications in medicine, autonomous driving and other fields. In our talk, we go through theory of the recent state-of-the-art methods for image segmentation based on FCNs and present our library which aims to provide a simplified way for users to apply these methods for their own problems.\n\n### Detailed description\n\n#### Background\nMethods based on Convolutional Neural Networks (CNNs) have pushed the performance on a broad array of problems, including image classification [(1)][cnn_krizh]  and object detection [(2)][detect_girsh].  ImageNet Large Scale Visual Recognition Competition (ILSVRC) is a main image classification competition. The training data of ILSVRC contains 1000 categories and approximately 1.2 million images and all successful approaches that perform well on this dataset are based on CNNs. Moreover, CNNs that were trained on this dataset act as a good initialization for other tasks as object detection, image segmentation and others [(2)][detect_girsh] [(3)][long_fcn]. \n\nHowever, partial built-in invariance of CNNs to translations, rotations and other transformations made it hard to use pretrained CNNs for the task of image segmentation. While being beneficial for the task of image classification, invariance properties are not beneficial for the task of image segmentation where strong localization propoerties are required [(3)][long_fcn].\n\nRecent work introduced Fully Convolutional Networks [(3)][long_fcn], an adaptation of image classification CNNs that enables to successfully use them for the task of image segmentation while reducing the negative effect of invariance properties. In our talk, we briefly describe basic building blocks of CNNs (convolutional layers, pooling layer, fully connected layers etc.), explain why they show superior performance according to recent papers, explain how these CNNs can be converted into FCNs in order to perform image segmentation. After that we conclude with demonstration of how our library can be used to train FCNs for image segmentation on a particular dataset.\n\n### Talk overview.\n\nWe plan to structure our talk in the following way:\n - Basic building blocks of Convolutional Neural Networks (CNNs) based on \"A guide to convolution arithmetic for deep learning\" resource [(4)][conv_guide].\n - Live demonstration on how these CNNs can be applied for image classification based on our blog post [(5)][cnn_class].\n - Live demonstration and explanation on how CNNs can be converted into FCNs based on our blog post [(5)][cnn_class]. \n - Live demonstration and explanation on how interpolation can be reformulated in terms of convolution and being integrated into the network architecture based on our blog post [(6)][upsampling].\n - Live demonstration and explanation on how FCNs can be trained on the PASCAL VOC general image segmentation dataset based on our blog post [(7)][fcn_training].\n - Demonstration of how our library [(8)][our_library] (implemented using Tensorflow library) was used to train these models for the task of segmentation of medical images based on our recent paper [(9)][our_paper].\n- Demonstration of the same library but ported to PyTorch and why it is easier to use. \n\n\n### Conclusion and discussion\n\nIn our talk, we introduced audience to the recent advancement in the field of image segmentation research, briefly covered the theory behind it and showed how some of the recent state-of-the-art image segmentation methods can be applied to a particular task using our library.\n\n### Biography and additional information\n\nDaniil Pakhomov is a PhD student at Johns Hopkins University. His main research areas are general image segmentation and segmentation of medical images.\n\nContents of our blog posts were well-accepted by machine learning community. Some of them got promotional tweets from the official Kaggle account and others [(10)][twitter]. The author previously gave a talk on EuroScipy 2016 conference [(11)][euro_scipy]. The author has contributed to ```tensorflow/models```, ```Theano``` and ```scikit-image``` repositories. Similar talk by the author was accepted to be presented at Scipy 2017 and this talk is an extended and improved version of it since then.\n\n   [tf_img_segm]: <https://github.com/warmspringwinds/tf-image-segmentation>\n   [long_fcn]: \n<https://people.eecs.berkeley.edu/~jonlong/long_shelhamer_fcn.pdf>\n   [deeplab_fcn]: \n<https://arxiv.org/abs/1412.7062>\n   [cnn_krizh]: \n<http://papers.nips.cc/paper/4824-imagenet-classification-with-deep-convolutional-neural-networks.pdf>\n   [detect_girsh]: <http://www.cv-foundation.org/openaccess/content_cvpr_2014/papers/Girshick_Rich_Feature_Hierarchies_2014_CVPR_paper.pdf>\n   [obj_detect_module]: \nhttps://github.com/scikit-image/scikit-image/pull/1570\n   [conv_guide]: \n<https://arxiv.org/pdf/1603.07285.pdf>\n   [cnn_class]: \n<http://warmspringwinds.github.io/tensorflow/tf-slim/2016/10/30/image-classification-and-segmentation-using-tensorflow-and-tf-slim/>\n   [upsampling]: \n<http://warmspringwinds.github.io/tensorflow/tf-slim/2016/11/22/upsampling-and-image-segmentation-with-tensorflow-and-tf-slim/>\n   [fcn_training]: <http://warmspringwinds.github.io/tensorflow/tf-slim/2017/01/23/fully-convolutional-networks-(fcns)-for-image-segmentation/>\n   [our_paper]: <https://arxiv.org/abs/1703.08580>\n   [our_library]: <https://github.com/warmspringwinds/tf-image-segmentation>\n   [our_library_2]: <https://github.com/warmspringwinds/pytorch-image-segmentation>\n   [twitter]: <https://twitter.com/warmspringwinds>\n   [euro_scipy]: <https://www.euroscipy.org/2016/schedule/sessions/13/>  ",
  "duration": 834,
  "language": "eng",
  "recorded": "2017-08-31",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://www.euroscipy.org/2017/program.html"
    }
  ],
  "speakers": [
    "Daniil Pakhomov"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/0Lc1SsuP8U8/maxresdefault.jpg",
  "title": "Fully Convolutional Networks for Image Segmentation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0Lc1SsuP8U8"
    }
  ]
}
