{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Abstract\n~~~~~~~~\n\nRecently, a considerable advancemet in the area of Image Segmentation\nwas achieved after state-of-the-art methods based on Fully Convolutional\nNetworks (FCNs) were developed. The objective of Image Segmentation\nproblem is to label every pixel in the image with the class of its\nenclosing object or region. This problem is extremely challenging\nbecause the method should have strong classification and localization\nproperties at the same time. While being very complicated, image\nsegmentation is an important problem as it has many applications in\nmedicine, autonomous driving and other fields. In our talk, we go\nthrough theory of the recent state-of-the-art methods for image\nsegmentation based on FCNs and present our library which aims to provide\na simplified way for users to apply these methods for their own\nproblems.\n\nDetailed description\n~~~~~~~~~~~~~~~~~~~~\n\nBackground\n^^^^^^^^^^\n\nMethods based on Convolutional Neural Networks (CNNs) have pushed the\nperformance on a broad array of problems, including image classification\n`(1) <http://papers.nips.cc/paper/4824-imagenet-classification-with-deep-convolutional-neural-networks.pdf>`__\nand object detection\n`(2) <http://www.cv-foundation.org/openaccess/content_cvpr_2014/papers/Girshick_Rich_Feature_Hierarchies_2014_CVPR_paper.pdf>`__.\nImageNet Large Scale Visual Recognition Competition (ILSVRC) is a main\nimage classification competition. The training data of ILSVRC contains\n1000 categories and approximately 1.2 million images and all successful\napproaches that perform well on this dataset are based on CNNs.\nMoreover, CNNs that were trained on this dataset act as a good\ninitialization for other tasks as object detection, image segmentation\nand others\n`(2) <http://www.cv-foundation.org/openaccess/content_cvpr_2014/papers/Girshick_Rich_Feature_Hierarchies_2014_CVPR_paper.pdf>`__\n`(3) <https://people.eecs.berkeley.edu/~jonlong/long_shelhamer_fcn.pdf>`__.\n\nHowever, partial built-in invariance of CNNs to translations, rotations\nand other transformations made it hard to use pretrained CNNs for the\ntask of image segmentation. While being beneficial for the task of image\nclassification, invariance properties are not beneficial for the task of\nimage segmentation where strong localization propoerties are required\n`(3) <https://people.eecs.berkeley.edu/~jonlong/long_shelhamer_fcn.pdf>`__.\n\nRecent work introduced Fully Convolutional Networks\n`(3) <https://people.eecs.berkeley.edu/~jonlong/long_shelhamer_fcn.pdf>`__,\nan adaptation of image classification CNNs that enables to successfully\nuse them for the task of image segmentation while reducing the negative\neffect of invariance properties. In our talk, we briefly describe basic\nbuilding blocks of CNNs (convolutional layers, pooling layer, fully\nconnected layers etc.), explain why they show superior performance\naccording to recent papers, explain how these CNNs can be converted into\nFCNs in order to perform image segmentation. After that we conclude with\ndemonstration of how our library can be used to train FCNs for image\nsegmentation on a particular dataset.\n\nTalk overview.\n~~~~~~~~~~~~~~\n\nWe plan to structure our talk in the following way:\n\n-  Basic building blocks of Convolutional Neural Networks (CNNs) based\n   on \"A guide to convolution arithmetic for deep learning\" resource\n   `(4) <https://arxiv.org/pdf/1603.07285.pdf>`__.\n-  Live demonstration on how these CNNs can be applied for image\n   classification based on our blog post\n   `(5) <http://warmspringwinds.github.io/tensorflow/tf-slim/2016/10/30/image-classification-and-segmentation-using-tensorflow-and-tf-slim/>`__.\n-  Live demonstration and explanation on how CNNs can be converted into\n   FCNs based on our blog post\n   `(5) <http://warmspringwinds.github.io/tensorflow/tf-slim/2016/10/30/image-classification-and-segmentation-using-tensorflow-and-tf-slim/>`__.\n-  Live demonstration and explanation on how interpolation can be\n   reformulated in terms of convolution and being integrated into the\n   network architecture based on our blog post\n   `(6) <http://warmspringwinds.github.io/tensorflow/tf-slim/2016/11/22/upsampling-and-image-segmentation-with-tensorflow-and-tf-slim/>`__.\n-  Live demonstration and explanation on how FCNs can be trained on the\n   PASCAL VOC general image segmentation dataset based on our blog post\n   `(7) <http://warmspringwinds.github.io/tensorflow/tf-slim/2017/01/23/fully-convolutional-networks-(fcns)-for-image-segmentation/>`__.\n-  Demonstration of how our library\n   `(8) <https://github.com/warmspringwinds/tf-image-segmentation>`__\n   (implemented using Tensorflow library) was used to train these models\n   for the task of segmentation of medical images based on our recent\n   paper `(9) <https://arxiv.org/abs/1703.08580>`__.\n-  Demonstration of the same library but ported to PyTorch and why it is\n   easier to use.\n\nConclusion and discussion\n~~~~~~~~~~~~~~~~~~~~~~~~~\n\nIn our talk, we introduced audience to the recent advancement in the\nfield of image segmentation research, briefly covered the theory behind\nit and showed how some of the recent state-of-the-art image segmentation\nmethods can be applied to a particular task using our library.\n\nBiography and additional information\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nDaniil Pakhomov is a PhD student at Johns Hopkins University. His main\nresearch areas are general image segmentation and segmentation of\nmedical images.\n\nContents of our blog posts were well-accepted by machine learning\ncommunity. Some of them got promotional tweets from the official Kaggle\naccount and others `(10) <https://twitter.com/warmspringwinds>`__. The\nauthor previously gave a talk on EuroScipy 2016 conference\n`(11) <https://www.euroscipy.org/2016/schedule/sessions/13/>`__. The\nauthor has contributed to ``tensorflow/models``, ``Theano`` and\n``scikit-image`` repositories. Similar talk by the author was accepted\nto be presented at Scipy 2017 and this talk is an extended and improved\nversion of it since then.",
  "duration": 834,
  "language": "eng",
  "recorded": "2017-08-31",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://www.euroscipy.org/2017/program.html"
    }
  ],
  "speakers": [
    "Daniil Pakhomov"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/0Lc1SsuP8U8/maxresdefault.jpg",
  "title": "Fully Convolutional Networks for Image Segmentation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0Lc1SsuP8U8"
    }
  ]
}
