{
  "description": "Organizing Python events with the aim of setting up a Python community in a collapsed economy, without an open source software development house is not an easy task. In this talk, we share the journey we have traveled trying to set up a community that defies the existing norms/culture in the IT sector in Zimbabwe. We share the experiences and the challenges we faced in setting up a Python community in Zimbabwe as well as the sacrifices we have had to make to ensure PyCon Zimbabwe would take place. In our talk, we also elaborate why the lack of know-how and information can hinder the growth of a community. We also share our successes and the milestones we have managed to reach in establishing our community. We also share on the importance of support from established communities and the impact it has on an emerging community. The aim of our talk is to share the challenges faced by developers in developing countries and convince participants on how they can contribute to OSS communities in developing countries and why they should. By the end of this talk, participants should understand why understanding the context is so important in promoting the growth of communities outside their own region. In the end, we hope to convince the audience why we felt travelling a road trip of more than 33hrs was worth the while. We will conclude by sharing with the audience what we feel should be the future of open source in Zimbabwe and Africa.",
  "duration": 2484,
  "language": "eng",
  "recorded": "2017-04-03",
  "related_urls": [
    {
      "label": "slides",
      "url": "https://speakerdeck.com/amakarudze/setting-up-a-python-community-in-zimbabwe-djangocon-europe-2017"
    }
  ],
  "speakers": [
    "Anna Makarudze",
    "Humphrey Butau"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Y298EgZJMow/hqdefault.jpg",
  "title": "Setting up a Python Community in Zimbabwe",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Y298EgZJMow"
    }
  ]
}
