{
  "description": "I have created a web application that provides a stand to women's to share their story. So that government organization helps them to file cases. They will also be provided legal help through SMS or E-mail portal after sign- up. It's a Normal Django App. Codechef and AAP uses an open source forum to discuss things, So I am using that in this app. Use of PostgreSQL 9.6.1 for the database. Federated knOwledge eXtraction Framework for RDF extraction from text based on Ensemble Learning. \nSo this application help's us highlighting how one can learn about the different ways to use the power of Django to impact billions of people in the world. What happens here is the victim has to report the same thing to many people. When she goes to Police station, to the doctor, to her lawyer, she was being told to narrate the same story to everyone in the court and many other places like lawyers, doctors... This is the most quintessential problems women faces. In police station also she needs to report it to many people.\n\nMany women who have been stigmatized feel as though they are transforming from a whole person to a tainted one. They feel different and devalued by others. We can have a common place where we can ask a set of questions to her, once she will answer that we can send the set to all the concerned people. She will just ask their numbers or Mail ID's and click on a button in our web app and write the mail id or number and our web app will send the information to all intended person. A common platform, where women being anonymous will be able to share about experiences that they had. Inside some company, about some person. They will enter the story, location, gender, and some more specific things while writing their story. Based on that we will generate a map, as many plots as possible. Another woman can simply search for that location or company and can find what all bad things happen there. She can request the writer contact or mail, we will then send a mail asking the writer if we can leak and try to setup a connection between the two.",
  "duration": 1084,
  "language": "eng",
  "recorded": "2017-04-05",
  "related_urls": [
    {
      "label": "slides",
      "url": "https://speakerdeck.com/khushbuparakh/solidarity-of-systers"
    }
  ],
  "speakers": [
    "Khushbu Parakh"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/RJRbcvv6UEM/hqdefault.jpg",
  "title": "Solidarity of Systers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RJRbcvv6UEM"
    }
  ]
}
