{
  "description": "Filmed at PyData London 2017\nwww.pydata.org\n\nDescription\nDeep Learning taken world by storm in recent years, and most of the time it's powered by Python language. Working with 3D data is computationally demanding even by most powerful GPUs. A lot of times 3D data is in sparse form, or can be turned without loosing too much of it's usefulness. We combined high performance of CUDA library with ease of use and power of Python by getting good with Cython.\n\nAbstract\nWe live in great time for development of Machine Learning algorithms. There is an abundance of ways to implement models, a lot of them are in Python or have a python API. Python is a great way to implement high level APIs and connect your code to other parts of data processing. Learning how to write in Theano or Tensorflow can be very helpful for most of the people facing problems with complex data. But for a niche area like Deep Learning for sparse 3D data there was no solutions. Our python module enables creation of deep neural networks to process sparse data quickly using combination of Python and fast C++/CUDA code underneath. In my talk I'll explain how to connect high performance code with practical user level abstractions using Cython, as it was done in our project.\n\nYou can see code in a github repository or checkout our paper.\nhttps://github.com/gangiman/PySparseConvNet\nhttps://arxiv.org/abs/1611.09159\n\nPyData is a gathering of users and developers of data analysis tools in Python. The goals are to provide Python enthusiasts a place to share ideas and learn from each other about how best to apply our language and tools to ever-evolving challenges in the vast realm of data management, processing, analytics, and visualization.\n\nWe aim to be an accessible, community-driven conference, with tutorials for novices, advanced topical workshops for practitioners, and opportunities for package developers and users to meet in person.",
  "duration": 2583,
  "recorded": "2017-05-07",
  "speakers": [
    "Alexandr Notchenko"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/_tSoR3bQQQM/hqdefault.jpg",
  "title": "Analyzing 3D objects with power of Deep Learning and Cython",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_tSoR3bQQQM"
    }
  ]
}
