{
  "description": "Filmed at PyData 2017\n\nDescription\nIntroducing the basics of Natural Language Processing using Python NLTK and Machine Learning packages to classify language in order to create a simple Q&A bot.\n\nAbstract\nWorking code samples and a basic ChatBot framework (written in Python) will be provided and explained so that a simple Q&A bot that learns from previous experience and responds to questions with appropriate answers can be created. In this talk we will cover:\n\nBuild a basic ChatBot Framework using core Python and a SQL database.\nDemonstrate and experiment with a Learning-by-Example bot using ranking functions in Python and SQL to get some basic chat functionality working.\nIntroduce the Python NLTK to extract features from the chat sentences and words stored in the chatbot database.\nWork through a feature engineering example using NLTK and Sci-Kit and Numpy to show how we can classify sentences using Supervised Learning and estimate the accuracy of our classification model.\nApply the sentence classification ML model to our chatbot engine to target responses more accurately.\nPrerequisites\n\nAttendees will need:\n+ Anaconda for Python 3.5 or 3.6\n+ NLTK (Python Natural Language Toolkit - pip install nltk)\n+ The Stanford Java CoreNLP Parser (https://stanfordnlp.github.io/CoreNLP/ or wget http://nlp.stanford.edu/software/stanford-corenlp-full-2016-10-31.zip and un-zip)\n+ Java rel 8\n\nTheoretically all of this could be installed on the day but it would just help to save time by preparing in advance. Most of what I am demonstrating will probably work against Python 2.7, but it hasn’t been tested with 2.7.\n\n",
  "duration": 5469,
  "language": "eng",
  "recorded": "2017-05-05",
  "speakers": [
    "Edward Bullen"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/S-RLVBz3CrM/hqdefault.jpg",
  "title": "Building a ChatBot with Python, NLTK and scikit",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=S-RLVBz3CrM"
    }
  ]
}
