{
  "description": "Description\nMechanical ventilators are widely used in intensive care, they are sophisticated but Doctors do not have time to analyse the copious traces of data in a neonatal unit. We are providing an easy-to-interpret summary of this time-series data using visualisation and machine learning. This is an open source collaboration with the NHS, All results are open.\n\nAbstract\nMechanical ventilators are widely used in intensive care. Even two decades ago they were be primarily mechanical devices whose \"only\" task was to inflate the patient’s lung. Recently, however, they have become equipped with powerful computers that provide sophisticated ventilator modes. Data provided by the ventilators are almost never downloaded, stored or analysed. The data is complex, high frequency and requires time-intensive scrutiny to review. Doctors do not have time to analyse these traces in a neonatal unit.\n\nWe are providing a simple and easy-to-interpret summary of 100Hz dual-channel ventilator data to improve the quality of care of young infants by time-poor staff. This involves signal processing, visualisation, building a gold standard and machine learning to segment breaths and summarise a baby's behaviour. This builds on our talk at PyDataLondon Meetup 30 in January 2017. Our goal is to open source the research so that others can benefit from the processes that we develop. We invite feedback from the audience to help improve our methods.\n\nAnyone interested in time series data, automated labeling, scikit-learn, Bokeh and medical applications will find this talk of interest. Both the highs and lows of our current approaches will be discussed.\n\nThis is a collaboration between Dr Gusztav Belteki (Cambridge University Hopsitals NHS Foundation Turst), Ian Ozsvald (ModelInsight) and Giles Weaver (ModelInsight).\n",
  "duration": 2495,
  "language": "eng",
  "recorded": "2017-05-06",
  "speakers": [
    "Ian Ozsvald",
    "Dr Gusztav Belteki",
    "Giles Weaver"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/IrX2e-H5Ihw/hqdefault.jpg",
  "title": "Machine learning with ventilator data to improve reporting on critically ill newborn infants",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IrX2e-H5Ihw"
    }
  ]
}
