{
  "description": "Filmed at PyData London 2017\n\nDescription\nLearn how Jupyter Notebooks are a highly beneficial tool for modern geospatial data analysis and for creating reproducible workflows, both for web-based access of large geospatial data and its effective manipulation and geospatial data visualisation with bokeh or jupyter widgets.\n\nAbstract\nJupyter Notebooks benefit geospatial data analysis in multiple ways since geo data access, manipulation and (interactive) visualisation can be combined in one workflow and programming environment.\n\nThis tutorial session presents practical examples of workflows with Jupyter Notebooks for Earth Observation and Climate data analysis. An introduction to Python’s owslib package is given, which will showcase how standardised web services provide a time and cost-efficient way to access and process large volumes of environmental data. Hands-on examples will show how terabytes of open environmental data can be accessed, manipulated and visualized within one workflow without requiring data download. Different Python packages for data visualisation and geospatial data analysis will be harnessed.\n\nThe first part of the tutorial is a walk-through session, where participants are able to run the example workflows alongside. In a second part, the participants will get challenged to setup their own geospatial workflow, from data access and manipulation up to data visualization, based on the tools and data services that were presented during the walk-through session\n\nSession participants require their own laptop with Jupyter installed. We are investigating the feasibility of setting up mybinder or JupyterHub for this workshop. Notebooks will be provided.",
  "duration": 5205,
  "recorded": "2017-05-05",
  "speakers": [
    "Julia Wagemann",
    "Stephan Siemen"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/WpVm54SHoNw/hqdefault.jpg",
  "title": "Jupyter Notebooks for geospatial data analysis",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WpVm54SHoNw"
    }
  ]
}
