{
  "description": "Filmed at PyData London 2017\nwww.pydata.org\n\nDescription\nThe Milky Way is your average galaxy. There are thousands of them out there. Just like a medium size company. Not too young, not too old but has its own set of unique challenges no one ever mentioned. Hard earned lessons of moving from Academia to data science in industry in your average sized company.\n\nAbstract\nWhat happens when you move to a company which is no longer a start-up but still not established? When I moved to Data science, I choose a company which had been around for 10 years, as a small-medium sized Enterprise (SME) but the data science team was brand new (and both of us had moved from academia for this, our first data science job). You don't have the excitement of a start-up: everything is new, let's try that, you can build the structures from the ground up. You don't have the structures of a bigger older company: there are things in place for you to work with, you know what's expected. Instead you have the best and worst of both worlds: starting a data team but no one understands how to use data. You get to put those structures in place, but have to shoe horn them into everyone else's. But middle sized companies are like our Milky Way in many ways: numerous, survive in many different environments, and you find them everywhere! So what can you use from academia? Some things (like being able to communicate with a wide range of people) will be exceptionally useful. In a SME you will be expected to do this straight away, more than you might in a large company and with more people than you would find in a start-up. But you have a great mixture of guidance (like from a large company) and leeway to invent (like from a start-up) on projects but you need to prove your worth quickly, which means creating useful products. So you need to break that habit of spending hours researching and not getting anything \"done\". So here are some lessons learnt about the differences and how to use your academic experience to get the best of both worlds, not the worst",
  "duration": 2082,
  "recorded": "2017-05-07",
  "speakers": [
    "Kathryn Harris"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/5RfoyhWdm3k/hqdefault.jpg",
  "title": "Astrophysics to data Science: how the Milky Way is like my company.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5RfoyhWdm3k"
    }
  ]
}
