{
  "description": "Description\nRisk management is paramount to any lending institution, allowing it to perform well-informed decisions while originating loans. In this talk, I will describe our research and development approach to build our Credit Risk Prediction Model. I will browse over our target definition, feature optimisation, model building and tuning and our experience with model stacking.\n\nAbstract\nCredit Risk assessment is a general term used among financial institutions to describe the methodology used to determine the likelihood of loss on a particular asset, investment or loan. The objective of assessing credit risk is to determine if an investment is worthwhile, what steps should be taken to mitigate risk, and what the return rate should be to make an investment successful.\n\nBuilding a Credit Risk Prediction Model as accurate as possible becomes essential, as it allows the institution to provide fair prices to the customers while ensuring predictable and minimal losses. We build our Credit Risk Model by combining data gathered from the customer’s application on our online platform with their credit history provided by different credit agencies.\n\nIn this talk, we will cover the research and development behind our recently created Credit Risk Model. We will discuss the definition of the target, the variable selection procedure, the different machine learning models built and how we optimise their hyper-parameters, as well us some of our latest research in model stacking and deep learning.\n\nOur development and Modelling pipeline is built in Python, using Pandas, Numpy, Scikit-Learn, XGBboost, Keras, Matplotlib and Seaborn. We combine the use of machine learning algorithms with data visualisation to better understand the variables and our customers, and to convey the message to different stakeholders within and outside the company. Throughout the talk, we will focus both on the intellectual rationale of the research and the utilisation of the different python tools to accomplish each task, highlighting both the problems encountered and the solutions devised.\n\n",
  "duration": 2333,
  "language": "eng",
  "recorded": "2017-05-06",
  "speakers": [
    "Soledad Galli"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/KHGGlozsRtA/hqdefault.jpg",
  "title": "Machine Learning in Financial Credit Risk Assessment",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KHGGlozsRtA"
    }
  ]
}
