{
  "description": "Filmed at PyData London 2017\n\nDescription\nThe Data Science and Analytics group at Pirelli has to deal with factories' day to day that can't be further from the aseptic crunching of data from a keyboard in an office. Our group took the lift, went down at shop floor and started asking questions to try and make their life better: turns out questions flowed the other way round and results were startling.\n\nAbstract\nPirelli has a 140 year old tradition of manufacturing with 20 factories across 14 countries and headquarter office in Milan. Production flows, logistic, machinery and the whole extended value chain has morphed through decades across a broad range of needs and circumstances.\n\nThe creation of a Data Science and Analytics department at the beginning of 2016 has the goal of speeding up change and innovation, starting from areas that are harder to tackle. Some of the most interesting challenges include:\n\nbring data products at shop floor to increase efficiency while being aware of UX principles\nkeep 2-sided communication alive with wide number of actors, particularly with IT, quality and engineering\nencourage active participation by providing accessible analytics tools and an internal Academy training program\nactivate the virtuous circle of prototyping, feasibility check and production releases for sound product lifecycles\nintroduce Agile development methodologies in traditional waterfall environments\nshape a roadmap with principal stakeholders starting from off-line through live analysis and heading to ahead-of-time predictions\nopening a steady communication channel across groups is progressively eroding barriers between white and blue collars, allowing teams to better understand each other requirements and kicking off a broader conversation. At the end of the first year since releasing the first prototype, there is much more on the plate, and groups are now more familiar with concepts of User Experience, release lifecycle, data exploration and agile development.",
  "duration": 2378,
  "language": "eng",
  "recorded": "2017-05-06",
  "speakers": [
    "Thomas Alisi"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/YTuEYoPVlQ4/hqdefault.jpg",
  "title": "Show me the failures! Data products for manufacturing at shop floor",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YTuEYoPVlQ4"
    }
  ]
}
