{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "DjangoCon 2011", "speakers": ["Idan Gazit"], "title": "Benevolent Designer For Life's Keynote - Designers Make It Go to Eleven", "quality_notes": "", "video_flv_length": null, "recorded": null, "video_mp4_length": null, "description": "Benevolent Designer for Life's Keynote: Designers make it go to eleven\n\nPresented by Idan Gazit\n\nThe open-source world is and always has been focused on code; attention and\nrespect doled out in exchange for patches. As a result, many open-source\nprojects want for design love but don't know how to secure it. We scare off\npotential contributors from the many fields beneath the aegis of \"design\":\nuser experience, user interfaces, usability, interaction design, information\narchitects, graphic design, typography, and other roles assumed by the authors\nof our markup and styling. Django can be a model citizen among open-source\nprojects in changing these attitudes and coaxing contributors out of the\nwoodwork -- not just for the benefit of the framework, but for the\nconstellation of 3rd party apps which make Django great. Other FOSS\ncommunities have made efforts that we can learn from, and the fight to change\nperceptions is less uphill than you might think. This talk will cover: -\nMisconceptions of \"Design.\" What is design, and what do designers do? - A\nbrief trip down memory lane, and how Django came to be relatively designer-\nfriendly. - \"I don't get it: what is the BDesignFL role?\" - Process and tools:\nHow can Django better engage designers, for core's benefit and for the benefit\nof _your projects_. How can we help these contributors get over the \"suck\"\nthreshold? - What parts of core are ripe for love from designers? What 3rd\nparty projects?\n\n", "video_mp4_url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/djangocon-2011/84_benevolent-designer-for-life-s-keynote-designers-make-it-go-to-eleven.m4v", "tags": ["design", "djangocon", "djangocon2011", "ui", "ux"], "copyright_text": "", "related_urls": [], "video_flv_download_only": false, "source_url": "", "video_webm_url": null, "video_ogv_length": 105739185, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://a.images.blip.tv/Robertlofthouse-BenevolentDesignerForLifesKeynoteDesignersMakeItGoToE975-385.jpg", "video_flv_url": null}