{
  "id": 3328, 
  "category": "EuroScipy 2014", 
  "slug": "plotly-collaborative-python-and-matplotlib-plotti", 
  "title": "Plotly Collaborative Python and Matplotlib Plotting", 
  "summary": "Plotly's Python API and sandbox let you make and share beautiful, web-based plots. This talk will be a walk-through of Plotly's library. We will craft and embed interactive graphs within an IPython Notebook from our gallery, use Plotly's GUI to edit and share graphs, and use Plotly's matplotlib wrapper to create web-based graphs and data files from matplotlib scripts. ", 
  "description": "## Plotly: GitHub for Data and Graphs\r\n\r\n[Plotly](https://plot.ly/) is an online plotting platform. Think of it like GitHub, but for sharing data, graphs, and scripts for plotting. Plotly has a GUI and APIs for making graphs with Python, R, MATLAB, Perl, Julia, Arduino, Ruby, Raspberry Pi, and REST. The APIs let users make and share web-based graphs and interface a desktop environment with Plotly. Public sharing is free, users own their data, and users control whether data and graphs are public or private. Plotly also always pairs data and graphs, and lets you import by uploading or [live-streaming](https://github.com/plotly/Streaming-Demos).\r\n\r\n## What We'll Build\r\n\r\nPlotly allows users to make graphs with the GUI, Python, or other programming languages. We will make a number of beautiful graphs. We will make graphs with Python, share a graph, and then edit with the GUI or another programming language of choice. We will also uses Plotly's [matplotlib wrapper](http://nbviewer.ipython.org/github/plotly/IPython-plotly/blob/master/See%20more/Plotly%20and%20mpld3.ipynb) to make web-based Plotly graphs from matplotlib figures.\r\n\r\nWe will add data to a pre-existing graph, making a new version and always reverting back to previous versions. We will make a graph and store scripts, data sets, graphs, and past versions of files in Plotly.\r\n\r\nAuthors, and journalists from the and Wired Science use these Plotly features and the capacity to embed graphs in an iframe. We will conclude by showing how to optimize your embedding.\r\n\r\nMore examples can be found at <https://plot.ly/python/>.", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "youtube", 
  "thumbnail_url": "https://i.ytimg.com/vi/DObmPAtuNw0/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=DObmPAtuNw0", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=DObmPAtuNw0", 
  "tags": [], 
  "speakers": [
    "Matthew Sundquist"
  ], 
  "recorded": "2014-10-22"
}