{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroScipy 2014", "speakers": ["Giannis Ashiotis", "Jerome Kieffer"], "title": "PyFAI: a Python library for high performance azimuthal integration on GPU", "quality_notes": "", "video_flv_length": null, "recorded": "2014-10-22", "video_mp4_length": null, "description": "In the field of X-Ray diffraction, 2D area detectors like ccd or pixel detectors have become popular in the last 15 years for diffraction experiments thanks to the large solid-angle coverage and to their better signal linearity. These detectors have a large sensitive area of millions of pixels with high spatial resolution and are getting fast: one kilo-Hertz is expected this year. The software package pyFAI we present here has been designed to reduce X-ray 2D-diffraction images into 1D curves (azimuthal integration) usable by other software for in-depth analysis such as Rietveld refinement, ... Other averaging patterns like 2D integration, image distortion, ... are also available. PyFAI is a library featuring a clean pythonic interface and aiming at being integrated into other software. But it also needs to cope with the data deluge coming from the detector...\r\n\r\nIn this contribution, we would like to highlight the performance reached by this library. To get today’s computers best performances, one needs to have parallelized code and azimuthal integration is not directly parallelizable. After a scatter-to-gather transformation of the algorithm, it got parallel (Cython implementation). Other optimizations have been used to get the best performances out of GPU (compensated summation, partial parallel reductions, ...). ", "video_mp4_url": "", "tags": [], "copyright_text": "youtube", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=QSlo_Nyzeig", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/QSlo_Nyzeig/hqdefault.jpg", "video_flv_url": ""}