{
  "description": "Cleanroom software engineering process is a software development process developed at IBM intended to produce software with a certifiable level of reliability. A principal objective of the Cleanroom process is development of software that exhibits zero failures in use. In this workshop we will review how to implement it in a project with the help of Django.\n\nThe Software Engineering Institute defines the Cleanroom software engineering as \"a theory-based team-oriented process for development and certification of high-reliability software systems under statistical quality control. A principal objective of the Cleanroom process is development of software that exhibits zero failures in use. The Cleanroom name is borrowed from hardware Cleanrooms, with their emphasis on rigorous engineering discipline and focus on defect prevention rather than defect removal. Cleanroom combines mathematically based methods of software specification, design, and correctness verification with statistical, usage-based testing to certify software fitness for use. Cleanroom projects have reported substantial gains in quality and productivity. \"\n\nThis method was widely adopted in the 90's by organizations like IBM, Ericsson or the US Army with up to 20x gains in quality and 4.6x gains in productivity. It can be used for current technology projects, but it needs the help of tools like Django for implementing it in an organization.\n\nIn this workshop we will learn about this method and then we will do a practical exercise, first with basic tools and then using Django.",
  "duration": 3458,
  "language": "eng",
  "recorded": "2021-06-04",
  "related_urls": [
    {
      "label": "Talk announcement",
      "url": "https://2021.djangocon.eu/cfp/talk/SXFXBF/index.html"
    }
  ],
  "speakers": [
    "Francisco J. López-Lira Hinojo"
  ],
  "tags": [
    "Django",
    "DjangoConEU",
    "djangoconeu2021"
  ],
  "thumbnail_url": "https://img.youtube.com/vi/kkeL9Uha0es/0.jpg",
  "title": "Cleanroom Software Engineering with Django",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kkeL9Uha0es"
    }
  ]
}
