{
  "description": "\n\nSketchnoting is the process of taking visual notes by combining symbolic illustrations and text. In this workshop we will learn the basics of sketchnoting first. And then we will make visual notes about Django concepts! Grab a pencil and some paper, and let's sketch!\n\nIn this workshop we will learn some easy drawing skills we can use for illustrating tech concepts (or anything else). Sketchnoting, the combination of text and simple, symbolic drawings is a great way to express ideas. Requirements, user stories, notes of meetings, talks, articles or tutorials, all can become much more engaging with a few extra illustrations. Though developers (and people in general) often think they can't draw, there are some easy tricks everyone can learn. In addition, drawing things is a really fun way to spend your time!\n\nAfter a short intro of what sketchnoting is (5 min), we go over 4 tips for sketching practice:\n\n    I can't draw this: composition and googling (5 min)\n    drawing people fast and easy (5 min)\n    putting text in boxes (5 min)\n    faces and emotions (5 min)\n\nWe will continue with a couple of drawing challenges (10 min), where I will show how to quickly sketch some easy and more difficult concepts.\n\nThe last 25 minutes will encourage the attendees to illustrate a Django concept on their own, with guidance and support from myself.\nThis can be the take aways of a Djangocon talk, a concept they recently learned, an illustration to a blogpost or podcast, tips on how to make the most out of an online conference...\n\nThis workshop intends to appeal to an audience of all backgrounds and skill levels. On top of that, the content will be appropriate for all ages, so you can draw along with your kids! By the end of this talk, attendees will have some inputs to be creative with pen and paper, and have learned some of the skills that go with it.",
  "duration": 2272,
  "language": "eng",
  "recorded": "2021-06-02",
  "related_urls": [
    {
      "label": "Talk announcement",
      "url": "https://2021.djangocon.eu/cfp/talk/UQVXM9/index.html"
    },
    {
      "label": "Tutorial",
      "url": "https://github.com/djangocon/2021.djangocon.eu/blob/static_dump/cfp-media/tutorial.pdf?raw=true"
    },
    {
      "label": "Presentation",
      "url": "https://github.com/djangocon/2021.djangocon.eu/blob/static_dump/cfp-media/Sketchnote_talk.pdf?raw=true"
    }
  ],
  "speakers": [
    "Sara Peeters "
  ],
  "tags": [
    "Django",
    "DjangoConEU",
    "djangoconeu2021"
  ],
  "thumbnail_url": "https://img.youtube.com/vi/Xn6F0wT405Q/0.jpg",
  "title": "Django Sketchnoting Challenge",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Xn6F0wT405Q"
    }
  ]
}
