{
  "description": "\n\nBy the end of this class you will have the tools to teach Python, Jinja2 and web development to a class of remote students.\n\nThere are many excellent free resources for learning Python, but the Forest Wiki is the only free resource for teaching Python, Jinja2 and web development in the browser.  The Forest Wiki understands and respects the relationship between the teacher and a class of students.  \n\nHere is the demo for teaching turtle graphics.\n\nHere is the cPython in the Browser Demo.\n\nThe teacher sets the assignments, the students do them.   Even when the students are working from home, the teacher can monitor their progress. If there is an issue, or during grading,  the teacher can privately comment on that student's work.    When the time is right, the teacher can check a box to publish the answers.  When the time is up, the teacher can check another box to limit new submissions.\n\nJust to be clear, this tutorial is not about teaching you Python and web development. It is about training the teachers. It is assumed that you already know some Python and HTML. And yes, you will learn some Turtle graphics and Jinja2. But in the class the focus will be on teaching someone else. We will break out into groups of 2 and take turns being the teacher and the student.\n\nNo need to install anything for this class. All exercises will be done in the browser using Skulpt, and Pyodide (cPython 3.8.2 running on WASM). The whole point of teaching in the browser, is that your students will also not need to install anything.",
  "duration": 748,
  "language": "eng",
  "recorded": "2021-06-02",
  "related_urls": [
    {
      "label": "Talk announcement",
      "url": "https://2021.djangocon.eu/cfp/talk/YXVTVE/index.html"
    }
  ],
  "speakers": [
    "Christopher Lozinski"
  ],
  "tags": [
    "Django",
    "DjangoConEU",
    "djangoconeu2021"
  ],
  "thumbnail_url": "https://img.youtube.com/vi/4yH0TUnlPwU/0.jpg",
  "title": "Teaching cPython, Turtle Graphics, and Jinja2 in the Browser",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4yH0TUnlPwU"
    }
  ]
}
