{
  "description": "DjangoCon US 2017 - Accessibility Matters: Creating a Better Web by Lindsey Dragun\n\nThis talk will go through accessibility concerns on the web through example sites and code with both good and bad accessibility to experience what some users have to struggle with daily. We will cover well-known concerns such as low vision/color blindness and deafness, as well as attention issues and autism, and discuss the limitations and abilities of various alternative input devices that people with motor control issues rely on. Short and long-term fixes will be demonstrated and taught, with the overall goal being that the participants leave knowing how to find and solve accessibility problems.\n\nWhy Bother With Accessibility\n\nNot only should you want everyone to be able to easily use your site, but having an accessible website comes with a variety of benefits. According to the U.S. Census Bureau, around 19% of Americans have a disability, which is a large potential audience for any site. Many companies also fall under accessibility laws they might not even be aware cover their products, with lawsuits becoming more prevalent in recent years, and showing a good faith effort to improve your products’ accessibility can help keep your company out of hot water. Accessible web development also tends to lead to better UX and a happier user base. And, another plus: It will save devs time and frustration when they’re working with the code, since good HTML is enforced.\n\nWho This Talk Is For\n\nAnyone who wishes to learn more about accessibility. While we won’t be going over the absolute basics of accessibility in detail, the examples and resources will be easy to understand for people with very basic knowledge of web development.\n\nhttps://2017.djangocon.us/talks/accessibility-matters-creating-a-better-web/",
  "language": "eng",
  "recorded": "2017-08-14",
  "speakers": [
    "Lindsey Dragun"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/alE3hWLHhNY/hqdefault.jpg",
  "title": "Accessibility Matters: Creating a Better Web",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=alE3hWLHhNY"
    }
  ]
}
