{
  "description": "DjangoCon US 2017 - Butter smooth, interactive applications with Django and Websockets by Ganesh Swami\n\nWeb applications have changed significantly over the years – from simple static pages, to sprinkling interactiveness with JQuery/AJAX, to full dynamic single page apps. Through each evolution, we’re adding more complexity, more data and more asynchronous behavior to our applications.\n\nIn this new world, where does the synchronous nature of Django’s request-response cycle fit in?\n\nMy talk will focus on the topics around asynchronous Django applications. I’ll be sharing some lessons we learnt while building and scaling an interactive web application within the confines of Django and django-channels.\n\nThis topic is interesting because there’s been a lot of interest with meteor-like frameworks that have synchronized state between the frontend and backend. My intention is to show the audience that you can accomplish the same end-result with Django, without the need to learn and deploy a brand new framework.\n\nAn outline I have in mind:\n\nWhat does asynchrony mean, and why you need it.\n\nTraditional methods of achieving asynchrony (delayed jobs using worker queues like celery, long-polling for messaging, etc.)\n\nWhy django-channels changes the game.\n\nHow to architect your state.\n\nWhat are the available options for deployment.\n\nGotchas, and what to do when things go wrong.\n\nJust a basic knowledge of Django is required, as the topics are transferable to other frameworks. We did not have to monkey-patch any of the drivers to achieve asynchrony, so what you’ll learn at my talk will apply cleanly to a stock Django.\n\n\nhttps://2017.djangocon.us/talks/butter-smooth-interactive-applications-with-django-and-websockets/",
  "language": "eng",
  "recorded": "2017-08-14",
  "speakers": [
    "Ganesh Swami"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/BRCx6lSA0fM/hqdefault.jpg",
  "title": "Butter smooth, interactive applications with Django and Websockets",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BRCx6lSA0fM"
    }
  ]
}
