{
  "description": "DjangoCon US 2017 - Functional Programming in an Imperative World. Maybe by Derik Pell\n\nLet’s start by looking at the core concepts that differentiate FP from the OO / imperative style most programmers are familiar with. Along the way I’ll introduce you to:\n\n1. Immutable data structures. Having data structures that don’t change makes your code safer, especially when dealing with concurrency and parallelism, but they require you to approach solutions in a different way than you would with mutable data.\n\n2. “Pure” functions. Pure, or idempotent, functions do not mutate state or cause other kinds of side effects. As a result, you are guaranteed that every time you call a function with the same parameters, you will always get the same value.\n\n3. Recursion: While recursion is something most of us know about, it’s not something we tend to use often in imperative programming, and with good reason. Nonetheless, it’s a worth knowing about it’s various forms.\n\n4. Function composition. When you have pure functions that handle only one task, you can build larger, more complex and more beneficial programs by composing functions together to form new functions.\n\n5. First class functions: passing around functions as parameters and return values, just like any other object.\n\n6. The holy trinity: map, reduce, filter. These three functions are the work horses of FP, helping us manipulate and transform data quickly and elegantly.\n\nFP in python\n\nNow, let’s take a look at how we can or cannot apply these concepts in python.\n\n1. While most data structures in python are mutable, tuples are a built in immutable data structure that we have at our disposal. We’ll see that tuples have a solid place in python, but they’re not as easy to work with as we might like.\n\n2. Recursion isn’t really well developed in python (on purpose) so let’s take a look at it’s pitfalls and how to avoid them.\n\n3. Function composition is something you probably already do some in python and perhaps don’t even know it.\n\n4. The trinity:\n\nFilter is easy, we just call it “list comprehension”\n\nReduce. Let’s try to get beyond flattening nested lists and doing tricks with math.\n\nMap. You probably don’t use this enough in python so let’s see if we can change that.\n\nFP is great! Maybe.\n\nNow that we’ve seen how FP can be used, we really need to decide if it should be used. Python is not a functional programming language, despite the tools it has. We’ve talked about some of the technical drawbacks to these tools, but we also need to decide if working in an FP paradigm is right for our work environment. We’ll look at some examples of where running into FP can be jarring and talk about the additional cognitive load on co-workers who aren’t used to seeing these tools in place.\n\nhttps://2017.djangocon.us/talks/functional-programming-in-an-imperative-world-maybe/",
  "language": "eng",
  "recorded": "2017-08-14",
  "speakers": [
    "Derik Pell"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Nk2kqwz7jjs/hqdefault.jpg",
  "title": "Functional Programming in an Imperative World. Maybe",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Nk2kqwz7jjs"
    }
  ]
}
