{
  "description": "DjangoCon US 2017 - Getting the most out of Django’s User Model by Julia M. Looney\n\nDjango’s User model is nice, but the fields it provides out of the box are minimal. We frequently need to associate our own custom data with a user, and luckily Django provides ways for us to add to its built-in User model. This talk will help novice Django developers understand which options are best when it comes to getting the most out of the Django User model.\n\nI’ll start by talking about the built-in Django User model and what it has to offer.\n\nThen I will identify scenarios when the User model might not be enough for a project, and why someone might want something with more flexibility. Then we’ll look at the different ways to get the most out of the Django User model. There are two main methods I’ll cover:\n\nExtending the User model\nCreating a custom User model\n\n\nExtending the User model:\n\nExtending the User model is handy when you only need to add a few extra fields. There are two main ways to do this: using a proxy model, and using a OneToOneField. I will cover the pros and cons of each, and give examples for implementing each.\n\nCreating a custom User model:\n\nWith this method, you can substitute Django’s default User model with your own. Though more complex, a custom User model is particularly useful when you need to uniquely identify users by email address instead of by username. I’ll go into a couple more scenarios where a custom User model would be helpful, and show examples of implementation.\n\nLastly, I will show how each method works with the default Django admin, and how they can be managed there.\n\n\nhttps://2017.djangocon.us/talks/getting-the-most-out-of-djangos-user-model/",
  "recorded": "2017-08-14",
  "speakers": [
    "Julia M Looney"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/uLPZYuj7yTg/hqdefault.jpg",
  "title": "Getting the most out of Django’s User Model",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uLPZYuj7yTg"
    }
  ]
}
