{
  "description": "DjangoCon US 2017 - Going Rogue: How Code.org Created a Curriculum Development Platform Without their Engineers All by Josh Caldwell\n\nAs a Middle School computer science teacher, I know enough to be dangerous, but not enough to consider myself a “real” developer. As a member of the curriculum team at Code.org (a nonprofit dedicated to providing all students with access to CS education), I knew that our combination of rendered markdown files and Google docs was far from the most effective way to write and deliver curriculum. If only we could schematize our curriculum writing, I thought, we’d be able to write more consistent lessons with better support for teachers to see which lessons are aligned to which standards, or where a given concept was first taught.\n\nWhen I brought this proposal to our engineering team everyone was excited about the idea, but there was no way we had the bandwidth to actually create it. Our small team of engineers are booked solid building tools for students to learn programming and for teachers to manage their classes. When it comes to the needs of our curriculum writers, we obviously need to come after the students and teachers. But wait, I know how to program. I did the “Two Scoops” tutorial. Why couldn’t I make the tool I had dreamed of?\n\nUsing Django and Mezzanine as a base, I gradually built a system that allows Code.org curriculum writers to write faster, more consistent, and better supported lessons at a massive scale. Along the way, I also dealt with the very real concerns of my engineering team. How can we be sure this will scale to our 10’s of thousands of teachers? What about our millions of students? How can we be certain that this doesn’t introduce new security vulnerabilities to our site? Are you sure you know what you’re doing here?\n\nThe answer to all of these problems was surprising simple, and has allowed me to address the needs of our curriculum team without taking the engineering team’s focus away from the customers that really matter - teachers and students.\n\nAfter many months of development, CurriculumBuilder has become an essential internal tool for curriculum writing at Code.org, and continues to find new ways to solve problems that would otherwise go unaddressed. Not bad for a Middle School CS teacher who had never before written software used by others.",
  "recorded": "2017-08-14",
  "speakers": [
    "Josh Caldwell"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/YugOi6N6Atw/hqdefault.jpg",
  "title": "Going Rogue: How Code.org Created a Curriculum Development Platform Without their Engineers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YugOi6N6Atw"
    }
  ]
}
