{
  "description": "DjangoCon US 2017 - Overcoming the Challenges of Mentoring by Kim Crayton\n\n​There is an ongoing mantra within the developer community: that there are far more jobs available then programmers to fill them. Which should be an indication as to the wonderful potential for both business and those learning to code. Yet what often follows such statements are not words of joy but rather a list of frustrations related to the difficulty in finding and retaining enough skilled developers to fill these positions. The challenge is not in the number of newbies entering the field but the number who leave because they are not able to bridge the divide between bootcamps, online tutorials, books, videos, etc. to an employable developer who is able to contribute to the team. Kim has years of experience working with learners of various ages in helping them develop the skills they needed to be successful at whatever their chosen goal. She understands that for businesses to be successful, they must develop more effective and efficient ways of recruiting and retaining developers in order to meet organizational benchmarks. The developer community is a overwhelmingly generous one and a well designed mentoring or apprenticeship program could be one answer that business leaders and newbies are looking for.\n\nThe business costs associated with corporate hiring managers inability to recruit and retain skilled workers to fill current and future entry-level positions are increasing (Queen, 2014).\n\n89 percent of organizational leaders stated that they are having difficulties filling open positions, which is causing them to either turn down orders, miss key deliverable deadlines or hire individuals from outside of the United States (Aho, 2015).\nAho, K. (2015). The robotics industry: creating jobs, closing the skills gap. Techniques, (7), 22. Retrieved from https://www.acteonline.org/techniques/#.VpMcQq6rR0s\n\nQueen, J. (2014). Hire power: to close the skills gap, states are teaming up with industries that need, but can’t find, qualified workers. State Legislatures, (8), 16. Retrieved from http://www.ncsl.org/bookstore/state-legislatures-magazine.aspx\n\nhttps://2017.djangocon.us/talks/overcoming-the-challenges-of-mentoring/",
  "recorded": "2017-08-14",
  "speakers": [
    "Kim Crayton"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/O6zPRGWR04g/hqdefault.jpg",
  "title": "Overcoming the Challenges of Mentoring",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=O6zPRGWR04g"
    }
  ]
}
