{
  "description": "DjangoCon US 2017 - Why can't everyone just do what I want them to? Leadership, management, and working with people who don't think like you by Briana Morgan\n\nDo you pride yourself on your post-it and Sharpie collection? Do you set appointments for yourself in your own calendar - that you actually show up for? Do you write to-do lists on your hand, since you’ll forget if the to-do isn’t right in front of your face? Do you own - and use - a label maker? Do you hate New Year’s resolutions because the whole idea of starting new habits on January 1 is an artificial construct?\n\nPeople are weird. We all have some pretty particular ways we think, work, and get motivated. It’s hard enough when we’re just trying to focus on ourselves, but it gets even more complicated when we add other people to the mix. What happens when a whiteboard person has to work with a spreadsheet person - or even harder, lead a whole team of spreadsheet people?\n\nThis talk will focus on practical tips for working better with others - especially when you’re in a leadership or management position, although we all lead in different ways. We’ll start off with an overview of productivity and motivational styles, identifying how they influence the way we all think and work. Then, we’ll pinpoint how our own personal productivity and motivational styles impact us and those around us. After that, we’ll figure out how to look for clues about our colleagues’ working styles. Finally, we’ll talk about strategies for bridging our working styles with those of the people around us. You’ll leave with insights about what makes you tick, plus actionable tools to improve your leadership skills and enhance your working relationships.\n\nhttps://2017.djangocon.us/talks/why-can-t-everyone-just-do-what-i-want-them-to-leadership-management-and-working-with-people-who-don-t-think-like-you/",
  "language": "eng",
  "recorded": "2017-08-14",
  "speakers": [
    "Briana Morgan"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/QLDc4PlxGiI/hqdefault.jpg",
  "title": "Why can't everyone just do what I want them to?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QLDc4PlxGiI"
    }
  ]
}
