{
    "description": "In this talk we will walk through the concept of Data mining and visualization right from the basics. A free and open source tool for data visualization -Orange from a beginner to an advance level will also be covered. We will also cover the concepts of data mining and data warehousing to gain a deeper insight into the concept and help understand the process form the core level.\nData mining refers to an autonomous process of discovery of previously unknown patterns which are valid, potentially useful or novel from large database.Orange is Open source machine learning, data visualization and data mining toolkit.  \nOrange features an interactive data visualization platform. The platform provides a wide variety of data analysis and visualization by statistical distributions, scatter plots, box plots, decision trees, heat maps, linear projections to name a few. By carefully selecting attributes in the dataset we can drill down multidimensional data to 2D. It helps in fast prototyping of data analysis workflow.\nThe talk will also cover the recent and diverse existing use cases of Orange like:\n1. Analysis of hyperspectra images from the Ryugu asteroid\n2. Language support for 50 languages\n3. bioinformatics, and many more.\nBy the end of the talk attendees would have a clear knowledge of \n- What Orange is\n- How they can use it in work or side projects\n- Be able to use it as a separate tool or embed it as a library in their existing Python projects \nAnd use all functionalities of Orange of data mining and visualization to the fullest!",
    "language": "eng",
    "recorded": "2021-10-22",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2021.djangocon.us"
        }
    ],
    "speakers": [
        "Drishti Jain"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/cSh_aHcsbFM/maxresdefault.jpg",
    "title": "Illuminate Data with Visualization",
    "videos": [
        {
            "type": "youtube",
            "url": "https://youtu.be/cSh_aHcsbFM"
        }
    ]
}