{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Music Synthesis in Python\n~~~~~~~~~~~~~~~~~~~~~~~~~\n\nPython has become a one-stop-shop for everything audio - from cutting edge digital signal processing packages to music synthesis and music composition packages. This plethora of audio related packages allows developers and musicians to build the most creative projects and experiences in a single programming language.\n\nThe goal of this talk to provide attendees with the knowledge of the fabulous audio analysis and music creation tools available in Python.\n\nTalk Overview\n~~~~~~~~~~~~~\n\nThe talk will start with a presentation of one of my recent projects, `Luncz`_ (pronounces “Luntz”), a tool that analyzes live playing and generates a bass line to accompany the musician. Luncz helps the musician to stay within the musical context of the original idea and leaves enough room for this idea to be developed. We will breakdown Luncz technical components and learn about the capabilities of the DSP packages that were used to build it and the Csound Python interface that was used to generate the playback.\n\nFollowed by the project presentation, we will briefly review a variety of available Python tools and packages for music creation, music analysis, and Python interfaces to the most used digital music synthesis engines. Among these tools are pyAudio, LibROSA, pyAudio, athenaCL, Cecilia, Pyo, Soundgrain, and Csound’s, Supercollider’s and ChucK’s Python APIs.\n\nAbout The Speaker\n~~~~~~~~~~~~~~~~~\n\nDror Ayalon is a maker, programmer, user experience designer, and a user interface designer, and was the Product Manager for a few very successful start-ups. Dror is currently a graduate student at NYU. As a lifelong music lover, he researches and develops innovative music creation tools, using music information retrieval (MIR) techniques, digital signal processing (DSP), and machine learning algorithms, that will allow musicians to compose music in a variety of new ways and formats.\n\n.. _Luncz: https://www.drorayalon.com/#/luncz/",
  "duration": 1500,
  "language": "eng",
  "recorded": "2017-10-07",
  "related_urls": [
    "https://2017.pygotham.org/talks/music-synthesis-in-python/"
  ],
  "speakers": [
    "Dror Ayalon"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ROlkhVs15AM/maxresdefault.jpg",
  "title": "Music Synthesis in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ROlkhVs15AM"
    }
  ]
}
