{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "From it's origins in the early days as a metadata server to the current trove of hosted packages, PyPI has grown into a critical part of the Python Communities Infrastructure.\n\nOriginally conceived and implemented in 2002 as a simple set of metadata, the codebase that backs PyPI has been pushed well beyond it's limits. While some may call it \"legacy\" software, I choose to view it like one may view a classic car that still sees it's time on the road.\n\nThis talk will present some of the challenges common to keeping a Vintage Car on the road as well as their counter parts when dealing with Vintage Software and take a look at the approaches that have worked well to keep PyPI up and running as a full rewrite is underway.\n\nAlso covered will be an overview of the history of PyPI as a whole, as well as what the future holds and how you (yes you!) can contribute.\n\nTechnical Topics covered include:\n  - External caching, Content Delivery Networks\n  - Internal caching, to speed up common or repetitive requests which just can't be cached in the CDN\n  - Metrics, Metrics, Metrics! Not just for monitoring! Keep track of what features just aren't worth supporting any longer or what methods are prime for optimization\n  - Dealing with issues related to scaling even when major refactors or changes aren't feasible.\n  - Increasing reliability\n\nThe desired outcome for attendees of this talk is a sense of how to approach a Vintage codebase that must remain up and running even as it's predecessor may be in progress. Big rewrites can take time! Don't feel defeated sustaining an old project, it is what your users need!\n\nNovice attendees may find the history and high level concepts interesting, but Intermediate attendees should get the most out of this talk. Specifically some of the technical bits will make the most sense and be most applicable if you've ever worked on a medium to large production web service.",
  "duration": 1500,
  "language": "eng",
  "recorded": "2017-10-07",
  "related_urls": [
    "https://2017.pygotham.org/talks/running-vintage-software-pypi-s-aging-codebase/"
  ],
  "speakers": [
    "Ernest W. Durbin III"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/AUpTQzjEths/maxresdefault.jpg",
  "title": "Running Vintage Software: PyPI's Aging Codebase.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AUpTQzjEths"
    }
  ]
}
