{
  "description": "I will tell the story of how the statistical challenges in the search for the Higgs boson and exotic new physics at the Large Hadron Collider led to new approaches to collaborative, open science. The story centers around computational and sociological challenges where software and cyberinfrastructure play a key role. I will highlight a few important changes in perspective that were critical for progress including embracing declarative specifications, pivoting from reproducibility to reuse, and the abstraction that led to the field of simulation-based inference.\n\nKyle Cranmer is the David R. Anderson Director of the University of Wisconsin-Madison’s Data Science Institute and a Professor of Physics with courtesy appointments in Statistics and Computer Science. He is also the Editor in Chief of the journal Machine Learning Science and Technology. Before moving to Madison, Cranmer was a Professor of Physics and Data Science at NYU from 2007 – 2022, where he also served as the Executive Director of the Moore-Sloan Data Science Environment at NYU. He obtained his Ph.D. in Physics from the University of Wisconsin-Madison in 2005. He was awarded the Presidential Early Career Award for Science and Engineering in 2007, the National Science Foundation's Career Award in 2009, and became a Fellow of the American Physical Society in 2021 for his work at the Large Hadron Collider. Professor Cranmer developed a framework that enables collaborative statistical modeling, which was used extensively for the discovery of the Higgs boson in 2012. He has been an advocate for open science, open source software, and shared cyberinfrastructure. At UW-Madison he has established an Open Source Program Office and actively collaborates with groups like NumFOCUS and the Academic Data Science Alliance to strengthen academic contributions to open source.",
  "duration": 2991,
  "language": "eng",
  "recorded": "2024-07-08",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.scipy2024.scipy.org/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/0-dcPM2qCm8/maxresdefault.jpg",
  "title": "Kyle Cranmer - Keynote: Particles, People, and Pull Requests",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0-dcPM2qCm8"
    }
  ]
}
