{
  "description": "🐍🐍 Pycon Colombia 2023 in this edition brings guests from another dimension, This year, we will have the participation of Deb Nicholson, she is the Executive Director at the Python Software Foundation, the non-profit steward of the Python programming language. She is a free software policy expert and a passionate community advocate. After years of local organizing on free speech, marriage equality, government transparency and access to the political process, she joined the free software movement in 2006. She has previously served the open source ecosystem through her work at the Open Source Initiative, Software Freedom Conservancy, and the Open Invention Network. She’s won the O’Reilly Open Source Award and the Award for the Advancement of Free Software for her efforts to broaden the free and open source software movement. She is also a founding organizer of the Seattle GNU/Linux Conference, an annual event dedicated to surfacing new voices and welcoming new people to the free software community. She lives with her partner and her lucky black cat in Cambridge, Massachusetts, USA.\n\nLinkedIn: https://www.linkedin.com/in/denicholson \nTwitter: https://twitter.com/baconandcoconut\n\n\n#PyConColombia2023 #PyCon #speaker #python #developers #keynote #development #Conference #Tech #Presencial #Bogota #Event",
  "duration": 1668,
  "language": "spa",
  "recorded": "2023-06-09",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.pycon.co/"
    },
    {
      "label": "https://twitter.com/baconandcoconut",
      "url": "https://twitter.com/baconandcoconut"
    },
    {
      "label": "https://www.linkedin.com/in/denicholson",
      "url": "https://www.linkedin.com/in/denicholson"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/fbTj0zqlokw/maxresdefault.jpg",
  "title": "Deb Nicholson Keynote PyCon Colombia 2023",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fbTj0zqlokw"
    }
  ]
}
