{
  "description": "Today, Jupyter Notebooks are mostly confined to science, research & education. But notebooks can provide organizations with a powerful general-purpose “executable documentation” platform. A solid use case for this is DevOps & more specifically, IT incident response.\n\nTechnology teams usually have an on-call rotation with static wiki-style documentation to guide the on-call engineer. Jupyter Notebooks can replace static documentation with executable notebooks. E.g. “fetch service logs” and “rollback last deployment” can simply mean executing a code cell that’s available alongside the markdown instructions.\n\nWhat are the benefits of executable vs. static documentation for DevOps -\n\nQuick e.g. “check DB latency” is 1-click notebook code cell execution to plot latency graph vs. going to a third-party UI in the middle of an incidence\nPrecise e.g. “promote read replica to master” can mean a series of steps & possibility of human error; codifying the steps in advance removes ambiguity & results in precise action.\n“Executable documentation” is a simple yet powerful concept that can extend to other use cases such as - API documentation, developer onboarding, data visualization & reporting, scheduling routine tasks & so on. Think of it as executable GoogleDocs powered by Jupyter!\n\nIn this talk, we’d like to,\n- Introduce the concept of Jupyter powered “executable documentation” platform, particularly for DevOps and Incident Response,\n- Show a demo of how it’d work - (https://www.youtube.com/watch?v=vvLXSAHCGF8)\n- Talk about important challenges, and propose a way forward to make this a mainstream application of Jupyter notebooks.",
  "duration": 1665,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    },
    {
      "label": "https://www.youtube.com/watch?v=vvLXSAHCGF8",
      "url": "https://www.youtube.com/watch?v=vvLXSAHCGF8"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "#AgileDevelopment",
    "#CodeAutomation",
    "#CodeSharing",
    "#CollaborativeCoding",
    "#DataScienceTools",
    "#DevOpsBestPractices",
    "#DevOpsInnovation",
    "#DevOpsSimplified",
    "#EfficientCoding",
    "#ExecutableNotebooks",
    "#JupyterCon2023",
    "#JupyterNotebooks",
    "#NotebookDrivenDevelopment",
    "#StreamlinedDevelopment",
    "#TechConference",
    "#TechLearning"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/TUYY2kHrTzs/maxresdefault.jpg",
  "title": "Amit Rathi, Vinay Kakade   Simplify DevOps with Executable Notebooks | JupyterCon 2023",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TUYY2kHrTzs"
    }
  ]
}
