{
  "description": "Jupyter Server is the core web server that powers most Jupyter web applications—it is widely used in research, education, and enterprise. Beyond the core web server, the Jupyter Server Project offers a powerful collection of plugins and extensions that enable deployers to build a Jupyter web application that best suits any workflow.\n\nIn this talk, we will lean heavily on live demos to showcase some of the core functionality, features, and strengths of Jupyter Server. To get the audience familiar with Jupyter Server, we will\n\ndemonstrate how to install, launch, and configure a server.\ncustomize the server overriding one of Jupyter's core services.\nexpand Jupyter Server's capabilities by authoring a server extension\nWe will, then, highlight some of the new features offered by Jupyter Server 2.0, including the\n\nidentity and authorization APIs for secure access to a shared server,\nserver-side features that enable real-time collaboration in Jupyter documents,\nevent system that powers many features in JupyterLab and beyond.\nFinally, we will share some perspective on the future direction of Jupyter Server and invite the audience to get involved with the project. We will share some unique ways that the Jupyter Server Team is encouraging and empowering new contributors through its weekly \"Contributing Hour\".\n\nWhile Jupyter Server is fairly technical component in the Jupyter stack, we believe this talk offers helpful information for audiences of all levels. Particularly, if you are deploying Jupyter Server's for your research lab or company, or you are interested in becoming a Jupyter Server contributor, you will not want to miss this!",
  "duration": 1692,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    }
  ],
  "speakers": [
    "David Brochart"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/pZC4V8xmsLE/maxresdefault.jpg",
  "title": "Jupyter Server — the workhorse that drives nearly all Jupyter web applications",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pZC4V8xmsLE"
    }
  ]
}
