{
  "description": "Block-based programming offers the unique opportunity of teaching basic yet fundamental programming concepts without the challenge brought on by the specific syntax of text-based programming languages. Wishing to provide a smooth ramp of complexity for learners, we designed a JupyterLab extension for Blockly, such that Jupyter can now be used all throughout a student's learning journey, without the hassle of having to switch to a completely new environment at any point along the way.\n\nIn this talk, we will provide a more detailed look at the JupyterLab-Blockly extension, starting from the benefits of using it and our motivation when creating it, going through a well-documented journey of the UI, all towards a live demonstration with the kind of algorithms you can build using our standard blocks.\n\nA relevant aspect of the extension is also its buildability. As such, we will also dive deeper into how JupyterLab-Blockly can be used as a base for other extensions, providing the perfect tools for simple robotics applications. We will go through each step a coder needs to take in order to make their own extension and the possibilities we offer in creating your own blocks, toolboxes and even programming language generators.\n\nFinally, we will offer a glimpse into our very own cool robotics applications which were built on top of the JupyterLab-Blockly extension:\n- jupyterlab-niryo, a plugin to control the Niryo One robot,\n- jupyterlab-lego-boost, a plugin to communicate with the LEGO® Boost robot.\n\nAs a preview, you can read more in our blogpost: https://blog.jupyter.org/visual-programming-in-jupyterlab-with-blockly-7731ec3e113c",
  "duration": 1645,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    },
    {
      "label": "https://blog.jupyter.org/visual-programming-in-jupyterlab-with-blockly-7731ec3e113c",
      "url": "https://blog.jupyter.org/visual-programming-in-jupyterlab-with-blockly-7731ec3e113c"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/hSodReGg6l8/maxresdefault.jpg",
  "title": "Denisa Checiu, Carlos Herrero   Visual Programming in JupyterLab with Blockly | JupyterCon 2023",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hSodReGg6l8"
    }
  ]
}
