{
  "description": "The use of scientific programming in Python is still developing in the French Human and Social Sciences (HSS). While computational approaches are gaining visibility, adoption by the HSS community remains quite low. Supporting good practices across disciplines and providing training for students and young researchers will require infrastructure, as well as examples of treatments specific to the fields concerned. Although the tools for scientific programming in Python are largely mature and used in numerous scientific communities, they have yet to be widely adopted in HSS.\n\nTo promote the diffusion of interactive computational practices, we developed five proof of concept notebooks that aim not only to demonstrate the possible uses of Jupyter Notebooks and Python machine learning tools, but also to foster their adoption by the HSS community. This project was initiated by the large digital research infrastructure in HSS, Huma-Num, in the context of testing a jupyter hub deployment. However, despite our best efforts, these notebooks were woobly and not very useful. We can say that we failed to match our expectations.\n\nIn this communication, we propose to dissect this failure as an attempt to gain a better understanding of the current uses of Notebooks by French researchers. We would like to emphasize the need to better explore research practices. Drawing on Science and Technological Studies, we suggest the hypothesis that many notebooks are primarily \"intermediate objects\" that allow for the coordination of the research process. If this is the case, reproducibility is not the primary goal, nor is diffusion. For this reason, the adoption of Jupyter Notebooks by HSS researchers would require primarily effort on the general computational literacy to foster their integration into their research process.",
  "duration": 1773,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "#AIinAction",
    "#CodingInJupyter",
    "#DataAnalysis",
    "#DataDrivenInsights",
    "#DataScienceInnovation",
    "#DataVisualization",
    "#InteractiveComputing",
    "#JupyterCommunity",
    "#JupyterCon2023",
    "#JupyterLove",
    "#MachineLearning",
    "#NotebookWorkflow",
    "#OpenSourceTools",
    "#PythonProgramming",
    "#ResearchTools"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/G63bEFSEUco/maxresdefault.jpg",
  "title": "Emilien Schultz   How to convince French HSS researchers to use Jupyter Notebooks ?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=G63bEFSEUco"
    }
  ]
}
