{
  "description": "We introduce mystjs (http://js.myst-tools.org/), a set of open-source, community-driven tools designed for scientific communication, including a powerful authoring framework that supports blogs, online books, scientific papers, reports and journals articles.\n\nThe MyST (Markedly Structured Text) project has grown out of the ExecutableBooks team, which has been working on MyST Markdown and JupyterBook as new ways to publish notebooks. Originally based on Sphinx and RST, over the past year the ExecutableBooks team has been working on a MyST Specification to coordinate development of the markup language and extensions across multiple languages & parsers (e.g. implementations in Python & Javascript). The new mystjs libraries run directly in the browser, opening up new workflows for components to be used in web-based editors, directly in Jupyter and in JupyterLite. The libraries work with current MyST Markdown documents/projects and can export to LaTeX/PDF, Microsoft Word and JATS as well as multiple website templates using a modern React-based renderer. There are currently over 400 scientific journals that are supported through templates, with new LaTeX templates that can be added easily using a Jinja-based templating package, called jtex.\n\nIn our presentation we will give an overview of the MyST ecosystem, how to use MyST tools in conjunction with existing Jupyter Notebooks, markdown documents, and JupyterBooks to create professional PDFs and interactive websites, books, blogs and scientific articles. We give special attention to the additions around structured data, standards in publishing (e.g. efforts in representing Notebooks as JATS XML), rich frontmatter and bringing cross-references and persistent IDs to life with interactive hover-tooltips (ORCID, RoR, RRIDs, DOIs, intersphinx, wikipedia, JATS, GitHub code, and more!). This rich metadata and structured content can be used directly to improve science communication both through self-publishing books, blogs, and lab websites — as well as journals that incorporate Jupyter Notebooks.\n\nOur talk is aimed at attendees who are looking to communicate their Jupyter Notebooks, markdown documents or write scientific articles/papers. Our talk will assume basic familiarity with command-line tools and markdown. Throughout the presentation we will practically demonstrate the myst command-line interface to work with Jupyter Notebooks & markdown articles to create PDFs & Word documents, add citations & cross-references, and deploy modern websites with multiple themes that preserves the structured content.",
  "duration": 1662,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    },
    {
      "label": "http://js.myst-tools.org/",
      "url": "http://js.myst-tools.org/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/wyRmcbWBXs4/maxresdefault.jpg",
  "title": "Franklin Koch   MyST Markdown: Using notebooks in scientific publishing workflows | JupyterCon 2023",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wyRmcbWBXs4"
    }
  ]
}
