{
  "description": "In this presentation we dive into the unique challenges of the user experience of Project Jupyter.\n\nThe UX of computational notebooks\n\nComputational notebooks have changed the way we think about interactive computing. By blending together narration and code, they are widely regarded as a concrete implementation of the concept of literate programming [1]. Very popular in educational contexts, notebooks are a unique tool in promoting computational thinking, the ability to present problems and solutions in the form of algorithmic steps.\n\nWe will present some of the challenges with the UX of computational notebooks, that is distinct from both document processing tools and development environments.\n\nJupyterLab, an open application framework\n\nWhile a lot of websites are focused on guiding users towards a predefined goal (such as a purchase for e-commerce websites), JupyterLab provides a space for open-ended exploration and creation, creating unique user experience challenges that have been sparsely explored.\n\nPhoto editing software, development environments, CAD tools, all fall in this category and have similar requirements, such as allowing for a complex tiled layout or displaying a lot of personalised information on the screen.\n\nWe will show how the foundations of JupyterLab can be reused to build other tools of that category, and present two examples with the JupyterCAD and Glue-Jupyter projects.\n\nImproving the UX of Jupyter\n\nWe are launching a new initiative focused on the UX of JupyterLab. How can we uncover issues and improve user experience through UX research without breaking what Jupyter got right and what enabled its global adoption.\n\nWe will present the first steps of our initiative, ranging from the triaging of issues to the set up of user tests.\n\n[1] Knuth, Donald E. (1992). Literate Programming. California: Stanford University Center for the Study of Language and Information. ISBN 978-0-937073-80-3.",
  "duration": 1518,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    }
  ],
  "speakers": [
    "Gabriela Vives"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/XMLQ42CK7nY/maxresdefault.webp",
  "title": "The UX of computational thinking",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XMLQ42CK7nY"
    }
  ]
}
