{
  "description": "The study of climate and meteorology is underpinned by an ability to use large datasets, however handling these datasets has typically been the role of specialists in the field. Jupyter notebooks provide a novel approach to introducing large complex datasets to a non-specialist audience, where the boundaries between documentation and use-cases becomes fluid.\n\nThe Copernicus Climate Change Service (C3S) Climate Data Store (CDS) is an entry point to a broad spectrum of data related to climate and meteorology, from output produced by weather and climate models to observation data from satellites and weather stations. Even when strict data standards are followed, each dataset has its own peculiarities and pitfalls which require some degree of documentation support. Jupyter notebooks, provide the perfect complement to user-guides that typically accompany the datasets available in the CDS. The notebooks provide examples of how to access, download and explore the data, and provide a platform where the producers of the data can demonstrate the qualities of the data and applied use cases.\n\nThe C3S is embracing this concept and building a JupyterBook-based training material to support users of the datasets available in the CDS. Such a library will instigate greater use of climate and meteorology in sectoral fields (e.g. health, tourism and transport) and could be used as an educational resource in universities and schools. This library will feature directly in the JupyterHub-based online development environment that will be integrated into the modernised version of the CDS.\n\nThis session will present the training material we have produced, and the framework we have in place such that data producers are able to easily contribute to our growing library of content. We will demonstrate the importance of this material in providing data users the information required to make use of the data, and how this fits in the plans for modernising our online development environment. This session is aimed at people who may be interested in using the training material we have produced to gain experience handling climate, weather and observation data; and aimed at people who may want to construct a similar, community developed, training material resource.\n\nThe CDS is implemented by the European Centre for Medium-Range Weather Forecasts (ECMWF) on behalf of the European Commission.",
  "duration": 1257,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "#AIinAction",
    "#CodingInJupyter",
    "#DataAnalysis",
    "#DataDrivenInsights",
    "#DataScienceInnovation",
    "#DataVisualization",
    "#InteractiveComputing",
    "#JupyterCommunity",
    "#JupyterCon2023",
    "#JupyterLove",
    "#MachineLearning",
    "#NotebookWorkflow",
    "#OpenSourceTools",
    "#PythonProgramming",
    "#ResearchTools"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/vFu5Vk0W8tA/maxresdefault.jpg",
  "title": "James Varndell   Using Jupyter notebooks to document and support climate and meteorology data",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vFu5Vk0W8tA"
    }
  ]
}
