{
  "description": "Science is not composed of isolated groups of practitioners, but is rather an interconnected network of communities of practice, with members who fluidly move between them. Infrastructure for scientific research and collaboration should leverage this structure to make science more productive and inclusive. You will learn about the JupyterHub tools, community, and best practices being developed to achieve these goals around a specific NASA science mission and research objectives in a project known as the CryoCloud.\nScience is not composed of isolated groups of practitioners, but is rather an interconnected network of communities of practice, with members who fluidly move between them. Infrastructure for scientific research and collaboration should leverage this structure to make science more productive and inclusive. You will learn about the JupyterHub tools, community, and best practices being developed to achieve these goals around a specific NASA science mission and research objectives in a project known as the CryoCloud.\n\nOutline:\n\nFor NASA’s upcoming Year of Open Science, NASA and other federal funding agencies have begun to transition their data stores and computing into the cloud. However, substantial barriers exist for individual users to make the transition from their local systems to the cloud to accomplish research goals and fully utilize new cloud capabilities: cloud cost opacity, infrastructure deployment complexity, and a general lack of community awareness and knowledge, among others.\n\nTo address these challenges, we have built a persistent JupyterHub in partnership with the International Interactive Computing Collaboration (2i2c), called CryoCloud (cryointhecloud.com), for NASA Cryosphere communities. We provide a persistent hub space across a series of hackathon-style workshop events to help the NASA ICESat-2 Science Team and related Cryosphere researchers build community and transition to a collaborative cloud workspace. CryoCloud models how to build a research community around a specific science mission and research objectives, while enabling learning and creation of the technical knowledge to facilitate NASA’s open-source, interconnected, and science-accelerated vision of the future. We gather user data to understand research needs, imagine tools required to streamline collaboration, and build community best practices. We share examples of how these JupyterHub cloud tools make scientific computing more intuitive, cost- and time-efficient, and open for all.\n\nThis presentation is intended for cloud engineers, scientific programmers, data scientists, and all other interested people. Attendees are expected to have no specific knowledge background. Familiarity with geospatial datasets and Earth science is useful but not required.",
  "duration": 1624,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    }
  ],
  "speakers": [
    "James Colliander"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/9itR-_EXa5c/maxresdefault.jpg",
  "title": "Accelerating Discovery for NASA Cryosphere Communities with JupyterHub",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9itR-_EXa5c"
    }
  ]
}
