{
  "description": "The Jupyter ecosystem is vast and complex, with many different projects and libraries that work together to support interactive computing and data science. In this talk, we will navigate and explore the Jupyter ecosystem, highlighting the key projects and libraries that make up the ecosystem and discussing how they relate to each other.\n\nWe will start by introducing the core Jupyter projects, including the Jupyter Notebook and JupyterLab, and explaining how they provide a platform for interactive computing and data visualization. We will then discuss some of the key sub-projects within the Jupyter ecosystem, such as JupyterHub for enabling multi-user access to notebooks and nbconvert for converting notebooks to other formats, and we will explain how they fit into the overall landscape of Jupyter.\n\nNext, we will delve into the underlying projects and libraries that make Jupyter and its related projects possible, such as the Jupyter server, the core APIs projects and the traitlets library. We will discuss the different protocols used for communication between the applications and the kernels, and show how it makes Jupyter agnostic to the language. We will also cover some of the key technologies used by Jupyter and its related projects, such as the Tornado web framework or the ZeroMQ messaging library, and we will explain how these technologies fit into the Jupyter landscape.\n\nThroughout the talk, we will provide examples of how these tools and technologies can be used in practice and discuss the latest developments and future directions of the Jupyter ecosystem. By the end of the talk, attendees will have a better understanding of the Jupyter ecosystem and how its various projects and libraries fit together to enable interactive computing and data science.\n\nOutline:\n\nIntroduction to the Jupyter ecosystem\nOverview of the core Jupyter projects (Jupyter Notebook, JupyterLab)\nOverview of key sub-projects within the Jupyter ecosystem (JupyterHub, nbconvert)\nExplanation of the underlying projects and libraries used by Jupyter (Jupyter server, jupyter_client, traitlets)\nIntroduction to the Jupyter protocol and the widget protocol\nOverview of key technologies used by Jupyter and its related projects (ZeroMQ, Tornado framework)\nDiscussion of the latest developments and future directions of the Jupyter ecosystem\nConclusion and next steps for learning more about the Jupyter ecosystem",
  "duration": 1377,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    }
  ],
  "speakers": [
    "Jeremy Tuloup",
    "Johan Mabille"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/uWJ0-OPKTxI/maxresdefault.jpg",
  "title": "Navigating the Jupyter Landscape",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uWJ0-OPKTxI"
    }
  ]
}
