{
  "description": "Jupyter notebooks are a popular tool for data science and scientific computing, allowing users to mix code, text, and multimedia in a single document. However, sharing Jupyter notebooks can be challenging, as they require installing a specific software environment to be viewed and executed.\n\nJupyterLite is a Jupyter distribution that runs entirely in the web browser without any server components. A significant benefit of this approach is the ease of deployment. With JupyterLite, the only requirement to provide a live computing environment is a collection of static assets. In this talk, we will show how you can create such static website and deploy it to your users.\n\nWe will cover the basics of JupyterLite, including how to use its command-line interface to generate and customize the appearance and behavior of your Jupyter website. This will be a guided walkthrough with step-by-steps instructions for adding content, extensions and configuration.\n\nBy the end of this talk, you will have a good understanding of how JupyterLite works and how you can use it to create interactive websites.\n\nOutline:\n\nIntroduction to Jupyter and JupyterLite\nExamples of JupyterLite used for interactive documentation and educational content (NumPy, Try Jupyter, SymPy)\nStep-by-step demo for creating a Jupyter website\nQuickstart with the demo repository\nAdding content: notebooks, files and static assets\nAdding extensions to the user interface\nAdding packages to the Python runtime\nCustomization and custom settings\nDeploy JupyterLite as a static website on GitHub Pages, Vercel or your own server\nConclusion and next steps for learning more about the Jupyter ecosystem\nThe talk will be based on resources already publicly available:\n\ntry JupyterLite in your browser: https://jupyterlite.github.io/demo/\nthe JupyterLite documentation: https://jupyterlite.readthedocs.io/en/latest/quickstart/deploy.html\nthe JupyterLite repositories: https://github.com/jupyterlite",
  "duration": 1654,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    },
    {
      "label": "https://jupyterlite.readthedocs.io/en/latest/quickstart/deploy.html",
      "url": "https://jupyterlite.readthedocs.io/en/latest/quickstart/deploy.html"
    },
    {
      "label": "https://github.com/jupyterlite",
      "url": "https://github.com/jupyterlite"
    },
    {
      "label": "https://jupyterlite.github.io/demo/",
      "url": "https://jupyterlite.github.io/demo/"
    }
  ],
  "speakers": [
    "Jeremy Tuloup"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/8LfnsmtXHNU/maxresdefault.jpg",
  "title": "Creating interactive Jupyter websites with JupyterLite",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8LfnsmtXHNU"
    }
  ]
}
