{
  "description": "Copernicus, as the European Union’s Earth Observation program ; is providing an unprecedented amount of data and added-value information on any aspect of terrestrial environment and climate, including data from new generation satellites, reanalysis, historical datasets and forecasts. This is enabling new science, services, operational applications and businesses in the fields of meteorology, climate, air quality, oceanography and, at large, environmental monitoring.\nTheJupyter ecosystem is becoming central to support users in discovering, using and analysing this data.\n\nThe European Organisation for the Exploitation of Meteorological Satellites (EUMETSAT) is an implementer of the Copernicus programme and this talk will show how Jupyter is used to provide know-how and access toCopernicus Earth Observation data on the following aspects:\n\nTraining and awareness - jupyter-based platforms used in events to self-paced approach over a wide range of domains, including atmosphere, climate change, and marine. For example in 2022 have been held more than 50 international events making use of Jupyter environment with more than 5000 users\nData ready - using jupyter notebooks to showcase applications and grant a seamless access to data - providing notebooks and access to hubs through advanced and open platforms .\nAmong these, the European Weather Cloud and the WEkEO Copernicus Data and Information Access Services (DIAS) as collaboration among key international organisations and agencies (ECMWF, EUMETSAT, EEA and Mercator Ocean International)\n\nCommunications and outreach- make use of Jupyter to engage with a large public scientifically literate. This includes competition of jupyter notebooks applied to innovative data analysis and access and practical sessions using Jupyter Notebooks in largely attended massive on-line courses (MOOCs)",
  "duration": 1590,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/In0oeWwltIE/maxresdefault.jpg",
  "title": "Julia Wagemann   Jupyter for Copernicus   improve the use of Earth Observation data | JupyterCon 202",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=In0oeWwltIE"
    }
  ]
}
