{
  "description": "We developed a Jupyter interface to conduct machine learning experiments on living human brain tissue. Our group, the Braingeneers, is a collaboration between neuroscientists, computational scientists, and engineers from University of California Santa Cruz, San Francisco, Santa Barbara, and Washington University St. Louis working to incorporate AI algorithms in the design of neuroscience experiments. We found Jupyter to be an indispensable tool that allows us to accomplish two key goals:\n1. Rapidly design automated experiments on neurobiology\n2. Share results with collaborators and students\n\nOver two years, our group has created a customized open-source Jupyter environment which we call WetAI, because its intention is to run AI algorithms with wet biology brain organoids. Brain organoids are sesame seed-sized brain-like tissues that are grown from stem cells in the lab, such that they can be induced to form neural circuits. We have used WetAI to control automated experiments that are conducted on human brain organoids. Code written in Jupyter implements an experimental protocol or learning algorithm that defines how a computer communicates with neurons. The WetAI portal provides experimenters with access to the brain-computer-interface and the other biotechnological devices that maintain tissue in optimal condition. Researchers can view a livestream of the tissue underneath a microscope and send drugs to the culture medium using Jupyter widgets. Our neuroscience experiments take place over multiple days, and this entire process is automated through Jupyter without a biologist needing to be present.\n\nWe also used WetAI to teach programming and to provide data analytic tools to the general scientific community. WetAI was instrumental in teaching underrepresented high school students scientific coding in physically distant locations. Youtube tutorials were embedded into notebooks, and the Jupyter interface was customized to be tablet and smartphone friendly. We designed WetAI to also share datasets and analytic tools with the general scientific community. The WetAI docker was customized to work with the Broad Institute’s notebook based sharing platform, Terra. This made it possible for other laboratories to analyze datasets from our experiments using WetAI.\n\nWe expect WetAI will increasingly be used by other labs to conduct remote neuroscience experiments. We are also expanding the number of high schools and colleges in our student outreach program. We hope WetAI inspires other groups to use Jupyter to unify research, education, and collaborations.",
  "duration": 1636,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    }
  ],
  "speakers": [
    "Matthew Elliott"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/g1VYT1WV8nY/maxresdefault.jpg",
  "title": "Jupyter as a Brain Computer Interface",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=g1VYT1WV8nY"
    }
  ]
}
