{
  "description": "User feedback is crucial to any community, as it helps shape the community’s direction and growth. However, managing and processing this feedback can be challenging, especially for large and active communities. This talk will discuss practices for community management teams to effectively handle user feedback and turn it into valuable insights.\n\nWe will cover the following topics:\n\nStrategies for gathering and prioritizing user feedback, including surveys, polls, and short interviews.\nTechniques for analyzing and synthesizing user feedback, including data visualization and text analysis tools.\nMethods for communicating and following up on user feedback, including the use of transparent and consistent processes for decision-making.\nBest practices for engaging with users and fostering a sense of community ownership.\nBy the end of this session, attendees will have a better understanding of how to effectively manage user feedback and use it to drive the growth and success of their projects.\n\nAudience:\nThis conference proposal is suitable for community managers, moderators, and other professionals responsible for online communities. It is also relevant for anyone interested in understanding how to effectively process and use user feedback to shape the direction of their communities.\n\nObjectives:\nTo provide attendees with strategies for gathering and prioritizing user feedback.\nTo discuss techniques for analyzing and synthesizing user feedback.\nTo share community practices for communicating and acting on user feedback.\nTo explore ways to engage with users and foster a sense of community ownership and responsibility.",
  "duration": 1430,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "#CommunityBuilding",
    "#CommunityCollaboration",
    "#CommunityEngagement",
    "#CommunityLeadership",
    "#CommunityManagement",
    "#EffectivePractices",
    "#FeedbackBestPractices",
    "#FeedbackLoop",
    "#InteractiveLecture",
    "#JupyterCon2023",
    "#MaximizingImpact",
    "#OnlineCommunities",
    "#OnlineFeedback",
    "#OpenSource",
    "#TechConference",
    "#UserEmpowerment",
    "#UserExperience",
    "#UserFeedback"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/e6Mj9hQJAQE/maxresdefault.webp",
  "title": "Meag Doherty   Maximizing the Impact of User Feedback: Effective Practices for Community Management",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=e6Mj9hQJAQE"
    }
  ]
}
