{
  "description": "This poster summarizes the \"Astronomy Notebooks For All\" project undertaken in 2022-2023 by Space Telescope Science Institute. We are researching how Jupyter Notebooks can be made more accessible through paid usability testing sessions with disabled developers, scientists, and students. Our focus is on the compatibility of Jupyter Notebooks with assistive technologies such as screen readers, magnification, and braille readers. Additionally, we are developing potential solutions for the problems we find that may be incorporated upstream into the wider Jupyter project.\n\nThis poster will examine:\n\nAccessibility issues with Jupyter Notebooks and how these problems frequently keep disabled people out of careers in data and bench sciences.\nOur user-centered method of tackling this difficult problem by cycling between paid usability feedback sessions with impacted users and implementation of accessibility enhancements. We repeat this until we create a benchmark notebook built with a more accessible structure to contribute back to the community.\nStories of how Jupyter accessibility impacts community members, including case studies of people with disabilities deterred from pursuing careers in STEM by inaccessible tools.\nSpecific problems we have uncovered so far and solutions we have tried for those problems. Solutions will focus on both individual authors and the wider codebase.\nOur team from a variety of organizations (Space Telescope Science Institute, Iota School, Quansight) with a diverse array of skills used in the project.\nHow members of the Jupyter community can contribute to further work towards accessibility and inclusion in this area.",
  "duration": 1616,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    }
  ],
  "speakers": [
    "Patrick Smyth",
    "Jenn Kotler"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/LJMS9R-KFXQ/maxresdefault.webp",
  "title": "Notebooks for All: Accessibility & Jupyter Notebooks",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LJMS9R-KFXQ"
    }
  ]
}
