{
  "description": "The Jupyter ecosystem provides a powerful platform for iteratively developing and deploying data applications and dashboards. In this talk we will discover how to leverage Panel and Lumen to develop data applications by iterating in a notebook, previewing and finally deploying it to a JupyterHub or to an external cloud provider - all without leaving the JupyterLab UI. Along the way we will explore best practices for structuring these applications and make them performant. We will also explore the integration of these tools with the rest of the Jupyter ecosystem, e.g. by leveraging Jupyter Widgets, and deploy them in applications running outside Jupyter on the Panel server. In doing so we will discover the power of Jupyter not just for exploratory workflows but for sharing complex and rich data applications with the world.\n\nDeveloping & Iterating\nIn the first section we will go over the development of a rich and powerful data application in a notebook. We will demonstrate how we can quickly build and preview individual components by displaying them inline and previewing the entire application using a JupyterLab extension.\n\nOnce we have built the application we will go over recommendations for structuring the application to make them easier to maintain but also to achieve a good look and feel and get the best performance out of the application.\n\nJupyter Widgets integration\nNext we will go over the integrations of the Panel and Lumen stack with the Jupyter Widgets ecosystem. The ability to leverage this existing ecosystem allows users to leverage the tools they love and allows taking Jupyter Widgets out of Jupyter and ship them in a standalone application.\n\nDeployment\nLastly we will demonstrate how we can easily deploy Panel applications in a JupyterHub environment using existing extensions like CDSDashboards and how we can begin to extend this with Jupyter extensions that provide UIs to deploy to a cloud provider.",
  "duration": 1433,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/SnR9JbNgiRQ/maxresdefault.jpg",
  "title": "Philipp Rudiger   Rapidly prototyping and deploying powerful data applications in Jupyter using Pane",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SnR9JbNgiRQ"
    }
  ]
}
