{
  "description": "The MakinaRocks Link plugin is a powerful tool that empowers data scientists to create, manage, and execute complex directed acyclic graphs (DAGs) within the JupyterLab environment. With its caching mechanism, support for parallelism, and remote execution capabilities, Link provides an efficient and user-friendly solution for building and deploying data pipelines. Additionally, Link complies with JupyterLab semantics, making it an ideal development platform for MLOps tools such as MakinaRocks Runway. By using Link to develop and test DAGs, data scientists can ensure seamless integration with their operational MLOps environment.\n\nMakinaRocks Runway provides a comprehensive solution for managing the model training and serving pipelines. It simplifies the process of retraining models with new datasets and parameters, allowing users to accomplish this with a single click. Runway tracks training parameters, pipeline source codes, and the environment used to run training for each registered model. Users can also easily construct and update HTTP APIs and real-time inferences for their models. Updating ML models within running inference services with retrained models is a straightforward process.\n\nIn this presentation, we will explore the key features of MakinaRocks Link and Runway and demonstrate how they can help data scientists streamline their workflows and improve their productivity when constructing MLOps loops. We will showcase real-world examples of DAGs built using Link and highlight the benefits of using it in conjunction with MLOps tools such as Runway. Attendees will learn how they can work together to take their data science projects from development to the operational environment.",
  "duration": 1739,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    }
  ],
  "speakers": [
    "Sangwoo Shim"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/NY0cgM_bXck/maxresdefault.jpg",
  "title": "From Jupyter to MLOps: Jupyter as a key integrator for MLOps",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NY0cgM_bXck"
    }
  ]
}
