{
  "description": "In 2021, JupyterHub was awarded a CZI EOSS grant to improve community practices around inclusion within the project, and that work began in earnest in 2022. An important part of this work involves developing pathways into the community that cater for i) contributors that are diverse and bring a new perspective that is not already represented in our community; and ii) contributors beyond the “burnt out PhD” archetype that is prevalent throughout the landscape of open source scientific software.\n\nOne strategy we employed from the start of the grant-writing process was to secure funding for four rounds of Outreachy, with two interns per round, over the grant duration of two years. Outreachy is a mission-aligned organisation dedicated to placing interns from backgrounds that are underrepresented in tech, into open source projects. The mentorship these interns receive is the bedrock on which sustainable entry-level pathways into the community can be built. Since Outreachy supports more than only coding projects, we can also provide other pathways into the community that do not rely on being a “coder” or “software developer”.\n\nThis kind of “Mountain of Engagement” work is important to any community-led project, whether within the Jupyter ecosystem or beyond, and as such we have been capturing lessons learned in a guide as we go. This will ensure that the process of participating in Outreachy as a community is a little more repeatable with each round, and provide clear pathways for other community members to become involved in the processes after the term of the grant. We also hope that by sharing our experiences, this resource becomes usable by other Jupyter subprojects, or elsewhere, to begin their own internship initiatives.\n\nRepository: https://github.com/jupyterhub/outreachy\nWebsite: https://jupyterhub-outreachy.readthedocs.io\nBy the time JupyterCon 2023 arrives, JupyterHub will have completed the first Outreachy round funded by the CZI grant. We have already learned, and will continue to learn, a great deal around the processes required for running these internships, which we have captured in the above guide. During this talk, we will discuss some strategies the JupyterHub team implemented during this initial round, such as:\n\nEstablishing partnerships with other mentoring organisations, such as Open Life Science, to deliver support through mentor training and cohort calls for interns\nDeveloping processes during the Outreachy contribution period to manage and evaluate applications",
  "duration": 1256,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    },
    {
      "label": "https://github.com/jupyterhub/outreachy",
      "url": "https://github.com/jupyterhub/outreachy"
    },
    {
      "label": "https://jupyterhub-outreachy.readthedocs.io",
      "url": "https://jupyterhub-outreachy.readthedocs.io"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/vMm5rkiMbGU/maxresdefault.jpg",
  "title": "Sarah Gibson   How to grow the JupyterHub community and improve its practices by mentoring Outreachy",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vMm5rkiMbGU"
    }
  ]
}
