{
  "description": "Are you an educator working in one of the scientific disciplines and are looking to take your lessons to the next level? In the OSSCAR\nproject (Open Software Services for Classrooms and Research, https://www.osscar.org/), we have created an online collaborative hub where instructors can find a curated set of software tools for creating interactive lessons that leverage all the benefits of the Jupyter ecosystem to enrich classroom teaching. At the heart of this initiative, Jupyter notebooks play the role of self-contained lessons which, through their conversion to web-based applications, are practicable for all prospective students independent of their local setup (what libraries and packages they have installed on their own computer). In this talk, I will first guide you through a prototypical example of one of these notebook-based lessons and show how it may be used to enhance traditional teaching methods. Whilst doing so, emphasis shall be put on the technological and design choices that were made to optimize the pedagogical effectiveness of the lessons. Following on from this, I shall demonstrate the various steps that go into constructing such a notebook and how one goes about deploying it as a cloud-based web application. Here, we shall see an example of how an instructor, who has a given concept that they would like to present, can quickly go from a basic lesson plan to a functioning notebook in a few steps. Additionally, I shall briefly show how a teacher is able to benefit from the flexibility of the Jupyter environment to implement customized features (such as bespoke widgets and extensions) in order to get the full potential from their lessons. Finally, I shall outline the advantages engendered by this collaborative project: how lessons, tools, and knowledge can be shared and re-used amongst the broader community - aspects which are discussed in more detail in the paper [1]. In this spirit, we hope that this talk fosters discussion amongst interested Jupyter users regarding how they may get involved in the OSSCAR initiative, use ideas derived from our approach to notebook-based teaching, and possibly contribute suggestions for building upon our current approach.\n\n[1] D. Du, T. Baird, S. Bonella and G. Pizzi, OSSCAR, an open platform for collaborative development of computational tools for education in science, Computer Physics Communications, 282, 108546 (2023)",
  "duration": 1639,
  "language": "eng",
  "recorded": "2023-05-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20230531110007/https://www.jupytercon.com/"
    },
    {
      "label": "https://www.osscar.org/",
      "url": "https://www.osscar.org/"
    }
  ],
  "speakers": [
    "Taylor Baird"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/pNQZsXzZLkc/maxresdefault.jpg",
  "title": "OSSCAR: leveraging interactive Jupyter notebooks to enhance teaching in the scientific disciplines",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pNQZsXzZLkc"
    }
  ]
}
