{
    "description": "PyCon APAC 2022｜一般演講 Talks｜國泰金控 Cathay Financial Holdings / 美光科技 Micron 冠名贊助\n\n✏️ 共筆 Note：https://hackmd.io/@pycontw/rkh-wTXyi\n🖐🏻 Slido：https://app.sli.do/event/jfzDeYQ9auhfLV1U9uRRBN\n🪧 投影片 Slides：https://github.com/ShreyaKhurana/PyconAPAC22\n💬 語言 Language：英文 English\n🎯 層級 Level：中階 Intermediate\n🔎 分類 Category：自然語言處理 Natural Language Processing\n\n💡 摘要 Abstract 💡\nFrom Googling for the reviews of that new deli place to watching Parasite with subtitles, sequence-to-sequence learning is behind a variety of applications - machine translation, speech recognition, chatbots etc. In this talk, I share my experiences with modeling real-world messy data with attention-based transformer and CNN models - the good, the bad, and the ugly. I'll discuss some of the lessons that we learned through experimentation on sequence-to-sequence models - about architecture size, vocabulary, the relation between validation and training error, etc. Working in ML makes you realize one thing–it’s not always black and white and it doesn’t have to be a black box! The process of building good NLP models is not a straight line. Not-so-little decisions can often require tons of experiments, but in this talk, I share my modeling experience and lessons learned so your walk isn't as random as mine was!\n\n🚀 講者介紹 About Speaker - Shreya Khurana 🚀\nHi, I'm a data scientist in the Domain Search team at GoDaddy which researches, develops, and deploys deep learning models for Godaddy’s domain business. I enjoy working with data in general and more specifically building NLP models. I'm a Python enthusiast and enjoy sharing my learnings with the community - I've previously presented at the Grace Hopper Conference, PyCon US, EuroPython and GeoPython.\n\n#pycontw #pyconapac2022 #python #sequencetosequence #nlp #machinelearning \n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://pycontw.blogspot.com",
    "speakers": [
        "Shreya Khurana"
    ],
    "recorded": "2022-09-03",
    "title": "Big Models, Small Pitfalls: My Random Walk Towards Building Seq2Seq｜Shreya Khurana｜PyCon APAC 2022",
    "thumbnail_url": "https://i.ytimg.com/vi/vI74uLKk4ag/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=vI74uLKk4ag"
        }
    ]
}