{
    "description": "PyCon APAC 2022｜主題演講 Keynotes｜國泰金控 Cathay Financial Holdings / 美光科技 Micron 冠名贊助\n\n🪄 說明 Description 🪄\nIqbal will be speaking about the past, present and his hopes for the future of the community, from a people mover and organizer point of view.\nThere will be nostalgic pictures, thoughts on diversity, inclusion, generational change, burnout and hopefully opportunities to reflect during this talk.\n\n🚀 講者介紹 About Speaker - Iqbal Abdullah 🚀\nI am a Malaysian who has been a resident of Japan for the past 20 years. Career wise, I am the founder and CEO of LaLoka Labs. My previous company, Xoxzo was acquired in Sept 2021 which I still currently serve as the COO. In the past, I have worked in engineering positions within Yahoo! Japan and business roles within Amazon. The experiences working within these organizations have tremendously influenced me on my ideas and philosophies concerning engineering and business.\n\nMy Python journey started in 2002 with ver. 1.5.2 when I started working at Yahoo! Japan. The language has led me to the community behind it. My first PyCon APAC was in 2010 in Singapore.\nWithin the Python community, I co-founded PyCon JP and PyCon MY, I help manage PyCon APAC, and I am also involved with the Trademarks Working Group (WG) and the Diversity and Inclusion WG of the Python Software Foundation (PSF).\n\nI also ran for a seat on the PSF board, and after failing spectacularly for the second time, wrote an essay on my thoughts on what needs to be done for the PSF. I would like to believe that this directly had an impact on the PSF's decision to start the D&I Workgroup in Dec 2020.\n\nThe experiences working with the community has tremendously shaped my views on how and why we need to be present and actively participate within the community with ideas, effort and money. It also has shown me how the rest of us are lacking the opportunities that some of us have. Opening those opportunities to more people has and still is a constant personal mission that I have. After all, we are living off the goodwill which the people before us have left us with, and replacing that goodwill is the least we can do. Feel free to connect with me or learn more about myself from Twitter, LinkedIn or even LaLoka Labs's blog.\n\n#python #pycontw #pyconapac2022\n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://pycontw.blogspot.com",
    "speakers": [
        "Iqbal Abdullah"
    ],
    "recorded": "2022-09-03",
    "title": "Changing the World, One PyCon at a Time (Ver. 2022)｜Iqbal Abdullah｜主題演講 Keynotes｜PyCon APAC 2022",
    "thumbnail_url": "https://i.ytimg.com/vi/T6NNpKbNyRY/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=T6NNpKbNyRY"
        }
    ]
}