{
    "description": "PyCon APAC 2022｜專業課程 Tutorials｜國泰金控 Cathay Financial Holdings / 美光科技 Micron 冠名贊助\n\n✏️ 共筆 Note：https://hackmd.io/@pycontw/ryg0L67ys\n🖐🏻 Slido：https://app.sli.do/event/6DJ5vhaAUaAP3as8m7vcnw\n💬 語言 Language：英文 English\n🎯 層級 Level：中階 Intermediate\n🔎 分類 Category：專案建置工具 Project Tooling\n\n💡 摘要 Abstract 💡\nAcquiring massive amounts of public data from anywhere on the web is crucial in today's data age. Such undertaking could be achieved through the use of Spiders which has two components: (1) Crawling —— the means to find the content of interest and (2) Extraction —— the means of turning data into a structured format. However, the web changes so fast that scaling and maintaining these spiders become an issue. In this talk, we will create an end-to-end web crawling project that walks through each crucial step, the challenges for each stage, and the available tools and techniques to overcome such obstacles. We will be using Scrapy, one of the most popular web crawling Python frameworks, together with its ecosystem of tools.\n\n🚀 講者介紹 About Speaker - Kevin Lloyd Bernal 🚀\nKevin is currently a Software Engineer in Zyte. He builds on solutions to crawl the web at scale. He's part of the team that develops and maintains open source packages that enable developers to effectively manage their parsing and crawling solutions. He is also currently studying MS in Computer Science at GA Tech specializing in Machine Learning.\n\n#python #pycontw #pyconapac2022 #webcrawler #scrapy\n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://pycontw.blogspot.com",
    "speakers": [
        "Kevin Lloyd Bernal"
    ],
    "recorded": "2022-09-03",
    "title": "Effective Ways to Scale-Up and Maintain Your Web Crawling Project｜Kevin Lloyd Bernal｜PyCon APAC 2022",
    "thumbnail_url": "https://i.ytimg.com/vi/pLucY2PoSts/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=pLucY2PoSts"
        }
    ]
}