{
    "description": "PyCon APAC 2022｜一般演講 Talks｜國泰金控 Cathay Financial Holdings / 美光科技 Micron 冠名贊助\n\n✏️ 共筆 Note：https://hackmd.io/@pycontw/B1nqUTQ1s\n🖐🏻 Slido：https://app.sli.do/event/2odhKfnXyV33Y4yCPDsZdb\n💬 語言 Language：英文 English\n🎯 層級 Level：中階 Intermediate\n🔎 分類 Category：最佳實踐與慣例 Best Practices & Patterns\n\n💡 摘要 Abstract 💡\nDevelopers have used Sphinx to integrate documentation into workflow and use tools and services to enhance the developer and user experience from those documentations. This talk will discuss how we further it by utilizing markup processors as extensions and generate more effective documentation. This will be also further elaborated on through a case study showcasing how integrating the documentation can improve the overall benefit towards a project and mistakes to avoid while attempting the integration.\n\n🚀 講者介紹 About Speaker - Renaldi Gondosubroto 🚀\nRenaldi Gondosubroto is the Founder and CEO of GReS Studio, a company that promotes the concept of the Internet of Things by creating solutions for problems around the community while utilizing the concept. Leading his team of individuals that share the same passion as him with the IoT concept, he leads his company with the vision of being able to have an interconnected world where both individuals and companies can share big data with one another. Starting from just a hobbyist of programming in different languages including Python from a very young age, he eventually decided to venture into working within the IoT technology sector when he created an innovation to help combat a problem all around us which everyone encounters in their daily lives: air pollution. Throughout his time leading his company, Renaldi enjoys sharing his experiences regarding practices and trends that he believes are of importance to develop and navigate through the technologies of today.\n\n#python #pycontw #pyconapac2022 #sphinx #workflow #documentation \n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://pycontw.blogspot.com",
    "speakers": [
        "Renaldi Gondosubroto"
    ],
    "recorded": "2022-09-03",
    "title": "Enhancing Documentations on Sphinx with the Power of Extensions｜Renaldi Gondosubroto｜PyCon APAC 2022",
    "thumbnail_url": "https://i.ytimg.com/vi/QDExDbvfDb8/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=QDExDbvfDb8"
        }
    ]
}