{
    "description": "PyCon APAC 2022｜一般演講 Talks｜國泰金控 Cathay Financial Holdings / 美光科技 Micron 冠名贊助\n\n✏️ 共筆 Note：https://hackmd.io/@pycontw/HyCRLpQyi\n🖐🏻 Slido：https://app.sli.do/event/fLCSJrx9LtUJq631UaNLuQ\n💬 語言 Language：英文 English\n🎯 層級 Level：中階 Intermediate\n🔎 分類 Category：自然語言處理 Natural Language Processing\n\n💡 摘要 Abstract 💡\nMath word problem (數學應用問題) is one of the Holy Grail issue in modern AI community, especially in NLP/NLU field. It takes a machine that understands the semantics of human languages and equipts with mathematic skills to solve the equations desribed with natural languages. As Loki NLU engine provides accurate semantic parsing result and SymPy is good at solving equations, I'd love to share my experience of using Loki NLU engine to convert math word problems into equations, then solve them with SymPy. The beauty of these two tools is that they are both Python-based and it only takes basic Python skills to build the math word problem solver. To begin with, I present a simple comparison of NLU systems and their joy and tears (mostly tears) while dealing with math word problems. Then, the hybrid NLU system, Loki, is used to convert math word problems into equations. Finally, I introduce SymPy and how to use it to solve the equations to get the answer of the problem.\n\n🚀 講者介紹 About Speaker - PeterWolf 🚀\n強人工智慧倡議者、設計者與實作者。\nStrong AI advocater, designer and practitioners. \n\n#python pycontw #pyconapac2022 #nlu #sympy #mathwordproblem \n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://pycontw.blogspot.com",
    "speakers": [
        "PeterWolf"
    ],
    "recorded": "2022-09-03",
    "title": "Fantastic NLU: Loki, SymPy and the Solver to Math Word Problems｜PeterWolf｜PyCon APAC 2022",
    "thumbnail_url": "https://i.ytimg.com/vi/u6SkdB6Oh1E/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=u6SkdB6Oh1E"
        }
    ]
}