{
    "description": "PyCon APAC 2022｜主題演講 Keynotes｜國泰金控 Cathay Financial Holdings / 美光科技 Micron 冠名贊助\n\n🪧 投影片 Slides：https://www.dropbox.com/s/5be2a75ke4vyp8f/talk-pycon-apac-20220904-v2.pdf?dl=0\n\n🪄 說明 Description 🪄\nGraphs depict how entities connect and interact with one another, and enable fundamental predictive tasks, including node classification (NC) and link prediction (LP). With the blooming and advances of deep learning, novel Graph Representation Learning (GRL) and Graph Neural Networks (GNN) models, which learn the representations of nodes and graphs, are invented and widely applied on social and information networks. How can GRL/GNN be applied for data science? In this talk, I will utilize our recent research outcomes to exhibit what, where, and how graph machine learning can benefit a variety of tasks in data science. First, I will first give a review on both unsupervised and supervised GRL for typical NC and LP tasks. Second, I will show that GRL can be applied to better model and exploit diverse relationships between various types of nodes in the realms of recommender systems and knowledge base. Third, through the applications to fake news detection, air quality forecasting, traffic flow forecasting, customs fraud detection, and stock price prediction, I will further exhibit that GRL and GNN are powerful even when the graphs cannot be observed.\n\n🚀 講者介紹 About Speaker - Dr. Cheng-Te Li 🚀\nDr. Cheng-Te Li is now an Associate Professor at Institute of Data Science, National Cheng Kung University (NCKU), Tainan, Taiwan. He received his Ph.D. degree (2013) from Graduate Institute of Networking and Multimedia, National Taiwan University. Before joining NCKU, he was an Assistant Research Fellow (2014-2016) at CITI, Academia Sinica. Dr. Li’s research targets at Machine Learning and Data Mining with their applications to Social Networks, and Social Media, Recommender Systems, and Natural Language Processing. His work has been published at premier conferences, including KDD, TheWebConf (WWW), ICDM, CIKM, SIGIR, IJCAI, ACL, EMNLP and NAACL. Dr. Li’s academic recognition includes: Y. Z. Hsu Scientific Paper Award (2022), FAOS Young Scholars’ Creativity Award (2021), MOST Future Tech Awards (2021, 2020), TAAI Domestic Track Best Paper Award (2020), K. T. Li Young Researcher Award (2019), MOST Young Scholar Fellowship (2018), and Exploration Research Award of Pan Wen Yuan Doundation (2016).nHe leads Networked Artificial Intelligence Laboratory (NetAI Lab) at NCKU.\n\n#python #pycontw #pyconapac2022\n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://pycontw.blogspot.com",
    "speakers": [
        "Dr. Cheng-Te Li"
    ],
    "recorded": "2022-09-03",
    "title": "Graph Machine Learning and Its Applications｜Dr. Cheng-Te Li｜主題演講 Keynotes｜PyCon APAC 2022",
    "thumbnail_url": "https://i.ytimg.com/vi/Gy3bvZEtdCk/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=Gy3bvZEtdCk"
        }
    ]
}