{
    "description": "PyCon APAC 2022｜一般演講 Talks｜國泰金控 Cathay Financial Holdings / 美光科技 Micron 冠名贊助\n\n✏️ 共筆 Note：https://hackmd.io/@pycontw/BkwCLT7Ji\n🖐🏻 Slido：https://app.sli.do/event/sE3aaBEUsYZ7HiLkrvcrAp\n🪧 投影片 Slides：https://drive.google.com/file/d/1NdBaMqZjVTucV_Z2EY2iFub826hF92ga/view?usp=sharing\n💬 語言 Language：中文演講/英文投影片 Chinese talk w. English slides\n🎯 層級 Level：中階 Intermediate\n🔎 分類 Category：應用 Application\n\n💡 摘要 Abstract 💡\nIn the current data-driven world, we are often faced with how to process and analyze data effectively and in real time. And streaming processing will be an important application. In addition, the data will have different schemas for different applications and needs. In order to effectively achieve data correctness and availability in the application of streaming, it is necessary to integrate schema verification into the streaming process. In order to achieve this objective, I will start with introducing the concept and use cases or scenarios of streaming process and two services, Apache Kafka and Schema Registry. The Kafka is a message queue system that can handle a large amount of streaming data. And Schema Registry is a service which based on Kafka, it can help us do schema verification during producing data to Kafka or consuming data from Kafka. Lastly, I will share how to use python to integrate these two service to implement a reliable streaming process.\n\n🚀 講者介紹 About Speaker - 蘇揮原 Mars Su 🚀\nA Senior ML/Data Engineer in Gogolook. Currently i am in charge of implementing streaming etl infrastructure and nlp related ml model and application. Having 4+ years experience of data science and data engineering, include NLP and Streaming(micro-batch) ETL design. My research interests include nlp related algorithm model and paper, streaming data pipeline and cloud service. Hope i can contribute something in data world.\n\n#python #pycontw #pyconapac2022 #kafka #streaming\n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://pycontw.blogspot.com",
    "speakers": [
        "蘇揮原 Mars Su"
    ],
    "recorded": "2022-09-03",
    "title": "Integrate Schema Registry & Kafka in Python...｜蘇揮原 Mars Su｜PyCon APAC 2022",
    "thumbnail_url": "https://i.ytimg.com/vi/X0HryRZ7BnQ/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=X0HryRZ7BnQ"
        }
    ]
}