{
    "description": "PyCon APAC 2022｜主題演講 Keynotes｜國泰金控 Cathay Financial Holdings / 美光科技 Micron 冠名贊助\n\n🪄 說明 Description 🪄\nThe past year has seen a wave of interest at the intersection of security and open source. The rapid creation of new tools, new standards, and new best practices to build defences against threats (both historic and anticipated) represents real action towards a fundamentally more secure technological ecosystem. But what, exactly, are we protecting? Who are we protecting it from? And what responsibility do we as individuals have to participate?\n\n🚀 講者介紹 About Speaker - Dustin Ingram 🚀\nDustin is a software engineer on Google’s Open Source Security Team, where he works on improving the security of open-source software that Google & the rest of the world relies on. He’s also a director of the Python Software Foundation, where he helps ensure the long-term success of one very big open-source Python project you've probably heard of: Python itself, as well as the community around it. He's also maintainer of the Python Package Index, where he helps ensure the long-term success of hundreds of thousands of tiny Python projects, many of which you've probably never heard of, but play a critical role in the Python ecosystem.\n\n#python #pycontw #pyconapac2022\n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://pycontw.blogspot.com",
    "speakers": [
        "Dustin Ingram"
    ],
    "recorded": "2022-09-03",
    "title": "Protecting the Collective Good｜Dustin Ingram｜主題演講 Keynotes｜PyCon APAC 2022",
    "thumbnail_url": "https://i.ytimg.com/vi/JHLuuIWLUSk/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=JHLuuIWLUSk"
        }
    ]
}