{
    "description": "PyCon APAC 2022｜一般演講 Talks｜國泰金控 Cathay Financial Holdings / 美光科技 Micron 冠名贊助\n\n✏️ 共筆 Note：https://hackmd.io/@pycontw/ryxkv6m1j\n🖐🏻 Slido：https://app.sli.do/event/89eWi3M339pEYGWaAtcwac\n💬 語言 Language：英文 English\n🎯 層級 Level：中階 Intermediate\n🔎 分類 Category：機器學習 Machine Learning\n\n💡 摘要 Abstract 💡\nPython drives Machine Learning advancements in numerous fascinating scientific areas, one of which is chaos theory. Chaos theory is the study of systems that appear random but are completely deterministic, such as the double pendulum. Due to factors such as open-source libraries and an active community, Python has allowed for new machine learning progress for more efficient understanding of chaos theory, particularly with the application of ML models for new perspectives on problems considered “unsolvable”. In this talk, we discuss Python implementations of physics-informed neural networks, PINNs, for chaotic physics scenarios. The key takeaways are a refreshing introduction to the fascinating field of chaos theory and an appreciation for how Python is impacting physics research.\n\n🚀 講者介紹 About Speaker - Srivatsa Kundurthy 🚀\nSrivatsa Kundurthy is a student based in the Greater New York City Area. As a Python practitioner, his projects include Open Source Intelligence tools for extracting public data and Python notebooks for explaining and simulating chaotic dynamical systems. His work in machine learning includes studying computer vision applications and researching neural networks for predicting states of chaotic dynamical systems. Additionally, he is working with the LAION Research Group to develop and release the world’s largest image-text dataset. Apart from Machine Learning Research, Srivatsa is greatly interested in technology policy and community-related issues, particularly those extending to the accessibility of programming education. On the side, Srivatsa enjoys science communication and stargazing.\n\n#python pycontw #pyconapac2022 #machinelearning \n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://pycontw.blogspot.com",
    "speakers": [
        "Srivatsa Kundurthy"
    ],
    "recorded": "2022-09-03",
    "title": "Python for the Unsolvable: Machine Learning Applications in...｜Srivatsa Kundurthy｜PyCon APAC 2022",
    "thumbnail_url": "https://i.ytimg.com/vi/Bk-Dji80n2Q/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=Bk-Dji80n2Q"
        }
    ]
}