{
    "description": "PyCon APAC 2022｜一般演講 Talks｜國泰金控 Cathay Financial Holdings / 美光科技 Micron 冠名贊助\n\n✏️ 共筆 Note：https://hackmd.io/@pycontw/r1O1wpmyo\n🖐🏻 Slido：https://app.sli.do/event/mkwQmSfgPv8JCsh8Jny9xm\n💬 語言 Language：英文 English\n🎯 層級 Level：中階 Intermediate\n🔎 分類 Category：科學 Science\n\n💡 摘要 Abstract 💡\nScanning Tunneling Microscope is widely used for 2D material characterization and even more, for building quantum computer at the cutting edge of science. A typical surface science experiment can generate hundreds of STM images each containing multiple structures to be identified. Since each investigation is different, it needs to draw on highly flexible methods algorithmically and integrate several image processing techniques. In this talk I’ll present an end-to-end Pythonic solution: reading raw STM data, implementing various STM artifact, noise filtering schemes and flattening. Then I’ll discuss how to search for, identify, count and measure different surface structures, particularly some epitaxial islands. Finally I’ll show statistical results of size and angular distributions, and apply some similar image processing, feature recognition and image interpolation algorithms to extract angular distributions from electron diffraction measurements and compare the results.\n\n🚀 講者介紹 About Speaker - Hsu-Kai Cheng 🚀\nI am currently a research assistant at Center for Condensed Matter Sciences in National Taiwan University (NTU). I received my bachelor's degree in the Department of Physics, NTU and my master’s degree in the Graduate Institute of Applied Physics, NTU. My scientific interests include surface science device development and characterization and my current research focuses on post-graphene materials such as black phosphorus and transition metal dichalcogenides. Especially, I aim to explore the properties of topological materials in which the interplay between topology and functions is so overwhelming and renders materials of this kind really promising for future application.\n\n#python #pycontw #pyconapac2022 #scanning #tunneling #microscopy #imageprocessing #featurerecognition #featureextraction\n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://pycontw.blogspot.com",
    "speakers": [
        "Hsu-Kai Cheng"
    ],
    "recorded": "2022-09-03",
    "title": "Python Under a Microscope: Scanning Tunneling Microscopy...｜Hsu-Kai Cheng｜PyCon APAC 2022",
    "thumbnail_url": "https://i.ytimg.com/vi/8g6_Q2zMJ0g/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=8g6_Q2zMJ0g"
        }
    ]
}