{
    "description": "PyCon APAC 2022｜一般演講 Talks｜國泰金控 Cathay Financial Holdings / 美光科技 Micron 冠名贊助\n\n✏️ 共筆 Note：https://hackmd.io/@pycontw/SkcqIpQko\n🖐🏻 Slido：https://app.sli.do/event/tAUZ1kB7EQJbQpbCvsvTse\n🪧 投影片 Slides：https://www.canva.com/design/DAEyq1KSIoE/tnOz5wAsPUfuf_IEdTcUBw/view?utm_content=DAEyq1KSIoE&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton\n💬 語言 Language：英文 English\n🎯 層級 Level：入門 Novice\n🔎 分類 Category：教育 Education\n\n💡 摘要 Abstract 💡\nWhen I teach technology things to 12~15 years old students in the rural school, I realize that we need have some solutions like Raspberry Pi Pico + MicroPython for students. For the economic consideration, The PICO gives them friendly prices and creates more flexible things. And it's useful for their life in long-term regard. The technology community is a different environment for them but will play an essential role in inspiring them to change their life. In this talk, I will share my teaching experience of MicroPython combined with technology. I will share a middle school teacher's education case on developing a work, material preparation management, woodworking design, circuit design, and MicroPython writing electromechanical integration. Let the children know the outline of the world's technology and learn Python's practical skills.\n\n🚀 講者介紹 About Speaker - Milo Chen 🚀\nIn my achievement, I did LinkedIn 100,000+ followers (2017), Intel Award (2018), Stack overflow ranking top 1k~2k (2021), PyCon talk WebRTC (2021). My first time in to use Python 2.0 was in 2002. I used it to write TCP/IP programs. I have majored in law, electronics, and computer science. I like to be constantly exposed to new knowledge and new areas. -- I have made contributions to product innovation in industries such as electronics, automobiles, and medical systems and have served as a senior software engineer, product manager, and architect. Now I'm solving the problem of the global gap between the rich and the poor. -- Currently, I work as a science and technology teacher in a rural middle school. Whether it is developing and promoting the Sync Slide open source product (GPL 3) or incubating the Metaversity (Metaverse University) ecosystem, these are all strategies to solve the gap between the rich and the poor in the world. Because I want to improve the world's human gap.\n\n#python #pycontw #pyconapac2022 #raspberrypipico #education \n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://pycontw.blogspot.com",
    "speakers": [
        "Milo Chen"
    ],
    "recorded": "2022-09-03",
    "title": "Use Raspberry Pi Pico + Python to Provide Good Value on...｜Milo Chen｜PyCon APAC 2022",
    "thumbnail_url": "https://i.ytimg.com/vi/e7WSVXg-YAY/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=e7WSVXg-YAY"
        }
    ]
}