{
  "description": "\"Revisiting Bayesian Network Learning with Small Vertex Cover\"\nJuha Harviainen, Mikko Koivisto\n(https://proceedings.mlr.press/v216/harviainen23a.html)\n\nAbstract\nThe problem of structure learning in Bayesian networks asks for a directed acyclic graph (DAG) that maximizes a given scoring function. Since the problem is NP-hard, research effort has been put into discovering restricted classes of DAGs for which the search problem can be solved in polynomial time. Here, we initiate investigation of questions that have received less attention thus far: Are the known polynomial algorithms close to the best possible, or is there room for significant improvements? If the interest is in Bayesian learning, that is, in sampling or weighted counting of DAGs, can we obtain similar complexity results? Focusing on DAGs with bounded vertex cover number—a class studied in Korhonen and Parviainen’s seminal work (NIPS 2015)—we answer the questions in the affirmative. We also give, apparently the first, proof that the counting problem is #P-hard in general. In addition, we show that under the vertex-cover constraint counting is #W[1]-hard.\n\nSlides: https://www.auai.org/uai2023/oral_slides/342-oral-slides.pdf",
  "duration": 1394,
  "language": "eng",
  "recorded": "2023-07-31",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.auai.org/uai2023/"
    },
    {
      "label": "https://proceedings.mlr.press/v216/harviainen23a.html",
      "url": "https://proceedings.mlr.press/v216/harviainen23a.html"
    },
    {
      "label": "https://www.auai.org/uai2023/oral_slides/342-oral-slides.pdf",
      "url": "https://www.auai.org/uai2023/oral_slides/342-oral-slides.pdf"
    }
  ],
  "speakers": [
    "Juha Harviainen",
    "Mikko Koivisto"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Mx4WfFabc7c/maxresdefault.jpg",
  "title": "Revisiting Bayesian Network Learning with Small Vertex Cover",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Mx4WfFabc7c"
    }
  ]
}
