{
  "description": "\"Neural Probabilistic Logic Programming in Discrete-Continuous Domains\"   Lennert De Smet, Pedro Zuidberg Dos Martires, Robin Manhaeve, Giuseppe Marra, Angelika Kimmig, Luc De Raedt\n(https://proceedings.mlr.press/v216/de-smet23a.html)\n\nAbstract\nNeural-symbolic AI (NeSy) allows neural networks to exploit symbolic background knowledge in the form of logic. It has been shown to aid learning in the limited data regime and to facilitate inference on out-of-distribution data. Probabilistic NeSy focuses on integrating neural networks with both logic and probability theory, which additionally allows learning under uncertainty. A major limitation of current probabilistic NeSy systems, such as DeepProbLog, is their restriction to finite probability distributions, i.e., discrete random variables. In contrast, deep probabilistic programming (DPP) excels in modelling and optimising continuous probability distributions. Hence, we introduce DeepSeaProbLog, a neural probabilistic logic programming language that incorporates DPP techniques into NeSy. Doing so results in the support of inference and learning of both discrete and continuous probability distributions under logical constraints. Our main contributions are 1) the semantics of DeepSeaProbLog and its corresponding inference algorithm, 2) a proven asymptotically unbiased learning algorithm, and 3) a series of experiments that illustrate the versatility of our approach.\n\nSlides: https://www.auai.org/uai2023/oral_slides/233-oral-slides.pdf",
  "duration": 1312,
  "language": "eng",
  "recorded": "2023-07-31",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.auai.org/uai2023/"
    },
    {
      "label": "https://proceedings.mlr.press/v216/de-smet23a.html",
      "url": "https://proceedings.mlr.press/v216/de-smet23a.html"
    },
    {
      "label": "https://www.auai.org/uai2023/oral_slides/233-oral-slides.pdf",
      "url": "https://www.auai.org/uai2023/oral_slides/233-oral-slides.pdf"
    }
  ],
  "speakers": [
    "Lennert De Smet",
    "Pedro Zuidberg Dos Martires",
    "Robin Manhaeve",
    "Giuseppe Marra",
    "Angelika Kimmig",
    "Luc De Raedt"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/eqWOMycQOk4/maxresdefault.jpg",
  "title": "Neural Probabilistic Logic Programming in Discrete Continuous Domains",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eqWOMycQOk4"
    }
  ]
}
