{
  "description": "\"Conditional Abstraction Trees for Sample-Efficient Reinforcement Learning\"\nMehdi Dadvar, Rashmeet Kaur Nayyar, Siddharth Srivastava\n(https://proceedings.mlr.press/v216/dadvar23a.html)\n\nAbstract\nIn many real-world problems, the learning agent needs to learn a problem’s abstractions and solution simultaneously. However, most such abstractions need to be designed and refined by hand for different problems and domains of application. This paper presents a novel top-down approach for constructing state abstractions while carrying out reinforcement learning (RL). Starting with state variables and a simulator, it presents a novel domain-independent approach for dynamically computing an abstraction based on the dispersion of temporal difference errors in abstract states as the agent continues acting and learning. Extensive empirical evaluation on multiple domains and problems shows that this approach automatically learns semantically rich abstractions that are finely-tuned to the problem, yield strong sample efficiency, and result in the RL agent significantly outperforming existing approaches.\n\nSlides: https://www.auai.org/uai2023/oral_slides/701-oral-slides.pdf",
  "duration": 1521,
  "language": "eng",
  "recorded": "2023-07-31",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.auai.org/uai2023/"
    },
    {
      "label": "https://www.auai.org/uai2023/oral_slides/701-oral-slides.pdf",
      "url": "https://www.auai.org/uai2023/oral_slides/701-oral-slides.pdf"
    },
    {
      "label": "https://proceedings.mlr.press/v216/dadvar23a.html",
      "url": "https://proceedings.mlr.press/v216/dadvar23a.html"
    }
  ],
  "speakers": [
    "Mehdi Dadvar",
    "Rashmeet Kaur Nayyar",
    "Siddharth Srivastava"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/UEIwl1NrAqk/maxresdefault.jpg",
  "title": "Conditional Abstraction Trees for Sample-Efficient Reinforcement Learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UEIwl1NrAqk"
    }
  ]
}
