{
  "description": "\"MixupE: Understanding and Improving Mixup from Directional Derivative Perspective\"   \nYingtian Zou, Vikas Verma, Sarthak Mittal, Wai Hoh Tang, Hieu Pham, Juho Kannala, Yoshua Bengio, Arno Solin, Kenji Kawaguchi\n(https://proceedings.mlr.press/v216/zou23a.html)\n\nAbstract\nMixup is a popular data augmentation technique for training deep neural networks where additional samples are generated by linearly interpolating pairs of inputs and their labels. This technique is known to improve the generalization performance in many learning paradigms and applications. In this work, we first analyze Mixup and show that it implicitly regularizes infinitely many directional derivatives of all orders. Based on this new insight, we propose an improved version of Mixup, theoretically justified to deliver better generalization performance than the vanilla Mixup. To demonstrate the effectiveness of the proposed method, we conduct experiments across various domains such as images, tabular data, speech, and graphs. Our results show that the proposed method improves Mixup across multiple datasets using a variety of architectures, for instance, exhibiting an improvement over Mixup by 0.8% in ImageNet top-1 accuracy.\n\nSlides: https://www.auai.org/uai2023/oral_slides/129-oral-slides.pdf",
  "duration": 1658,
  "language": "eng",
  "recorded": "2023-07-31",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.auai.org/uai2023/"
    },
    {
      "label": "https://www.auai.org/uai2023/oral_slides/129-oral-slides.pdf",
      "url": "https://www.auai.org/uai2023/oral_slides/129-oral-slides.pdf"
    },
    {
      "label": "https://proceedings.mlr.press/v216/zou23a.html",
      "url": "https://proceedings.mlr.press/v216/zou23a.html"
    }
  ],
  "speakers": [
    "Yingtian Zou",
    "Vikas Verma",
    "Sarthak Mittal",
    "Wai Hoh Tang",
    "Hieu Pham",
    "Juho Kannala",
    "Yoshua Bengio",
    "Arno Solin",
    "Kenji Kawaguchi"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Fnwi35bNZbo/maxresdefault.jpg",
  "title": "MixupE Understanding and Improving Mixup from Directional Derivative",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Fnwi35bNZbo"
    }
  ]
}
