{
  "description": "\"Towards Physically Reliable Molecular Representation Learning\"\nSeunghoon Yi, Youngwoo Cho, Jinhwan Sul, Seung Woo Ko, Soo Kyung Kim, Jaegul Choo, Hongkee Yoon, Joonseok Lee\n(https://proceedings.mlr.press/v216/yi23a.html)\n\nAbstract\nEstimating the energetic properties of molecular systems is a critical task in material design. Machine learning has shown remarkable promise on this task over classical force fields, but a fully data-driven approach suffers from limited labeled data; not just the amount of available data lacks, but the distribution of labeled examples is highly skewed to stable states. In this work, we propose a molecular representation learning method that extrapolates well beyond the training distribution, powered by physics-driven parameter estimation from classical energy equations and self-supervised learning inspired from masked language modeling. To ensure reliability of the proposed model, we introduce a series of novel evaluation schemes in multifaceted ways, beyond the energy or force accuracy that has been dominantly used. From extensive experiments, we demonstrate that the proposed method is effective in discovering molecular structures, outperforming other baselines. Furthermore, we extrapolate it to the chemical reaction pathways beyond stable states, taking a step towards physically reliable molecular representation learning.\n\nSlides: https://www.auai.org/uai2023/oral_slides/95-oral-slides.pdf",
  "duration": 1372,
  "language": "eng",
  "recorded": "2023-07-31",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.auai.org/uai2023/"
    },
    {
      "label": "https://proceedings.mlr.press/v216/yi23a.html",
      "url": "https://proceedings.mlr.press/v216/yi23a.html"
    },
    {
      "label": "https://www.auai.org/uai2023/oral_slides/95-oral-slides.pdf",
      "url": "https://www.auai.org/uai2023/oral_slides/95-oral-slides.pdf"
    }
  ],
  "speakers": [
    "Seunghoon Yi",
    "Youngwoo Cho",
    "Jinhwan Sul",
    "Seung Woo Ko",
    "Soo Kyung Kim",
    "Jaegul Choo",
    "Hongkee Yoon",
    "Joonseok Lee"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/AUdoxYVy6Hc/maxresdefault.jpg",
  "title": "Towards Physically Reliable Molecular Representation Learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AUdoxYVy6Hc"
    }
  ]
}
