{
  "description": "Ponente: Antonio Manjavacas y Alejandro Campoy \nTítulo: Introducción al aprendizaje por refuerzo en Python\nAula: Teoría 6 (Sábado)\n-------------------------------------\nResumen:\nEl aprendizaje por refuerzo es un método de aprendizaje computacional centrado en la interacción de un agente con su entorno. Se trata de un proceso de aprendizaje iterativo, basado en prueba y error, donde el agente recibe recompensas positivas si sus acciones le conducen a estados deseables.\n\nEsta rama de la inteligencia artificial, ampliamente ligada a la psicología conductista, ha permitido alcanzar hitos hasta hace poco impensables, como vencer al campeón mundial de Go o StarCraft, dirigir vehículos autónomos, reducir el consumo energético de edificios, o resolver el problema del plegamiento de proteínas: un reto de la biología desde hace más de 50 años.\n\nEl objetivo de esta charla será ofrecer una introducción práctica al aprendizaje por refuerzo en Python, presentando dos de las librerías más utilizadas en este campo: OpenAI Gym, destinado a la simulación en entornos de aprendizaje, y Stable Baselines, que incluye implementaciones de los algoritmos de aprendizaje por refuerzo que constituyen el estado del arte.\n\nFinalmente, estudiaremos una aplicación real del aprendizaje por refuerzo en control energético de edificios, ámbito en el que se enmarca nuestra investigación y últimos trabajos.",
  "duration": 1918,
  "language": "spa",
  "recorded": "2022-09-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2022.es.pycon.org/"
    }
  ],
  "speakers": [
    "Antonio Manjavacas",
    "Alejandro Campoy"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Z6myo1vGoO4/maxresdefault.jpg",
  "title": "Antonio y Alejandro - Introducción al aprendizaje por refuerzo en Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Z6myo1vGoO4"
    }
  ]
}
