{
  "description": "Ponente: Antoni Aloy\nTítulo: Estimación de proyectos 101\nAula: Paraninfo (Domingo)\n-------------------------\nResumen:\nIncluso si trabajamos en modalidad ágil, sin un presupuesto definido, tenemos ser capaces de valorar el esfuerzo que lleva una tarea, tanto para saber si cabe en un sprint como para poder decidir si se hace o no se hace.\nLos programadores en general pecamos de optimistas, utilizamos el \"tiempo programador\" como unidad de medida, subestimando la tarea en la mayoría de ocasiones.\nEsta ponencia pretende mostrar algunas herramientas y técnicas que nos ayuden a realizar mejores estimaciones, sin olvidar que son eso, estimaciones y no pactos firmados en sangre.\n\nEn nuestra vida como programadores nos vamos encontrando con la pregunta de \"cuánto costará o cuánto llevará hacer una cosa\". Gestionar la incertidumbre y el riesgo es parte de nuestro día a día, pero cuando se trata de dar una cifra muchas veces no tenemos la herramientas para atrevernos a darla. El \"tiempo programador\", cambios de criterio y cómo gestionar los cambios de alcance son parte del contenido introductorio de esta charla.\n\nEl tiempo programador como unidad de medida, nuestra propio bias a la hora de hacer una estimación de un proyecto que nos gusta (o no nos gusta), la subestimación del esfuerzo y la sobreestimación de nuestras propias capacidades, afectan a nuestra manera de acercarnos a una tarea y poder definir su alcance y dificultad.",
  "duration": 1805,
  "language": "spa",
  "recorded": "2022-09-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2022.es.pycon.org/"
    }
  ],
  "speakers": [
    "Antoni Aloy"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/g8vxzheWsOo/maxresdefault.jpg",
  "title": "Antoni Aloy - Estimación de proyectos 101",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=g8vxzheWsOo"
    }
  ]
}
