{
  "description": "Ponente: Caterina Fuster Barceló\nTítulo: Protegiendo el oro con tu corazón\nAula: Teoría 8 (Domingo)\n--------------------------------------------------------\nResumen:\n¿Sabías que igual que puedes identificarte con la huella dactilar también puedes hacerlo con tu corazón? Con esta charla pretendo mostrar cómo es posible usar los electrocardiogramas para proteger la caja fuerte de un banco. A través de este proyecto desarrollado 100% en python que va desde procesamiento de señales con PanTompkins hasta identificación y clasificación de usuarios con TensorFlow, veremos cuáles son las ventajas de identificar usuarios con electrocardiogramas y por qué deberíamos usar este método de identificación biométrica para proteger el oro de una caja fuerte.\n\nEl objetivo de esta charla es acercar la biometría y cómo ésta se combina junto con la inteligencia artificial para lograr hacer un modelo de clasificación de usuarios.\nLos electrocardiogramas son un sistema válido de identificación biométrica desde que se presentó en 2001 el paper titulado \"ECG analysis: a new approach in human identification\" de Lena Biel. Nosotros intentamos ir un paso más allá. Intentamos demostrar que es posible identificar a los usuarios no solo con la señal propia del ECG sino con una sola imagen donde se reflejan los latidos de su corazón. Todo esto, es posible gracias a las técnicas de IA como son las CNNs que nos permiten hacer una clasificación de usuarios basada en estas imágenes.\nDe este modo, en esta charla, veremos cómo es posible identificar a las personas a través de su electrocardiograma y qué ventajas tiene sobre otros sistemas biométricos más habituales.",
  "duration": 2197,
  "language": "spa",
  "recorded": "2022-09-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2022.es.pycon.org/"
    }
  ],
  "speakers": [
    "Caterina Fuster Barceló"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/ejwLeCrf3pY/maxresdefault.webp",
  "title": "Protegiendo el oro con tu corazón",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ejwLeCrf3pY"
    }
  ]
}
