{
  "description": "Ponente: Cheuk Ting Ho\nTítulo: Came for the Conference, Stayed for the Sprint\nAula: Teoría 7 (Sábado)\n-----------------------------------------\nResumen:\nMany Python conferences have \"sprints\" included in their conference schedule. In this talk, we will explain what is it for the newcomers, why is it important to the open-source community, and as an organizer and maintainer how can you help this \"sprints\" movement.\n\nWe all know the famous quote in the Python community \"I came for the language, but I stayed for the community\" by Brett Cannon. But I would like to borrow it and say \"I came for the conference, but I stayed for the sprint\". As one of the organizers of Mentored Sprint, maintainer of an open-source project and long term sprint participant, I would like to explain to the people who are new to the community, what is a \"sprint\"? Also, I would like to discuss the goal of sprints from different points of view.\n\nFirst of all, I would like to introduce the concept of sprints. In software development, we have sprints to achieve some goals, whether it's fixing a bug or adding a new feature. But what about an open-source sprint? Are we going to achieve \"something\" in the sprint? What is this \"something\"?\n\nThen I would like to talk about what is the \"benefit\" of participating in a sprint as a maintainer? Will you get useful help in the sprint? Is it worth the time? What is the expectation of bringing your project into the sprint?\n\nIn the end, I would like to add my opinion on why sprints, especially mentored sprint is so important to the open-source community and makes the community that we all would like to \"stay for\".",
  "duration": 1647,
  "language": "spa",
  "recorded": "2022-09-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2022.es.pycon.org/"
    }
  ],
  "speakers": [
    "Cheuk Ting Ho"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/c_HoP_V1gj0/maxresdefault.jpg",
  "title": "Came for the Conference, Stayed for the Sprint",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=c_HoP_V1gj0"
    }
  ]
}
