{
  "description": "Ponente: Cristián Maureira-Fredes\nTítulo: Aprendiendo sobre el núcleo de Python rompiéndolo todo: un tour gentil y en español\nAula: Paraninfo (Domingo)\n-------------------\nResumen:\nExperience has shown that aprender nuevas tecnologías in another language might be a bit complicado, sobre todo por como our brains are working double to aprender algo totalmente nuevo.\n\nCrecemos sabiendo que aprender inglés para integrarnos en la comunidad tecnológica es un requisito. Python como lenguaje no es una excepción, desde el lenguaje hasta su implementación, lo que a veces aumenta su nivel de complejidad por lo abstracto de diferentes temáticas.\n\nPero... ¿Podemos hacer algo al respecto?\n\nAbriremos la caja de Pandora, y entraremos en el núcleo de Python, para perder el miedo, y darnos cuentas que la implementación de Python estándar (CPython) no es nada del otro mundo, y es un proyecto que cualquier persona con un conocimiento básico de C podría al menos entender en términos generales, y en Español!\n\nAdicionalmente, modificaremos algunos elementos del lenguaje para entender los pasos, y la relación de los archivos de la implementación de forma resumida y enfocado a personas sin tiempo de estudiar todo el código fuente, en otras palabras, lo romperemos todo.\n\nLuego de esta charla, podrás preparar tu hot beverage favorito, y comenzar a modificar lo que quieras de Python, para aprender rompiendo, y sobre todo para tener la base necesaria para mejorar el lenguaje.\n\nEl contenido de la charla está definido por los siguientes temas:\n\nIntroducción a los pasos desde que escribimos código Python y se ejecuta el código de máquina de la VM final.\nImplementación de los tipos de Python en C\nExtensiones de Python en C\nModificación del intérprete estándar de Python\nImaginando Python en Español\nMaterial y recomendaciones finales",
  "duration": 1803,
  "language": "spa",
  "recorded": "2022-09-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2022.es.pycon.org/"
    }
  ],
  "speakers": [
    "Cristián Maureira-Fredes"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/bKLvyltEKV0/maxresdefault.jpg",
  "title": "Aprendiendo sobre el núcleo de Python rompiéndolo todo",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bKLvyltEKV0"
    }
  ]
}
