{
  "description": "Ponente: Daniel Sánchez Llopis\nTítulo: Más vale Wagtail en mano que CMS volando\nAula: Teoría 8 (Domingo)\n----------------------------------------------------\nResumen:\nCómo crear la base de un CMS de una forma rápida y fácil es la clave que muchas veces se busca. En esta charla sobre Wagtail podremos ver las funcionalidades que nos ofrece dentro un espectro inicial de desarrollo de un CMS, además de ver varias las opciones más personalizables y eficientes que podemos desarrollar para nuestro CMS como que trabaje en diferentes idiomas, creemos un generador de formularios, etc.\n\nWagtail es una herramienta que estos últimos años ha crecido a nivel funcional y técnico a pasos agigantados, gracias a sus grandes capacidades como generador de contenido.\n\nEn esta pequeña charla podremos ver los avances de Wagtail y su potencia para desarrollar en poco tiempo una herramienta funcional ya sea como stack único o como API de consulta. Todo ello es gracias a la facilidad que nos da el framework por sí mismo y su versatilidad dentro de un marco como Django, ya que es su base sostenible.\n\nHaremos un pasada desde los puntos más básicos del framework como la generación de los modelos, sus especificaciones para su gestión desde el frontal del CMS incorporado, la autenticación o sistema de permisos personalizados, hasta la integración de elasticsearch, la generación de modelos para generar tareas programáticas dentro del CMS, la creación de un sistema de auditoría o el uso de las señales.",
  "duration": 1721,
  "language": "spa",
  "recorded": "2022-09-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2022.es.pycon.org/"
    }
  ],
  "speakers": [
    "Daniel Sánchez Llopis"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/TaJzucSdvHg/maxresdefault.jpg",
  "title": "Más vale Wagtail en mano que CMS volando",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TaJzucSdvHg"
    }
  ]
}
