{
  "description": "Ponente: Gloria Silva\nTítulo: Mi yo niña estaría orgullosa\nAula: Teoría 8 (Sábado)\n----------------------------------------------------------------------------------\nResumen:\nMi nombre es Gloria Silva soy de Venezuela, Ingeniera Mecánica, autodidacta, aventurera Desarrolladora Web. Estas son solo algunas de las cosas que me hacen ser quien soy. Tengo 29 años y si hay algo que me ha definido todo mi vida es ser curiosa, aunque no me lleve muy bien con eso de ponerme etiquetas porque siento que son limitantes y si algo he aprendido a lo largo de mi vida es no permitir que nada ni nadie me limite o me ponga etiquetas. Establecido este punto y una vez he dejado claro lo mucho que creo en que puedo hacer cada cosa que me propongo, les quiero contar un poco de lo que me ha traído al punto donde estoy ahora.\n\nTodo empieza cuando una niña de una ciudad pequeña en medio de montañas decidió cuestionarse todo (según mi mamá “buscarle las 5 patas al gato”).\nDesde pequeña he sido muy curiosa, me ha llamado la atención: ¿cómo funcionaban las cosas?, ¿que inspiraba a las mentes más brillantes?, ¿cuáles serían sus referentes? y ¿qué podría hacer yo para ser parte de este grupo? el cual era capaz de crear todo aquello que imaginaban o al menos lo intentaban. Esto último para mi siempre ha sido muy importante, llamenle terquedad, testarudez u obstinación, pero siempre he amado probar todo, nunca me he conformado con un “No” como respuesta solo por miedo a intentar algo nuevo, algo arriesgado o fuera de mi zona de confort. De pequeña quise ser muchas cosas, detective, veterinaria, arqueóloga, científica, piloto, ir a Howarts y ser hechicera…, en fin, no tenia ni idea que quería ser, sin embargo, había una cosa que siempre tuve muy clara: quería tener una profesión asombrosa, de esas como la gente que sale en la tele y hace cosas geniales. Edificios enormes o encontrar la cura para alguna enfermedad. Otra cosa que también tuve muy claro era que para lograr esa “asombrosidad” tenía que prepararme y estudiar muchísimo.\nQuisiera decirles que el camino para llegar aquí ha sido fácil, pero no, la realidad es otra, el camino a perseguir nuestros sueños puede ser aterrador, pero si que es nuestro y es todo lo que importa. Nuestra capacidad de sobreponernos a las dificultades, determinación, ambición, disciplina y amor propio, es lo único que nos permitirá enfrentar las mayores dificultades y superarlas, y creanme a lo largo de mi vida he tenido que superar muchas dificultades pero mi historia no trata de ellas, sólo son un par de capítulos que me han enseñado muchas cosas porque yo no soy mis dificultades, soy todo lo que he hecho, aprendido, crecido y todas las oportunidades que he tenido a pesar de ellas. Así que pequeño spoiler, mi historia va de lo orgullosa que estaría la Gloria de 8 años que veía el canal discovery y que a pesar de que no logró ser hechicera en Howarts, si que logro tener una profesión asombrosa como programadora.",
  "duration": 1389,
  "language": "spa",
  "recorded": "2022-09-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2022.es.pycon.org/"
    }
  ],
  "speakers": [
    "Gloria Silva"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/U6L1gYR6IBQ/maxresdefault.webp",
  "title": "Mi yo niña estaría orgullosa",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=U6L1gYR6IBQ"
    }
  ]
}
