{
  "description": "Ponente: Jara Juana Bernejo Vega\nTítulo: Análisis de red del discurso de odio queerfóbico en Twitter\nAula: Teoría 7 (Domingo)\n----------------------------------\nResumen:\nEn los últimos años el uso de retórica anti-LGTBQIA+ se ha disparado en todo el mundo. En España, esto se ha manifestado como un aumento del discurso de odio transfóbico. Grupos reaccionarios difunden narrativas de inseguridad jurídica y bulos de ultraderecha para transmitir discursos de odio y atacar la legislación que garantiza derechos fundamentales de las personas trans. Entre estos actores se encuentran grupos \"feministas trans-excluyentes\" (TERF) y grupos ultraconservadores como el partido político VOX y la plataforma Hazte Oír. El odio antitrans se utiliza como tema cuña para aumentar los discursos de odio a la comunidad LGBTQIA+, el feminismo y la legislación en materia de derechos.\n\nEn esta charla, contextualizaremos el aumento de estos discursos de odio. Presentaremos un trabajo de investigación en el que utilizamos herramientas de análisis de datos cuantitativas para caracterizar las redes de odio queerfóbico en la red social Twitter. Utilizando herramientas Python como t-hoarder, recogemos datos de tendencias transfóbicas en Twitter. Utilizamos métodos de teoría de grafos para encontrar grupos de usuarios reaccionarios antitrans que difunden el odio antitrans en Twitter. Analizamos su comportamiento y la estructura de red de estos grupos.\n\nObservamos que un núcleo pequeño y dedicado de usuarios de Twitter es responsable de la mayor parte del odio antitrans en esta red social. Imitando las estrategias de la ultraderecha, estos grupos reaccionarios impulsan tendencias en Twitter creando ráfagas de contenido de interacción inauténtica. Con esta estrategia, pueden hacer hijacks a la página de portada de Twitter. Su comportamiento constituye un riesgo para la salud e integridad de la personas trans, ya que puede contribuir a difundir bulos y fake news que distorsionan la opinión pública en materia de derechos trans.",
  "duration": 2351,
  "language": "spa",
  "recorded": "2022-09-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2022.es.pycon.org/"
    }
  ],
  "speakers": [
    "Jara Juana Bernejo Vega"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/nC58DAXGhgw/maxresdefault.jpg",
  "title": "Análisis de red del discurso de odio queerfóbico en Twitter",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nC58DAXGhgw"
    }
  ]
}
