{
  "description": "Ponente: Juan Luis Cano\nTítulo: Más allá de pandas: comparativa de dataframes en Python\nAula: Teoría 8 (Domingo)\n-----------------------------------------\nResumen:\nLa biblioteca pandas ha sido uno de los factores decisivos para el crecimiento de Python en la década pasada dentro de la industria del análisis de datos y continúa ayudando a data scientists a resolver problemas 15 años después de su creación. Gracias a su éxito, ahora hay varios proyectos open-source que afirman mejorar pandas de diversas maneras: en esta charla haremos un repaso de dichas alternativas.\n\nDurante la charla\n\nHaremos una breve introducción a pandas, hablaremos de su importancia, y señalaremos algunas de sus limitaciones, como ya hizo su autor hace un lustro (https://wesmckinney.com/blog/apache-arrow-pandas-internals/).\nEnumeraremos algunas de sus alternativas y las clasificaremos (pandas-like o diferente, nodo único vs distribuido). Mencionaremos RAPIDS, Dask, Modin, y Spark por encima.\nMostraremos fragmentos de código de Arrow, Vaex, y Polars a través de notebooks de Jupyter almacenados en Orchest Cloud y hablaremos de los puntos fuertes de las bibliotecas anteriores.\nConcluiremos dando una serie de pautas para elegir un proyecto u otro en función del caso y las necesidades.\nAl final de la charla la audiencia tendrá más información de cómo algunas de las alternativas modernas a pandas encajan dentro del ecosistema, entenderá cuáles proveen un camino para migrar más sencillo, y estará más preparada para juzgar cuál usar para próximos proyectos.\n\nConocimientos básicos de pandas ayudarán a entender el resto de la presentación.\n\nLos materiales de la charla se encuentran en GitHub (https://github.com/astrojuanlu/talk-dataframes), y una serie de artículos de blog desarrollan los conceptos que se verán durante la charla:\n\nArrow\nVaex\nPolars",
  "duration": 2093,
  "language": "spa",
  "recorded": "2022-09-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2022.es.pycon.org/"
    },
    {
      "label": "https://github.com/astrojuanlu/talk-dataframes",
      "url": "https://github.com/astrojuanlu/talk-dataframes"
    },
    {
      "label": "https://wesmckinney.com/blog/apache-arrow-pandas-internals/",
      "url": "https://wesmckinney.com/blog/apache-arrow-pandas-internals/"
    }
  ],
  "speakers": [
    "Juan Luis Cano"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/WgLtYLzEXzQ/maxresdefault.jpg",
  "title": "Más allá de pandas: comparativa de dataframes en Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WgLtYLzEXzQ"
    }
  ]
}
