{
  "description": "Ponente: Maria José Molina-Contreras\nTítulo: Respira mejor: creando un sistema de monitoreo y predictivo para calidad del aire en interiores.\nAula: Teoría 8 (Sábado)\n-------------------------------------------------------------\nResumen:\nEn los últimos dos años mucha gente ha pasado a un estilo de trabajo totalmente remoto, lo que nos ha hecho darnos cuenta de beneficios de los que no éramos conscientes, pero lamentablemente también de algunos pequeños inconvenientes, como problemas relacionados con la salud.\n\nEn esta charla, exploraremos cómo construir un sistema funcional para rastrear la calidad del aire, recoger nuestros propios datos utilizando diferentes sensores e implementar un enfoque predictivo para evitar futuros problemas de salud.\nVamos a sumergirnos en las diferentes configuraciones para interactuar con los sensores de calidad del aire utilizando Python en microcontroladores y sistemas embebidos, recogiendo sus propios datos para evaluar diferentes factores como humedad, temperatura, CO2, partículas, pero eso no es todo, también nos adentraremos en la implementación de un modelo de aprendizaje automático predictivo para predecir los niveles de CO2 en interiores y alertarnos en base a las predicciones antes de los niveles críticos.\n\nLa idea principal de esta charla es mostrar con un ejemplo práctico cómo podemos implementar sistemas de monitorización y aprendizaje automático en casa, y al mismo tiempo, los asistentes verán cómo Python es una gran opción para la monitorización de la calidad del aire interior complementada con un modelo predictivo (Neural Network) para el CO2 interior, mientras se divierten construyendo y monitorizando su casa.",
  "duration": 2251,
  "language": "spa",
  "recorded": "2022-09-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2022.es.pycon.org/"
    }
  ],
  "speakers": [
    "Maria José Molina-Contreras"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/z38pp61CmFQ/maxresdefault.webp",
  "title": "Respira mejor: creando un sistema de monitoreo y predictivo para calidad del aire en interiores",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=z38pp61CmFQ"
    }
  ]
}
