{
  "description": "Ponente: Nerea Luis\nTítulo: \"Computer says no\"\nAula: Paraninfo (Sábado)\n------------------------------\nResumen:\nTe pongo en situación: es 2004 y en la televisión británica se hace famosísimo un sketch llamado \"Computer Says No\" en un programa de humor llamado Little Britain (https://www.youtube.com/watch?v=0n_Ty_72Qds). Yo aún ni había empezado mi carrera como ingeniera por aquel entonces, como para saber qué era todo lo que estaba por venir... En el sketch se reían de la respuesta que daba el ordenador de atención al cliente a un paciente por haber gestionado mal la cita en el sistema. No le podían atender y no podían hacer nada al respecto.\n\nHan pasado 18 años de esa escena y seguimos con un panorama parecido, solo que ahora hablamos de \"algoritmos\" en vez de \"ordenadores\". Los modelos de inteligencia artificial se empiezan a aplicar en sectores como salud, empleo, administración pública, educación, justicia, fabricación... ¿qué harías como ciudadano si el sistema asesorado por una Inteligencia Artificial te dice \"que no\" a una ayuda, a un trámite, a un trabajo, a un crédito? ¿qué derechos tienes como ciudadano para reclamar?... un momento... ¿se puede reclamar a un algoritmo? ¿qué regulación existe? Y nosotros los técnicos... ¿qué mecanismos de transparencia podemos aplicar en nuestros desarrollos? ¿nos va a afectar esto? ¿nos van a pedir que enseñemos el código?\n\nEn 30 minutos y utilizando un tono divulgativo intentaré dar una panorámica concisa y global del estado actual de la regulación de la Inteligencia Artificial en la Unión Europea. Hablaremos de qué esperar en el corto plazo, qué hacer como desarrolladores (y como ciudadanos) y qué sectores parece que van a ser los más \"afectados\".",
  "duration": 2037,
  "language": "spa",
  "recorded": "2022-09-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2022.es.pycon.org/"
    },
    {
      "label": "https://www.youtube.com/watch?v=0n_Ty_72Qds",
      "url": "https://www.youtube.com/watch?v=0n_Ty_72Qds"
    }
  ],
  "speakers": [
    "Nerea Luis"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/aqEqozCcgLQ/maxresdefault.jpg",
  "title": "\"Computer says no\"",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aqEqozCcgLQ"
    }
  ]
}
