{
  "description": "Ponente: Victor Suarez\nTítulo: Pyxel: Los 8 bits Retro Pythoneros\nAula: Teoría 8 (Domingo)\n------------------------------------------------------------------\nResumen:\nEs hora de volver a ver esos grandes títulos de 8 bits que tanto nos han gustado; pero esta vez con un toque de Python. Pyxel está aquí para poder crear nuestro juego de forma sencilla y con todas las herramientas integradas. ¡Todo con toque retro!\n\nEn esta charla, vamos a conocer pyxel. Un pequeño motor que nos ayudará a crear videojuegos de estética 8 bits con 16 colores de forma muy sencilla. Nos permite crear nuestros juegos y gestionar todos los recursos ya que trae herramientas como gestión de mapas, sprites, sonido, etc.\n\nEn esta charla veremos cómo crear un juego desde cero y cómo al final tendremos nuestro juego funcionando de forma muy sencilla. Y por supuesto totalmente retro. Si de pequeño disfrutabas de los juegos de NES, Spectrum y muchos más del mundo de los 8 bits, esta es tu charla. Tanto para aquellos que comienzan como para los que ya tienen experiencia con herramientas como PICO-8, esta charla les ayudará a comprender y conocer Pyxel.\n\nPuedes conocer pyxel y ver ejemplos en su repositorio:\n\nhttps://github.com/kitao/pyxel\n\nCon pyxel, te sorprenderás lo fácil que es hacer un videojuego con todas las características de una máquina de 8 bits, y todo por supuesto con Python.",
  "duration": 2022,
  "language": "spa",
  "recorded": "2022-09-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2022.es.pycon.org/"
    },
    {
      "label": "https://github.com/kitao/pyxel",
      "url": "https://github.com/kitao/pyxel"
    }
  ],
  "speakers": [
    "Victor Suarez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/Z6-eGh3KJyA/maxresdefault.webp",
  "title": "Pyxel: Los 8 bits Retro Pythoneros",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Z6-eGh3KJyA"
    }
  ]
}
