{
  "description": "Ponente: Zerjillo y Javier Flores Martín\nTítulo: Control de dispositivos astronómicos con Python\nAula: Teoría 8 (Sábado)\n-------------------------------------------------\nResumen:\nEl mundo de la astronomía (particularmente el de la astronomía amateur) ha sufrido una revolución en los últimos años con la aparición de multitud de dispositivos que ayudan a la captura de imágenes astronómicas: monturas computerizadas que permiten apuntar al objeto celeste que queremos fotografiar, cámaras CCD, enfocadores automáticos, ruedas portafiltros, etc.\n\nEl control de dichos dispositivos se suele llevar a cabo con software especializado que permite el control y programación de dichos dispositivos. Sin embargo en ocasiones puede que necesitemos una funcionalidad que no esté presente en dichos programas.\n\nEn esta propuesta mostramos como se pueden controlar gran cantidad de dispositivos astronómicos (tanto comerciales como DIY) desde Python, con lo que las posibilidades de crear nuevas funcionalidades automáticas para nuestro equipo astronómico aumentan exponencialmente.\n\nPara conseguir el control de nuestros dispositivos utilizaremos el protocolo de comunicación INDI que facilita el control de dispositivos mediante intercambios de mensajes en XML entre nuestro programa (el cliente) y un servidor al que están conectados nuestros aparatos (puede ser la misma máquina).\n\nEn la propuesta se hará una demostración en vivo del control de varios dispositivos astronómicos con nuestros propios scripts (con el riesgo que conllevan las demostraciones en directo).",
  "duration": 2219,
  "language": "spa",
  "recorded": "2022-09-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2022.es.pycon.org/"
    }
  ],
  "speakers": [
    "Sergio Alonso Burgos",
    "Javier Flores Martín"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ol9ICBMWOOg/maxresdefault.jpg",
  "title": "Control de dispositivos astronómicos con Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ol9ICBMWOOg"
    }
  ]
}
