{
  "copyright_text": "Standard YouTube License",
  "description": "Description\n\nWe will introduce Palladium, an open source framework for setting up predictive analytics services. It supports tasks like fitting, evaluating, storing, and distributing (predictive) models. Core ML processes are compatible with scikit-learn and a large number of scikit-learn’s features can be used. Besides the use of Palladium we will also show how to use it with Docker and Mesos / Marathon.\n\n\nAbstract\n\nIn this talk, we will introduce Palladium, an open source framework for easily setting up predictive analytics services (https://github.com/ottogroup/palladium). It supports tasks like fitting, evaluating, storing, distributing, and updating (predictive) models. Core machine learning processes are compatible with the open source machine learning library scikit-learn and thus, a large number of scikit-learn’s features can be used with Palladium. Although being implemented in Python, Palladium provides support for other languages and is shipped with examples how to integrate and expose R and Julia models. For an efficient deployment of services based on Palladium, a script to create Docker images automatically is provided. This talk will cover the use of Palladium including an example where a simple classification service is set up. We will also show how Docker and Mesos / Marathon can be used to deploy and scale Palladium-based services. Having basic knowledge about Machine Learning and/or scikit-learn would be an advantage when attending this talk.",
  "duration": 2333,
  "language": "eng",
  "recorded": "2016-06-07",
  "related_urls": [
    "https://github.com/ottogroup/palladium"
  ],
  "speakers": [
    "Andreas Lattner"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/zG-L0WyQMdI/maxresdefault.jpg",
  "title": "Setting up predictive analytics services with Palladium",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zG-L0WyQMdI"
    }
  ]
}
