{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Berlin 2016\n\nYour source data has multiple formats? You have multiple API’s to pull data from? This talk will go through some common problems with solutions that you will face when trying to combine multiple different research data sources in programmatic way. We go through a real world web project on that visualizes poverty data with JSON API's, Shapefiles and Excel spreadsheets as data sources.\n\nIntroduction\n\n- Give talk goals: This talk aims to give the tools to solve the engineering challenges related to combining different datasources\n- Set the context: We use geodata from humanitarian projects as an example, but solutions will apply to other areas as well.\n- Go through talk outline\n\nPart 2: Quickly introduce the project\n\nGive the audience idea of real world project in preparation for the part 3\n\n- Show screenshots of the final project\n- Go through the used technologies (ESRI shapefiles, geo/topo json, xls, API’s, python libraries)\n- Introduce the data pipeline\n\nPart 3: Explain common problems and our solutions for them\n\nThis is the meat of the talk, each point introduces problem and suggests at least one solution. Solutions are based on Python technologies \n\n- Handling different data formats \n- How to manage the data sources (validation, automation, etc) \n- Normalizing units \n- Mapping problems (different projects may follow different standards for the id’s) \n- Normalizing data and metadata\n\nPart 4: Wrap up\n\n- Quickly explain how we applied these problems in the project\n- Sum up the things you should consider (check-list)",
  "duration": 2078,
  "language": "eng",
  "recorded": "2016-06-01",
  "related_urls": [],
  "speakers": [
    "Juha Suomalainen"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/qB9DbNAFUJQ/maxresdefault.jpg",
  "title": "Visualizing research data: Challenges of combining different datasources",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qB9DbNAFUJQ"
    }
  ]
}
