{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Berlin 2016\n\nTalk will be about brand recognition system that detects logos in real-life photos. It allows for better brand monitoring in social media independently from text descriptions and hashtags. Software was implemented using state-of-the-art Python deep learning tools (Theano, Lasagne, Caffe). Project was created during a 3-months full-time data science program called Data Science Retreat.\n\nProject was created during a 3-months full-time data science program called Data Science Retreat. I’ve developed a brand recognition system that detects logos in real-life photos. It uses Deep Learning and SVM on Instagram images uploaded by users. It allows for better brand monitoring in social media independently from text descriptions and hashtags. I’ve used state-of-the-art Deep Learning tools (Theano, Lasagne, Caffe).\n\nDeep Learning is an advanced Machine Learning technic that usually needs lot of data and powerful machines. I would like to show how to use it when you don't have huge dataset and your resources are limited in time and money.\n\nI would also like to talk about a new era in which developers can start to write code which understands visual context of images and is not limited to descriptions and tags.\n\nSlides: http://de.slideshare.net/ukaszCzarnecki/brand-recognition-in-reallife-photos-using-deep-learning-lukasz-czarnecki-pydata-berlin-2016/",
  "duration": 1474,
  "language": "eng",
  "recorded": "2016-06-01",
  "related_urls": [
    "http://de.slideshare.net/ukaszCzarnecki/brand-recognition-in-reallife-photos-using-deep-learning-lukasz-czarnecki-pydata-berlin-2016/"
  ],
  "speakers": [
    "Lukasz Czarnecki"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/0Ho0O1tvcU4/maxresdefault.jpg",
  "title": "Brand recognition in real-life photos",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0Ho0O1tvcU4"
    }
  ]
}
