{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Berlin 2016\n\npypet manages exploration of the parameter space of any numerical simulation in Python, thereby storing your data into HDF5 files for you. The toolkit offers a new data container which lets you access all your parameters and results from a single source. Data I/O of your simulations and analyses become a piece of cake!\n\n\npypet `python parameter exploration toolkit <http://pypet.readthedocs.org/>`_ is a new multi-platform Python toolkit for management of simulations and storage of numerical data. Exploring or sampling the space of model parameters is one key aspect of simulations and numerical experiments. pypet was especially designed to allow easy and arbitrary sampling of trajectories through a parameter space beyond simple grid searches.\n\nSimulation parameters as well as the obtained results are collected by pypet and stored in the widely used `HDF5 file format <http://www.hdfgroup.org/HDF5/>`_. This allows fast and convenient loading of data for further analyses. Furthermore, pypet provides an environment with various features. For example, among these are multiprocessing for fast parallel simulations, dynamic loading of data, integration of Git version control, and supervision of experiments via the electronic lab notebook Sumatra_. A rich set of data formats is supported encompassing native Python types, Numpy and Scipy data, and `pandas DataFrames <http://pandas.pydata.org/>`_. Moreover, the toolkit is easily extendable to allow the user to add customized data formats. pypet is a very flexible tool and suited for short Python scripts as well as large scale projects that involve simulations and numerical experiments.\n\n.. _Sumatra: https://pythonhosted.org/Sumatra/\n",
  "duration": 1470,
  "language": "eng",
  "recorded": "2016-05-31",
  "related_urls": [
    "http://www.hdfgroup.org/HDF5/",
    "http://pypet.readthedocs.org/",
    "http://pandas.pydata.org/",
    "https://pythonhosted.org/Sumatra/"
  ],
  "speakers": [
    "Robert Meyer"
  ],
  "tags": [
    "pypet",
    "HDF5"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/a8Qq8kPS-dg/maxresdefault.jpg",
  "title": "pypet: A Python Toolkit for Simulations and Numerical Experiments",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=a8Qq8kPS-dg"
    }
  ]
}
