{
  "alias": "video/60/djangocon-2010--maps-of-imaginary-lands",
  "category": "DjangoCon 2010",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "The GIS features of Django aren't restricted to being applied to real\nworld maps and planets. This talk will show how to display and interact\nwith maps of imaginary lands, such as game maps or lands in science\nfiction novels. We'll uncover a bit of how Django GIS works in the\nprocess, separating the map display from the modeling.\n\nAbstract\n\nWhilst django.contrib.gis isn't particularly difficult to get started\nwith, particularly if you follow the tutorials, it can sometimes seem a\nbit overwhelming in the way it goes from zero to fancy maps in only a\ncouple of steps. I'd like to demystify some of the pieces of the stack,\npulling apart the modeling support — specifying the data are we trying\nto work with — from the display and client-side portion.\n\nTo make this more than a dry technical dive, I'll show how to add extras\nto an imaginary map, rather than something pulled from Google Maps or\nOpen Street Map. We'll take on the task of plotting features on a\nlandscape from a potential role-playing game and show how the GIS data\nmanipulation features, such as calculating region intersections, nearby\npoints, and javascript client-side display work the in a familiar way\nagainst this slightly unusual background.\n\nSome basic familiarity with Django's GIS features would be useful for\nthis talk, although it might also serve as a motivating introduction to\ntrying things out. The code shown will be available for download after\nthe talk.\n",
  "duration": null,
  "id": 60,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2010-09-07",
  "slug": "djangocon-2010--maps-of-imaginary-lands",
  "speakers": [
    "Malcolm Tredinnick"
  ],
  "summary": "",
  "tags": [
    "djangocon",
    "djangocon2010",
    "geodjango",
    "gis"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_60___maps-of-imaginary-lands",
  "title": "Maps of Imaginary Lands",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_60___maps-of-imaginary-lands"
    }
  ]
}
