{
  "alias": "video/61/djangocon-2010--breaking-down-the-process-of-buil",
  "category": "DjangoCon 2010",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "The purpose of this talk is to share some of the important insights\ngained over a couple years of working on custom CMS-type projects\nserving large organizations. Acknowledging that approx. 30 minutes is a\nshort time to cover a broad subject, the focus of the talk would be on\noutlining a basic strategy for managing large projects.\n\nAbstract\n\nOver the past couple of years, Brian and Yann's team have built and\nworked on several large Django projects for large organizations. They\nwill discuss how to start and manage large CMS projects, with an\nemphasis on pointing people to the best reference information and\nbreaking down the common operations.\n\nThe primary discussion topics would cover:\n\n-  Breaking Down the Job: Over the course of the project you'll end up\n   accounting for thousands of details; here's how to figure out the\n   first few Centering Around a Prototype: Hedging your bets for the\n   inevitable \"give me a ballpark figure\"\n-  Dealing With Legacy Data Stores: Migrate legacy information early and\n   often.\n-  Selecting 3rd Party Components: Reuse exiting app, fork it early or\n   Trailblaze\n-  Bad News: Django Ain't Perfect - where it has weaknesses and how to\n   compensate\n\nAt the end of this talk the audience will be able to:\n\n::\n\n    * Break down this type of project into meaningful phases \n    * Migrate large dataset to populate the django models that are still under development. \n    * Have a rational and objective approach to select django reusable component and understand how to refine them during the different stages of the project lifecycle. \n    * Find and evaluate quality information about the tradeoffs Django presents in these types of projects \n\n",
  "duration": null,
  "id": 61,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2010-09-07",
  "slug": "djangocon-2010--breaking-down-the-process-of-buil",
  "speakers": [
    "Brian Luft",
    "Yann Malet"
  ],
  "summary": "",
  "tags": [
    "development",
    "djangocon",
    "djangocon2010",
    "projectmanagement"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_61___breaking-down-the-process-of-building-a-custom-cms",
  "title": "Breaking down the process of building a custom CMS",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_61___breaking-down-the-process-of-building-a-custom-cms"
    },
    {
      "length": null,
      "type": "flv",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/djangocon-2010/61_breaking-down-the-process-of-building-a-custom-cms.flv"
    }
  ]
}
