{
  "alias": "video/38/djangocon-2010--multi-database-patterns",
  "category": "DjangoCon 2010",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "A tour through four common \"multiple database\" usage patterns and how\nthey can be implemented and utilised with Django. We'll talk about the\nstrengths and weaknesses of each pattern and why you might not need any\nof them.\n\nAbstract\n\nThere are a few good reasons a system might want to interact regularly\nwith multiple databases. “Because it’s what cool people do” is not one\nof those reasons. Most multi-database usages fall into one of four main\nclasses:\n\n-  Separation by function. All data of one type in one database, all\n   data of another type in some other database.\n-  Separation by sharding. Data of a particular type (e.g. user records)\n   is split across multiple databases, each database holding a shard of\n   the whole data.\n-  Data replication (separation by access). Some pieces of data are\n   synchronized to multiple machines. Writes might go into one or more\n   masters and reads normally come from the slaves.\n-  Data augmentation/shadowing. Data in one database is added to or\n   entirely replaced by data from another database. Can happen during\n   development when reading from a production snapshot whilst trying out\n   changes to some tables or data only against a local database.\n\nObviously, combinations of these classes are possible, such as\nreplicated sharded data in a huge site. There are tricks and traps to\nthe way a developer talks to each of these sorts of setups. I'll spend a\nfew minutes showing credible examples of the usage of each as well as\nwhen you might be over- engineering by going that way. All four access\npatterns are possible in Django 1.2, with varying degrees of ease of use\nand I'll show the type of code required in each case.\n",
  "duration": null,
  "id": 38,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2010-09-09",
  "slug": "djangocon-2010--multi-database-patterns",
  "speakers": [
    "Malcolm Tredinnick"
  ],
  "summary": "",
  "tags": [
    "database",
    "djangocon",
    "djangocon2010",
    "multipledatabases"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_38___multi-database-patterns",
  "title": "Multi-database patterns",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_38___multi-database-patterns"
    },
    {
      "length": null,
      "type": "flv",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/djangocon-2010/38_multi-database-patterns.flv"
    }
  ]
}
