{
  "alias": "video/48/djangocon-2010--data-herding--how-to-shepherd-you",
  "category": "DjangoCon 2010",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Learn how to use common tools like the management shell,\ndjango-extensions, and iPython to craft an effective workflow whether\nyou're building a new schema or migrating from old systems. We'll also\nlook at how to take advantage of the latest ORM features.\n\nAbstract\n\nThe presentation would consist of walking through a few example\nscenarios where one would deal with processing or converting data in\nsome manner. For example, migrating from a large legacy database often\nbrings a number of tedious problems. I would demonstrate how to work in\nan iterative, repeatable style using the Django sql management commands,\na few iPython tricks, etc.\n\nAnother demonstration would be showing a team workflow for South\nmigrations, illustrating how to deal with some common problems that crop\nup in practice.\n\nThe audience will leave with some solid techniques for dealing with a\nfew specific data management challenges. The unifying philosophy\nthroughout is to break large, difficult problems into small, repeatable\nsteps and audience members should also come away knowing how to select\ntools that help them work in this style.\n",
  "duration": null,
  "id": 48,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2010-09-07",
  "slug": "djangocon-2010--data-herding--how-to-shepherd-you",
  "speakers": [
    "Brian Luft"
  ],
  "summary": "",
  "tags": [
    "djangocon",
    "djangocon2010",
    "django-extensions",
    "ipython",
    "managementshell",
    "orm"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_48___data-herding-how-to-shepherd-your-flock-through-valleys-of-darkness",
  "title": "Data Herding: How to Shepherd Your Flock Through Valleys of Darkness",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_48___data-herding-how-to-shepherd-your-flock-through-valleys-of-darkness"
    }
  ]
}
