{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "DjangoCon US 2016 - Rub-A-Dub Rubber Duck: Don't be Afraid to Debug! by Anna Ossowski\n\nEveryone of us knows this scenario, it's part of the daily life of a programmer: You build something and it doesn’t work. You run into a bug, you find a problem, you break your code - and then you have to figure out how to fix it again. This can take 5 minutes, several hours, sometimes even several days. Sometimes you get really frustrated and are about to give up but when you finally find the solution it's the greatest feeling in the world. Do you want to learn how to proceed when your code doesn’t work? Do you want to learn how you can become a better problem solver? Do you want to learn how a rubber duck can help you? Then this talk is for you :) In this talk I will present strategies on how to proceed when you run into a bug or other coding problems. I will also talk about what you can do in order to prevent frustration and how you can learn to be more confident when encountering bugs. My goal is to show that bugs are nothing to be scared of, that you can fix (almost) everything and shouldn’t be afraid of breaking things, and that debugging can be easier than you think it might be if you approach it the right way. Breaking things is the first step to learning how to fix them! This talk is inspired by a blog post I wrote a while ago, which you can find here().\n\nIntroduction - Who am I? What is this talk about? (2 minutes)\nWhat is a bug?/What is debugging? (5 minutes)\nWhy breaking things is great - Don’t be afraid to break things (3 minutes)\nWhy a rubber duck? - Debugging strategies (10 minutes)\n\nReading error messages the right way\nHow Google can help\nRubber ducks, hypothesis, testing different approaches/solutions\nReproducing bugs\nBreaking your code down into smaller pieces\nDrawing diagrams of code/writing pseudocode\nReading documentation\nDebugging tools like the django-debug toolbar\nWhat to do when frustration kicks in (3 minutes)\n\nWhere/how to get help (2 minutes)\nQ&A (5 minutes)",
  "duration": 1516,
  "language": "eng",
  "recorded": "2016-08-10",
  "related_urls": [],
  "speakers": [
    "Anna Ossowski"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/RoNxR803gs4/maxresdefault.jpg",
  "title": "Rub-A-Dub Rubber Duck: Don't be Afraid to Debug!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RoNxR803gs4"
    }
  ]
}