{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Walking Down the A11Y Road - Lessons Learnt From Working on Accessibility of A Django Project by Radina Matic\n\n(~ 5 minutes)\n\n-   Who we are and how did we meet? WHY DO WE CARE?\n\n(~ 10 minutes)\n\n-   Universal Design as a core value\n-   Who benefits?\n-   Why making inclusive products makes business sense?\n-   What liabilities you incur for not making inclusive products? WHAT CAN YOU DO WITH AN ALREADY ROUNDED PRODUCT?\n\n(~ 10 minutes)\n\nBABY-STEPS WITH KA LITE\nEasy things you can check for and correct fast (titles, headings, aria landmarks, visible focus, alttext for images, meaningful labels for EVERYTHING...)\n\nBit more tinkering required (menus and navigation, complex forms, accessible color schemes...)\n\nAccessible Multimedia & Documents (offer ALTERNATIVES!)\n\nWHAT SHOULD YOU DO RIGHT FROM THE START OF A NEW PROJECT?\n\n(~ 10 minutes)\n\nKOLIBRI FLIES FOR EVERYBODY\n- Include a11y requirements into the Usability Style Guide\n- Take a11y into account when choosing the libraries and frameworks\n- Follow the standard web semantic\n- Make accessible web components available from the beginning\n- Start including a11y automated tests as soon as possible\nACCESSIBILITY IN EVERYDAY DEV TEAM LIFE\n\n(~ 10 minutes)\n\n-   A11y Pills & lots of passion\n-   Make accessibility a *SHARED* responsibility\n-   Start a Tools Repository (Rome wasn't built in a day)\n-   Don't rely exclusively on checklists and automated testing (Involve the USERS!)\n-   No such thing as 100% accessible",
  "duration": 2607,
  "language": "eng",
  "recorded": "2016-08-13",
  "related_urls": [],
  "speakers": [
    "Radina Matic"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/GQPGuxgesM0/maxresdefault.jpg",
  "title": "Walking Down the A11Y Road - Lessons Learnt From...",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GQPGuxgesM0"
    }
  ]
}
