{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "DjangoCon US 2016 - Design for Non-Designers by Tracy Osborn\n\nNot everyone can hire a professional designer for their websites and web apps, but we all still want our interfaces to be easy to use and attractive. However, if you want to learn a bit of design, design books jump straight into concepts like \"the golden ratio\" and teach proper typographic terms which, to be frank, aren't needed if you're just looking to improve your website's look and feel.\n\nThis talk will cover the top quick ways to improve your website, covering both user experience as well as visual design. Quick hits, easy to understand and utilize principles that anyone can use to improve their design skills. Perhaps you too can become the next designer+developer unicorn!\n\nOutline Intro (5%): * Who am I? * Why is good design important? Overview of design terms (only the basics) (20%): * Definitions and overview of UI, UX, and visual design. * Overview of conversion, goals, and click-through rates. * What's most important when you're designing? Easy-to-understand design principles (40%): * Clutter is our #1 enemy. How a grid, fonts, and color can affect how cluttered our design looks. * Faces and photos, and other shortcuts we can use to make beautiful designs Step-by-step of walkthrough of creating a website design (20%): * Collecting ideas. * Sketching your ideas efficiently. * Tools to mock up your ideas. * Resources to help you build your idea. How improve your design eye and become a better designer (10%). Resources to learn more (5%).\n\nAttendees should have the know-how to quickly improve the design of their websites immediately as well as knowledge of resources to improve their design eye.",
  "duration": 2248,
  "language": "eng",
  "recorded": "2016-08-10",
  "related_urls": [],
  "speakers": [
    "Tracy Osborn"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/-JQBfUnYxXA/maxresdefault.jpg",
  "title": "Design for Non-Designers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-JQBfUnYxXA"
    }
  ]
}