{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Django, Python, and Health Care Data by Becca Nock\n\nData and technology can be used to improve the health of older adults and to help them to continue to live at home and in the community as they age. Predictive analytics and modeling can predict who will get sick, be hospitalized, or have adverse outcomes in the future. Once we know who is at risk, we can design interventions to decrease the likelihood of negative health outcomes.\n\nThis talk will introduce you to health care data sources, such as electronic medical records and insurance claims; predictive modeling and how it can be used to improve the care we provide; and publicly available and open health data. We will talk about the D2S2 (discharge decision support system), which helps health care providers make decisions when older adults are getting ready to be discharged from the hospital; and how Django and Python can be used to visualize open health-related data.\n\n* Intro: Who I am (2 min)\n* Health care data and where it comes from (5 min)\n    * Electronic health records\n        * Dr. Chrono is actually built with Django!\n* Claims data\n* Predictive modeling and decision support (10 min)\n    * Predicting readmissions & the discharge decision support system (D2S2)\n* Predict whether older adults are at high risk or low risk of being readmitted to the hospital after discharge.\n    * Building decision support to improve hospital discharge decision-making\n* Once we know a patient is at high risk of being readmitted, how do we decide what care they should receive after they leave the hospital? Use expert knowledge to develop decision support into the electronic medical record that will recommend a site for post acute care (care once the patient leaves the hospital).\n* Building patient preferences into the recommendations made to health care providers about what care the patient should receive after their hospitalization.\n    * Brief overview of:\n        * Predicting diabetes\n        * Likelihood of hospitalization modeling and nurse health coaching\n* Django and health care data (8 min)\n    * Overview of open and publically available health care data\n        * Open Data Philly (www.opendataphilly.org)\n        * HealthData.gov\n    * Visualizing open health data with Python and Django\n",
  "duration": 1302,
  "language": "eng",
  "recorded": "2016-08-12",
  "related_urls": [],
  "speakers": [
    "Becca Nock"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/nldGxuLGOY0/maxresdefault.jpg",
  "title": "Django, Python, and Health Care Data",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nldGxuLGOY0"
    }
  ]
}