{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "DjangoCon US 2016 - Django and React: Perfect Together by Jack McCloy\n\nReact is a JavaScript library that makes it much easier to build dynamic single-page sites. I won't much dive into how React works, but the main advantage is that it allows you to build your view layer in a declarative way, and with reusable components.\n\nWe'll start with an overview how React works, with an eye towards how it's different from interpretive libraries like jQuery. This overview will center around how state is managed in React vs. jQuery, which is the biggest hurdle for many developers when they're learning React. So if you haven't quite wrapped your head around the difference between \"2-way data binding\" and \"1-way data binding\", or if you've heard someone talk about \"data-down/actions-up\", \"flux\", or \"redux\" and weren't quite sure what they were talking about, this will clear all that up.\n\nThen we'll take a look at how you can integrate React into a Django project. We'll talk about how you might want to structure things if you're starting with a brand new project, but we'll also talk about ways you can start to take advantage of React's strengths even in projects that are already mature.\n\nFinally, we'll talk about some of the challenging parts of working with React for the first time - how to handle front-end permissioning in React based on your back-end API, how to think about url routing when you literally have two routers, deployment, and the general confusion that goes along with using npm and webpack for the first time.",
  "duration": 2598,
  "language": "eng",
  "recorded": "2016-08-10",
  "related_urls": [],
  "speakers": [
    "Jack McCloy"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/zYHv6U86X0Y/maxresdefault.jpg",
  "title": "Django and React: Perfect Together",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zYHv6U86X0Y"
    }
  ]
}
