{
  "description": "Lors de cette conférence présentée par trois passionnés de compétitions en cybersécurité, nous vous parlerons de tous les outils et astuces que nous utilisons pour décrocher la première place !\n\nLes grandes thématiques abordées seront :\n\n- Reverse Engineering : Dans ce type d'épreuve, il faut comprendre la logique d'un programme (souvent compilé et/ou obfusqué) afin d'y injecter un bug ou de contourner une protection logique.\n- Sécurité web : Exploiter des failles de sécurité d'un site web parmi les grandes familles connues - Injection SQL, XSS, et bien d'autres...\n- Cryptographie : Pour percer les secrets les mieux gardés, il faut parfois user des faiblesses de conception des cryptosystèmes.\n- Pwn : Souvent combiné au Reverse Engineering, cette discipline complexe consiste à manipuler l'exécution d'un programme en assembleur pour effectuer des actions non autorisées.\n- Programmation : Pour pouvoir répondre à un problème trop complexe pour les humains, il faut savoir combiner un peu d'astuce et beaucoup de scripting.\n- Forensics : Retrouver une aiguille dans une botte de foin en utilisant une grande variété de supports : capture réseau, contenu d'un disque dur, dump de mémoire vive, etc.",
  "duration": 2962,
  "language": "fra",
  "recorded": "2019-11-02",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.fr/2019/fr/schedule.html"
    }
  ],
  "speakers": [
    "Mathis Hammel",
    "Hugo Delval",
    "Nicolas Bonfante"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/edW9ofHMS6Q/hqdefault.jpg",
  "title": "Boîte à outils Python de l'expert CTF",
  "videos": [
    {
      "size": 235526406,
      "type": "webm",
      "url": "https://dl.afpy.org/pycon-fr-19/Mathis%20Hammel%2C%20Hugo%20Delval%20%26%20Nicolas%20Bonfante%20-%20Boite%20a%20outils%20Python%20de%20l%27expert%20CTF/Mathis%20Hammel%2C%20Hugo%20Delval%20%26%20Nicolas%20Bonfante%20-%20Boite%20a%20outils%20Python%20de%20l%27expert%20CTF.webm"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=edW9ofHMS6Q"
    },
    {
      "type": "peertube",
      "url": "https://bittube.video/videos/watch/106064d7-5af3-4201-b5e7-725d42f40a03"
    }
  ]
}
