{
  "description": "Aujourd’hui, on ne veut plus simplement produire un rapport PDF pour son projet de data science ou d'apprentissage automatique. De plus en plus, les utilisateurs souhaitent des outils interactifs permettant d'explorer des données avec des visualisations et des graphiques interactifs. Ces outils étant exécutés dans un navigateur web, soit il faut embaucher un spécialiste front end  qui respire le Javascript dans son équipe soit il faut que les data scientists  apprennent les technologies web. Ces alternatives ne sont pas pratiques et sont coûteuses. L’alternative se nomme Dash !\n\nDash, une bibliothèque de Plotly, peut résoudre le dilemme ainsi: les scientifiques de données peuvent faire les sites interactifs utilisant uniquement le Python et une connaissance minimale du HTML, et absolument aucun JavaScript.\n\nÀ decisionLab, une société de conseil en modélisation mathématique du centre du Londres, nous avons adopté Dash pour créer des interfaces pour nos POCs et les premiers alphas de nos projets. Bien que nous ne fassions pas officiellement partie du projet Dash, en l’utilisant quotidiennement, à travers de nombreux projets, nous avons acquis de nombreuses connaissances. Nous aimerions les partager ainsi que des conseils et des bonnes pratiques. Puis obtenir vos retours!\n\nCette conférence donnera un aperçu de Dash, de son fonctionnement et de son utilité, avant de présenter certains problèmes pouvant survenir lorsque les data scientists  sont laissés à eux-mêmes pour créer des applications Web, et que les ingénieurs informatiques doivent travailler avec l'écosystème pydata. Nous identifierons aussi certaines des limites de Dash, et discuterons de la façon de prendre la décision d'arrêter d'utiliser Dash pour commencer à créer une application Web complète.",
  "duration": 1530,
  "language": "fra",
  "recorded": "2019-11-02",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.fr/2019/fr/schedule.html"
    }
  ],
  "speakers": [
    "Dom Weldon"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/IMWuQpWsIkM/hqdefault.jpg",
  "title": "Dash : applications web de visualisation de données interactives sans Javascript",
  "videos": [
    {
      "size": 609988707,
      "type": "mp4",
      "url": "https://dl.afpy.org/pycon-fr-19/Dom%20Weldon%20-%20Dash%20-%20applications%20web%20de%20visualisation%20de%20donnees%20interactives%20sans%20Javascript/Dom%20Weldon%20-%20Dash%20-%20applications%20web%20de%20visualisation%20de%20donnees%20interactives%20sans%20Javascript.mp4"
    },
    {
      "size": 146717538,
      "type": "webm",
      "url": "https://dl.afpy.org/pycon-fr-19/Dom%20Weldon%20-%20Dash%20-%20applications%20web%20de%20visualisation%20de%20donnees%20interactives%20sans%20Javascript/Dom%20Weldon%20-%20Dash%20-%20applications%20web%20de%20visualisation%20de%20donnees%20interactives%20sans%20Javascript.webm"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IMWuQpWsIkM"
    },
    {
      "type": "peertube",
      "url": "https://bittube.video/videos/watch/f605279d-332c-49c1-943d-322093657e69"
    }
  ]
}
