{
  "description": "Python est aujourd’hui le langage principal pour l’analyse de données, mais il y a une étape qui reste encore longue et mal optimisée : le passage du notebook vers la visualisation dans les applications BI des utilisateurs métier. Dans quasiment tous les cas il faut réécrire le code dans le langage de l’application BI, c’est long et très mal adapté à une approche agile d’itérations successives.\n\nChez ActiveViam j’ai voulu accélérer ce process et concevoir un système qui permette de sauter entièrement cette étape. Le but du projet était de mettre la visualisation directement dans le notebook, pas juste des graphes statiques mais quelques chose de vraiment dynamique.\n\nLe résultat, que je propose de présenter, c’est une librairie Python que nous avons mise en open source et qui permet de visualiser les données en continu à mesure qu’on les charge et qu’on les travaille en Python dans son notebook. C’est utile pour faire ses propres analyses, mais surtout quand il faut concevoir des dashboards qui seront utilisés par d’autres services dans l’entreprise. Les allers-retours avec le métier se font beaucoup plus vite et une fois que les specs et l’apparence du dashboard sont validées par les utilisateurs finaux, passer en production est aussi rapide puisque cela peut se faire en quelques clics – avec ce système on ne construit pas juste une preview ou un mock-up avec Python mais bien l’application analytique finale.",
  "duration": 1532,
  "language": "fra",
  "recorded": "2019-11-02",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.fr/2019/fr/schedule.html"
    }
  ],
  "speakers": [
    "Romain Colle",
    "Thibault Derousseaux"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/xFsOWNJuY_I/hqdefault.jpg",
  "title": "La visualisation dynamique des données en Python",
  "videos": [
    {
      "size": 126419967,
      "type": "webm",
      "url": "https://dl.afpy.org/pycon-fr-19/Thibault%20Derousseaux%20-%20La%20visualisation%20dynamique%20des%20donnees%20en%20Python/Thibault%20Derousseaux%20-%20La%20visualisation%20dynamique%20des%20donnees%20en%20Python.webm"
    },
    {
      "size": 640024753,
      "type": "mp4",
      "url": "https://dl.afpy.org/pycon-fr-19/Thibault%20Derousseaux%20-%20La%20visualisation%20dynamique%20des%20donnees%20en%20Python/Thibault%20Derousseaux%20-%20La%20visualisation%20dynamique%20des%20donnees%20en%20Python.mp4"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xFsOWNJuY_I"
    },
    {
      "type": "peertube",
      "url": "https://bittube.video/videos/watch/912eb52a-eaea-4a17-b9c4-4f7a7dd06f8d"
    }
  ]
}
