{
  "description": "Since June 2019, Hong Kong shocked the world with massive protests. As protesters are mainly young, educated and technology-aware people, they are trying to use the new technology to outwit the government which also use AI and technology to control its people. Who got the upper hand?\n\nHave you ever think about using Tinder to look for a ‘date’ in the protest? Or using Uber to call for a free ride to drive you to safety?\n\nIn the first part of the talk, we will cover the background of the protest, why it happened and how it is started. We will briefly talk about the politic environment of Hong Kong and what causes the protest 1: the fear of losing a “high degree of autonomy”\nIn the second part, which is the main part of the talk, we will cover how technology/ apps like Telegram, Tinder, Pokemon Go, Twitch, AirDrop, Bridgefy, Uber, etc were used in by the protesters and what\nrole they play in the protest. People use Telegram’s encryption to communicate without worrying leaking of identity; they use Tinder to spread the news about where and when to protest; They use Pokemon Go\nto gather people 4; AirDrop to spread the message to the Chinese tourists; Bridgefy to communicate where internet is not available at crowded areas 3; Uber to let the protested know where there are\nvolunteer drivers to take you to safety.\n\nIn the third part, we will have a look at what technology the Chinese government may use to tighten its grip over Hong Kong. One of the front lines of the protest in the online activism 5, the Chinese\ngovernment has it’s own ‘50 cent army’ which is also known as ‘China bots’ who were paid to leave pro-CCP comments on social media. Which eventually cause Twitter and Facebook to shout down lots of accounts. Also, there are attacks cyberattacks, suspected to be related to the protest, towards Telegram and an online forum LiHKG which the protesters used to communicate. It is also suspected that the\ngovernment installed ‘smart’ lamppost which use facial detection to monitor the citizen of Hong Kong after protested found parts made by a Shanghai company which also made the surveillance cameras in mainland China 6.\n\nThis talk is for audients who are interested to know how our lives are changed by technology and how they could influence our society. By the end of the talk, audients will be more aware of what consequence new technology may bring us and be more thoughtful about the ethics behind the implementation of technology.",
  "duration": 1888,
  "language": "fra",
  "recorded": "2019-11-02",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.fr/2019/fr/schedule.html"
    }
  ],
  "speakers": [
    "Cheuk Ting Ho"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/0fXEkvyjHVY/hqdefault.jpg",
  "title": "Plénière n°3 / Keynote #3: The Role of 21st Century Technology in Protests",
  "videos": [
    {
      "size": 757883098,
      "type": "mp4",
      "url": "https://dl.afpy.org/pycon-fr-19/Cheuk%20Ting%20Ho%20-%20The%20Role%20of%2021st%20Century%20Technology%20in%20Protests/Cheuk%20Ting%20Ho%20-%20The%20Role%20of%2021st%20Century%20Technology%20in%20Protests.mp4"
    },
    {
      "size": 218129192,
      "type": "webm",
      "url": "https://dl.afpy.org/pycon-fr-19/Cheuk%20Ting%20Ho%20-%20The%20Role%20of%2021st%20Century%20Technology%20in%20Protests/Cheuk%20Ting%20Ho%20-%20The%20Role%20of%2021st%20Century%20Technology%20in%20Protests.webm"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0fXEkvyjHVY"
    },
    {
      "type": "peertube",
      "url": "https://bittube.video/videos/watch/af12d25c-acee-4fb9-bd3e-24e7df5af786"
    }
  ]
}
