{
  "description": "We all do cloud applications, no matter if they were built with the cloud (an app that consumes cloud services) or for the cloud (an app that was designed to run within cloud/container). The only thing that we, as Python community, haven’t talked out loud is imports performance that is so critical for business especially when you run your own business and cloud provider charges your own credit card.\n\nUntil Python 3.7 it was quite challenging to profile application code dependencies and imports specifically. With a new imports profiler, Python developers can measure how much time each import takes at the startup. The interesting thing, a new profiler opened the whole new Python problem - cold start issue. In this talk, we will go through one very challenging case: Python in serverless and why most of the Python libraries were never been designed to start fast.\n\nIf you’re going to attend this talk you’d get the following key takeaways:\n\n* Python coding strategy (placement, efficient and delayed imports)\n* New things in Python 3.7 related to imports\n* Module coding strategy\n\nand my favourite ones:\n\n* Why you should be careful with python code in serverless.\n* How to profile cold start and measure overall startup time.\n* The best CPU/RAM configuration for performing cold startup time measures.",
  "duration": 1542,
  "language": "fra",
  "recorded": "2019-11-02",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.fr/2019/fr/schedule.html"
    }
  ],
  "speakers": [
    "Denys Makogon"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/c-4uNWYRq-Q/hqdefault.jpg",
  "title": "Solving Python Cold Start Issues in Cloud Infrastructure",
  "videos": [
    {
      "size": 1113854450,
      "type": "mp4",
      "url": "https://dl.afpy.org/pycon-fr-19/Denys%20Makogon%20-%20Solving%20Python%20Cold%20Start%20Issues%20in%20Cloud%20Infrastructure/Denys%20Makogon%20-%20Solving%20Python%20Cold%20Start%20Issues%20in%20Cloud%20Infrastructure.mp4"
    },
    {
      "size": 120159735,
      "type": "webm",
      "url": "https://dl.afpy.org/pycon-fr-19/Denys%20Makogon%20-%20Solving%20Python%20Cold%20Start%20Issues%20in%20Cloud%20Infrastructure/Denys%20Makogon%20-%20Solving%20Python%20Cold%20Start%20Issues%20in%20Cloud%20Infrastructure.webm"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=c-4uNWYRq-Q"
    },
    {
      "type": "peertube",
      "url": "https://bittube.video/videos/watch/0480285d-e76d-4fea-9bda-0e81c7d0c39e"
    }
  ]
}
