{
  "description": "Le Captcha (ou Completely Automatized Public Turing test to tell Computers and Humans Apart) est un moyen a priori simple de déterminer si l'utilisateur stué derrière un site web est un humain ou un robot.\nCet outil est aujourd'hui souvent synonyme de ReCaptcha, technologie rachetée par Google en 2009. Malheureusement, cet outil est surtout utilisé à des fins de surveillance et d'espionnage, voire pour améliorer des IA utilisées par l'armée américaine.\n\nC'est en souhaitant lutter contre les abus de Google via cette technologie que j'ai travaillé sur un prototype fonctionnel qui pourrait facilement remplacer l'actuel. Pas forcément plus compliqué, pas forcément plus fiable, ce test est, par contre, beaucoup plus libre, son code source est ouvert et chacun peut l'installer chez soi (ou dans son entreprise).\n\nOn parlera donc de ce qu'est un Captcha, de ce que ça demande comme travail de recherche pour générer des tests de manière automatisée, de gérer des tests pour les déficients visuels (accessibilité quoi), de l'adapter pour remplacer un ReCaptcha le plus facilement possible, bref de comment faire un Captcha de A à Z !",
  "duration": 3512,
  "language": "fra",
  "recorded": "2019-11-02",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.fr/2019/fr/schedule.html"
    }
  ],
  "speakers": [
    "Mindiell"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/xvYtRnD2U4I/hqdefault.jpg",
  "title": "Un Captcha libre, c'est possible !",
  "videos": [
    {
      "size": 1571183843,
      "type": "mp4",
      "url": "https://dl.afpy.org/pycon-fr-19/Mindiell%20-%20Un%20Captcha%20libre%2C%20c%27est%20possible/Mindiell%20-%20Un%20Captcha%20libre%2C%20c%27est%20possible.mp4"
    },
    {
      "size": 226314971,
      "type": "webm",
      "url": "https://dl.afpy.org/pycon-fr-19/Mindiell%20-%20Un%20Captcha%20libre%2C%20c%27est%20possible/Mindiell%20-%20Un%20Captcha%20libre%2C%20c%27est%20possible.webm"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xvYtRnD2U4I"
    },
    {
      "type": "peertube",
      "url": "https://bittube.video/videos/watch/324c9cd1-09d2-4d7c-a4f3-d628556480f7"
    }
  ]
}
