{
  "description": "The access to data stocks made publicly available has never been easier than in present times. Among\nmany others, FranceArchives and the Muséum National d’Histoire Naturelle are examples of public institutions\nproviding access to their data. FranceArchives is a service by the Service interministériel des archives de France (SIAF) to help researchers and enthusiasts explore the French archives by grouping and enriching information about their contents. The Muséum National d’Histoire Naturelle (MNHN) is launching the « data.mnhn.fr » project which aims to unify their data stocks and integrate additional information in order to present their naturalists' academic career. In order to\nhelp navigate these enormous amounts of data, both institutions aim to enrich their data stocks by integrating\nadditional information from third-party sources, such as e.g. Wikidata and Geonames.\n\nTo this end, tools such as Nazca are used to align the datasets in question. There are two main challenges: the datasets' sizes and the heterogenity between them. Nazca is an open-source highly adaptable Python tool addressing both challenges by providing blocking algorithms to reduce the number of comparisons and normalization functions to clean up the data. The tool provides a customizable pipeline containing the normalization, blocking and alignment steps and automatically collects and re-assembles the results at the end.\n\nThe talk is split into two major parts: we begin by shortly introducing Nazca and its pipeline. We then illustrate how its used in FranceArchives to align geographical data to Geonames and close by explaining how it is used to create controlled vocabularies for names in data.mnhn.fr.",
  "duration": 1525,
  "language": "fra",
  "recorded": "2019-11-02",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.fr/2019/fr/schedule.html"
    }
  ],
  "speakers": [
    "Carine Dengler",
    "Simon Chabot"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Ezp6KIPzfus/hqdefault.jpg",
  "title": "Where in the World is \"11 H 1-2\"? − Aligning Public Datasets With Nazca",
  "videos": [
    {
      "size": 729287528,
      "type": "mp4",
      "url": "https://dl.afpy.org/pycon-fr-19/Carine%20Dengler%20%26%20Simon%20Chabot%20-%20Where%20in%20the%20World%20is%20%2211%20H%201-2%22%3F%20-%20Aligning%20Public%20Datasets%20With%20Nazca/Carine%20Dengler%20%26%20Simon%20Chabot%20-%20Where%20in%20the%20World%20is%20%2211%20H%201-2%22%3F%20-%20Aligning%20Public%20Datasets%20With%20Nazca.mp4"
    },
    {
      "size": 112702737,
      "type": "webm",
      "url": "https://dl.afpy.org/pycon-fr-19/Carine%20Dengler%20%26%20Simon%20Chabot%20-%20Where%20in%20the%20World%20is%20%2211%20H%201-2%22%3F%20-%20Aligning%20Public%20Datasets%20With%20Nazca/Carine%20Dengler%20%26%20Simon%20Chabot%20-%20Where%20in%20the%20World%20is%20%2211%20H%201-2%22%3F%20-%20Aligning%20Public%20Datasets%20With%20Nazca.webm"
    },
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ezp6KIPzfus"
    },
    {
      "type": "peertube",
      "url": "https://bittube.video/videos/watch/6bfa619b-c9b4-4117-9158-bf10599bb1b6"
    }
  ]
}
