{
    "description": "As more and more communities are experiencing rapid urban sprawl, the\nmanagement of infrastructure and resources provided is becoming crucial.\nOpen source datasets are imperative to monitoring and implementing\nchange throughout cities; in fact, a large majority of these datasets\ncan be mapped spatially. But how can you visualize multiple datasets\nspatially without skills in ArcGIS? This 10 minute thunder talk\nhighlights how to harness libraries in Python to visualize data\nspatially through an urban informatics case study on bike sharing\nsystems.\n\nMapping data geographically at industry level is performed in ArcGIS,\nbut ArcGIS is a complex, costly application. Mapping data helps us\nunderstand how socio-technical systems are disrupted or improved by\nlaws, policies, and infrastructure projects. For example, in ArcGIS you\ncan map the percentage of the population within a high-crime\nneighborhood or understand how the location of public transit correlates\nto a neighborhood’s socioeconomic status. But, you can also map this\ndata using libraries in Python.\n\nThis talk is geared towards those who have a basic understanding of data\nscience and data visualization, but want to dive deeper into the realms\nof mapping data science for social good. From briefly reviewing methods\nin Pandas to diving deep into methods in GeoPandas, the audience will\ngain a better understanding of how to derive a spatial component from a\ndataset, how to turn shapefiles into GeoDataFrames and plot them, and\nhow to create quantitative and thematic maps.\n",
    "language": "eng",
    "recorded": "2020-07-25",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://www.pyohio.org/2020/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://www.pyohio.org/2020/events/talks/civic-hacking-urban-informatics-mapping-data-with-geopandas"
        }
    ],
    "speakers": [
        "Katelyn Morrison"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/iaHDm0OPZsE/maxresdefault.jpg",
    "title": "Civic Hacking & Urban Informatics: Mapping Data with GeoPandas",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=iaHDm0OPZsE"
        }
    ]
}
