{
  "description": "www.pydata.org\n\nReddit r/place was conceived as Reddits's 2017 April Fools tongue-in-cheek experiment. A shared white canvas of million pixels (1000 x 1000) appeared in a subreddit called ''place''. Redditors could change the color of a single pixel of their choosing. Once a Redditor manipulated a pixel, he/she gets blocked by the system for a random time (5-20 minutes), effectively preventing any single Redditor from having a significant influence on the canvas. The experiment, titled by Newsweek as the Internet's best experiment yet, attracted 16.1M pixel changes performed by 1.2M unique users during 72 hours. While the expected result was total chaos, verging on white noise, the final state of the canvas contained an intricate collage of complex logos and artwork. In this talk, I present the experiment in detail, the data that were collected during the r/place experiment, and the research opportunities associated with this natural experiment. I introduce three research studies that make use of this unique dataset and settings. I share the machine-learning models we built as well as the insights gained using explainability tools, all using Python.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1695,
  "language": "eng",
  "recorded": "2023-12-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2023/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Avrahami"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/z4OCWMQuqrM/maxresdefault.jpg",
  "title": "The Internet's Best Experiment Yet",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=z4OCWMQuqrM"
    }
  ]
}
