{
  "description": "www.pydata.org\n\nAlmost all animals communicate with sound, but as far as we know only humans speak languages. How did speech evolve? How do animals like birds, bats, and dolphins learn their songs, and is it similar to how we learn to speak? Questions like these are answered by the study of acoustic communication. This talk will get you acquainted with this exciting research. Along the way you'll hear many different animal sounds, and find out how researchers in this area are using neural network models. You'll learn why there is a need for a core package for researchers in this area (think AstroPy for astronomy). We will present a package we've developed to meet that need, VocalPy, and give a demo of the features. Then we'll present some results we've obtained with VocalPy on evaluating methods for segmenting audio into sequences of animal sounds. Finally we'll share our development roadmap, and tell you how you can get involved with the VocalPy community.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1332,
  "language": "eng",
  "recorded": "2023-12-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2023/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "David Nicholson"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/53S5xM6s70g/maxresdefault.jpg",
  "title": "VocalPy: a core Python package for acoustic comms research",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=53S5xM6s70g"
    }
  ]
}
