{
  "description": "www.pydata.org\n\nThe talk takes inspiration from a famous literary piece, Dante Alighieri's \"Inferno\" (in Italian, the Hell) to offer data scientists a moral revenge on the data sinners they constantly encounter in their professional life. While Dante populates his Hell with political enemies and even former Popes, I redraw the map of Dante's Inferno finding a place and an adequate punishment for data sinners. With the help of the audience, I will make sure that creators of invalid CSV files, users of identifiers so unique that they are even longer than the recommended PEP 8 line length, and all other data sinners find their well-deserved place in Hell. The bottom line of the talk is that data scientists' life will not improve until organisations begin to manage their data properly and realise that data products and infrastructures can be developed only when data satisfy minimal usability criteria, such as machine-readability.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1526,
  "language": "eng",
  "recorded": "2023-12-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2023/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Giuditta Parolini"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/qArWARodu_g/maxresdefault.jpg",
  "title": "The Hell, According to a Data Scientist",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qArWARodu_g"
    }
  ]
}
