{
  "description": "www.pydata.org\n\nThis session is designed for those who are curious about Keras and want to learn more about its capabilities for computer vision and stable diffusion. We will start with a refresher on the core deep learning concepts that are essential for understanding Keras. Then, we will dive into a quick introduction to Keras 3 with Jax, using object detection as an example. Next, we will explore how to use Keras CV and Keras 3 together for multi-framework modeling that includes . We will also discuss how to use pre-trained PyTorch models with Keras 3. Finally, we will wrap up with a discussion of stable diffusion, what it is, and how to implement it using Keras 3 and multi-framework modeling.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 4419,
  "language": "eng",
  "recorded": "2023-12-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2023/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Ngesa Marvin"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/os0cNLj8Wsw/maxresdefault.jpg",
  "title": "Keras (3) for the Curious and Creative",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=os0cNLj8Wsw"
    }
  ]
}
