{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Supervised machine learning requires large labeled datasets - a prohibitive\nlimitation in many real world applications. What if machines could learn\nwith fewer labeled examples? This talk explores and demonstrates an\nalgorithmic solution that relies on collaboration between humans and\nmachines to label smartly, and shows product possibilities.\n\nBeing able to teach machines with examples is a powerful capability, but it\nhinges on the availability of vast amounts of data. The data not only needs\nto exist, but has to be in a form that allows relationships between input\nfeatures and output to be uncovered. Creating labels for each input feature\nfulfills this requirement, but is an expensive undertaking.\n\nClassical approaches to this problem rely on human and machine\ncollaboration. In these approaches, engineered heuristics are used to\nsmartly select the “best” instances of data to label, in order to reduce\ncost. A human steps in to provide the label. The model then learns from this\nsmaller labeled dataset. Recent advancements have made these approaches\namenable to deep learning, enabling models to be built with limited labeled\ndata.\n\nIn this talk, we explore algorithmic approaches that drive this capability,\nand provide practical guidance for translating this capability into\nproduction. We provide intuition for how and why these algorithms work by\ndemoing and describing how we built a working prototype.",
  "duration": 1500,
  "language": "eng",
  "recorded": "2019-10-04",
  "related_urls": [
    "https://2019.pygotham.org/talks/learning-with-limited-labeled-data/"
  ],
  "speakers": [
    "Shioulin Sam"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/kzgtj8vDd3Y/maxresdefault.jpg",
  "title": "Learning with Limited Labeled Data",
  "videos": [
    {
      "type": "youtube",
      "url": "https://youtu.be/kzgtj8vDd3Y"
    }
  ]
}
