{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Natural language processing models require a ton of text data and computing\ntime - resources that aren't available to most. But now you can use powerful\npre-trained NLP models from Google, AllenNLP, and others who have done the\nheavy lifting for you, accessible through straightforward python libraries.\nTransfer learning allows you to tailor these massive models to your specific\ndomain.\n\n2018 ushered in a new era for NLP based on a series of breakthroughs in the\nuse of transfer learning. Traditionally only word vectors such as word2vec,\nwhich provide rich representations of _words_, have been reused across\ndifferent NLP tasks.  However, word vectors have no notion of the context in\nwhich a word occurs, which is severely limiting. ``_Context-aware_`` transfer\nlearning is a powerful new technique that has already made a great impact.\n\nWithin a year, transfer learning has changed the state-of-the-art in nearly\nevery category. It is being used to generate extremely realistic text, and\nsome work has even been kept secret for fear of its potential for misuse. It\nhas made improvements in sentiment analysis, document topic classification,\nand named entity extraction.\n\nBut being so new, it’s not well understood how these techniques work, what\ntypes of problems benefit most, what hazards exist, or what tools to use. In\nthis talk we’ll cover new techniques in transfer learning, their impacts,\nand present a framework for how to apply them. We provide recommendations\nfor choosing candidate problems, how to conduct experiments, how to\nunderstand and interpret these models, and the available python tooling.",
  "duration": 1500,
  "language": "eng",
  "recorded": "2019-10-04",
  "related_urls": [
    "https://2019.pygotham.org/talks/less-talk-more-rock-transfer-learning-with-natural-language-processing/"
  ],
  "speakers": [
    "Ryan Micallef"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ug2qeGAzPDU/maxresdefault.jpg",
  "title": "Less Talk, More Rock: Transfer Learning with Natural Language Processing",
  "videos": [
    {
      "type": "youtube",
      "url": "https://youtu.be/ug2qeGAzPDU"
    }
  ]
}
