{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Although known by most, Pull Requests are often not dealt with in the most\neffective way. Believe it or not, there are teams that don’t review code at\nall! People may assume that a senior developer is experienced enough to not\nmake any mistakes, or that merely changing those 3 lines of code couldn’t\npossibly do any harm to the system. In these cases, it’s not uncommon to\nskip the code review in order to cut some time. Unreviewed (or badly\nreviewed) code can be extremely dangerous, resulting in huge risks and\nunpredictable behavior.\n\nA survey says that, on average, developers spend 45% of their time fixing\nbugs and technical debt, when they could be developing new features instead.\nDefining simple guideline files, adopting certain behaviors and setting up\nrepository configurations are steps that can increase manyfold the code\nreview performance (in both time and quality). Using review tools both on\nserver (e.g. Heroku Review Apps) and locally (e.g. linters) can also greatly\nincrease the process’ speed. Creating templates and checklists ensures no\nstep is overlooked or forgotten. The list goes on, but enough spoilers for\nnow. The attendees will learn specific tips, tools, processes and\nrecommended practices that were compiled from research and real-life use\ncases (both from my experience and from big players like Django, Facebook,\nMozilla, etc), along with some survey data that demonstrates why reviewing\ncode is important.",
  "duration": 1500,
  "language": "eng",
  "recorded": "2019-10-05",
  "related_urls": [
    "https://2019.pygotham.org/talks/pull-requests-merging-good-practices-into-your-project/"
  ],
  "speakers": [
    "Luca Bezerra"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/DuectEtpWvY/maxresdefault.jpg",
  "title": "Pull Requests: Merging good practices into your project",
  "videos": [
    {
      "type": "youtube",
      "url": "https://youtu.be/DuectEtpWvY"
    }
  ]
}
