{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "After Hurricane Maria struck Puerto Rico in September 2017, the Puerto Rico\nElectric Power Authority awarded Whitefish Energy, a small Montana-based\nfirm with only two employees at the time, a no-bid contract for up to $300\nmillion to repair part of the island's electrical grid. This contract even\nhad a clause that prevented the government from auditing or reviewing its\nlabor cost and profit elements. National outrage led to the cancellation of\nthis suspicious contract, a $200 million contract was awarded to Cobra\nAcquisitions, and some months later another $900 million contract was\nawarded to the same company, a subsidiary of an Oklahoma-based fossil fuel\ncompany. Why did PREPA enter into any agreements at all with private\ncontractors when the standard procedure for near-term disaster response is\nfor utilities to enter into mutual aid agreements with their counterparts in\nother states?\n\nIn the past few month's I've noticed an increasing amount of investigative\njournalism tackling questionable contracts awarded by different government\nentities and officials in Puerto Rico. Lack of transparency, costly\nmismanagement, and abuse of power can be found throughout. I feel like it's\nour duty to call these actions out and question and understand our\ngovernment's fiscal responsibility.\n\nThe Office of the Comptroller of Puerto Rico publishes awarded contracts\nonline and they've built a tool that lets you search and even download\ncontract documents (after they've been redacted of sensitive information).\nWe decided to use Python and Django to build a tool that would leverage this\ndata, showing what the government spends every year and how it spends the\nmoney.",
  "duration": 1500,
  "language": "eng",
  "recorded": "2019-10-05",
  "related_urls": [
    "https://2019.pygotham.org/talks/python-governments-and-contracts/"
  ],
  "speakers": [
    "Froilan Irizarry",
    "José Padilla"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/8AkKtTXcPJU/maxresdefault.jpg",
  "title": "Python, Governments, and Contracts",
  "videos": [
    {
      "type": "youtube",
      "url": "https://youtu.be/8AkKtTXcPJU"
    }
  ]
}
