{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "### Overview\n\nHave you ever struggled with finding ways to present data visualizations\nand/or results to non-technical audiences in a coherent and engaging manner?\nIn this talk, I'll detail how I overcame such a challenge by using Dash to\nbuild an interactive app for firefighters to use during performance testing\nof their rescue equipment.\n\n### Description\n\nAnalytical web applications can serve as a powerful means for scientists and\nengineers to interact with data and identify patterns and trends in a\nconcise and straightforward manner. Such tools can allow users to\nimmediately see the effects of modifying specific input parameters.\nAdditionally, interactive web apps can be utilized to present data\nvisualizations and analysis results in engaging ways.\n\nUnless you're a full-stack developer, creating these types of web\napplications may seem quite challenging. Dash, a Python framework written on\ntop of Flask, Plotly.js, and React.js, handles many of the complexities\nassociated with building custom interfaces and provides users the ability to\nbuild powerful data visualizations strictly through Python.\n\nDespite being an intermediate Python user lacking full knowledge of the\ntechnologies and protocols required to build web-based applications, I was\nable to create a UI using Dash. More specifically, I built an interactive\ndashboard for firefighters to process and interact with sensor data\ncollected during performance testing of their rescue equipment.\n\nDuring this talk, I will briefly detail the motivation behind this project.\nThen, I'll describe how the project progressed to its current state, while\nhighlighting key points that can be applied to the general case of\ndeveloping interactive web apps for audiences from non-technical\nbackgrounds. To conclude my presentation, I will show a demo of the\ninteractive web app and summarize the key takeaways.",
  "duration": 1500,
  "language": "eng",
  "recorded": "2019-10-05",
  "related_urls": [
    "https://2019.pygotham.org/talks/using-dash-to-create-interactive-web-apps-for-non-technical-audiences/"
  ],
  "speakers": [
    "Joseph Willi"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/CHkL_UYaDow/maxresdefault.jpg",
  "title": "Using Dash to Create Interactive Web Apps for Non-Technical Audiences",
  "videos": [
    {
      "type": "youtube",
      "url": "https://youtu.be/CHkL_UYaDow"
    }
  ]
}
