{
  "abstract": "Modern geoscientific research relies heavily on numerical computations\ninvolving complex software developed by physicists or chemists. It would\nseem that scientists should be well versed in ways of documenting and\nexplaining their research. Yet, when it comes to the documentation of\nscientific software projects, one soon realises that scientific wisdom\nis spread mostly by LaTeX and that the word 'documentation' starts to\nmean something completely different.\n\nWriting a documentation for a scientific project can be quite\nchallenging. There are not that many examples of well-documented\nopen-source geoscientific numerical modelling software projects to drew\nthe inspiration from. Even though the scientific results should be\nreproducible, mechanisms that reward those who deliver well documented\nsoftware are still to become widespread. The scientists are judged\nbasing on the number of peer-reviewed papers they publish, therefore\ninvesting the time solely to offer the documentation is difficult. The\ndocumentation should include the actual mathematical equations and\ntheory behind the software, figures documenting the scientific results\nas well as code listings and usage examples. The target audience may\nhave a strong background in science, computer science, both or neither.\n",
  "copyright_text": null,
  "description": "Full talk description: http://www.writethedocs.org/conf/eu/2015/speakers/\n\nSlides: http://www.writethedocs.org/conf/eu/2015/schedule/\n\nFollow us on Twitter @writethedocs\n\nJoin our mailing list http://writethedocs.us11.list-manage.com/subscribe?u=fcfe905987123983cc93c7a46&id=e2e27d6167",
  "duration": 1454,
  "language": "eng",
  "recorded": "2015-08-31",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2015/schedule/"
    }
  ],
  "speakers": [
    "Anna Jaruga"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Qg7lOWyT2mo/maxresdefault.jpg",
  "title": "The quest for scientific credit for software documentation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Qg7lOWyT2mo"
    }
  ]
}
