{
  "abstract": "\"So, your project needs better docs. For that, you'd need lots of\npeople. Professionalism. A well-thought out plan. All the tools. And a\nwhopping budget in both time and money.\n\nInstead, you're sitting there, with just a few paperclips, seven moldy\nMentos mints, a strip of Duct tape, a pencil and some nail polish\nremover...\n\nOh, hang on! There's also the combined experiences of generations of\npeople fighting seemingly insurmountable odds. From environmental\nactivists to LGBTQ people taking to the streets, we can draw on a rich\nhistory of inspired individuals taking whatever is at hand, mixed with\nsome clever zaniness to quite fabulous effect.\n\nSo, what if we apply an activist mindset and some DIY hacking into our\nprocess? What lessons can we learn from a world where TOC means Theory\nOf Change, where working on a shoestring budget is the norm and where\nempowering people to go beyond what they think they can do is considered\nmission- critical?\n\nTo be clear: the aim here is not to knock professionalism in docs, quite\nthe contrary! Yet, faced with a lack of resources, 'bend the rules and\nget going' sure beats lethargy. Not to mention being fun...\n\n(And before you think I'll be bringing back the dreaded mullet: the next\nMacGyver will be a woman, according to http://thenextmacgyver.com)\"\n",
  "copyright_text": null,
  "description": "Full talk description: http://www.writethedocs.org/conf/eu/2015/speakers/\n\nSlides: http://www.writethedocs.org/conf/eu/2015/schedule/\n\nFollow us on Twitter @writethedocs\n\nJoin our mailing list http://writethedocs.us11.list-manage.com/subscribe?u=fcfe905987123983cc93c7a46&id=e2e27d6167",
  "duration": 1845,
  "language": "eng",
  "recorded": "2015-08-31",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2015/schedule/"
    }
  ],
  "speakers": [
    "Paul Roeland"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Y2QxSTJ1jVs/hqdefault.jpg",
  "title": "MacGyvering your docs",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Y2QxSTJ1jVs"
    }
  ]
}
