{
  "abstract": "Do you feel like a fraud? Do you have that sneaking fear of being “found\nout” and exposed? Imposter syndrome is corrosive. It holds us back at\nwork - especially in an industry where we can feel constantly under\nreview by talented peers - and erodes our happiness. And the subject\nalways comes up whenever technical writers gather; sometimes it feels\nlike the very definition of a technical writer is “One who experiences\nimposter syndrome.”\n\nWhy is this? The first, shorter part of this talk will cover some\nresearch and insights into why we, as documentarians, may be especially\nsusceptible to imposter syndrome.\n\nBut the field of tech writing is experiencing a swerve: a tipping point\n- a sea change in direction. There will always be a demand for \"\"old\"\"\ntech writing, but many of us will have to adapt to this new environment.\n\nIn the second, forward-looking part of this talk, I’ll argue that being\nan “imposter” has its advantages during such a time of change. The very\nfactors that contribute to our self-doubt are actually the qualities\nthat will enable us to thrive as our role inexorably evolves to take on\nnew, unsolved challenges in engineering information. The keys to our\nsuccess: apophenia (the ability to see connections between seemingly\nrandom collections of information), empathy, and adaptability.\n\nOur future is bright if we pay attention to our new opportunities\ninstead of that nagging voice in our heads.\n",
  "copyright_text": null,
  "description": "... How Tech Writers Can Shed Self-Doubt, Embrace Uncertainty, and Surf the Upcoming Swerve in Technical Documentation\n\nFull talk description: http://www.writethedocs.org/conf/eu/2015/speakers/\n\nSlides: http://www.writethedocs.org/conf/eu/2015/schedule/\n\nFollow us on Twitter @writethedocs\n\nJoin our mailing list http://writethedocs.us11.list-manage.com/subscribe?u=fcfe905987123983cc93c7a46&id=e2e27d6167",
  "duration": 1853,
  "language": "eng",
  "recorded": "2015-08-31",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2015/schedule/"
    }
  ],
  "speakers": [
    "Riona MacNamara"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/pg_Y9hUt2dg/hqdefault.jpg",
  "title": "IMPOSTER NO MORE: How Tech Writers Can Shed Self-Doubt, Embrace Uncertainty, and Surf the Upcoming Swerve in Technical Documentation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pg_Y9hUt2dg"
    }
  ]
}
