{
  "id": 3129, 
  "category": "PyCon AU 2014", 
  "slug": "command-line-programs-for-busy-developers-by-aaro", 
  "title": "Command line programs for busy developers by Aaron Iles", 
  "summary": "", 
  "description": "Command line interface tools are the new web framework. In addition to the\r\nPython standard library's getopt, optparse and argparse there is a bewildering\r\narray of packages available on the Python Packaging Index. Packages like Click,\r\nCliff, Docopt, Invoke all provide different mechanics for creating command line\r\napplications. When all you want to do is expose a command line and get back to\r\ncreating functionality, it’s hard to know which alternative to reach for.\r\n\r\nThis presentation will have two parts, the first half will be a brief survey\r\nof popular modules. Strengths, weaknesses and design philosophies will be\r\ncompared by creating command line processing for the same example program.\r\n\r\nThe second half will go into more depth on a specific package, Begins. This\r\npackage was authored by the presenter to minimise the disruption developers\r\nexperience when breaking flow to implement command line processing. The\r\naudience will be shown how a single line of code can create a complex command\r\nline interface. It will also be shown how a handful of decorators from the\r\nBegins API can eliminate boilerplate code and create powerful, complex\r\napplications.", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i.ytimg.com/vi/D5l4JNt2ozI/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://mirror.linux.org.au/pub/pycon-au/pyconau2014/57-out.ogv", 
      "length": null, 
      "type": "ogv"
    }, 
    {
      "url": "http://www.youtube.com/watch?v=D5l4JNt2ozI", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=D5l4JNt2ozI", 
  "tags": [], 
  "speakers": [
    "Aaron Iles"
  ], 
  "recorded": "2014-08-07"
}