{
  "alias": "video/482/pyconau-2010--genropy---a-framework-for-creating-",
  "category": "PyCon AU 2010",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Genropy - A framework for creating complex applications deployed on the\nweb\n\nPresented by Jeff B Edwards (Goodsoftware)\n\n`Genropy <http://blog.genropy.org/>`__ is the python implementation of\nGenro, and is an application framework quite different from the standard\n(django, cherrypy, turbogears), for building powerful database\napplications deployed from the browser. Many differences and advantages\nbetween this framework and traditional python application frameworks are\nexplained. Genropy is a suitable for creating complex 'applications' as\nopposed to 'sites'. The differentiation is that an application is\nsomething an operator uses all day, has trained users, that have to\n'squeeze' all the power from it available. Conversely, a 'site' is\nbasically public and not necessarily powerful as a user spends a\nrelatively small amount of time on it. Genropy is the framework for\ncreation applications. It is used for attendee registration and sales in\npycon italy, the larger national conference in Europe (Florence, Italy).\n\nThis session will demonstrate how to create a simple application (3\ntables) and demonstrate the ease and power of using python for the model\nview and controller on the client. It demonstrates how one api- being\nthe genro Bag - is used to create the model, to map the sql to objects,\nto create the GUI and communicate all data. So all of it can be done in\npython instead of having to use many different technologies and\nlanguages.\n\nJeff Edwards from Goodsoftware is strategic partner of Sofwell who is\nthe author of Genropy.\n",
  "duration": null,
  "id": 482,
  "language": "eng",
  "quality_notes": "",
  "recorded": null,
  "related_urls": [
    "http://blog.genropy.org/"
  ],
  "slug": "pyconau-2010--genropy---a-framework-for-creating-",
  "speakers": [
    "Jeff B Edwards"
  ],
  "summary": "",
  "tags": [
    "databases",
    "gui",
    "pyconau",
    "pyconau2010",
    "web"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_482___pyconau-2010-genropy-a-framework-for-creating-complex-applications-deployed-on-the-web",
  "title": "PyConAU 2010: Genropy - a framework for creating complex applications deployed on the web",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_482___pyconau-2010-genropy-a-framework-for-creating-complex-applications-deployed-on-the-web"
    },
    {
      "length": null,
      "type": "flv",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-au-2010/482_pyconau-2010-genropy-a-framework-for-creating-complex-applications-deployed-on-the-web.flv"
    }
  ]
}
