{
  "alias": "video/472/pyconau-2010--glamkit--a-harder--better--faster--",
  "category": "PyCon AU 2010",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "GLAMkit: a harder, better, faster, stronger way to write reusable Django\ncode\n\nPresented by Dr. Greg Turner (the Interaction Consortium)\n\nAs part of our web development work for Galleries, Libraries, Archives\nand Museums (the so-called GLAM sector), we have open-sourced the common\ntools and design patterns that we have developed as a web framework\ncalled GLAMkit (http://glamkit.org/).\n\nGLAMkit is based on Django, and is inspired by its design philosophy of\nseveral apps which implement specific features. However, by looking at\nthe successes and challenges faced by other CMSes and collections of\napps such as Pinax, we have taken the philosophy a stage futher.\n\nRather than being a collection of Django apps, we have constructed\nGLAMkit as a collection of optional and reusable Django 'toolkits' for\nimplementing common features. We leave the implementation details - the\nthings that Django already does brilliantly - to the application\ndevelopers themselves.\n\nIn this talk, we will present the history of GLAMkit's development, with\nparticular focus on how our approach to reusability came about, and some\nexamples of that approach.\n",
  "duration": null,
  "id": 472,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2010-06-26",
  "related_urls": [
    "http://glamkit.org/)."
  ],
  "slug": "pyconau-2010--glamkit--a-harder--better--faster--",
  "speakers": [
    "Dr. Greg Turner"
  ],
  "summary": "",
  "tags": [
    "advocacy",
    "architecture",
    "community",
    "pyconau",
    "pyconau2010",
    "web"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_472___pyconau-2010-glamkit-a-harder-better-faster-stronger-way-to-write-reusable-django-code",
  "title": "PyConAU 2010: GLAMkit: a harder, better, faster, stronger way to write reusable Django code",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_472___pyconau-2010-glamkit-a-harder-better-faster-stronger-way-to-write-reusable-django-code"
    }
  ]
}
