{
    "description": "Uncover the secrets to turbocharging your Python numeric computations by\nharnessing the dynamic performance of ``C++``. This talk is aimed at the\nbeginner-intermediate Python developer working in the ML/AI infra or\nperformance optimization space.\n\nHave you ever wondered how the growing usage of the numeric computation\nstack, including libraries like numpy, scipy, and scikit-learn, along\nwith deep learning libraries such as pytorch and tensorflow, are shaping\nthe future of AI and Machine Learning? And what about the intriguing\nfact that these libraries are built on wrappers for the underlying C++\ncode? Have you considered the benefits this brings, or how the\noptimization of these libraries as per the host device - be it CPU, GPU,\nor Apple Silicon - enhances performance and efficiency?\n\nAnd finally, let's consider the practical applications and real-world\nexamples of this integration between Python and C++. What are the\nchallenges and solutions in bridging the gap between Python and C++ in\nthe context of AI and Machine Learning.\n\nObserving the growing trends at my workplace over the past few years, I\nam sure this process is going to be standardised soon with more\ndevelopers being involved in such integrations/optimizations.\n\n| This talk aims to get the Python community excited for this growing\n  trend by sharing:\n| 1. reasoning\n| 2. Integration framework/paths specifically for pybind\n",
    "language": "eng",
    "recorded": "2024-07-27",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://www.pyohio.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://www.pyohio.org/2024/program/talks/boosting-python-numeric-computations-with-dynamic-c-integration"
        }
    ],
    "speakers": [
        "Mandar Deshpande"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/pk1jGO41zLw/maxresdefault.jpg",
    "title": "Boosting Python Numeric Computations with Dynamic C++ Integration",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=pk1jGO41zLw"
        }
    ]
}
