{
    "description": "With an average of 195 daily deaths due to synthetic opioids overdose in\n2021, the US have been facing an unprecedented opioids crisis. Fentanyl\nand its analogues have been a major source of concern, due to their high\nlevels of addiction, fast-acting mechanisms, and detection challenges.\nFast, effective, and accurate identification and quantification of\nfentanyl, its analogues, and metabolites are essential to help prevent\noverdose-related incidents and to enable agile medical response.\nAlthough electrochemical sensors represent a promising technology for\nselectively detecting opioids at low concentrations, analyzing and\nprocessing the data remains one of the major challenges. To tackle this\nchallenge, certain Python libraries, such as *scipy.signal*, could be\nuseful in processing signals with high levels of noise and interference\nfrom other substances.\n\nThis talk will focus on specific examples of how such libraries could\nhelp enable filtering, Fourier transformation, and wavelet analysis of\nelectrochemical data. As examples, code snippets and outputs will be\nshown to demonstrate how Python can help improve the quality and\nusability of electrochemical data. Additionally, this talk will show how\ndata processing can further benefit from hyper parameter optimization\ntechniques, enabled by libraries like *hyperopt* and *ray-tune*. By\ndoing so, my hope is to demonstrate how Python could be extremely useful\nin helping address problems at the intersection of statistics, public\nhealth, and public policy.\n",
    "language": "eng",
    "recorded": "2024-07-28",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://www.pyohio.org/2024/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://www.pyohio.org/2024/program/talks/signal-processing-in-electrochemistry-with-python-applications"
        }
    ],
    "speakers": [
        "Rodrigo Silva Ferreira"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/7UPzG0HhjDE/maxresdefault.jpg",
    "title": "Signal Processing in Electrochemistry with Python: Applications to the US Opioids Crisis",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=7UPzG0HhjDE"
        }
    ]
}
