{
  "description": "Dynamic data are all around us. Changepoint models allow us to know when changes happen in these data and what they look like. Probabilistic modelling allows us to elegantly build customizable changepoint models for different data types, as well as provide us with uncertainty estimates for the position and magnitude of the change (both indispensable quantities for decision-making and hypothesis testing). This tutorial will briefly cover building changepoint models for multivariate data using PyMC but will primarily focus on the ways in which this “basic” model can be extended.\n\nThis tutorial is targeted towards academic researchers, data scientists, and anyone interested in being able to easily build bespoke models which provide uncertainty estimates for inferred statistics. This talk will attempt to be accessible to beginners but leans towards more intermediate users interested in changepoint modelling. Previous experience with PyMC, and a background in statistical modelling is assumed. No libraries other than PyMC and the basic scientific stack (numpy, scipy, matplotlib) will be used.\n\nThe tutorial aims to be hands-on, will discuss some theory to provide context for the models discussed, and will be heavy on understanding code to construct the “guts” of the models (in particular, selection of distributions for modelling the emissions and changepoint locations, and the details of the tensor manipulation to put everything together).\nThe tutorial will be divided into three parts:\n\nIntroduction to changepoint modelling and use cases.\nConstruction of the “basic” multivariate changepoint model.\nExtensions to the “basic” model:\n- Handling drift/noise in repeated observations using mixture emissions across multiple timeseries observations.\n- Determining the distribution over number of changepoints using a Dirichlet Process prior.\n\nContent:\n🎥 Abuzar's Interview: https://www.youtube.com/watch?v=ySF3X45XRyQ\n🎥 Walkthrough of changepoint modelling in PyMC: https://www.youtube.com/watch?v=iwNju1o5yQo\n📝 Code Notebook: https://github.com/abuzarmahmood/pymcon_bayesian_changepoint/blob/72102ad6149b86d586595bf4523f40f66eb20c25/Bayesian_Changepoint_Zoo_neural_data.ipynb\n👉 Discourse Post for more details and discussion: https://discourse.pymc.io/t/13251\n\n\n📢 PyMCon is a community conference that shares the latest in statistical practices, tricks, and tips. Submit your proposal for the PyMCon Web Series CFP and be part of this exciting community. Submit your proposal here: https://pymcon.com/cfp/\n\n📧 Join the PyMCon mailing list to stay up-to-date on the latest news, insights, and announcements. 🔗 Join the mailing list here: https://dashboard.mailerlite.com/forms/241188/73241617305175542/share\n\n🤝 Connect with us on Discourse and Meetup and be part of a vibrant community of statisticians, data analysts, and enthusiasts.\n🔗 Discourse: https://discourse.pymc.io\n🔗 Meetup: https://www.meetup.com/pymc-online-meetup\n\n#PyMConWebSeries #ProbabilisticProgramming #pymc  #datascience  #ai #machinelearning #programming #datascientist #developer",
  "duration": 3307,
  "language": "eng",
  "recorded": "2023-11-24",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pymcon.com/"
    },
    {
      "label": "https://discourse.pymc.io/t/13251",
      "url": "https://discourse.pymc.io/t/13251"
    },
    {
      "label": "https://www.meetup.com/pymc-online-meetup",
      "url": "https://www.meetup.com/pymc-online-meetup"
    },
    {
      "label": "https://www.youtube.com/watch?v=ySF3X45XRyQ",
      "url": "https://www.youtube.com/watch?v=ySF3X45XRyQ"
    },
    {
      "label": "https://github.com/abuzarmahmood/pymcon_bayesian_changepoint/blob/72102ad6149b86d586595bf4523f40f66eb20c25/Bayesian_Changepoint_Zoo_neural_data.ipynb",
      "url": "https://github.com/abuzarmahmood/pymcon_bayesian_changepoint/blob/72102ad6149b86d586595bf4523f40f66eb20c25/Bayesian_Changepoint_Zoo_neural_data.ipynb"
    },
    {
      "label": "https://pymcon.com/cfp/",
      "url": "https://pymcon.com/cfp/"
    },
    {
      "label": "https://discourse.pymc.io",
      "url": "https://discourse.pymc.io"
    },
    {
      "label": "https://dashboard.mailerlite.com/forms/241188/73241617305175542/share",
      "url": "https://dashboard.mailerlite.com/forms/241188/73241617305175542/share"
    },
    {
      "label": "Model Walkthroughs",
      "url": "https://www.youtube.com/watch?v=iwNju1o5yQo"
    },
    {
      "label": "Speaker Interview",
      "url": "https://www.youtube.com/watch?v=ySF3X45XRyQ"
    }
  ],
  "speakers": [
    "Abuzar Mahmood"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/vqT4Vx4fc5U/maxresdefault.webp",
  "title": "The Only Constant is Change: Bespoke Changepoint Modelling in PyMC",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vqT4Vx4fc5U"
    }
  ]
}
