{
  "description": "www.pydata.org\n\nNon-Intrusive Load Monitoring (NILM) is a key technique in data-driven energy management and home automation, aimed at disaggregating energy consumption to identify active appliances in households and quantify their energy usage. This presentation:\n\n    Provides an overview of NILM, highlighting its advantages and reviewing state-of-the-art deep learning algorithms developed for this purpose.\n    Examines smart meters and IoT devices in energy systems, with a focus on the Chain2 protocol used in Italian energy systems. This event-based protocol generates low-volume data, enabling real-time energy monitoring and alerting.\n    Presents examples of deep learning models trained on real-world IoT sensor data from energy meters, demonstrating their application in energy disaggregation.\n\nThis session offers an insightful overview of real-world deep learning applications in energy systems. While tailored for data scientists and data engineers interested in these fields, no prior knowledge is required. Join to explore how these technologies are driving energy optimization, cost reduction, and enhancing personal energy consumption awareness.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1796,
  "language": "eng",
  "recorded": "2024-12-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2024"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/cMtYqUqdzsA/maxresdefault.jpg",
  "title": "Francesco Conti - Deep Learning in Energy Management: Non-Intrusive Load Monitoring for IoT Devices",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cMtYqUqdzsA"
    }
  ]
}
