{
  "description": "As data grows larger and more complex, efficient storage and processing become critical to achieving scalable and high-performance computing. Blosc2 (https://www.blosc.org), a powerful meta-compressor library, addresses these challenges by enabling rapid compression and decompression of large, multidimensional arrays (NDArrays). This tutorial will introduce the core concepts of working with Blosc2, focusing on how it can be leveraged to optimize both storage and computational performance in Python.\n\nAttendees will learn how to:\n\n    Efficiently create and manage large NDArrays, including options for persistence.\n    Select the best codecs and filters for specific data types and workflows to achieve optimal compression ratios and performance.\n    Perform computations directly on compressed data to save memory and speed up processing.\n    Seamlessly share NDArrays using Caterva2, a versatile library designed to enable remote sharing and serving of multidimensional datasets.\n\nThis tutorial is ideal for Python developers working with large-scale data in scientific computing, machine learning, and other data-intensive fields.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 5220,
  "language": "eng",
  "recorded": "2024-12-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2024"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.blosc.org",
      "url": "https://www.blosc.org"
    }
  ],
  "speakers": [
    "Francesc Alted"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/aR-i_a3nGx0/maxresdefault.jpg",
  "title": "Mastering Large NDArray Handling with Blosc2 and Caterva2",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aR-i_a3nGx0"
    }
  ]
}
