{
  "description": "Learn to build powerful sensors running on low-cost microcontrollers, all in Python!\n\nDid you known that (Micro)Python can scale all the way down to microcontrollers\nthat have less than 1 MB of RAM and program memory? Such devices can cost just a few dollars, and are widely used to measure, log, analyze and react to physical phenomena. This enables a wide range of useful and fun applications - be it for a smart home, wearables, scientific measurements, consumer products or industrial solutions.\n\nIn this talk, we will demonstrate how to get started with MicroPython on a ESP32 microcontroller.\nWe will first show how to create a basic Internet-connected sensor node using simple analog/digital sensors. And then we will show how to create advanced sensors that use Digital Signal Processing and Machine Learning to analyze microphone, accelerometer or camera data\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 1716,
  "language": "eng",
  "recorded": "2024-12-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2024"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Jon Nordby"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/nCmBJJHGQKo/maxresdefault.jpg",
  "title": "Microcontrollers + Machine Learning with MicroPython in 1-2-3",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nCmBJJHGQKo"
    }
  ]
}
