{
  "description": "skchange is a python compatible framework library for detecting anomalies, changepoints in time series, and segmentation.\n\nskchange is based on and extends sktime, the most widely used scikit-learn compatible framework library for learning with time series. Both packages are maintained under permissive license, easily extensible by anyone, and interoperable with the python data science stack.\n\nThis workshop gives a hands-on introduction to the new joint detection interface developed in skchange and sktime, for detecting point anomalies, changepoints, and segment anomalies, in unsupervised, semi-supervised, and supervised settings.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 5362,
  "language": "eng",
  "recorded": "2024-12-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2024"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Franz Kiraly",
    "Christopher Risi",
    "Martin Tveten"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/VwhevNkxjYw/maxresdefault.jpg",
  "title": "sktime: time series anomaly detection, changepoint detection, segmentation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VwhevNkxjYw"
    }
  ]
}
