{
  "description": "As the climate changes, farmers in Africa are facing enormous challenges, from unpredictable rainfall to shifting growing seasons. In this session, I will share how we can use machine learning (ML) models, built on open-source platforms like TensorFlow and Google Earth Engine, to predict crop yields for key staples such as maize and cassava. By looking at case studies from Kenya, Ghana, and Malawi, I'll show how ML is helping farmers decide when to plant, manage resources more efficiently, and reduce climate risks. I’ll also talk about practical tools—like community hubs, radio broadcasts, and SMS alerts—that ensure even non-literate farmers can use these insights. Expect to walk away with actionable ideas on how to implement these techniques in your own work on food security.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 1675,
  "language": "eng",
  "recorded": "2024-12-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2024"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Kristal Joi Wise"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/wMwEmlhyYh0/maxresdefault.jpg",
  "title": "Harnessing Machine Learning to Improve Agricultural Resilience in Africa",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wMwEmlhyYh0"
    }
  ]
}
