{
  "description": "Tenova, as an innovative engineering company, collaborates closely with its client-partners to create advanced technologies and services that optimize business operations.\n\nThis talk discusses the deployment of our image recognition system to identify and mitigate potential hazards on steel plants, specifically focusing on the detection of bulky steel pieces.\nThe system was deployed on-premise using an edge device and an IP camera, supported by Azure IoT Edge and a Flask API for image processing and prediction.\nA recent migration to a RabbitMQ-based architecture using Pika enhanced scalability and communication.\n\nThe presentation will cover technical strategies, the challenges (like offline functionality and real-time, low-latency hazard detection) and the positive impact of the system on workplace safety and operational efficiency.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 1441,
  "language": "eng",
  "recorded": "2024-12-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2024"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Nicolò Giso"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/G8ypUIlvlEg/maxresdefault.jpg",
  "title": "Image Recognition for safety on the factory floor",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=G8ypUIlvlEg"
    }
  ]
}
