{
  "description": "www.pydata.org\n\nPolars (https://github.com/pola-rs/polars) boasts 18 different data types, not including variants of numerical types.\n\nDo we really need such a vast collection of data types?\n\nWhat is the use case for each type?\n\nWhat is the difference between List and Array? Or between Categorical and Enum? And why on Earth would I ever need a Struct?\n\nThis talk will clear up all of these questions and more, as we go through the data types that Polars provides and understand why we need each one of them.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1829,
  "language": "eng",
  "recorded": "2024-12-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2024"
    },
    {
      "label": "https://github.com/pola-rs/polars",
      "url": "https://github.com/pola-rs/polars"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/8HwfVVknhP4/maxresdefault.jpg",
  "title": "Rodrigo Girão Serrão - Understanding Polars data types | PyData Global 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8HwfVVknhP4"
    }
  ]
}
