{
  "description": "www.pydata.org\n\nThe R Development Guide (R Dev Guide) (https://contributor.r-project.org/rdevguide/) serves as a resource for onboarding new contributors to the R project. Initially drafted in 2021 and then expanded during the Google Season of Docs 2022, the guide has evolved to make contributing more accessible, especially for newcomers. This talk will explore the latest developments in the guide, its impact on the R community, and how it fosters inclusivity within the project by simplifying the contribution process.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1192,
  "language": "eng",
  "recorded": "2024-12-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2024"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://contributor.r-project.org/rdevguide/",
      "url": "https://contributor.r-project.org/rdevguide/"
    }
  ],
  "speakers": [
    "Saranjeet Kaur Bhogal"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/l5BwwvQlwG0/maxresdefault.jpg",
  "title": "Empowering New Contributors: The Evolving Role of the R Development Guide",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=l5BwwvQlwG0"
    }
  ]
}
