{
  "description": "www.pydata.org\n\ndata.table is an R package with C code that is one of the most efficient open-source in-memory data manipulation packages available today. First released to CRAN by Matt Dowle in 2006, it continues to grow in popularity, and now over 1500 other CRAN packages depend on data.table. This talk will start with data reading from CSV, discuss basic and advanced data manipulation topics, and finally will end with a discussion about how you can contribute to data.table.\n\nhttps://github.com/tdhock/2023-10-LatinR-data.table?tab=readme-ov-file#english\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 4098,
  "language": "eng",
  "recorded": "2024-12-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/global2024"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/tdhock/2023-10-LatinR-data.table?tab=readme-ov-file#english",
      "url": "https://github.com/tdhock/2023-10-LatinR-data.table?tab=readme-ov-file#english"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/l_7FXnppu-g/maxresdefault.jpg",
  "title": "Toby Dylan Hocking- Using and contributing to the data.table package for efficient big data analysis",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=l_7FXnppu-g"
    }
  ]
}
