{
  "description": "JupyterLab is a web-based user interface for scientists and developers for exploration, analysis, and visualization. JupyterLab provides a Jupyter notebook editor, code editor, code console, terminal, debugger, and more as core extensions. Users can write and distribute extensions as Python packages to add new components or customize and extend the capabilities of existing components in JupyterLab. For example, users can install extensions that provide a new file viewer or editor, display data with custom visualizations inside notebooks or code consoles, or interact with external services and version control. Extensions can add items to the main menu, status bar, command palette, notebook metadata panel, activity launcher, side bars, context menus, toolbars, and keyboard shortcuts. Extensions can also provide new autocomplete results, custom themes, custom settings, and custom ipywidgets. Extensions can also provide extension points for other extensions.\n\nIn this tutorial, we will guide attendees through creating basic extensions and show how extensions can interact with core components in JupyterLab. We'll use the new extension distribution system introduced in JupyterLab 3.0, which enables users to easily install extensions as Python packages. Attendees are expected to be comfortable with coding in javascript/typescript (or willing to pick it up fairly quickly). Attendees are encouraged to come with an extension idea that they’d like to work on.\n\nhttps://github.com/marthacryan/developing-extensions-tutorial",
  "duration": 6583,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.scipy2022.scipy.org/"
    },
    {
      "label": "https://github.com/marthacryan/developing-extensions-tutorial",
      "url": "https://github.com/marthacryan/developing-extensions-tutorial"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/9_-siU-_XoI/maxresdefault.jpg",
  "title": "Developing Extensions for JupyterLab- Martha Cryan, Alex Bozarth, Piyush Jain | SciPy 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9_-siU-_XoI"
    }
  ]
}
