{
  "description": "This tutorial is an introduction to performing interactive image analysis using the scientific python ecosystem, including scikit-image, scipy, jupyter notebook, and napari. Through a series of interactive notebooks, you will gain familiarity with image processing in python and learn to take an image processing workflow from prototype to packaged analysis plugin. You will be introduced to napari (a python-based image viewer) and its plugin ecosystem, perform basic image analysis tasks like segmentation and spot detection using napari and jupyter notebook, and finally will create your own napari plugin from this workflow. This tutorial is intended for those with some experience writing python scripts who have an interest in scientific image visualization and analysis. No prior experience with napari is required.\n\nWe will begin with an introduction to napari's interface, its various image layer types and general usage. Next we'll dive into an application to cell biology, using the cellpose plugin to perform cell nuclei segmentation, shape measurement and spot detection on a 2D image. Finally, we'll introduce the \"\"npe2\"\" napari plugin engine and help you turn the spot detection workflow into your own napari plugin. \n\nAll sections of the tutorial are accompanied by interactive activities using a Jupyter notebook. Where necessary, these activities are introduced through informational lectures covering key tools and concepts.\n\nhttps://alisterburt.github.io/napari-workshops/Scipy-0722/intro.html",
  "duration": 5202,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.scipy2022.scipy.org/"
    },
    {
      "label": "https://alisterburt.github.io/napari-workshops/Scipy-0722/intro.html",
      "url": "https://alisterburt.github.io/napari-workshops/Scipy-0722/intro.html"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/vismuuc4y1I/maxresdefault.jpg",
  "title": "Interactive image analysis with napari- Kevin Yamauchi, Draga Doncila Pop | SciPy 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vismuuc4y1I"
    }
  ]
}
