{
  "description": "This tutorial session is intended to give attendees a gentle introduction to applying causal thinking and causal inference to data using python. Causal data analysis is very common in many academic domains (e.g. in social psychology, epidemiology, macroeconomics, public policy research, sociology, and more) as well as in industry (all of the largest Silicon Valley tech companies employ teams of scientists who answer business questions purely with causal inference methods). \n\nThe tutorial will involve a combination of presentations with open Q&A and hands-on exercises contained in Jupyter notebooks. This session will cover the difference between correlation and causation, the pitfalls of conducting an analysis using observational data, how causal inference can help get around these pitfalls, and examples of common, modern modeling approaches used to conduct causal inference (propensity score matching, estimating causal curves, g-computation, and double ML). After the tutorial, the attendees should have a good foundational understanding of causality and the ability to confidently explore the topic on their own. Causal inference can be a very theory-heavy topic, making it impenetrable to novices. In this tutorial, we'll aim to take a more practical perspective on causal inference, while still occasionally touching on the theory. \n\nTutorial participants are not expected to be familiar with causal inference before attending, but we hope they have an earnest curiosity to learn about it! To get the most out of the session, the participants ought to have experience working with the common python data stack: `matplotlib`, `numpy`, `pandas`, and `scikit-learn`. Attendees should have some experience conducting classic machine learning modeling using the `scikit-learn` API, although having advanced machine learning expertise is absolutely not a prerequisite. A very basic understanding of statistics would be helpful (e.g. understanding what a mean is, what confidence intervals represent).\n\nhttps://github.com/ronikobrosly/causal_inference_intro",
  "duration": 5301,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.scipy2022.scipy.org/"
    },
    {
      "label": "https://github.com/ronikobrosly/causal_inference_intro",
      "url": "https://github.com/ronikobrosly/causal_inference_intro"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/tkJ3xo28-T0/maxresdefault.jpg",
  "title": "Introduction to Causal Modeling- Roni Kobrosly | SciPy 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tkJ3xo28-T0"
    }
  ]
}
