{
  "description": "The scientific Python ecosystem has been flourishing for more than 2 decades. It is very powerful and many tools can be built leveraging it, but one remaining challenge is how to disseminate this ecosystem deeper into industries and companies to make digital transformation a reality. While jupyter notebooks have made it easy to share scripts amongst regular programmers, many non-programmer scientists need a simple graphical user-interface to adopt new tools, technologies and practices.\n\nWeb based front-ends are certainly a way to solve this problem, but the client-server framework typically requires a shift in mental models for programmers, and may require more resources than may be readily available for small teams of scientists in early stages of their innovation process (IT, cloud services, front-end developers, security experts, …). Desktop applications can represent a powerful alternative for small user base situations, proof of concepts, or applications that involve local datasets.\n\nIn this tutorial, we will teach you to migrate your script/notebook to an interactive and scalable GUI application which can be shared with users who are not comfortable with programming or command line tools. You will learn to re-architect your analysis so it can grow seamlessly into a robust, interactive GUI and even to a large analysis platform if need be. We will show the power of combining multiple powerful components of the open source Enthought Tool Suite (ETS) like TraitsUI, Chaco, and Mayavi. It is a mature, flexible and scalable GUI framework, used across academic and companies alike and across many industries and fields. By the end of the tutorial, attendees will all have built a simple interactive browser for pictures (dubbed \"\"pycasa\"\"), and learned about the main features, capabilities, and principles of ETS.\n\nTarget audience: \nProgrammers/developers wanting to share tools/algorithms with colleagues/scientists needing to focus on science rather than code.\n\nhttps://github.com/jonathanrocher/ets_tutorial",
  "duration": 13065,
  "language": "eng",
  "recorded": "2022-07-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.scipy2022.scipy.org/"
    },
    {
      "label": "https://github.com/jonathanrocher/ets_tutorial",
      "url": "https://github.com/jonathanrocher/ets_tutorial"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/2dd4BduDkG8/maxresdefault.jpg",
  "title": "Sharing scientific tools from script to desktop- Jonathan Rocher, Prabhu Ramach | SciPy 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2dd4BduDkG8"
    }
  ]
}
