{
  "alias": "video/3359/november-2014-chipy-talks",
  "category": "ChiPy",
  "copyright_text": "youtube standard license",
  "description": "Hidden Markov Models to improve activity recognition in patients with spinal cord injury\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nBy: Asma Mehjabeen\n\nFitness tracking is great for calories and steps, but similar sensors\nare capable of reporting much more about how we move throughout the day.\nThis is especially important in assessing the quality of movement for\nthose with limited mobility. Doctors often want to know more detail\nabout patient behavior after therapy to select and adjust the\nappropriate intervention. Using machine learning on wearable\naccelerometer signals, we estimate the activities patients with\nincomplete spinal cord injury are performing. By combining windowed\nclassifier estimates over time using a hidden markov model, we show how\nerror rates can be significantly decreased, which brings more detailed\nassessments of patient activity closer to a clinical reality.\n\nInnate learning: training the brain before the eyes open\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nBy: Isaac Adorno\n\nAmorphous, blob-like patterns of neural activity form and move over the\neye during visual development in animals. Why do such patterns exist? We\nshow that these patterns are this way to better prepare the visual\nsystem for natural vision. Essentially, these are movies played in the\neyes to refine the visual system before the eyes even open. We use\npython to model the developing visual system, produce an efficient code\nbased on those patterns, and show how that code matches what is seen\nbiologically. In this way, we show that during your early development\nyou are learning from innately generated patterns - a unique twist in\nthe debates of nature and nurture.\n",
  "duration": null,
  "id": 3359,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-11-13",
  "slug": "november-2014-chipy-talks",
  "speakers": [
    "Asma Mehjabeen",
    "Isaac Adorno"
  ],
  "summary": "Talks from the November 2014 meeting. Hidden Markov Models to improve\nactivity recognition in patients with spinal cord injury and Innate\nlearning: training the brain before the eyes open.\n",
  "tags": [],
  "thumbnail_url": "",
  "title": "November 2014 Chipy Talks",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EEwufSsx4O8"
    }
  ]
}
