{
  "alias": "video/585/python-for-scientific-and-high-performance-compu1",
  "category": "ChiPy",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Python for Scientific and High Performance Computing (part 2 of 4)\n\nPython, a high-level portable multi-paradigm interpreted programming\nlanguage is becoming increasingly popular with the scientific and HPC\ncommunities due to ease of use, large collection of modules,\nadaptability, and strong support from vendors and community alike. This\ntutorial provides an introduction to Python focused on HPC and\nscientific computing. Throughout, we provide concrete examples, hands-on\nexamples, and links to additional sources of information. The result\nwill be a clear sense of possibilities and best practices using Python\nin HPC environments. We will cover several key concepts: language\nbasics, NumPy and SciPy, parallel programming, performance issues,\nintegrating C and Fortran, basic visualization, large production codes,\nand finding resources. While it is impossible to address all libraries\nand application domains, at the end participants should be able to write\na simple application making use of parallel programming techniques,\nvisualize the output, and know how to confidently proceed with future\nprojects with Python.\n\nChiPy is a group of Chicago Python Programmers, l33t, and n00bs.\nMeetings are held monthly at various locations around Chicago. Also,\nChiPy is a proud sponsor of many Open Source and Educational efforts in\nChicago.\n",
  "duration": null,
  "id": 585,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2009-11-12",
  "slug": "python-for-scientific-and-high-performance-compu1",
  "speakers": [],
  "summary": "",
  "tags": [
    "chipy",
    "numpy",
    "scipy"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_585___python-for-scientific-and-high-performance-computing-2-of-4",
  "title": "Python for Scientific and High Performance Computing (2 of 4)",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_585___python-for-scientific-and-high-performance-computing-2-of-4"
    },
    {
      "length": null,
      "type": "flv",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/chipy/585_python-for-scientific-and-high-performance-computing-2-of-4.flv"
    }
  ]
}
