{
  "description": "All kinds of businesses are using data science and machine learning to understand themselves, lowering costs, engineering better products, and improving customer experiences. Similarly, we use data science to improve science itself, understanding how scientific topics are discovered and modeling institutional expertise. In our work, we use a combination of Python-powered big data analytics and web-based tools to achieve this goal, including pyspark (http://spark.apache.org), scikit-learn (http://http://scikit-learn.org), Django (https://www.djangoproject.com/), Celery (http://www.celeryproject.org/), and or-tools (https://developers.google.com/optimization).\n\nFirst, we will present the infrastructure behind Scholarfy, a recommender system for massive scientific conferences (http://www.scholarfy.net). We will also present a machine learning approach to automatically match expert scientific reviewers to research proposals (http://pr.scienceofscience.org). Finally, we will present the work behind our award-winning visualization, World’s Science Map (http://map.scienceofscience.org), where we modeled the institutional expertise, collaboration network, and funding of all institutions in the world. At the end of our talk, we will argue that Python-powered data science can improve not only businesses but also science, making it more agile and accurate. ",
  "duration": 2700,
  "id": 4725,
  "language": "eng",
  "recorded": "2016-03-10",
  "related_urls": [
    "http://http://scikit-learn.org",
    "http://map.scienceofscience.org",
    "http://pr.scienceofscience.org",
    "http://spark.apache.org",
    "http://www.celeryproject.org/",
    "http://www.scholarfy.net",
    "https://developers.google.com/optimization",
    "https://www.djangoproject.com/"
  ],
  "slug": "python-based-data-science-to-understand-knowledge-discovery-and-expertise-a-science-perspective",
  "speakers": [
    "Daniel E. Acuna"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/pVd2v7fgxwU/maxresdefault.jpg",
  "title": "Python-based data science to understand knowledge discovery and expertise: A science perspective",
  "videos": [
    {
      "type": "youtube",
      "url": "http://youtu.be/pVd2v7fgxwU"
    }
  ]
}
