{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Cada vez mas la blockchain está de moda. Escuchamos la palabra \"bitcoin\" en todos lados, incluso Infobae tiene una sección dedicada específicamente a las criptomonedas, pero... ¿Realmente estamos seguros de que pasa en ese mundo? En esta charla voy a intentar convencerlos de que Blockchain es una tecnología sólida y confiable, y para eso voy a explicar que es y como funciona una transacción monetaria en la red bitcoin, usando un lenguaje adecuado para programadores, analizando con detalle y profundidad como funciona esta tecnología.\n\nEn el 2009 apareció bitcoin por primera vez la primera implementación de dinero digital, descentralizado, seguro y confiable. En su momento era una idea super pequeña, bancada solamente por un círculo muy chico de personas, sin casos de uso reales. 9 años después la realidad es muy diferente. Hay cada vez mas proyectos, aplicaciones, empresas, productos y servicios basados en criptomonedas. \"bitcoin\" y \"blockchain\" son palabras que se pueden escuchar en el noticiero. Incluso infobae tiene una sección dedicada solo a criptos. El objetivo de la charla es poder hacer una introducción conceptual al funcionamiento de bitcoin, pero entrando con mas profundidad en algunas partes que como desarrolladores nos son mas útiles. Para eso vamos a analizar que es una transacción en bitcoin. Como nace, como se envia, como se recibe, como está formada y lo mas importante... Por qué podemos confiar en que es segura.\n",
  "language": "spa",
  "recorded": "2018-11-24",
  "speakers": [
    "Miguel Felipe Duarte"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/wQZPf_V0H0o/hqdefault.jpg",
  "title": "Blockchain: El camino de una transacción",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wQZPf_V0H0o"
    }
  ]
}
