{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "En esta charla vamos a hablar sobre la implementación de un sistema de experimentos para resolver un problema de pricing de un e-commerce británico. ¿Experimentos rápidos o experimentos bien modelados? ¿hay que elegir? De yapa, contamos un poco sobre PyGMO, una herramienta que ayuda a resolver problemas de optimización de varios tipos distintos.\n\nEn esta charla presentamos los avances y problemas que hemos tenido para atacar un problema de base científica desde un modelado de programación orientado objetos. En Eryx trabajamos con Slidr, un E-commerce británico que se basa en un novedoso sistema de subastas para la venta de artículos tecnológicos. Desde Eryx resolvemos problemas interesantes para Slidr para lograr que la plataforma sea rentable y competitiva. Los problemas que tienen poseen una fuerte base científica en los que se debe experimentar con diferentes modelos para optimizar las funciones de descuento de la plataforma. El objetivo desde un primer momento fue lograr un sistema útil para la experimentación, pero que sea modelado correctamente desde el paradigma de la programación orientada a objetos para conseguir un código de calidad que nos sirva para lograr un código entendible, reutilizable y escalable. El objetivo de la charla es contar el modelado del problema en particular y el tradeoff con el que nos encontramos en varios puntos entre la calidad del modelo de objetos y la performance del sistema al realizar experimentos pesados. También se contará la integración de nuestro sistema con la herramienta PyGMO que resulta una herramienta útil para problemas de optimización generales.\n",
  "language": "spa",
  "recorded": "2018-11-24",
  "speakers": [
    "A. Garassino"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/RQDyHUWNm7A/hqdefault.jpg",
  "title": "Convivencia entre objetos y experimentos científicos, ¿Alguien tiene que ceder?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RQDyHUWNm7A"
    }
  ]
}
