{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Se presenta una aplicación para el almacenamiento, análisis, y visualización interactiva de datos heterogéneos pertenecientes al biobanco de la Patagonia (proyecto RAICES), basado en herramientas libres como Django Rest Framework, Vue.js, Bokeh, THREE.js, y contenedores de Docker.\n\nEl Instituto Patagónico de Ciencias Sociales y Humanas de Ciencias\nSociales y Humanas (`IPCSH-CONICET`_) estudia cómo se relacionan las\ncostumbres y herencias de la región con variables físicas de interés\nmédico, en particular con rasgos de riesgo para enfermedades complejas\ncomo obesidad, sobrepeso y síndrome metabólico, entre otras. El proyecto\n`RAICES`_ (iniciativa propia del IPCSH-CONICET) busca generar un banco\nde datos genéticos o biobanco de la Patagonia que pueda servir para\nfuturas aplicaciones en el diseño de políticas públicas de salud. Este\ntrabajo, realizado a través de una pasantía promovida por el Laboratorio\nde Ciencias de las Imágenes (LCI) de la Universidad Nacional del Sur,\npresenta la implementación de un datawarehouse (basado en Python y\nMongoDB) que permite a los investigadores del proyecto almacenar,\nconsultar y analizar datos heterogéneos propios de la colecta (encuestas\nsocioeconómicas, información geográfica y genética, hábitos\nalimenticios, modelos 3D, vídeos de cuerpo completo, medidas\nantropométricas, entre otros). Dado que las fuentes de datos eran\ndiversas, se trabajó en un módulo de *ETL* (*Extract, Transform and\nLoad*) para normalizar los datos y adaptarlos al modelo del\ndatawarehouse. Junto con el datawarehouse se diseñó y desarrolló una\n`aplicación web`_ para la carga masiva de datos y acceso a los mismos en\nforma selectiva, brindando también una plataforma interactiva de\nvisualización de datos exploratoria (gráficos y modelos 3D). Se tiene\ncomo resultado un framework fácilmente generalizable basado en\ntecnologías libres disponible para ser utilizado en otros ámbitos\ncientíficos Las tecnologías utilizadas para el desarrollo del trabajo\nfueron las siguientes: Django Rest Framework, Vue.js, Bokeh, THREE.js,\nPandas, pyocr, pillow, Mongoengine, Docker Este trabajo fue realizado a\ntravés de una pasantía promovida por el Laboratorio de Ciencias de las\nImágenes (LCI) de la Universidad Nacional del Sur.\n\n.. _IPCSH-CONICET: http://www.ipcsh.conicet.gob.ar/\n.. _RAICES: https://www.facebook.com/proyecto.raices.patagonia/\n.. _aplicación web: https://youtu.be/CIpbHRLAG0I\n",
  "language": "spa",
  "recorded": "2018-11-24",
  "speakers": [
    "Luciano Serruya Aloisi",
    "Pablo Toledo Margalef"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/RD3m0Z6OpIA/hqdefault.jpg",
  "title": "Datawarehousing para datos genéticos, socioeconómicos y fenotípicos, con visualización 3D",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RD3m0Z6OpIA"
    }
  ]
}
