{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "La charla analizará las formas de educar a través de la historia, y demostrará que a través de los videojuegos se logra una mejora notable en la adquisición de los conocimientos por parte de los alumnos y al público en general.\n\n¿Cómo alguien que demuestra dificultades en el aprendizaje de la matemática, cuando se le presenta un videojuego con desafíos basados en números logra jugarlo sin problemas, avanzando de nivel? ¿Cómo un alumno que posee miedo a desaprobar un examen no presenta la misma dificultad al momento de perder una vida en un videojuego? ¿Cómo alguien que no le interesa practicar ni ver partidos de fútbol puede memorizar la formación de un equipo y saber en qué posición se desempeña mejor cada jugador , armar una buena estrategia y ganar partidos?. La Gamificación en un anglicismo, que proviene del inglés “gamification”, y que tiene que ver con la aplicación de conceptos que encontramos habitualmente en los juegos, u otro tipo de actividades lúdicas, como los videojuegos. No hace falta saber de programación para disfrutar de un juego electrónico. Los videojuegos se han convertido en uno de los fenómenos más importantes dentro de la cultura digital, representando un negocio millonario para las empresas y, a su vez, una nueva forma de entretenimiento tanto para niños como adultos. Sin duda, la posición alarmista y la visión restringida de los medios de comunicación hacia los juegos electrónicos, ha instalado en la sociedad una serie de prejuicios, muchas veces, injustificados. Esta charla planea ahuyentar esos mitos, y plantear el desafío de mejorar la forma en que los docentes se dirigen a los alumnos, impulsando en ellos la curiosidad por querer mejorar su desempeño académico a través de los mecanismos del videojuego.\n",
  "language": "spa",
  "recorded": "2018-11-24",
  "speakers": [
    "Federico Brest"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/w-pMbTGwsyk/hqdefault.jpg",
  "title": "Gamificación: un enfoque de la vida desde los videojuegos",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=w-pMbTGwsyk"
    }
  ]
}
