{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "A partir de comprender las APIs de Asterisk (AMI/AGI) y la gran cantidad de librerías de la comunidad python/asterisk, contaremos cómo Django se transformó en una parte crucial dentro de las tecnologías que conforman el sistema OMniLeads. Expondremos los conceptos fundamentales de la interacción de Python con Asterisk, poniendo énfasis en la versatilidad de estas APIs y cómo conseguimos crear funcionalidades para software de gestión de Contact Center.\n\nLa empresa que representamos Freetech Solutions, se dedicó mayormente a realizar soporte de software FLOSS para VoIP. A partir de detectar las deficiencias que presentaban estas soluciones y la falta de una herramienta de Software Libre orientada al negocio de los Contact Centers, se comenzó a desarrollar nuestra plataforma OMniLeads. Se trata de una plataforma para gestión de Contact Centers, con interfaz web que utiliza principalmente Django como framework de backend en interacción con tecnologías VoIP como Asterisk, Kamailio, RTPEngine y JSSip, para modernizar las soluciones existentes a través de las ventajas que ofrece el nuevo estándar WebRTC (un motor de audio y video nativo en los browsers modernos). En esta charla nos proponemos explicar el diseño de la interacción entre Python y Asterisk mediante los protocolos AMI/AGI mostrando ejemplos concretos de su funcionamiento en nuestro sistema. Además mencionaremos otras tecnologías presentes en el desarrollo, que escogimos principalmente por su condición de FLOSS y por las ventajas que observamos en la integración con Python/Django.\n",
  "language": "spa",
  "recorded": "2018-11-24",
  "speakers": [
    "Alejandro Zamora Fonseca",
    "Ana Almada"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/VpMSo1GNDRk/hqdefault.jpg",
  "title": "Haciendo Voip con Python y Asterisk",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VpMSo1GNDRk"
    }
  ]
}
