{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Implementación de un proceso de mallado para dominios tridimensionales, y que permite refinar arbitrariamente, con el propósito de construir, a partir de él, soluciones aproximadas a problemas de ecuaciones diferenciales en derivadas parciales. Para el manejo de los objetos matriciales y el álgebra lineal usamos NumPy.\n\nMuchos problemas de la geometría y de la física se modelizan en términos de ecuaciones diferenciales, que son ecuaciones que relacionan a una función desconocida con algunas de sus derivadas. En casi todos los casos, si bien está demostrada la existencia y unicidad de la solución de una de tales ecuaciones, es imposible computarla analíticamente de manera exacta, y entonces un abordaje posible es construir un método numérico para construir otra función que sea una aproximación (todo lo cercana que se quiera) de esta función desconocida. Estas aproximaciones se dan en forma de una función definida por partes, siguiendo una cierta subdivisión de la región del espacio en donde ocurre el fenómeno físico de interés. La definición y construcción de un método numérico propio comienza, entonces, con la explicitación del proceso de mallado, que consiste en una sucesión infinita de subdivisiones del dominio, con elementos de medida tan pequeña como se quiera. Después de esto, la definición de todos los objetos de cálculo concreto y de análisis teórico concernientes al método numérico depende de cuáles son precisamente los puntos, las aristas, las caras y los poliedros de las mallas. Un programa de mallado debe tomar como entrada alguna información geométrica sucinta de la región a subdividir y entregar como salida alguna tabulación concreta de los puntos, aristas, caras y poliedros de la malla. Por ejemplo una lista de archivos de texto. Presento una primera versión del programa en Python que implementa (y grafica) la familia de mallas que dan lugar al método numérico que construido y propuesto en el trabajo de mi tesis doctoral, bajo la supervisión del Dr. Ariel Lombardi (FCEiA, UNR -- CONICET). Además muestro brevemente parte del programa en GNU Octave que ensambla el sistema lineal de ecuaciones, a partir de las mallas, cuya solución son las coordenadas que determinan a la solución aproximada de una ecuación diferencial modelo.\n",
  "language": "spa",
  "recorded": "2018-11-24",
  "speakers": [
    "Alexis Jawtuschenko"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ywt5wY4HB9E/hqdefault.jpg",
  "title": "Mallas Poliedrales para Aproximar Soluciones de Ecuaciones Diferenciales en Derivadas Parciales",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ywt5wY4HB9E"
    }
  ]
}
