{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "La presente charla explorará las diversas ventajas características que ofrece el lenguaje de programación Python respecto de las aplicaciones que se pueden desarrollar para auxiliar y optimizar la labor judicial y legal, en el cumplimiento de la función de administrar justicia con datos de calidad, señalando el potencial de su utilidad y la necesidad de su desarrollo como desafío a nivel local.\n\nSiendo el lenguaje Python característicamente simple, abierto, libre, portable, modular, extensible, integrable, dinámico, expresivo y orientado a objetos, entre otros caracteres, resulta naturalmente interesante explorar las múltiples posibilidades que ofrece como lenguaje de programación aplicado a las necesidades del área legal, jurídica y judicial. A nivel nacional, nuestra justicia proyecta un camino novedoso y recientemente adoptado a lo largo de los últimos años, que se orienta a la apertura de datos y paulatina implementación de las TICs en su funcionamiento y administración. Cambios tales como el expediente electrónico, firma digital, carga digital de documentación legal, consulta web de expedientes, notificación electrónica, y otros, han venido a demostrarnos que requerimos soluciones integrables a nivel modular y no simplemente cambios, agregados o upgrades a “features” a las que progresivamente vamos adecuándonos como integrantes de este sistema. PyJustice será una charla en la que buscaremos mostrar las ideas que el lenguaje Python inspira en auxilio del cumplimiento último de la meta de una justicia más eficaz, eficiente y efectiva. Los ejemplos internacionales que nos ofrecen las aplicaciones en lenguaje Python en materia legal, nos sirven como pequeños hitos referenciales de un campo inexplorado y fértil de programación modular legal, que puede potenciar las características de nuestro sistema en pos de su superación, mejora y calidad. Uno de los problemas fundamentales tanto para la labor judicial como la legal, es trabajar permanentemente con datos de calidad, el activo intangible que hoy día reviste mayor valor en todos los ámbitos, a lo cual no escapa el servicio de justicia. Es así como Python se presenta como un faro que puede arrojar luz en la programación de aplicativos legales que de manera certera cumplan y se adecúen a esta meta principiológica, y sirvan para todos sus actores como el lenguaje basal de sus herramientas más primarias e inmediatas de trabajo. Por todo ello, se señalarán las proyecciones de estas posibles aplicaciones, tales como “scrapers” de los reservorios de datos judiciales que disponemos en la actualidad, indicando el potencial de su utilidad y la necesidad de su desarrollo como desafío pendiente a nivel local.\n",
  "language": "spa",
  "recorded": "2018-11-24",
  "speakers": [
    "Johanna Caterina Faliero",
    "Pablo Cruz Casas"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Ltn6jPbhKP0/hqdefault.jpg",
  "title": "PyJustice: aplicaciones de Python en el área legal. Un lenguaje al servicio de la justicia.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ltn6jPbhKP0"
    }
  ]
}
