{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Pandas provides a powerful set of functions to compute statistics on rolling windows. We will go beyond the convenient interface, and peek at the algorithmic gems that implement these operations efficiently: summed area tables, Welford's method, skip lists, ring buffers, deques... will all get their minute of fame, and attendees may learn a thing or two they can use in their everyday coding.\n\n**Abstract**\n\nThe talk will cover:\n\n* A quick overview of the Rolling and Expanding objects in pandas. Why straightforward implementations, even clever ones using advanced NumPy tricks, are inefficient.\n* How is Series.rolling().sum() implemented. How the same idea can be extended to higher dimensions with the help of the inclusion-exclusion principle to yield summed area tables.\n* How are Series.rolling().var() and friends implemented. The importance of numerically stable algorithms: why Welford's method is the better choice, even if it's a little slower. How can the same ideas be generalized to higher order moments, and used to parallelize computations.\n* How are Series.rolling().max() and .min() implemented. The beauty of clever algorithms. The use of specialized data structures: a ring buffer as a deque.\n* How are Series.rolling().median() and .quantile() implemented. More specialized data structures: the skip list, or why randomization can be your friend.",
  "duration": 1973,
  "language": "eng",
  "recorded": "2017-05-20T15:45:00+02:00",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/barcelona2017/schedule/presentation/47/"
    }
  ],
  "speakers": [
    "Jaime Fernandez del Rio"
  ],
  "tags": [
    "pandas"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/XM_r5La-1tA/maxresdefault.jpg",
  "title": "The Secret Life Of Rolling Pandas",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XM_r5La-1tA"
    }
  ]
}
