{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "There's a widespread belief among machine learning practitioners that algorithms are objective and allow us to deal with the messy reality in a nice, objective way, without worrying about all the yucky human nature things. This talk will argue that this belief is wrong. Algorithms, just like the humans who create them, can be severely biased and despicable indeed.\n\n**Abstract**\n\nWhen working on a new ML solution to solve a given problem, do you think that you are simply using objective reality to infer a set of unbiased rules that will allow you to predict the future? Do you think that worrying about the morality of your work is something other people should do? If so, this talk is for you.\n\nIn this brief time, I will try to convince you that you hold great power over how the future world will look like and that you should incorporate thinking about morality into the set of ML tools you use every day. We will take a short journey through several problems, which surfaced over the last few years, as ML and AI generally, became more widely used. We will look at bias present in training data, at some real-world consequences of not considering it (including one or two hair-raising stories) and cutting-edge research on how to counteract this.\n\nThe outline of the talk is:\n\n* Intro the problem: ML algos can be biased!\n* Two concrete examples.\n* What's been done so far (i.e. techniques from recently-published papers).\n* What to do next: unanswered questions.",
  "duration": 2050,
  "language": "eng",
  "recorded": "2017-05-20T12:00:00+02:00",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/barcelona2017/schedule/presentation/44/"
    }
  ],
  "speakers": [
    "Maciej Siwek"
  ],
  "tags": [
    "ethics",
    "machine learning"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/8kL71zk4KNk/maxresdefault.jpg",
  "title": "Despicable machines: how computers can be assholes",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8kL71zk4KNk"
    }
  ]
}
