{
  "description": "In this May Meetup we have two inspiring talks on Machine Learning.\n\nThis edition was sponsored by IBM: IBM funds open source development through NumFocus while Tim Bonnemann provides a brief introduction to the IBM data science community.\n\nPart 1: A Load Defaulter Prediction Model - with Nadita Sharma: https://youtu.be/aUKaLlcNHLA\n\nEnjoy the talks!\nYour PyData Hamburg Crew\n\n--------\n\n# (Talk 2) Paco Nathan: AutoML\n\nAutoML is a very active area of AI research in academia as well as R&D work in industry. The public cloud vendors each promote some form of AutoML service. Tech unicorns have been developing AutoML services for their data platforms. Many different open source projects are available, which provide interesting new approaches. But what does AutoML mean?\n\nOstensibly automated machine learning will help put ML capabilities into the hands of non-experts, help improve the efficiency of ML workflows, and accelerate AI research overall. While in the long-term AutoML services promise to automate the end-to-end process of applying ML in real-world business use cases, what are the capabilities and limitations in the near-term?\n\nAbout Paco: Known as a \"player/coach\", with core expertise in data science, natural language, cloud computing; ~40 years tech industry experience, ranging from Bell Labs to early-stage start-ups. Advisor for Amplify Partners, IBM Data Science Community, Recognai, KUNGFU.AI, Primer. Lead committer PyTextRank, kglab. Formerly: Director, Community Evangelism @ Databricks and Apache Spark. Cited in 2015 as one of the Top 30 People in Big Data and Analytics by Innovation Enterprise.\n\n\n------------\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2875,
  "language": "eng",
  "recorded": "2021-03-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.meetup.com/pydata-hamburg/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://youtu.be/aUKaLlcNHLA",
      "url": "https://youtu.be/aUKaLlcNHLA"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "download",
    "learn",
    "python 3",
    "software",
    "syntax"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/7oW49Ulr4cY/maxresdefault.webp",
  "title": "AutoML - Paco Nathan | PyData Hamburg May 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7oW49Ulr4cY"
    }
  ]
}
