{
  "description": "We start 2021 with Natural Language Processing (NLP) and we are thrilled to host this meetup together with Hamburg NLP (https://www.meetup.com/Hamburg-Natural-Language-Processing-Meetup-Gruppe/). Your hosts are Christian Staudt, Gianluca Speranza and Kai Matzutt.\n\nFollow us on Twitter: @PyDataHamburg \n\n-------------------------------------------\n\n# (Talk 1) Phu Mon Htut : Transfer Learning in NLP: Tools and Tips\n\nIn recent years, pre-trained language models, such as Google's BERT, combined with transfer learning methods have enabled us to achieve the state-of-the-art in many natural language processing tasks. In this talk, I'll give an overview of the pre-trained language models and transfer learning methods in NLP. I'll then introduce open-source tools designed for transfer learning of NLP tasks and tips on using them.\n\nPhu is a Ph.D. candidate at New York University working on applying transfer learning methods to NLP problems and linguistic analysis of these methods for interpretability.\n\n-------------------------------------------\n\n# (Talk 2) Sebastian Nichtern & Adrian Baetu: NLP based Customer Service Automation at scale\n\nWe all hear about the great revolution of AI and NLP ahead. Still, we see most companies struggle leveraging the benefits of such technologies. In this talk we will take you on a difficult but successful journey to Hapag-Lloyd’s first productive NLP solution, that is currently allocating over 20.000 mails every single day.\n\nSebastian is a Senior Data Scientist working for Ginkgo Analytics as a consultant and specialist in applied Machine Learning.\n\nAdrian is a team lead in the AI Center of Excellence Hapag-Lloyd that is currently being established in Gdansk.\n-------------------------------------------\n\nPyData is a community for developers and users of open source data tools. PyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. The PyData Code of Conduct governs this meetup. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 7056,
  "language": "eng",
  "recorded": "2021-02-09",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.meetup.com/pydata-hamburg/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.meetup.com/Hamburg-Natural-Language-Processing-Meetup-Gruppe/",
      "url": "https://www.meetup.com/Hamburg-Natural-Language-Processing-Meetup-Gruppe/"
    }
  ],
  "speakers": [
    "Phu Mon Htut",
    "Sebastian Nichtern",
    "Adrian Baetu"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/n-jYfvmghEk/sddefault.jpg",
  "title": "Transfer Learning in NLP & NLP-based Customer Automation at Hapag-Lloyd",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=n-jYfvmghEk"
    }
  ]
}
