{
  "description": "PyData Hamburg Meetup November 2020: Head in the Clouds\n\nThis meetup is all about the cloud. Our two speakers from Hamburg and San Francisco will get you started with Python on the major cloud platforms and turning your infrastructure into code.\n\nfollow us on Twitter:  @PyDataHamburg \n-------------------------------------------\n\n# (Talk 1) Samantha Zeitlin: Snakes on a Cloud - Python on Google Cloud Platform vs. Amazon Web Services\n\nInfrastructure as code is far more maintainable than configuring everything manually. But working in the cloud means learning the eccentricities of many separate services. Samantha will share lessons learned from using both AWS and GCP, comparing major differences between similar services and sharing example code illustrating some pros and cons.\n\nSamantha is a data scientist and engineer who lives in San Francisco.\n\n-------------------------------------------\n\n# (Talk 2) Alessandro Romano: AWS CDK - provision your cloud application using Python\n\nThe Amazon Web Services Cloud Development Kit makes it possible to define the stack of a cloud application through a programming language (eg. Python). It's the implementation of the process \"Infrastructure as a code\" and is built on the top of Cloud Formation. It helps us boosting the creation and deployment of a cloud application without diving into complex CF configuration files.\n\nAlessandro is a data scientist working for a logistics company called Cargonexx. He is always searching for a better way to automate complex processes and make life easier for data scientists.\n\n-------------------------------------------\nwww.pydata.org\r\n\r\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\r\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 7968,
  "language": "eng",
  "recorded": "2020-11-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.meetup.com/pydata-hamburg/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "download",
    "learn",
    "python 3",
    "software",
    "syntax"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/7uw2sxy4GHU/maxresdefault.jpg",
  "title": "PyData Hamburg Nov '20 - Samantha Zeitlin: Python on GCP vs AWS - Alessandro Romano: AWS CDK",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7uw2sxy4GHU"
    }
  ]
}
