{
  "description": "# (Talk 2) Ron Hagensieker & Freddie Kalaitzis: Where are the Earth's streams flowing right now? - Dynamic hydrology maps from satellite-LiDAR fusion\n\nThe audience will learn about Very High Resolution satellite imagery and LiDAR, and the fusion of these sensor data through multi-sensor U-Nets, for the mapping of flowing networks at the continental scale, every day, stacking the times series maps over many years. The end result is a new map that could fundamentally improve how we manage our water resources around the world.\n\nPix2Streams reprint:\nhttps://arxiv.org/abs/2011.07584\n(accepted as a spotlight oral talk at the AI for Earth Sciences Workshop, NeurIPS 2020)\n\nPix2Streams demo:\nhttps://drive.google.com/file/d/1IOXFfM1hY0QnZp1j5xQO1gviKwL2FtSP/view\n\nRon is a machine learning engineer and remote sensing scientist. His work in remote sensing covers a wide range in applications and methods, ranging from deforestation to naval monitoring; classic segmentation to experimental generative methods; multi-spectral to Synthetic Aperture Radar.\n\nFreddie is a part-time Senior Research Fellow, and Theme Lead of ML for Earth Observation and Remote Sensing, in the Oxford Applied and Theoretical Machine Learning lab of Oxford University. He's also an ML & Project Lead at NASA's Frontier Development Lab (FDL), and the ML Lead of Trillium Technologies , the R&D production company behind FDL.\n\n-------------------------------------------\nFollow us on Twitter: @PyDataHamburg\n\nPyData is a community for developers and users of open source data tools. PyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. The PyData Code of Conduct governs this meetup. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 3464,
  "language": "eng",
  "recorded": "2021-03-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.meetup.com/pydata-hamburg/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://arxiv.org/abs/2011.07584",
      "url": "https://arxiv.org/abs/2011.07584"
    },
    {
      "label": "https://drive.google.com/file/d/1IOXFfM1hY0QnZp1j5xQO1gviKwL2FtSP/view",
      "url": "https://drive.google.com/file/d/1IOXFfM1hY0QnZp1j5xQO1gviKwL2FtSP/view"
    }
  ],
  "speakers": [
    "Ron Hagensieker",
    "Freddie Kalaitzis"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/9KWwkWska58/maxresdefault.webp",
  "title": "Where are the Earth's streams flowing right now?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9KWwkWska58"
    }
  ]
}
