{
  "id": 1216, 
  "category": "SciPy 2012", 
  "slug": "a-unified-release-of-python-iraf-software-for-a", 
  "title": "A Unified Release of Python & IRAF software for astronomy", 
  "summary": "", 
  "description": "As astronomical software development expands from historical data reduction\nplatforms towards more sophisticated Python applications, non-technically-\nfocused users can struggle with installing and maintaining a large number of\nheterogeneous dependencies. PyRAF has successfully bridged the gap between\nIRAF and Python, but managing dependencies falls outside its scope. A few\nexisting Python distributions make installation easy, but don't cater for\nspecific needs (such as dependence on IRAF). STScI and Gemini have therefore\ndeveloped a prototype, easy-to-install software distribution for Linux and OSX\nknown provisionally as the 'Unified Release' (UR).\n\nCurrently the UR includes STScI Python and its dependencies (eg. Python,\nNumPy, IRAF 2.15), as well as Matplotlib & Tk, SciPy, a number of IRAF\npackages, DS9, X11IRAF and some testing and documentation tools. Its scope\nextends to complementary non-Python/IRAF software, but we do not intend to\nproduce a comprehensive (Scisoft-like) distribution of tools for astronomy,\nnor to satisfy every installation preference. Our focus is on providing a\nsimple way to run key tools, for users with minimal support resources and who\nmay not have administrative privileges. Unlike most comparable distributions,\nour approach includes basic provision for in-place software additions and\nupdates.\n\nRecently we have completed a first internal version of the UR for both Linux\nand OSX, which we shall briefly demonstrate. We plan to make our first public\nrelease during the coming months.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC BY-SA", 
  "thumbnail_url": "http://i4.ytimg.com/vi/cgRouxz0y_4/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/A_Unified_Release_of_Python_IRAF_software_for_astronomy.mp4?Signature=oCxI%2FyHw3t0nEcCFJ7AYbMa1YWQ%3D&Expires=1346381851&AWSAccessKeyId=FEWGReWX3QbNk0h3", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "https://www.youtube.com/watch?v=cgRouxz0y_4", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=cgRouxz0y_4", 
  "tags": [
    "Astronomy Mini-Symposia"
  ], 
  "speakers": [
    "James E.H. Turner"
  ], 
  "recorded": "2012-07-18"
}