{
  "id": 1213, 
  "category": "SciPy 2012", 
  "slug": "alges-geostatistics-and-python", 
  "title": "ALGES: Geostatistics and Python", 
  "summary": "", 
  "description": "ALGES is a laboratory that develops tools applied to geostatistics. We've been\nusing python for a while and it has brought us very good results. Its ease-of-\nuse and portability allow us to rapidly offer practical solutions to problems.\nAlong with a brief introduction to the laboratory, we cover two particular\nprojects we are currently working on. One project is an application for\nmultivariate geostatistic analysis. Most available applications provide\nanalysis for a single variable at a time and either obviate how variables can\nrelate between one another or make it really difficult to consider any\nrelationship. Our proposal provides both an interface that's both easy to use\nfor primers and fine tuning for experienced users. The other presented project\ncovers a problem in geological modeling and resource estimation. Commonly,\nwhen modeling geological volumes, continuity in data is assumed. This is not\noften true, as there are different kinds of faults that break this continuity.\nThis is very hard to incorporate when modeling. We propose a solution to\nrestore the original continuous volume for better modeling as well as\nrestitution to the real distorted volume, all this providing a better\nestimation. Both projects have lots of heavy computations and no shortage of\ninput data. We take this as a challenge to build fast processing solutions, so\nwe take advantage of both the easiness of a python interface and the speed of\nC/C++ code.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC BY-SA", 
  "thumbnail_url": "http://i2.ytimg.com/vi/qOPNbjx5uhM/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/ALGES_Geostatistics_and_Python.mp4?Signature=SY9wk52zGieTkNTs9q5txKugp1A%3D&Expires=1346381755&AWSAccessKeyId=FEWGReWX3QbNk0h3", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "http://youtube.com/watch?v=qOPNbjx5uhM", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://youtube.com/watch?v=qOPNbjx5uhM", 
  "tags": [
    "Geophysics Mini-Symposia"
  ], 
  "speakers": [
    "Felipe Lema"
  ], 
  "recorded": "2012-07-18"
}