{
  "id": 1214, 
  "category": "SciPy 2012", 
  "slug": "astropy-herding-snakes-or-astronomers-which-is", 
  "title": "Astropy - Herding Snakes or Astronomers: which is more difficult?", 
  "summary": "", 
  "description": "Developers and users of astronomical software have long bemoaned the absence\nof shared efforts in the field. While there are well known, free software\ntools available for astronomy, most have been developed by large institutions,\nand the past few decades have seen comparatively little progress in fostering\na community-based set of software tools. There is hope that is changing now.\nThe continuing growth of Python in astronomy has led to an increasing\nawareness of needless duplication of efforts within the community and the need\nto make existing packages work better with each other; such discussions came\nto a head on the astropy email list in the spring of 2011 leading to formation\nof the astropy project. The first coordination meeting was held in the fall of\n2011, and significant progress has been made in setting up a community\nrepository of core astronomical packages. We will describe the general goals\nof astropy and the progress that has been made to date.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC BY-SA", 
  "thumbnail_url": "http://i3.ytimg.com/vi/VmxthPjCFXo/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Astropy_Herding_Snakes_or_Astronomers_which_is_more_difficult.mp4?Signature=mzIR%2FouPTEnbyJod6u03IF5%2B9Nk%3D&Expires=1346381801&AWSAccessKeyId=FEWGReWX3QbNk0h3", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "http://youtube.com/watch?v=VmxthPjCFXo", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://youtube.com/watch?v=VmxthPjCFXo", 
  "tags": [
    "Astronomy Mini-Symposia"
  ], 
  "speakers": [
    "Erik Tollerud", 
    "Perry Greenfield", 
    "Thomas Robitaille"
  ], 
  "recorded": "2012-07-18"
}