{
  "id": 1241, 
  "category": "SciPy 2012", 
  "slug": "domain-analysis-of-mosaic-proteins-in-purple-sea", 
  "title": "Domain Analysis of Mosaic Proteins in Purple Sea Urchin", 
  "summary": "", 
  "description": "Purple sea urchins (Strongylocentrotus purpuratus or Sp) are invertebrates\nthat share more than 7,000 genes with humans, more than other common model\ninvertebrate organisms like fruit flies and worms. In addition, the innate\nimmune system of sea urchins demonstrates unprecedented complexity. These\nfactors make the sea urchin a very interesting organism for investigations of\nimmunology. Of particular interest are the set of proteins in SP that contain\nC-type lectin (CLECT) domains, a functional region in the protein which\nrecognizes sugars. Proteins containing CLECTs may be particularly important to\nimmune system robustness because of sugars that are present on pathogens.\n\nThe primary goals of this research project are first to identify all the\nCLECT-containing proteins in the Sp genome, and then to predict their function\nbased on similarity to characterized proteins in other species (protein\nhomology or similarity). The latter goal is particularly challenging and\nrequires new and creative analysis methods.\n\nFrom an informational viewpoint, proteins are represented by a unique sequence\nof letters, each letter corresponding to an amino acid. For example G-A-V\nindicates the sequence glycine, alanine and valine. Commonality between\nproteins is usually measured by sequence alignments; that is, by directly\ncomparing the sequence of letters between two proteins. Algorithms and tools\nfor these alignments are among the most standardized and available tools in\nbioinformatics.\n\nSequence similarity between homologous proteins can degrade over long\nevolutionary timescales. This is in part because some mutations at the\nsequence level can occur without compromising a protein's overall function.\nThis is akin to the evolution of a language, e.g modern English and middle\nEnglish, which initially appear to be separate languages due to spelling\ndifferences. Because domains are regions of a protein which can function semi-\nindependently, they are less prone to accommodate mutations. By comparing\nproteins based on the ordering of their domains, or their \"domain\narchitecture\", it becomes possible to identify homology, or similarities in\ndomain order, separated by extensive evolution.\n\nAlignment tools based on domain architecture are promising, but are still in\ntheir infancy. Consequently, very few researchers utilize both sequence and\ndomain alignment methodologies corroboratively. Using Python scripts in tandem\nwith various web tools and databases, we have identified the top alignment\ncandidates for the CLECT-containing Sp proteins using both methods. With the\nhelp of the Enthought Tool Suite, we have created a simple visualization tool\nthat allows users to examine the sequence alignments side-by-side with two\ntypes of domain alignments. The information provided by these three results\ntogether is much more informative with respect to predicting protein function\nthan any single method alone. Finally, we have developed a systematic set of\nheuristic rules to allow users to make objective comparisons among the three\nsets of results. The results can later be parsed using Python scripts to make\nquantitative and qualitative assessments of the dataset. We believe that these\nnew comparison and visualization techniques will apply in general to\ncomputational proteomics.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC BY-SA", 
  "thumbnail_url": "http://i1.ytimg.com/vi/l4x23L-mSfk/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Domain_Analysis_of_Mosaic_Prot.mp4?Signature=sk5dC792%2F9McCWo60IdAhf4LCUU%3D&Expires=1346383398&AWSAccessKeyId=FEWGReWX3QbNk0h3", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "https://www.youtube.com/watch?v=l4x23L-mSfk", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=l4x23L-mSfk", 
  "tags": [
    "Bioinformatics Mini-Symposia"
  ], 
  "speakers": [
    "Adam Hughes"
  ], 
  "recorded": "2012-07-19"
}