{
  "id": 1234, 
  "category": "SciPy 2012", 
  "slug": "fcm-a-python-library-for-flow-cytometry", 
  "title": "Fcm - A python library for flow cytometry", 
  "summary": "", 
  "description": "Cellular populations in biology are often heterogeneous, and aggregate assays\nsuch as expression arrays can obscure the small differences between these\npopulations. Examples where these differences can be highly significant\ninclude the identification of antigen-specific immune cells, stem cells and\ncirculating cancer cells. As the frequency of such cells in the blood can be\nvanishingly small, assays to detect signals at the single cell level are\nessential. Flow cytometry is probably the best established single cell assay,\nand has been an integral tool in immunology and biology for decades, able to\nmeasure cellular marker levels for individual cells, as well as population\nstatistics over millions of cells.\n\nRecent technological innovations in flow cytometry have increased the number\nof cell markers capable of being resolved simultaneously, and visual analysis\n(gating) is difficult and error prone with increasing data dimensionality.\nHence there is increasing demand for tools to automate the analysis and\nmanagement of flow data, so as to increase accuracy and reproducibility.\nHowever, essentially all software used by flow cytometry laboratories is\ncommercial and based on the visual analysis paradigm. With the exception of\nthe R BioConductor project, we are not aware of any other full-featured open\nsource tools for analyzing flow data. The few open source flow software\nmodules that exist simply extracts data from FCS (flow cytometry standard)\nfiles into tabular/csv format, losing all metadata associated with the file,\nand provide no additional tools for analysis. We therefore decided to develop\nthe _fcm_ library in python that would provide a foundation for flow cytometry\ndata management and analysis.\n\nThe _fcm_ library provides functions to load fcs files, apply spectral\ncompensation, and perform standard log and log-like transforms for\nvisualization. The library also provides objects and methods for traditional\ngating-based analysis, including standard polygon, threshold, interval, and\nquadrant gates. Using _fcm_ and other common python libraries, one can quickly\nwrite scripts for doing large scale batch analysis. In addition to gating-\nbased analysis, _fcm_ provides methods to do model-based analysis, utilizing\nGPU-optimized statistical models to identify cell subsets. These statistical\nmodels provide a data-driven way to construct generative probability models\nthat scale well with the increasing dimensionality of flow data and do not\nrequire expert input to identify cell subsets. High performance computational\nroutines to fit statistical models are optimized using cython and pycuda. More\nspecialized tools for the analysis of flow data include the use of a novel\ninformation measure to optimize reagent panels and analysis strategies, and\noptimization methods for automatic determination of positivity thresholds.\n\nWe are currently using the _fcm_ library for the analysis of tetramer assays\nfor cancer immunotherapy, as well as intracellular expression of effector\nmolecules in the NIAID-sponsored External Quality Assurance Policy Oversight\nLaboratory (EQAPOL) program to standardize flow cytometry assays in HIV\nstudies. An illustrative example is the use of _fcm_ in building a pipeline\nfor the Cytostream application to automate the analysis of 459 FCS files from\n12 laboratories, reducing the analysis time of one month to a single evening.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC BY-SA", 
  "thumbnail_url": "http://i4.ytimg.com/vi/SXdIiLPQLAo/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Fcm_A_python_library_for_flow_.mp4?Signature=47khe03tMWQWqHO71268Wx73pMs%3D&Expires=1346383053&AWSAccessKeyId=FEWGReWX3QbNk0h3", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "https://www.youtube.com/watch?v=SXdIiLPQLAo", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=SXdIiLPQLAo", 
  "tags": [
    "Computational Bioinformatics"
  ], 
  "speakers": [
    "Jacob Frelinger"
  ], 
  "recorded": "2012-07-19"
}