{
  "id": 1196, 
  "category": "SciPy 2012", 
  "slug": "hdf5-is-for-lovers", 
  "title": "HDF5 is for lovers", 
  "summary": "", 
  "description": "HDF5 is a hierarchical, binary database format that has become a _de facto_\nstandard for scientific computing. While the specification may be used in a\nrelatively simple way (persistence of static arrays) it also supports several\nhigh-level features that prove invaluable. These include chunking, ragged\ndata, extensible data, parallel I/O, compression, complex selection, and in-\ncore calculations. Moreover, HDF5 bindings exist for almost every language -\nincluding two Python libraries (PyTables and h5py).\n\nThis tutorial will discuss tools, strategies, and hacks for really squeezing\nevery ounce of performance out of HDF5 in new or existing projects. It will\nalso go over fundamental limitations in the specification and provide creative\nand subtle strategies for getting around them. Overall, this tutorial will\nshow how HDF5 plays nicely with all parts of an application making the code\nand data both faster and smaller. With such powerful features at the\ndeveloper's disposal, what is not to love?!\n\nThis tutorial is targeted at a more advanced audience which has a prior\nknowledge of Python and NumPy. Knowledge of C or C++ and basic HDF5 is\nrecommended but not required.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC BY-SA", 
  "thumbnail_url": "http://i3.ytimg.com/vi/Nzx0HAd3FiI/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/HDF5_is_for_lovers.mp4?Signature=cM8rA2NfAmu5op3Ha%2FNG7gQUYFc%3D&Expires=1346380446&AWSAccessKeyId=FEWGReWX3QbNk0h3", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "http://youtube.com/watch?v=Nzx0HAd3FiI", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://youtube.com/watch?v=Nzx0HAd3FiI", 
  "tags": [], 
  "speakers": [
    "Anthony Scopatz"
  ], 
  "recorded": "2012-07-16"
}