{
  "id": 1232, 
  "category": "SciPy 2012", 
  "slug": "object-oriented-finite-elements-at-nist", 
  "title": "Object Oriented Finite Elements at NIST", 
  "summary": "", 
  "description": "The Object Oriented Finite-Element project at NIST\n<[http://www.ctcms.nist.gov/oof](http://www.ctcms.nist.gov/oof)> is a Python\nand C++ tool designed to bring sophisticated numerical modeling capabilities\nto users in the field of Materials Science. The software provides numerous\ntools for constructing finite-element meshes from microstructural images, and\nfor implementing material properties from a very broad class which includes\nelasticity, chemical and thermal diffusion, and electrostatics. The current\nseries of releases has a robust interface for defining new nonlinear\nproperties, and provides both first and second order time-dependence in the\nequations of motion. The development team is currently working on a fully-3D\nversion of the code, as well as expanding the scope of available properties to\ninclude surface interactions, such as surface tension and chemical reactions,\nand inequality constraints, such as arise in mechanical surface contact and\nplasticity. The software is a hybrid of Python and C++ code, with the high\nlevel user interface and control code in Python, and the heavy numeric work\nbeing done in C++. The software can be operated either as an interactive, GUI-\ndriven application, as a scripted command-line tool, or as a supporting\nlibrary, providing useful access to users of varying levels of expertise. At\nevery level, the user-interface objects are intended to be familiar to the\nmaterials-science user. This presentation will focus on an interesting example\nof a nonlinear property, called Ramberg-Osgood elasticity, and the process for\nincorporating this feature into the OOF architecture.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC BY-SA", 
  "thumbnail_url": "http://i2.ytimg.com/vi/mSCo09arkY0/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Object_Oriented_Finite_Element.mp4?Signature=UwtvlUJXYHNDjR5nZs59Lt1Fp7Y%3D&Expires=1346383004&AWSAccessKeyId=FEWGReWX3QbNk0h3", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "http://youtube.com/watch?v=mSCo09arkY0", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://youtube.com/watch?v=mSCo09arkY0", 
  "tags": [
    "General"
  ], 
  "speakers": [
    "Andrew Reid"
  ], 
  "recorded": "2012-07-19"
}