{
  "id": 1347, 
  "category": "SciPy 2012", 
  "slug": "qutip-an-open-source-python-framework-for-the-dy", 
  "title": "QuTiP: An open-source Python framework for the dynamics of open quantum systems", 
  "summary": "", 
  "description": "We present QuTiP, an object-oriented open-source framework for solving the\ndynamics of open quantum systems. The QuTiP framework is written in a\ncombination of Python and Cython, and using SciPy, NumPy and matplotlib to\nprovide an environment for computational quantum mechanics that is easy and\nefficient to use. Arbitrary quantum systems, including time-dependent systems,\nmay be built up from operators and states defined by a quantum object class,\nand then passed on to a choice of unitary and dissipative evolution solvers.\nWe give an overview of the basic structure for the framework and the\ntechniques used in its implementation. We also present a few selected examples\nfrom contemporary research on quantum mechanics that illustrate the strengths\nof the framework, and the types of calculation that can be performed. The\nframework described here is particularly well suited to the fields of quantum\noptics, superconducting circuit devices, nanomechanics, and trapped ions,\nwhile also being ideal as an educational tool.\n\nFor more information see\n[http://qutip.googlecode.com](http://qutip.googlecode.com).\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC BY-SA", 
  "thumbnail_url": "http://i4.ytimg.com/vi/KxDFDYn-6Lc/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/QuTiP_An_opensource_Python_framework_for_the_dynamics_of_open_quantum_systems.mp4?Signature=ofqa37FpyivmhkcJ4Hmj4gmwblw%3D&Expires=1346989222&AWSAccessKeyId=FEWGReWX3QbNk0h3", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "https://www.youtube.com/watch?v=KxDFDYn-6Lc", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=KxDFDYn-6Lc", 
  "tags": [
    "hpc"
  ], 
  "speakers": [
    "Paul Nation", 
    "Robert Johansson"
  ], 
  "recorded": "2012-07-19"
}