{
  "id": 1198, 
  "category": "SciPy 2012", 
  "slug": "time-series-data-analysis-with-pandas", 
  "title": "Time Series Data Analysis with pandas", 
  "summary": "", 
  "description": "In this tutorial, I'll give a brief overview of pandas basics for new users,\nthen dive into the nuts of bolts of manipulating time series data in memory.\nThis includes such common topics date arithmetic, alignment and join / merge\nmethods, resampling and frequency conversion, time zone handling, moving\nwindow functions like moving mean and standard deviation. A strong focus will\nbe placed on working with large time series efficiently using array\nmanipulations. I'll also illustrate visualization tools for slicing and dicing\ntime series to make informative plots. There will be several example data sets\ntaken from finance, economics, ecology, web analytics, or other areas.\n\nThe target audience for the tutorial includes individuals who already work\nregularly with time series data and are looking to acquire additional skills\nand knowledge as well as users with an interest in data analysis who are new\nto time series. You will be expected to be comfortable with general purpose\nPython programming and have a modest amount of experience using NumPy. Prior\nexperience with the basics of pandas's data structures will also be helpful.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC BY-SA", 
  "thumbnail_url": "http://i1.ytimg.com/vi/0unf-C-pBYE/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Time_Series_Data_Analysis_with_pandas.mp4?Signature=kkRls%2BknoyZjRP5XV2lzO%2FB%2FuKE%3D&Expires=1346381098&AWSAccessKeyId=FEWGReWX3QbNk0h3", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "https://www.youtube.com/watch?v=0unf-C-pBYE", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=0unf-C-pBYE", 
  "tags": [
    "advanced"
  ], 
  "speakers": [
    "Wes McKinney"
  ], 
  "recorded": "2012-07-17"
}