{
  "id": 1193, 
  "category": "SciPy 2012", 
  "slug": "unlock-a-python-based-framework-for-rapid-develo", 
  "title": "Unlock: A Python-based framework for rapid development of practical brain-computer interface applications", 
  "summary": "", 
  "description": "The Unlock Project aims to provide brain-computer interface (BCI) technologies\nto individuals suffering from locked-in syndrome, the complete or near-\ncomplete loss of voluntary motor function. While several BCI techniques have\nbeen demonstrated as feasible in a laboratory setting, limited effort has been\ndevoted to translating that research into a system for viable home use. This\nis in large part due to the complexity of existing BCI software packages which\nare geared toward clinical use by domain experts. With Unlock, we have\ndeveloped a Python-based modular framework that greatly simplifies the time\nand programming expertise needed to develop BCI applications and experiments.\nFurthermore, the entire Unlock system, including data acquisition, brain\nsignal decoding, user interface display, and device actuation, can run on a\nsingle laptop, offering exceptional portability for this class of BCI.\n\nIn this talk, I will present the Unlock framework, starting with a high-level\noverview of the system then touching on the acquisition, communication,\ndecoding, and visualization components. Emphasis will be placed on the app\ndeveloper API with several examples from our current work with steady-state\nvisually evoked potentials (SSVEP).\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC BY-SA", 
  "thumbnail_url": "http://i1.ytimg.com/vi/lIjdXLuuMlY/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Unlock_A_Pythonbased_framework.mp4?Signature=bLD7r1uAbL0HVyxX3BZUPBgGjiA%3D&Expires=1346444446&AWSAccessKeyId=FEWGReWX3QbNk0h3", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "http://youtube.com/watch?v=lIjdXLuuMlY", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://youtube.com/watch?v=lIjdXLuuMlY", 
  "tags": [
    "General"
  ], 
  "speakers": [
    "Byron V. Galbraith", 
    "Frank H. Guenther", 
    "Jonathan S. Brumberg", 
    "Sean D. Lorenz"
  ], 
  "recorded": "2012-07-18"
}