{
  "category": null,
  "copyright_text": "CC BY-NC-SA",
  "description": "What do you do when your test suite is not fit for purpose? At Opto, we felt like we were locked in a daily battle against the tests written for our Java and TypeScript services. But, when we paired the adaptability of Python with the power of LLMs, we were able to enhance & extend what we had into something that really worked!\r\n\r\nJoin us on a journey of transformation where we'll cover:\r\n- Proactive Monitoring: Implementing \"production probes\" - lightweight and fast Python request \"tests\"- to actively ensure our services were up and executing core functionalities.\r\n- LLMs in Action: The unexpected efficacy of LLMs in aiding the creation of tests. We'll focus on our Python/TypeScript deployment tools here.\r\n- Quality Over Quantity: Recognizing that just writing tests isn’t the end game. We harnessed FastAPI LLMs to swiftly assess our functional test coverage, helping us identify and address gaps.\r\n- Living Documentation: A sneak peek into how we've sown the seeds for dynamic, ever-evolving documentation using Python.\r\n\r\nThroughout the session, we’ll touch on the trade-offs, democratization & ownership of tests, and how this little endeavor set the stage for Opto's broader embrace of Python.",
  "language": "eng",
  "quality_notes": null,
  "recorded": "2023-10-08T18:00:00",
  "slug": "Beyond_Conventional_Embracing_Python_LLMs_for_Quality_Assurance",
  "source_url": "https://youtu.be/TSI4rYKpwws",
  "speakers": [
    "Paul Pereyda Karayan"
  ],
  "summary": null,
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/TSI4rYKpwws/hqdefault.jpg",
  "title": "Beyond Conventional: Embracing Python & LLMs for Quality Assurance",
  "videos": [
    {
      "type": "youtube",
      "url": "https://youtu.be/TSI4rYKpwws"
    }
  ],
  "related_urls": [
    {
      "label": "conf",
      "url": "https://pybay.com/speakers/#sz-speaker-637576b0-27e3-4dae-8fc4-b1ad8067664d"
    }
  ],
  "veyepar_state": 10
}