{
  "alias": "video/3619/controllo-di-un-dispositivo-per-la-riabilitazione",
  "category": "PyCon Italia 2015",
  "copyright_text": "",
  "description": "Le moderne pratiche di neuroriabilitazione possono beneficiare di\ndispositivi robotici, progettati e realizzati per assistere il paziente\ne il personale medico durante la fase di recupero funzionale e\ncognitivo. Essi possono alleviare lo sforzo fisico del fisioterapista\ndurante la terapia, rendere i pazienti parzialmente indipendenti durante\ngli esercizi, ottimizzare la disponibilità dei terapisti durante\nsessioni parallele di riabilitazione e rendere oggettiva la valutazione\ndelle capacità motorie. Alcune cliniche hanno la possibilità di\nacquistare dispositivi costosi e complessi, ma questi stessi aspetti li\nrendono non adatti ad essere installati nella maggior parte dei centri\ndi riabilitazione e presso le case dei pazienti. Per questi motivi è\nstato realizzato LINarm, un dispositivo robotico a basso costo dedicato\nalla riabilitazione dell’arto superiore. Esso sfrutta la tecnica FDM di\nstampa 3D per la realizzazione di alcuni componenti meccanici, un\npeculiare schema meccanico a rigidezza variabile ed un microcontrollore\nArduino interfacciato ad un PC Linux-based per una soluzione di\ncontrollo flessibile ed economica. Il talk sarà relativo alla\ndescrizione dell’architettura di controllo sviluppata, focalizzandosi\nsull’interfaccia utente realizzata in Python. Essa integra un layer per\nla comunicazione bidirezionale con la scheda Arduino, funzionalità di\nplot real-time 2D e 3D per il monitoraggio del dispositivo e per il\nfeedback visivo, comandi grafici per un controllo interattivo e la\npossibilità di programmare esercizi di training riaiblitativo attraverso\nscript Python. I requisiti richiesti sono un minimo background di\nconoscenza relativa al linguaggio Python ed alla piattaforma Arduino,\noltre ad una discreta passione per i dispositivi elettromeccanici.\n",
  "duration": 1689,
  "id": 3619,
  "language": "ita",
  "quality_notes": "",
  "recorded": "2015-05-29",
  "slug": "controllo-di-un-dispositivo-per-la-riabilitazione",
  "speakers": [
    "Matteo Malosio"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/_rJ9M078yJs/maxresdefault.jpg",
  "title": "Controllo di un dispositivo per la riabilitazione dell’arto superiore",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_rJ9M078yJs"
    }
  ]
}
