{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": 942, "video_ogv_download_only": false, "category": "PyCon Italia 2015", "speakers": ["Adriano Di Luzio"], "title": "Davvy - Django, WebDAV e (pessimo) stato dell'arte.", "quality_notes": "", "video_flv_length": null, "recorded": "2015-05-29", "video_mp4_length": null, "description": "Davvy è un’applicazione Django che permette la gestione di servizi WebDAV.\nGli obiettivi del talk comprendono: fornire un’overview del protocollo WebDAV e mostrarne la nostra implementazione; mostrare la costruzione di un’applicazione Django che gestisca servizi basati su protocolli di questo tipo, in modo che sia estendibile a piacimento e pienamente configurabile (e quindi anche qualche buona regola da seguire nello sviluppo Django). \nAnalizzare lo stato dell’arte e quindi, in particolare, come ogni client implementi, a proprio piacimento,  specifiche “personalizzate” del protocollo, risultando in una quasi impossibile interoperabilità e una scarsa compatibilità con i fornitori di servizi.\nI prerequisiti necessari richiedono soltanto una conoscenza poco approfondita di Django.\nIl talk includerà:\n\nDettagli sul protocollo WebDAV: cos’è, a cosa serve, come lo utilizziamo, e le alternative odierne.\nDettagli implementativi: come funziona WebDAV sotto il cofano, le estensioni che apporta ad HTTP, come utilizza l’XML e soprattutto, come utilizzare Django per gestirlo.\nDjango e WebDAV: la struttura nello specifico della nostra implementazione, il model, le view e l’implementazione di un’applicazione Django sui generis.\nScelte di implementazione, difficoltà tecniche e soluzioni: dove abbiamo utilizzato il database e dove invece abbiamo ritenuto più opportuno sfruttare le periferiche di archiviazione, i problemi che abbiamo incontrato durante lo sviluppo, e come li abbiamo risolti.\nIl pessimo stato dell’arte: come ogni client implementi una propria versione “personalizzata” di WebDAV e come Davvy si adatta in mdo implicito ed automatico alle diverse richieste dei client. Esempi sui più noti client: Apple’s Calendar, Mozilla Thunderbird, e così via.\n\n", "video_mp4_url": null, "tags": [], "copyright_text": "", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=YGwciTWE60A", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "Italian", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/YGwciTWE60A/maxresdefault.jpg", "video_flv_url": null}