{
  "alias": "video/3609/davvy-django-webdav-e-pessimo-stato-dellart",
  "category": "PyCon Italia 2015",
  "copyright_text": "",
  "description": "Davvy è un’applicazione Django che permette la gestione di servizi\nWebDAV. Gli obiettivi del talk comprendono: fornire un’overview del\nprotocollo WebDAV e mostrarne la nostra implementazione; mostrare la\ncostruzione di un’applicazione Django che gestisca servizi basati su\nprotocolli di questo tipo, in modo che sia estendibile a piacimento e\npienamente configurabile (e quindi anche qualche buona regola da seguire\nnello sviluppo Django). Analizzare lo stato dell’arte e quindi, in\nparticolare, come ogni client implementi, a proprio piacimento,\nspecifiche “personalizzate” del protocollo, risultando in una quasi\nimpossibile interoperabilità e una scarsa compatibilità con i fornitori\ndi servizi. I prerequisiti necessari richiedono soltanto una conoscenza\npoco approfondita di Django. Il talk includerà:\n\nDettagli sul protocollo WebDAV: cos’è, a cosa serve, come lo\nutilizziamo, e le alternative odierne. Dettagli implementativi: come\nfunziona WebDAV sotto il cofano, le estensioni che apporta ad HTTP, come\nutilizza l’XML e soprattutto, come utilizzare Django per gestirlo.\nDjango e WebDAV: la struttura nello specifico della nostra\nimplementazione, il model, le view e l’implementazione di\nun’applicazione Django sui generis. Scelte di implementazione,\ndifficoltà tecniche e soluzioni: dove abbiamo utilizzato il database e\ndove invece abbiamo ritenuto più opportuno sfruttare le periferiche di\narchiviazione, i problemi che abbiamo incontrato durante lo sviluppo, e\ncome li abbiamo risolti. Il pessimo stato dell’arte: come ogni client\nimplementi una propria versione “personalizzata” di WebDAV e come Davvy\nsi adatta in mdo implicito ed automatico alle diverse richieste dei\nclient. Esempi sui più noti client: Apple’s Calendar, Mozilla\nThunderbird, e così via.\n",
  "duration": 942,
  "id": 3609,
  "language": "ita",
  "quality_notes": "",
  "recorded": "2015-05-29",
  "slug": "davvy-django-webdav-e-pessimo-stato-dellart",
  "source_url": "https://www.youtube.com/watch?v=YGwciTWE60A",
  "speakers": [
    "Adriano Di Luzio"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/YGwciTWE60A/maxresdefault.jpg",
  "title": "Davvy - Django, WebDAV e (pessimo) stato dell'arte.",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YGwciTWE60A"
    }
  ]
}