{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": 1898, "video_ogv_download_only": false, "category": "PyCon Italia 2015", "speakers": ["Emanuel Danci", "Vlad Temian"], "title": "gitfs - building a filesystem in Python", "quality_notes": "", "video_flv_length": null, "recorded": "2015-05-29", "video_mp4_length": null, "description": "gitfs is an open-source[1] filesystem which was designed to bring the full powers of Git to everyone, no matter how little they know about versioning. A user can mount any repository and all the his changes will be automatically converted into commits. gitfs will also expose the history of the branch you’re currently working on by simulating snapshots of every commit.\ngitfs is useful in places where you want to keep track of all your files, but at the same time you don’t have the possibility of organizing everything into commits yourself. A FUSE filesystem for git repositories, with local cache.\nIn this talk we will take a look at some of the crucial aspects involved in building a reliable FUSE filesystem, the steps that we took in building gitfs,  especially in handling the git objects (http://git-scm.com/book/en/v2/Git-Internals-Git-Objects), what testing methods we have used for it and also we will share the most important lessons learned while building it. \nThe prerequisites for this talk are:\n\nA good understanding of how Git works\nBasic understaning of Operating Systems concepts \n\n[1] You can get the source here - https://github.com/PressLabs/gitfs; you cand find more details here -  http://www.presslabs.com/gitfs/.\n", "video_mp4_url": null, "tags": [], "copyright_text": "", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=elA96lMW-gA", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/elA96lMW-gA/maxresdefault.jpg", "video_flv_url": null}