{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": 1538, "video_ogv_download_only": false, "category": "PyCon Italia 2015", "speakers": ["Alex Martelli"], "title": "Modern Python Patterns and Idioms", "quality_notes": "", "video_flv_length": null, "recorded": "2015-06-09", "video_mp4_length": null, "description": "Python itself has grown to encompass some classic idioms, such as Decorate-Sort-Undecorate, AKA DSU, begetting the widespread key= argument to most functions related to ordering – but not quite all of them: heapq, for example, still mostly lacks key= – so, we also show what idioms to use with this and similar modules.\r\n\r\nLists have long been one of Python’s strengths, and they’re of course still precious – but many kinds of specialized containers have emerged, and it’s important to know how to choose among them, and when and how to roll your own. More important still, iterators have grown into prominence, and very often they’ll be the best choice – and they come with a large set of relevant patterns and idioms.\r\n\r\nThe tectonic shift that’s taking us from classic to modern Python goes even deeper – even the dominance of good old duck typing is threatened! Specifically, in many cases, we use, instead, goose typing – checking against an abstract base class – and, as type annotations slowly emerge, they reinforce this general tendency.\r\n\r\nThese, and a miscellanea of smaller patterns and idioms (concerning I/O, best uses of dicts and other specialized mappings, async operations, testing, …), are fast becoming indispensable parts of the Proficient Pythonista’s repertoire.", "video_mp4_url": "", "tags": [], "copyright_text": "", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=LeuChRCByZc", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "As Python grows, the problem spaces we address keep shifting, and best practices for software development mature, so does the set of best-of-breed patterns and idioms change: some classics fading, new stars emerging. This talk helps fill the gap between yesterday’s good old Python, and tomorrow’s glittering vistas.", "thumbnail_url": "https://i.ytimg.com/vi/LeuChRCByZc/maxresdefault.jpg", "video_flv_url": ""}