{
  "id": 3565,
  "category": "PyCon Italia 2015",
  "slug": "modern-python-patterns-and-idioms",
  "title": "Modern Python Patterns and Idioms",
  "alias": "video/3565/modern-python-patterns-and-idioms",
  "summary": "As Python grows, the problem spaces we address keep shifting, and best\npractices for software development mature, so does the set of\nbest-of-breed patterns and idioms change: some classics fading, new\nstars emerging. This talk helps fill the gap between yesterday’s good\nold Python, and tomorrow’s glittering vistas.\n",
  "description": "Python itself has grown to encompass some classic idioms, such as\nDecorate-Sort-Undecorate, AKA DSU, begetting the widespread key=\nargument to most functions related to ordering – but not quite all of\nthem: heapq, for example, still mostly lacks key= – so, we also show\nwhat idioms to use with this and similar modules.\n\nLists have long been one of Python’s strengths, and they’re of course\nstill precious – but many kinds of specialized containers have emerged,\nand it’s important to know how to choose among them, and when and how to\nroll your own. More important still, iterators have grown into\nprominence, and very often they’ll be the best choice – and they come\nwith a large set of relevant patterns and idioms.\n\nThe tectonic shift that’s taking us from classic to modern Python goes\neven deeper – even the dominance of good old duck typing is threatened!\nSpecifically, in many cases, we use, instead, goose typing – checking\nagainst an abstract base class – and, as type annotations slowly emerge,\nthey reinforce this general tendency.\n\nThese, and a miscellanea of smaller patterns and idioms (concerning I/O,\nbest uses of dicts and other specialized mappings, async operations,\ntesting, …), are fast becoming indispensable parts of the Proficient\nPythonista’s repertoire.\n",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "",
  "thumbnail_url": "https://i.ytimg.com/vi/LeuChRCByZc/maxresdefault.jpg",
  "duration": 1538,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=LeuChRCByZc",
      "type": "youtube",
      "length": 0
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=LeuChRCByZc",
  "tags": [],
  "speakers": [
    "Alex Martelli"
  ],
  "recorded": "2015-06-09"
}