{
  "alias": "video/3592/scipy-e-rpy-per-lanalisi-degli-acquisti-della-pu",
  "category": "PyCon Italia 2015",
  "copyright_text": "",
  "description": "Il talk propone di mostrare un caso concreto di utilizzo di python, con\nvarie librerie, per l’analisi di dati in formato aperto in ambito\neconomico. Tutti gli enti pubblici italiani per legge devono pubblicare\nun file xml liberamente accessibile con tutti i dettagli sulla spesa per\nacquisti di lavori, beni e servizi. Questa mole di dati può dare\ninformazioni molto interessanti per il controllo della spesa pubblica:\nbenchmark per gli operatori del settore, controllo diffuso sulla spesa\npubblica da parte della cittadinanza, prevenzione della corruzione, ma\nanche analisi di mercato e confronto con i concorrenti per aziende\nfornitori della pubblica amministrazione. Per analizzare questa mole di\ndati, pubblica ormai da un anno, ma ancora poco utilizzata, ho\nutilizzato python per scaricare e interpretare i file xml, organizzare i\ndati raccolti in un database, analizzarli con indici, grafici, confronti\ndi settore, variazione nel tempo, analisi di regressione. Le analisi\nsono state condotte principalmente utilizzando scipy (con anche un\nesempio di calcolo parallelo multiprocesso). Ho inoltre utilizzato il\nsoftware statistico R tramite rpy2 per alcune analisi e per la\ngenerazione di grafici. La presentazione delle analisi è realizzata in\nexcel con xlsxwriter, con molti grafici disegnati direttamente da excel,\nma ovviamente parametrizzati in python. Per l’interpretazione dell’xml,\nqualche pagina web per la gestione e per tenere insieme il tutto ho\nutilizzato genropy. Il talk può essere interessante per mostrare come le\nlibrerie python per il calcolo scientifico possano essere utilizzate\nvelocemente e con un tempo di apprendimento veramente minimo anche non\nda statistici o matematici, ma da un economista come me, per ottenere\nrisultati magari semplici per gli esperti del settore (ho appena\nsfiorato la superficie delle potenzialità di questi strumenti), ma\ncomunque strabilianti per chi è abituato a fare i conti solo con excel.\nPrerequisiti per una piena comprensione sono una conoscenza normale di\npython e un’idea di cos’è l’XML. Per quanto riguarda le librerie scipy e\nrpy2 il talk è assolutamente introduttivo, un esempio di come può usarle\ncon frutto anche un totale principiante come me.\n",
  "duration": 1580,
  "id": 3592,
  "language": "Italian",
  "quality_notes": "",
  "recorded": "2015-05-29",
  "slug": "scipy-e-rpy-per-lanalisi-degli-acquisti-della-pu",
  "source_url": "https://www.youtube.com/watch?v=fH3hZZ27tzY",
  "speakers": [
    "Francesco Cavazzana"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/fH3hZZ27tzY/maxresdefault.jpg",
  "title": "Scipy e Rpy per l'analisi degli acquisti della pubblica amministrazione",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fH3hZZ27tzY"
    }
  ]
}