{
  "alias": "video/3560/v-eras-14-una-missione-di-esplorazione-marziana",
  "category": "PyCon Italia 2015",
  "copyright_text": "",
  "description": "European MaRs Analogue Station for Advanced Technologies Integration\n(ERAS) è un programma guidata dall’Italian Mars Society (IMS), il cui\nobiettivo principale è fornire un ambiente di test per studiare\noperazioni sul campo in preparazione a una missione su Marte. Prima\ndella sua costruzione, IMS ha iniziato lo sviluppo di una simulazione\nimmersiva in realtà virtuale (VR) della stazione ERAS (V-ERAS). Il setup\niniziale di V-ERAS si basa sui seguenti elementi chiave: - Simulazione\ndella stazione ERAS usando un virtual reality headset - Full body\ntracking - Integrazione con un treadmill omnidirezionale - Supporto per\nil monitoraggio della salute dei membri della crew - Supporto per utenti\nmultipli Fin dall’inizio, Python è stato una delle tecnologie chiave che\nci ha permesso di sviluppare il sistema, grazie anche a un team\ninternazionale di studenti che hanno partecipato con l’IMS a Google\nSummer of Code. Nel Dicembre 2014, quattro astronauti virtuali hanno\ncondotto per una settimana un programma di simulazioni immersive in\nrealtà virtuale durante la prima missione V-ERAS (V-ERAS-14). La\npresentazione mostrerà i risultati della missione V-ERAS-14,\nintegrandoli con il ruolo che Python ha avuto nel supportare\nl’infrastruttura del progetto.\n",
  "duration": 3114,
  "id": 3560,
  "language": "Italian",
  "quality_notes": "",
  "recorded": "2015-06-09",
  "slug": "v-eras-14-una-missione-di-esplorazione-marziana",
  "source_url": "https://www.youtube.com/watch?v=tbOra5MjSgQ",
  "speakers": [
    "Ezio Melotti",
    "Franco Carbognani"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/tbOra5MjSgQ/hqdefault.jpg",
  "title": "V-ERAS-14: Una missione di esplorazione marziana in realtà virtuale",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tbOra5MjSgQ"
    }
  ]
}