{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": 3114, "video_ogv_download_only": false, "category": "PyCon Italia 2015", "speakers": ["Ezio Melotti", "Franco Carbognani"], "title": "V-ERAS-14: Una missione di esplorazione marziana in realtà virtuale", "quality_notes": "", "video_flv_length": null, "recorded": "2015-06-09", "video_mp4_length": null, "description": "European MaRs Analogue Station for Advanced Technologies Integration (ERAS) è un programma guidata dall’Italian Mars Society (IMS), il cui obiettivo principale è fornire un ambiente di test per studiare operazioni sul campo in preparazione a una missione su Marte.\nPrima della sua costruzione, IMS ha iniziato lo sviluppo di una simulazione immersiva in realtà virtuale (VR) della stazione ERAS (V-ERAS).\nIl setup iniziale di V-ERAS si basa sui seguenti elementi chiave:\n - Simulazione della stazione ERAS usando un virtual reality headset\n - Full body tracking\n - Integrazione con un treadmill omnidirezionale\n - Supporto per il monitoraggio della salute dei membri della crew\n - Supporto per utenti multipli\nFin dall’inizio, Python è stato una delle tecnologie chiave che ci ha permesso di sviluppare il sistema, grazie anche a un team internazionale di studenti che hanno partecipato con l’IMS a Google Summer of Code.\nNel Dicembre 2014, quattro astronauti virtuali hanno condotto per una settimana un programma di simulazioni immersive in realtà virtuale durante la prima missione V-ERAS (V-ERAS-14).\nLa presentazione mostrerà i risultati della missione V-ERAS-14, integrandoli con il ruolo che Python ha avuto nel supportare l’infrastruttura del progetto.\n", "video_mp4_url": "", "tags": [], "copyright_text": "", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=tbOra5MjSgQ", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "Italian", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/tbOra5MjSgQ/hqdefault.jpg", "video_flv_url": ""}