{
  "alias": "video/3626/v-eras-14-a-virtual-reality-mars-exploration-mis",
  "category": "PyCon Italia 2015",
  "copyright_text": "",
  "description": "The European MaRs Analogue Station for Advanced Technologies Integration\n(ERAS) is a program spearheaded by the Italian Mars Society (IMS), whose\nmain goal is to provide an effective test bed for field operation\nstudies in preparation for human missions to Mars. Preliminarily to its\nconstruction, IMS has started the development of an immersive Virtual\nReality (VR) simulation of the ERAS Station (V-ERAS). The initial V-ERAS\nsetup has been based on the following key elements: - ERAS Station\nsimulation using an appropriate game engine supporting a virtual reality\nheadset - Full body tracking - Integration of an omnidirectional\ntreadmill - Support for the crew members’ health monitoring -\nMultiplayer Support Since the beginning, Python has been one of the key\ntechnologies that allowed us to develop the system, also thanks to a\nteam of international students that participated with the IMS to Google\nSummer of Code. In December 2014, four virtual astronauts have conducted\na sustained program of immersive virtual reality simulations during the\nfirst week-long V-ERAS Mission (V-ERAS-14). The presentation will report\non the outcomes of the V-ERAS-14 Mission while fusing on the transversal\nrole played by the Python language in supporting the project\ninfrastructure.\n",
  "duration": 2656,
  "id": 3626,
  "language": "English",
  "quality_notes": "",
  "recorded": "2015-05-29",
  "slug": "v-eras-14-a-virtual-reality-mars-exploration-mis",
  "source_url": "https://www.youtube.com/watch?v=I5e__EoRpnM",
  "speakers": [
    "Ezio Melotti",
    "Franco Carbognani"
  ],
  "summary": "This presentation reports on the outcomes of the V-ERAS-14 Mission while\nfocusing on the integral role played by the Python language in\nsupporting the project infrastructure.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/I5e__EoRpnM/maxresdefault.jpg",
  "title": "V-ERAS-14: A Virtual Reality Mars Exploration Mission (in English)",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=I5e__EoRpnM"
    }
  ]
}