{
  "description": "With the advent of new amazing front-end frameworks and the\never-increasing power of browsers and mobile processors, webapp users\nexpect a dynamic, seamless user experience where page refresh is out\nof the question. We Pythonistas love Django for web development, but\nserver-side template rendering is not cool anymore. What do? Use\nDjango as a pure back-end.\n\nIn this talk, technologies, strategies and third-party packages will\nbe discussed, which will enable you to hit the ground running when\ntackling your first decoupled project or using Django in the context\nof a hybrid architecture. Furthermore, we will discuss how web\ndevelopment has changed through the years, aiming to find the mindset\nthat will keep Django (and by extension Python as a web development\nlanguage) relevant in the future.\n\n------\n\nCarlos is a Pythonista and Django developer from Madrid, Spain.\nThough he wouldn't consider programming his vocational calling\n(probably music is), he loves open source and free software ever ince\nhe has discovered it. That led him to be an occasional teacher and\nmentor, introducing rogramming and the hacker mindset to young\npeople.\n\nHe believes, that real technological literacy, as opposed to\ntechnological consumerism, is integral to building a better society:\ndevelopers are in a privileged position and openness, transparency\nand ease of access are fundamental. Communities play a vital role\nhere: programming can be a cold, lonely and dehumanized enterprise,\nbut in communities we can find warmth and meaning.\n\nThis year he spoke at DjangoCon Europe, where he delivered a speech\nin the hope of being useful and giving a glimpse of his own\nexperiences with Django. Currently he works for a small data analysis\nand intelligence start-up as the lead developer, which is quite a\nchallenge, but a learning experience with every step.",
  "duration": 1871,
  "language": "eng",
  "recorded": "2017-06-09",
  "speakers": [
    "Carlos de las Heras"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/NptFO5S6tLo/hqdefault.jpg",
  "title": "Django's watching my back(end)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NptFO5S6tLo"
    }
  ]
}
