{
  "description": "Data, data, data and even more data. How can we handle all this data,\nof course by analysing them with Python :) But neither Python nor any\nother program, software etc. can tell us the story, which is hidden\nin the data. The story is created by a human interaction with the\ndata. In this process data visualisation is our friend as it helps us\nto discover patterns, outliers and everything we need to create the\ndata story. At the same time data visualisation is a language we all\nunderstand and enjoy using, therefore it is the logical bridge\nbetween the data and the story. In this talk I want to show you why\nwe love visual storytelling and inspire your own imagination by\nexplaining to you how one of the best visual data stories have been\ncreated\n\n-----\n\nSandra’s biggest passion is and always was analysing and visualising\ndata in order to discover the world.\n\nWithin the last 10 years she had the pleasure to design statistical\nmodels and create analytical solutions in various interesting\nprojects while working in market research institutes, brand, media\nand advertisement agencies in Germany, UK and Spain.\n\nSara is German but she would consider heself already as half Spanish\nas she've been living in her favourite city of Madrid for nearly\nthree years now. In her last position she'd led the data\nvisualisation training program for Telefonica Spain and LATAM by\nhelping them to understand, use and communicate their data in an\nefficient, attractive and dynamic way.\n\nNow as a profesor and teacher for data visualisation she has the\npossibility to focus on new ways to explore and represent data,\nespecially using open source software like D3.js, R shiny & ggplot2,\nPython and CARTO and with a passion for the visual storytelling. Her\nfinal objective is to transmit high quality knowledge combined with\nenjoyment.",
  "duration": 2287,
  "language": "eng",
  "recorded": "2017-06-08",
  "speakers": [
    "Sandra Becker"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/xtyA-lqXMPI/hqdefault.jpg",
  "title": "Visual storytelling – why we love it?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xtyA-lqXMPI"
    }
  ]
}
