{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon AU 2012", "speakers": ["Elyse Maria Glina"], "title": "Human as a Second Language: Succeeding with the Natural Language Toolkit", "quality_notes": "", "video_flv_length": null, "recorded": "2012-08-21", "video_mp4_length": null, "description": "The Natural Language Toolkit (NLTK) suite offers powerful tools for natural\nlanguage processing and analysis. Like many other code libraries, it enables\nprogrammers to achieve results when working with data they may not be an\nexpert in the handling of - in this case, human language. The NLTK is\nparticularly valuable as human language skills are in general something\nprogrammers can get along without, and therefore they are likely to be ill-\nequipped with the tools to most effectively work with language data. However,\nwhile NLTK provides programmers with a way to work with all the relevant parts\nof language without needing to rely on their own grammar skills, there are\nmany concepts in the field of natural language processing that require basic\ncomprehension of natural language operation, which may make knowing where to\nstart working with the NLTK difficult for the average programmer.\n\nThis presentation will demonstrate some of the NLTK's powerful and impressive\nfeatures, while covering the concepts that will enable any programmer to work\ncool tricks on natural language. The application of the NLTK to a very basic\nartificial intelligence will be shown.\n\n", "video_mp4_url": null, "tags": ["nltk"], "copyright_text": "http://www.youtube.com/t/terms", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=GynvZHDdUgA", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "The Natural Language Toolkit (NLTK) suite offers powerful tools for natural\nlanguage processing and analysis. Like many other code libraries, it enables\nprogrammers to achieve results when working with data they may not be an\nexpert\n\n", "thumbnail_url": "http://i.ytimg.com/vi/GynvZHDdUgA/hqdefault.jpg", "video_flv_url": null}