{
  "id": 1625, 
  "category": "PyCon AU 2012", 
  "slug": "path-dependent-development-why-on-earth-are-you", 
  "title": "Path Dependent Development: Why on Earth are you using SQL Alchemy as a JSON validator?", 
  "summary": "The PulpDist project uses SQL Alchemy as part of a custom JSON validator. This\ncould be seen as an unusual choice, so it's worth exploring the way this\napproach came to be adopted. Practicing iterative development means coping\nwith the tension between \"doing the simplest thing that could possibly work\"\nto meet immediate project requirements and avoiding \"reinventing the wheel\".\n\n", 
  "description": "The PulpDist project uses SQL Alchemy as part of a custom JSON validator. This\ncould be seen as an unusual choice, so it's worth exploring the way this\napproach came to be adopted.\n\nPracticing iterative development means coping with the inevitable tension\nbetween \"doing the simplest thing that could possibly work\" to meet immediate\nproject requirements and avoiding \"reinventing the wheel\" in order to take\nfull advantage of existing software components.\n\nThis means that iterative software designs are inevitably path dependent:\ndecisions made in early iterations can shape later aspects of a project in\nunexpected ways. These early influences may even predate the project itself,\ninstead being a consequence of wider organisational policies and the personal\npreferences and abilities of key developers.\n\nUnderstanding some of these factors can help with understanding why:\n\n  * \"good enough\" is usually a better target than \"perfect\"\n  * \"Not Invented Here\" syndrome is not always the villain it is frequently made out to be\n  * the need to extensively rewrite existing components is not always a sign of past failure\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i.ytimg.com/vi/PYw2K0_ZZ0w/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=PYw2K0_ZZ0w", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=PYw2K0_ZZ0w", 
  "tags": [
    "pulpdist"
  ], 
  "speakers": [
    "Nick Coghlan"
  ], 
  "recorded": "2012-08-22"
}