{
  "description": "www.pydata.org\n\nTired of waiting for massive datasets to load on your local machine? In this beginner-friendly tutorial, we’ll explore how to scale your data analysis skills from pandas to PySpark using a real-world anime dataset. We’ll walk through the basics of distributed computing, discuss why Spark was created, and demonstrate the benefits of working with PySpark for big data tasks—including reading, cleaning, and transforming millions of records with ease. By the end of this workshop, you’ll understand how PySpark harnesses cluster computing to handle large-scale data and you’ll be comfortable applying these techniques to your own projects.\n\nParticipant Requirements:\n- A laptop (any OS) with an internet connection\n- A Google account (to access Colab notebooks and slides)\n- Familiarity with Python and pandas\n\nHere's the link to the Google Colab to follow along 👇🏾\nhttps://colab.research.google.com/drive/1fi0cTQ1NIE5kDEH0ynp2sqDuVeiBJJWU?usp=sharing\n\nHere are the slides 👇🏾\nhttps://drive.google.com/file/d/11JIih1VzLxTJ9O6PeGzqD_e8vumTZQmw/view?usp=sharing\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 4399,
  "language": "eng",
  "recorded": "2025-04-18",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/virginia2025"
    },
    {
      "label": "https://colab.research.google.com/drive/1fi0cTQ1NIE5kDEH0ynp2sqDuVeiBJJWU?usp=sharing",
      "url": "https://colab.research.google.com/drive/1fi0cTQ1NIE5kDEH0ynp2sqDuVeiBJJWU?usp=sharing"
    },
    {
      "label": "https://drive.google.com/file/d/11JIih1VzLxTJ9O6PeGzqD_e8vumTZQmw/view?usp=sharing",
      "url": "https://drive.google.com/file/d/11JIih1VzLxTJ9O6PeGzqD_e8vumTZQmw/view?usp=sharing"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/McbJMdcKp5c/maxresdefault.jpg",
  "title": "Cynthia Ukawu - From Pandas to PySpark | PyData Virginia 2025",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=McbJMdcKp5c"
    }
  ]
}
