{
  "description": "Health disparities remain a critical challenge in public health, demanding innovative approaches to uncover inequities and drive actionable change. This webinar will demonstrate how Python can serve as a powerful tool for creating data visualizations that illustrate the unequal burden of HIV across different populations. Participants will learn how Python’s popular libraries, such as Matplotlib, Seaborn, and Plotly, can transform complex datasets into accessible, impactful visuals.\nUsing an HIV dataset containing demographic, geographic, and clinical variables, this session will guide attendees through a series of practical examples. From creating heatmaps and geospatial maps to analyzing temporal trends, the webinar emphasizes how to identify and communicate key social determinants related to race, gender, socioeconomic status, and access to care. Through hands-on demonstrations, attendees will see how Python’s capabilities streamline data analysis and visualization workflows.\nKey takeaways from the session include identifying regions and communities in Texas, disproportionately affected by HIV, uncovering intersectional factors influencing health outcomes, and leveraging visual tools to inform policy and resource allocation. Special attention will be given to designing visuals that resonate with non-technical audiences, ensuring findings are actionable for public health professionals and policymakers.",
  "duration": 4007,
  "language": "eng",
  "recorded": "2025-04-18",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/virginia2025"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Kimberly Deas"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/-BA2eXBoDoc/maxresdefault.jpg",
  "title": "Data Viz in Python as a Tool to Study HIV Health Disparities",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-BA2eXBoDoc"
    }
  ]
}
