{
  "copyright_text": "Standard YouTube License",
  "description": "PyData London 2016\n\nThis talk will present best-practices and most commonly used methods for dealing with irregular time series. Though we'd all like data to come at regular and reliable intervals, the reality is that most time series data doesn't come this way. Fortunately, there is a long-standing theoretical framework for knowing what does and doesn't make sense for corralling this irregular data.\n\n____\n\nIrregular time series and how to whip them\n\n==========================================\n\nHistory of irregular time series\n\n--------------------------------\n\nStatisticians have long grappled with what to do in the case of missing data, and missing data in a time series is a special, but very common, case of the general problem of missing data. Luckily, irregular time series offer more information and more promising techniques than simple guesswork and rules of thumb.\n\nYour best options\n\n-----------------\n\nI'll discuss best-practices for irregular time series, emphasizing in particular early-stage decision making driven by data and the purpose of a particular analysis. I'll also highlight best-Python practices and state of the art frameworks that correspond to statistical best practices.\n\nIn particular I'll cover the following topics:\n\n* Visualizing irregular time series\n* Drawing inferences from patterns of missing data\n* Correlation techniques for irregular time series\n* Causal analysis for irregular time series\n\nSlides available here: https://slack-files.com/T0LFE6T6J-F17Q90AC9-b3eabe5c42",
  "duration": 1781,
  "language": "eng",
  "recorded": "2016-05-09",
  "related_urls": [
    "https://slack-files.com/T0LFE6T6J-F17Q90AC9-b3eabe5c42"
  ],
  "slug": "aileen-nielsen-irregular-time-series-and-how-to-whip-them",
  "source_url": "https://www.youtube.com/watch?v=E4NMZyfao2c",
  "speakers": [
    "Aileen Nielsen"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/E4NMZyfao2c/maxresdefault.jpg",
  "title": "Irregular time series and how to whip them",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=E4NMZyfao2c"
    }
  ]
}