{
  "copyright_text": "Standard YouTube License",
  "description": "PyData London 2016\n\nRecently the LIGO project announced the first detection of a gravitational wave. This achievements is a triumph for experimental physics, after decades of effort on developing an instrument sensitive enough to react to the tiny push and pull from a gravitational wave. I will present examples from our work on modelling and understanding the complex laser interferometers of LIGO.\n\nGravitational waves are a prediction from Einstein's theory of gravity: when very compact and massive objects such as black holes collide, they produce strong gravitational waves, but until recently we did not have an instrument sensitive enough to measure them. In September 2015 the LIGO detectors achieved the first detection of a gravitational wave and could estimate the parameters of the black holes that had produced the signal, a billion years ago in a galaxy far away. LIGO and other detectors will now be improved further to detect more signals from black holes and other elusive objects, kickstarting a new type of astronomy.\n\nAt the core of the LIGO observatories are very large laser interferometers. The concept for these interferometers is well known but has been enhanced with new technology. It typically takes several years of work after the interferometers have been first turned on, until they reach their full sensitivity. Numerical simulations play an important role in the process. In recent years we have developed new Python-based tools to model the optical systems. Such tools must remain accessible to the experimentalists in charge of the instruments, to be used effectively in large collaborations.\n\nI will give a short introduction to the LIGO project and present examples from our work to support the LIGO detectors with numerical modelling tools. I will mention how the evolution of our work over the last ten years led to Python as a language of choice.\n\nSlides available here: http://www.gwoptics.org/talks/2016/pydata/",
  "duration": 2836,
  "id": 5200,
  "language": "eng",
  "recorded": "2016-05-08",
  "related_urls": [
    "http://www.gwoptics.org/talks/2016/pydata/"
  ],
  "slug": "andreas-freise-keynote-laser-ranging-in-a-new-dimension",
  "speakers": [
    "Andreas Freise"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/BXID4teFfDc/maxresdefault.jpg",
  "title": "KEYNOTE:  Laser ranging in a new dimension",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BXID4teFfDc"
    }
  ]
}
