{
  "copyright_text": "Standard YouTube License",
  "description": "PyData London 2016\n\nAlzheimer's disease is a form of dementia that affects over 44 million people globally. Unfortunately the condition is very hard to detect in its early stages. It is usually diagnosed by a simple questionnaire test, an approach that can only detect Alzheimer's disease many years after its onset. The challenge set in this project was earlier detection using Python and data science.\n\nAlzHack is a collaborative citizen science project undertaken by a small but diverse group of data scientists. We will discuss the challenges encountered in discovering and acquiring suitable data, describe how we cleaned and merged multiple data sources, and how it was possible to extract meaningful features from within.\n\nWe will cover textual feature extraction, examining; amongst other methods, part-of-speech tagging, readability calculations, locality sensitive hashing as well as sentiment analysis, all in Python 3.\n\nIn addition we will show how a variety of machine learning techniques (including text clustering and classification) were used; with the aim of distinguishing diagnosed Alzheimer's sufferers from their healthy peers solely based on samples of their written correspondence.\n\nThis will be followed by a look at changepoint and ramp detection on noisy time series data; deployed to identify subtle changes in signals obtained from correspondence of individuals over time; thus allowing a form of non-medical, 'early warning' style detection of Alzheimer's disease.\n\nFinally we will address the tough task of scaling up a small, collaborative data science project to become an extremely powerful, widely available self-diagnosis tool.\n\nSlides available here: http://www.slideshare.net/FrankKelly3/alz-hack-ii",
  "duration": 2212,
  "language": "eng",
  "recorded": "2016-05-11",
  "related_urls": [
    "http://www.slideshare.net/FrankKelly3/alz-hack-ii"
  ],
  "slug": "frank-kelly-giles-weaver-alzhack-data-driven-diagnosis-of-alzheimers-disease-1",
  "source_url": "https://www.youtube.com/watch?v=gLMNKxHx61I",
  "speakers": [
    "Frank Kelly",
    "Giles Weaver"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/gLMNKxHx61I/maxresdefault.jpg",
  "title": "AlzHack  Data Driven Diagnosis of Alzheimer's Disease 1",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gLMNKxHx61I"
    }
  ]
}