{
  "copyright_text": "Standard YouTube License",
  "description": "PyData London 2016\n\nSome of the more advanced deep learning to help you get the best out of it in a practical setting. The main focus is on computer vision and image processing.\n\nIn the last few years, deep neural networks have been used to generate state-of-the-art results in image classification, segmentation and object detection. They have also successfully been used for speech recognition.\n\nIn this tutorial we build on the basics, demonstrating some useful techniques that are useful in a practical setting. Along with tips and tricks found to be useful, we will discuss the following:\n\nactive learning; train a neural network using less training data\nusing pre-trained networks; using the body of a pre-trained network (e.g. an ImageNet network) and re-using it for localisation or locating objects not within the original training set\nhaving fun with neural networks; some of the fun techniques that have been demonstrated in the last couple of years\nPrior knowledge of deep learning, machine learning, linear algebra, a bit of calculus and the NumPy/SciPy stack would be helpful for participation. We will mainly focus on using the Theano toolkit along with the Lasagne neural network library.\n\nSlides available here: https://speakerdeck.com/britefury/deep-learning-tutorial-advanced-techniques-pydata-london-2016\n\nGitHub Repo: https://github.com/Britefury/deep-learning-tutorial-pydata2016",
  "duration": 5792,
  "id": 5215,
  "language": "eng",
  "recorded": "2016-05-26",
  "related_urls": [
    "https://github.com/Britefury/deep-learning-tutorial-pydata2016",
    "https://speakerdeck.com/britefury/deep-learning-tutorial-advanced-techniques-pydata-london-2016"
  ],
  "slug": "geoffrey-french-deep-learning-tutorial-advanced-techniques",
  "speakers": [
    "Geoffrey French"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/DlNR1MrK4qE/maxresdefault.jpg",
  "title": "Deep learning tutorial - advanced techniques",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DlNR1MrK4qE"
    }
  ]
}
