{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Berlin 2016\n\nSince April 2015 our group has studied the Allergic Rhinitis of a subject with the goal of building a machine learned model that predicts the need for antihistamines. Approximately 30% of the world's population suffers from allergies, we aim to provide a methodology for others to identify the drivers of their own symptoms. This is a \"citizen science\" project, currently focused on one individual and a year's worth of self-reported antihistamine usage, sneezing data and geolocated points. We'll discuss the available external data (including the London Air project's pollution readings, weather, diet, exercise and commute data), exploratory data analysis, our approach to feature engineering from time-series and text sources and our modeling progress. The data logging iPhone app and data preparation tools are all open sourced. Python tools discussed include scikit-learn, seaborn, statsmodels and textract. We'll also review our distributed working practices.\n\nSlides: https://speakerdeck.com/ianozsvald/statistically-solving-sniffles-step-by-step-a-work-in-progress\n\nMore information: http://ianozsvald.com/2016/05/07/statistically-solving-sneezes-and-sniffles-a-work-in-progress-report-at-pydatalondon-2016/",
  "duration": 2231,
  "language": "eng",
  "recorded": "2016-05-31",
  "related_urls": [
    "http://ianozsvald.com/2016/05/07/statistically-solving-sneezes-and-sniffles-a-work-in-progress-report-at-pydatalondon-2016/",
    "https://speakerdeck.com/ianozsvald/statistically-solving-sniffles-step-by-step-a-work-in-progress"
  ],
  "slug": "ian-ozsvald-statistically-speculating-on-the-source-of-sneezes-and-sniffles",
  "speakers": [
    "Ian Ozsvald"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/T6zTmE1yiHo/maxresdefault.jpg",
  "title": "Statistically Speculating on the Source of Sneezes and Sniffles",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=T6zTmE1yiHo"
    }
  ]
}