{
  "copyright_text": "Standard YouTube License",
  "description": "PyData London 2016\n\nAt first encounter Bayesianism can easily seem like a totally new and intimidating way of doing statistics. However, in this tutorial you will learn that you don’t need to make a big commitment to gain real benefits from using some Bayesian techniques. We will model the effectiveness of advertising using survival analysis and you will see how Bayesian tools can complement traditional models\n\nIf you come from a traditional statistical or econometric background, Bayesianism can seem like a totally new and different way of approaching statistics. It can feel like there is no middle ground, you either need to commit to it entirely or move on.\n\nBut neither of these are the case. Rather than having to entirely replace our models with Bayesian ones, we can augment particular parts of the models using Bayesian techniques. By the end of the tutorial you will be able to do exactly this when looking at modelling life time value or expected life times.\n\nThe tutorial will focus on modelling the effectiveness of advertising as this is something that affects a wide range of businesses, but the techniques we cover are widely applicable.\n\nWe will begin by looking at how Bayesian ways of thinking can be very useful in helping flag up when we are violating the core assumptions of our models. We will then look at how Bayesian techniques can be used to essentially provide modelling short cuts, i.e. how they allow us to do some things much more easily than we would otherwise be able to do them.",
  "duration": 5028,
  "language": "eng",
  "recorded": "2016-05-11",
  "related_urls": [],
  "slug": "jake-coltman-jacob-goodwin-bayesianism-and-survival-analysis",
  "source_url": "https://www.youtube.com/watch?v=jlz2_hjW3UE",
  "speakers": [
    "Jake Coltman",
    "Jacob Goodwin"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/jlz2_hjW3UE/maxresdefault.jpg",
  "title": "Bayesianism and Survival Analysis",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jlz2_hjW3UE"
    }
  ]
}