{
  "copyright_text": "Standard YouTube License",
  "description": "PyData London 2016\nMin Ragan Kelley & Thomas Kluyver\n\nLearn to deploy JupyterHub! JupyterHub is a simple, highly extensible, multi-user system for managing per-user Jupyter Notebook servers, designed for research groups or classes. We will cover deploying JupyterHub on a single server, as well as deploying with Docker using GitHub for authentication.\n\nThe Jupyter Notebook is an interactive web-based tool for interactive programming and writing code-centric documents. Being a web-based environment, the notebook server can be run remotely, not just on your local machine. JupyterHub is a multi-user server, aimed at helping research groups and instructors host notebook servers for their users or students. By default, JupyterHub uses the local system users and PAM authentication, but it can be customized to use any authentication system, including GitHub, CILogon, Shibboleth, and more. The way single-user servers are spawned can also be customized to use services such as Docker, Kubernetes, or HPC cluster queuing systems. The tutorial will cover a basic deployment of JupyterHub on a single machine, then extending it to use docker and GitHub authentication, as well as general best practices for JupyterHub deployment.\n\nSlides available here: https://github.com/minrk/jupyterhub-pydata-2016/blob/master/JupyterHub.pdf\nGitHub Repo: https://github.com/minrk/jupyterhub-pydata-2016",
  "duration": 5787,
  "language": "eng",
  "recorded": "2016-05-13",
  "related_urls": [
    "https://github.com/minrk/jupyterhub-pydata-2016/blob/master/JupyterHub.pdf",
    "https://github.com/minrk/jupyterhub-pydata-2016"
  ],
  "slug": "jupyterhub-deploying-jupyter-notebooks-for-students-and-researchers",
  "source_url": "https://www.youtube.com/watch?v=gSVvxOchT8Y",
  "speakers": [
    "Min Ragan Kelley",
    "Thomas Kluyver"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/gSVvxOchT8Y/maxresdefault.jpg",
  "title": "JupyterHub: Deploying Jupyter Notebooks for students and researchers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gSVvxOchT8Y"
    }
  ]
}