{
  "copyright_text": "Standard YouTube License",
  "description": "PyData London 2016\n\nBandicoot is a free and open-source toolbox to process mobile phone metadata. It provides standardized and privacy-preserving methods to analyze such datasets, returning more than 160 behavioral indicators. Bandicoot is a complete easy-to-use environment for researchers and developers, allowing them to load their data, perform analysis, and export their results with a few lines of code.\n\nThe metadata generated at large scale by cellphones and collected by literally every carrier around the world have the potential to fundamentally transform the way we fight diseases, design transportation systems, and do research. Scientists have compared the recent availability of these large-scale behavioral data sets to the invention of the microscope and new fields such as Computational Social Science have recently emerged. Mobile phone metadata have, for example, already been used to study human mobility and behavior in cities, understand the propagation of viruses such as malaria and dengue fever. They have been combined with machine learning algorithms to predict people's age, gender, personality, loan repayments, and crime.\n\nBandicoot is a free and open-source Python toolbox to extract more than 160 features from standard mobile phone metadata. bandicoot focuses on making it easy for researchers and practitioners to load mobile phone data, analyze them, as well as compute and extract robust features from them. Emphasis is put on ease of use, consistency, and documentation. bandicoot has no dependencies and is distributed under the MIT license.\n\nbandicoot indicators: individual, spatial, and network features\n\nIn this talk, we provide an introduction to bandicoot via real life case studies, showing you how to visualise and analyze large scale data sets, or directly metadata from your own phone.\n\nMaterials available here: https://github.com/cynddl/pydata-london-2016",
  "duration": 2130,
  "language": "eng",
  "recorded": "2016-05-13",
  "related_urls": [
    "https://github.com/cynddl/pydata-london-2016"
  ],
  "slug": "luc-rocher-bandicoot-a-toolbox-to-analyze-mobile-phone-metadata",
  "source_url": "https://www.youtube.com/watch?v=_Fb7ttS43GE",
  "speakers": [
    "Luc Rocher"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/_Fb7ttS43GE/maxresdefault.jpg",
  "title": "bandicoot: a toolbox to analyze mobile phone metadata",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_Fb7ttS43GE"
    }
  ]
}