{
  "copyright_text": "Standard YouTube License",
  "description": "PyData London 2016\n\nIf you have ever used crowdsourcing, you know that dealing with sloppy workers is a major part of the effort. Come see this talk if you want to learn about how to solve this problem using machine learning and some elbow grease. As a bonus, you will also find out how to properly persist your ML models and use them to serve predictions through an HTTP API.\n\nIn 2016 nobody needs convincing that crowdsourced work is a solution to many problems from data labeling, to gathering subjective opinions, to producing transcripts etc. Turns out it can also work really well for functional software testing - but it's not easy to get right.\n\nOne well-known problem with crowdsourcing is sloppy work - where people perform only the absolute minimum actions allowing them to get paid, without actually fulfilling the intended tasks. In many scenarios this can be counteracted by asking multiple workers to complete the same task, but that dramatically increases cost and can still be error-prone. Detecting lazy work is another way to increase quality of gathered data and we have found a way to do this reliably for quite a large variety of tasks.\n\nIn this talk I will describe how we have trained a machine learning model to discriminate between good and sloppy work. The outline is as follows:\n\n- describe the specific problem we had 5m\n- overview of the solution 2m\n- ML model details 10m\n- data capture\n- labelling\n- balancing the dataset\n- feature engineering\n- training, retraining\n- model itself\n- model persistence 10m\n- productizing the result by putting it behind an HTTP API 3m\n- limitations, trade-offs, what could we do better 3m\n\nSlides available here: https://docs.google.com/presentation/d/1ZY-VFCOh54LGfE5LVz4cIFpvizwdrqomb4-suNTKSZo/edit?usp=sharing\n\nGitHub Repo: https://github.com/rainforestapp/destimator",
  "duration": 1713,
  "id": 5231,
  "language": "eng",
  "recorded": "2016-05-11",
  "related_urls": [
    "https://docs.google.com/presentation/d/1ZY-VFCOh54LGfE5LVz4cIFpvizwdrqomb4-suNTKSZo/edit?usp=sharing",
    "https://github.com/rainforestapp/destimator"
  ],
  "slug": "maciej-gryka-gotta-catchem-all-recognizing-sloppy-work-in-crowdsourcing-tasks",
  "speakers": [
    "Maciej Gryka"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/EBUmvY9Qj2k/maxresdefault.jpg",
  "title": "Gotta catch'em all  recognizing sloppy work in crowdsourcing tasks",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EBUmvY9Qj2k"
    }
  ]
}
