{
  "copyright_text": "Standard YouTube License",
  "description": "PyData London 2016\n\nWe address a gap in UK statistics by producing aggregate and local residential land price indices for England and Wales starting from house sales data from the Land Registry (LR) Price Paid Dataset. We decompose each sale price into a “structure” and a “land” component using data on building volumes and land areas derived from Ordnance Survey MasterMap and LR maps of freehold land parcels.\n\nThe goal of this project is to produce aggregate and local residential land price indices for England and Wales, and their local authorities, starting from house sales data (data on actual land sales are very sparse and not readily available). We address a current gap in UK statistics: the Valuation Office Agency discontinued its land price indices in 2011. Data on land values are important: they provide builders with information on the profitability of their investments and offer the public sector an instrument to evaluate decisions on land releases.\n\nWe attach to each house transaction in the England and Wales Land Registry (LR) Price Paid Dataset an estimate of the building volume and the associated land area. These additional variables are gathered from two data sources: (1) Ordnance Survey MasterMap, which includes information on the footprint and height of all buildings in Great Britain, and (2) LR maps of freehold land parcels, which can be freely downloaded online for each local authority. After putting together our dataset with QGIS and R, we can decompose each sale price in LR Price Paid into a “structure” and a “land” component using regression methods. We double check our results on structures using data on construction costs from the Office for National Statistics.\n\nSlides available here: http://www.slideshare.net/PyData/philippe-bracke-estimating-residential-land-prices-in-the-uk",
  "duration": 2436,
  "language": "eng",
  "recorded": "2016-05-09",
  "related_urls": [
    "http://www.slideshare.net/PyData/philippe-bracke-estimating-residential-land-prices-in-the-uk"
  ],
  "slug": "philippe-bracke-estimating-residential-land-prices-in-the-uk",
  "speakers": [
    "Philippe Bracke"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/XKpcb-Ejw7s/maxresdefault.jpg",
  "title": "Estimating Residential Land Prices in the UK",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XKpcb-Ejw7s"
    }
  ]
}