{
  "copyright_text": "Standard YouTube License",
  "description": "PyData London 2016\n\nThis talk will focus on two main goals. The first of these is to present the CV, and a job seeker's career trajectory more generally, as a highly interesting and fertile application domain for data science. Secondly, the talk will highlight a number of practical lessons and tips gleaned though years of hands-on experience in this area.\n\nDespite the proliferation of professional networks such as LinkedIn, and the widespread use of online forms in which job seekers can fill in their details when applying for a job, the CV still remains relevant today. From online job boards to recruitment firms, personal websites to companies who remain old-fashioned in their hiring, the CV finds its way in every facet of job hunting. For the HR professional however, the CV is cumbersome to work with. For this reason, it has consumed countless man-hours of work usually spent on mundane tasks. For example, candidate details from CVs are often manually copied into forms to create a structured profile in a database.\n\nFrom a data scientist's perspective, the CV provides us with a wealth of interesting applications and opportunities for investigation. In this talk, the author will present learnings from over three years of working in this domain as well as a range of applications that can arise.\n\nConcretely, the talk will cover:\n\nIntroducing the CV Parsing task and its components\nAutomatically extracting text from documents with Apache Tika\nUnderstanding and mitigating text extraction errors\nAnalyzing CV text with an NLP pipeline\nUsing open source tools for core NLP tasks\nHigh-level CV parsing with section identification and sentence classification\nIdentifying important entities with Named Entity Recognition (NER)\nUnderstanding the limitations of existing NER systems\nBuilding your own NER model\nReproducibility in experiments\nBuilding a corpus of annotated data\nRecognizing entity relationships\nEntity normalization\nDiscovering and extracting skills from CV's\nClustering CV's by word vectors\nIdentifying duplicate profiles\nThough each of these topics could be an entire talk on their own, the objective here is to present the main idea of each and the role that they play within the broader context of CV parsing and interpreting job seeker data. The talk will also feature code snippets in Python and Apache Spark to give a practical foundation for some of the concepts discussed.\n\nSlides available here: https://speakerdeck.com/ruimiguelforte/the-cv-a-data-scientists-view",
  "duration": 2949,
  "id": 5251,
  "language": "eng",
  "recorded": "2016-05-08",
  "related_urls": [
    "https://speakerdeck.com/ruimiguelforte/the-cv-a-data-scientists-view"
  ],
  "slug": "rui-miguel-forte-the-cv-a-data-scientists-view",
  "speakers": [
    "Rui Miguel Forte"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/elzMhqKc4AM/maxresdefault.jpg",
  "title": "The CV: A Data Scientist's View",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=elzMhqKc4AM"
    }
  ]
}
