{
  "copyright_text": "Standard YouTube License",
  "description": "PyData London 2016\n\nThis talk outlines my journey from complete novice to machine learning practitioner. It started in November 2015 when I left my job as a project manager, and by April 2016 I was hired as a Data Scientist by a startup developing bleeding edge deep learning algorithms for medical imagery processing.\n\nSHORT INTRO\nWho I am, my background and short summary of my story. Here I will list the steps I personally took to achieve the goal I had.\n\nHOW DID I DO IT?\nWhy I chose a “hacky” way to enter this career path. First mover advantage, why getting a degree doesn’t always improve your career prospects. Possibly a rant on the signalling function of formal education and how that is rarely aligned with a relevant practical skill set. Some stats to back it up (best career success predictors). Examples of hacking bureaucracies/social hierarchies from my experience and elsewhere.\nList of things not to do and common cognitive pitfalls.\nNetworking for nerds - how to do it right.\nTime management for chronic procrastinators - how to plan a self-guided project. Some notes on psychology of time discounting and need for external reinforcement, with autobiographical examples.\nCONCLUSION\nYou don’t need a PhD or even a masters to do machine learning. On taking calculated risks and especially calculated exits from one’s comfort zone. Some notes on soul searching and how to choose a career that is also a passion. Reading list.\n\nSlides available here: https://slack-files.com/T0LFE6T6J-F170V6945-ad054e4f6a",
  "duration": 3385,
  "language": "eng",
  "recorded": "2016-05-11",
  "related_urls": [
    "https://slack-files.com/T0LFE6T6J-F170V6945-ad054e4f6a"
  ],
  "slug": "tetiana-ivanova-how-to-become-a-data-scientist-in-6-months-a-hackers-approach-to-career-planning",
  "speakers": [
    "Tetiana Ivanova"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/rIofV14c0tc/maxresdefault.jpg",
  "title": "How to become a Data Scientist in 6 months a hacker’s approach to career planning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rIofV14c0tc"
    }
  ]
}