{
  "alias": "video/734/34-crosscompute-is-a-web-platform-where-users-ca",
  "category": "PyCon US 2012",
  "copyright_text": "",
  "description": "CrossCompute is a site where you can run mathematical models and\nalgorithms submitted by researchers. If you are a researcher and you\nsubmit your algorithm, you'll get paid each time it runs. We'll send you\na URL where users can run your model on their data as many times as they\nwant. More users mean more feedback that you can use to improve your\nmodel.\n\nHere is an example: Suppose a mathematician in the US develops an\noperations research model for placing schools in a community given the\nlocations of existing schools and households, and decides to charge ten\ncents each time it runs. Then a business owner in Ghana runs the model\nover the internet to place stores in his district, and saves money\nbecause he didn't have to hire a consulting firm or buy a software\npackage. Meanwhile, the mathematician in the US uses the algorithm\nrevenue to fund research to improve the model.\n\nNow is an exciting time to get involved in data analytics for your city\nor local government. Governments need to prioritize limited resources\nlike emergency response firefighters, police officers and city\ninspectors. I urge you to contact your local Mayor's office to learn\nabout the challenges they are facing. Then, create a tool to make their\nlife easier. You can send the tool to support@crosscompute.com where it\nwill join a growing collection of analytics for the public good. You\nwill get the credit for the algorithm, the revenue and users from around\nthe world.\n",
  "duration": null,
  "id": 734,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-03-11",
  "slug": "34-crosscompute-is-a-web-platform-where-users-ca",
  "speakers": [
    "Roy Hyunjin Han"
  ],
  "summary": "Have you developed a mathematical model or computational / visualization\nalgorithm? Your algorithm could be useful worldwide to people who face a\nreal- world problem but do not want to write code. Professionals in\nindustry, scientists in other fields or researchers in developing\ncountries can quickly apply your work to their domain with a web-based\ncloud-computing platform like CrossCompute.\n",
  "tags": [],
  "thumbnail_url": "https://img.youtube.com/vi/U1Y5Uxn2Rcw/hqdefault.jpg",
  "title": "34. CrossCompute is a web platform where users can run algorithms",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=U1Y5Uxn2Rcw"
    }
  ]
}
