{
  "alias": "video/725/40-mediagoblin-the-road-to-federation",
  "category": "PyCon US 2012",
  "copyright_text": "",
  "description": "From just a gleam in founder Chris Webber's eye to a full tilt media\nhosting project supporting photos, HTML5 video, and more, the road to\nfederation has been a wild ride so far. We owe a lot to the huge\ncommunity of fellow federators whose work on the ostaus library enabled\nus to start in the middle with our own not-quite-finished spin, Kuneco.\nKudos to the GNU project for getting excited about the web with us.\nWe're also thankful for the massive outpouring of project love that\nchanneled itself through transifex and has made Media Goblin\nglobal-ready even though it isn't finished. Ever thought about switching\ndatabases midstream? Come talk to us, Mongo to SQL wasn't as bad as we'd\nbeen expecting. We'll also tell you all about our minimalist wsgi\nun-framework design and how we think it's working compared to Django or\neven Pylons/Pyramid.\n\nWhat's still left do? Smoother interoperations with allied projects like\nStatusNet and Diaspora. Support for more media types like 3D modelling\nand presentations. World domination... in a friendly way! Swing by if\nyou're looking for a new project to get involved with or just want\ndetails to take back to your own.\n",
  "duration": null,
  "id": 725,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-03-11",
  "slug": "40-mediagoblin-the-road-to-federation",
  "speakers": [
    "Christopher Allan Webber",
    "Deb Nicholson"
  ],
  "summary": "From just a gleam in founder Chris Webber's eye to a full tilt media\nhosting project supporting photos, HTML5 video, and more, the road to\nfederation has been a wild ride so far. Come talk to us about the\nchallenges, the fun and the future.\n",
  "tags": [],
  "thumbnail_url": "https://img.youtube.com/vi/AMMBYLB3qd0/hqdefault.jpg",
  "title": "40. MediaGoblin: The Road to Federation",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AMMBYLB3qd0"
    }
  ]
}
