{
  "alias": "video/726/43-what-is-ipv6-and-why-does-my-website-i-need-i",
  "category": "PyCon US 2012",
  "copyright_text": "",
  "description": "**Background**\n\nOn February 3rd, 2011 the world ran out of the IPv4 addresses that we\nknow and love. The Internet continues to work thanks to technologies\nlike NAT that enable private IP addresses like 192.168.1.1 and 10.0.0.1\nto be reused across organizations. However, even these large blocks of\nprivate IP addresses are not large enough for large ISPs like Comcast in\nthe United States that give several IP addresses to each customer (ex.\ncable set top box, voip, cable modem).\n\nTo continue adding new customers large ISPs have begun deploying two\ntechnologies: IPv6 and large scale NAT.\n\nLarge scale NAT is a way for large ISPs to put several of their\ncustomers behind a single public IP address. This means that the one\npublic IPv4 address you used to have to yourself is now shared by you\nand several of your neighbors. It means that as a website owner it is\nnow more difficult to discern anything useful from the IP addresses\nvisiting your website.\n\nIPv6 solves the address exhaustion problem by moving from approximately\n4 billion IP addresses to 3.4×10^38 IP addresses; more than the number\nof atoms on Earth. With plenty of IP addresses ISPs can now return to\ngiving out unique, public IP addresses to each customer.\n\nMany mobile operators are already beginning to deploy IPv6. In 2009\nVerizon issued a mandate that any LTE devices on its network support\nIPv6 with IPv4 support being listed as optional [1]. An IPv6-only device\nwill still need access to the IPv4 Internet, however, IPv6 and IPv4 are\nnot compatible. Providers like Verizon are putting in place protocol\ntranslation devices that inspect Internet traffic going through them and\nproxy IPv4-only websites to their IPv6 customers. While this may sound\nwonderful it means that mobile providers are inspecting and rewriting\nyour packets. Making things more interesting is that this won't work\nsecurely over SSL. The solution is to enable IPv6 on your website so\nthat IPv6-only hosts can directly access your content.\n\n**Joining the IPv6 bandwagon**\n\nAmazon's Elastic Load Balancer supports IPv6 and is already enabled in\nall east coast availability zones [2]. If you're already using ELB\nenabling IPv6 on your website is as easy as making a single DNS change.\nOr so we'd hope, there are still some impediments to a world where your\nsite runs seamlessly on IPv6.\n\n**The user with broken IPv6**\n\nThere are people in the world with broken or inferior IPv6 connectivity\nand a web browser or operating system that attempt to use IPv6 anyway.\nWhat this means is that if you turn on IPv6 on your website you have the\npotential to cut off those users from your site. In this talk I'll\ndiscuss methods for measuring and analyzing this loss before your\nbroadly enable IPv6 so that you can make an informed decision about when\nand how to flip the switch.\n\n**Geo IP**\n\nGeo IP libraries today are still coming to terms with IPv6. One vendor\nin particular is working on IPv6 but only provides limited support in\ntheir free libraries and not yet in their python driver. In their\ncommercial library, the one generally considered better, they do not\nsupport IPv6 yet due to lack of data [3].\n\n**IPv6 without Amazon**\n\nAt Eventbrite we do development inside of Virtual Box virtual machines.\nIn this talk I'll discuss how we configure IPv6 on both the host and\nguest operating systems so that we can test IPv6 before we push to\nAmazon.\n\n**IP Address Validation**\n\nIf you accept IP addresses from end users check your IP address\nvalidation routines (Django has support, see GenericIPAddressField).\n\n**References**\n\n-  [1]\n   [http://www.circleid.com/posts/20090609\\_verizon\\_mandates\\_ipv6\\_support\\_for\\_next\\_gen\\_cell\\_phones/](http://www.circleid.com/posts/20090609\\_verizon\\_mandates\\_ipv6\\_support\\_for\\_next\\_gen\\_cell\\_phones/)\n-  [2]\n   [http://www.allthingsdistributed.com/2011/05/aws\\_ipv6.html](http://www.allthingsdistributed.com/2011/05/aws\\_ipv6.html)\n-  [3]\n   [http://www.maxmind.com/app/ipv6](http://www.maxmind.com/app/ipv6)\n\n",
  "duration": null,
  "id": 726,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-03-11",
  "related_urls": [
    "http://www.allthingsdistributed.com/2011/05/aws\\_ipv6.html](http://www.allthingsdistributed.com/2011/05/aws\\_ipv6.html)",
    "http://www.circleid.com/posts/20090609\\_verizon\\_mandates\\_ipv6\\_support\\_for\\_next\\_gen\\_cell\\_phones/](http://www.circleid.com/posts/20090609\\_verizon\\_mandates\\_ipv6\\_support\\_for\\_next\\_gen\\_cell\\_phones/)",
    "http://www.maxmind.com/app/ipv6](http://www.maxmind.com/app/ipv6)"
  ],
  "slug": "43-what-is-ipv6-and-why-does-my-website-i-need-i",
  "speakers": [
    "Bob Van Zant"
  ],
  "summary": "On February 3rd, 2011 the world ran out of the IPv4 addresses that we\nknow and love. Clearly the Internet has survived even though hardly\nanyone has deployed IPv4's successor, IPv6. Drop by to learn about what\nIPv6 is, why you should deploy it and some of the hurdles to deployment.\n",
  "tags": [],
  "thumbnail_url": "https://img.youtube.com/vi/DTGi8y1DMtg/hqdefault.jpg",
  "title": "43. What is IPv6 and why does my website I need it",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VuFW0PkNS74"
    }
  ]
}
