{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Our voices are no longer a mystery to speech recognition (SR) software,\nthe technology powering these services has amazed the humanity with its\nability to understand us. This talk aims to cover the intrinsic details\nof advanced state of art SR algorithms with live demos of Project\nDeepSpeech.\n\nA research says that “50% of all searches will be voice searches by\n2020”. World’s technology giants have placed big bets with their\ninvestments in services providing voice search, personal digital\nassistant, IoT devices etc. Solving the problem of speech recognition is\na herculean task, given the complexity involved with data like human\nvoice.\n\nThe talk will cover a brief history of speech recognition algorithms,\nthe challenges associated with building these systems and then explain\nhow one can build an advance speech recognition system using the power\nof deep learning and for illustration, we will deep dive into Project\nDeepSpeech. Project DeepSpeech is an open source Speech-To-Text engine\ndeveloped by Mozilla Research based on Baidu’s Deep Speech research\npaper and implemented using Google’s TensorFlow library.\n\nSpeech recognition is not all about the technology, there are a lot more\nconcerns, challenges around how these AI models are being part of our\nday to day life, its biases etc. The bigger question revolves around\ncentralization of these AI services, projects like Common Voice\naddresses these problems by enabling all to be part of this revolution,\na part of the talk will focus on how people need to approach these type\nof research keeping in mind the community and humanitarian benefits as\nfirst priority.\n",
  "duration": 2564,
  "language": "eng",
  "recorded": "2018-11-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://pycon.hk/schedule-2018/"
    }
  ],
  "speakers": [
    "Vigneshwer Dhinakaran"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ZJpLldlJYY8/maxresdefault.jpg",
  "title": "Demystifying speech recognition with Project DeepSpeech",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZJpLldlJYY8"
    }
  ]
}
