{
    "title": "Do we really need Data Scientists?",
    "description": "Speaker:: Dr. Setareh Sadjadi\n\nTrack: General: Community, Diversity, Carreer, Life and everything else\nThe term Data Science has emerged in the late 70s in a wider spectrum of research and industry and since then we observed an increasing trend for it, especially from late 90s. Data Science job became very hot between 2010-2018 and many companies started hiring data scientists worldwide and many people have been changing their career to data science, from academia or IT industry. However, we have been hearing about “death of data science” here and there in the past 2 years as AI/ML field has been growing and many automated ML tools emerging.\r\nLooking at Google Trends for “Data Science” shows a slow decreasing pattern since mid 2020 as well. That means people have started to google less for “Data Science”. And the job descriptions have become more in the direction of Machine Learning Engineering for so many companies. The job definition of data science has always been vague, and any company has been adopting it to their own needs, but it might be now the time to properly define this job. In this talk I would like to talk about what the job of a data science is and if data science is really going to die and why there is a gap between data science job descriptions and the real skills of the workforce looking for the jobs.\n\n\nRecorded at the PyConDE & PyData Berlin 2022 conference, April 11-13 2022.\nhttps://2022.pycon.de\nMore details at the conference page: https://2022.pycon.de/program/BKSMFA\nTwitter: https://twitter.com/pydataberlin\nTwitter: https://twitter.com/pyconde",
    "thumbnail_url": "https://i.ytimg.com/vi/PxCVbpDYaCM/hqdefault.jpg",
    "duration": 1580,
    "speakers": [
        "Dr. Setareh Sadjadi"
    ],
    "language": "eng",
    "recorded": "2022-05-12",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=PxCVbpDYaCM"
        }
    ],
    "related_urls": [
        {
            "label": "Talk announcement",
            "url": "https://2022.pycon.de/program/BKSMFA"
        }
    ],
    "tags": [
        "PyCon",
        "PyConDE",
        "pyconde2022",
        "pydata",
        "PyDataBerlin",
        "pydataberlin2022"
    ]
}
