{
    "title": "My forecast is better than yours! What does that even mean?",
    "description": "Speaker:: Illia Babounikau\n\nTrack: PyData: Machine Learning & Stats\nForecasting is one of the most popular applications of Machine Learning. In the last decades, it went from large numbers, few factors, and simple algorithms to small numbers, many factors, and complex ML models. Moreover, some modern forecasting models can predict not only naive point estimators of the target variable but their probability distributions. As an example, BlueYonder delivers demand forecasts in the form of demand probability distribution on a very granular level (e.g. for each product, store, and day).\r\nHowever, established forecast evaluation procedures and criteria (e.g. directly using metrics like RMAE, RMSE, MAPE, etc., and comparing these metrics between various data categories) often turn out to be inappropriate and biased. Therefore, it is important to understand the limitations of the traditionally used metrics and approaches. BlueYonder has implemented forecast evaluation techniques to address these limitations. \r\nIn this talk, I will present the most important issues in forecast evaluation and their possible resolutions based on the real use cases of demand forecasting developed within BlueYonder.\n\n\nRecorded at the PyConDE & PyData Berlin 2022 conference, April 11-13 2022.\nhttps://2022.pycon.de\nMore details at the conference page: https://2022.pycon.de/program/WHHMWQ\nTwitter: https://twitter.com/pydataberlin\nTwitter: https://twitter.com/pyconde",
    "thumbnail_url": "https://i.ytimg.com/vi/ldzRfYeI6TA/hqdefault.jpg",
    "duration": 1770,
    "speakers": [
        "Illia Babounikau"
    ],
    "language": "eng",
    "recorded": "2022-05-12",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=ldzRfYeI6TA"
        }
    ],
    "related_urls": [
        {
            "label": "Talk announcement",
            "url": "https://2022.pycon.de/program/WHHMWQ"
        }
    ],
    "tags": [
        "PyCon",
        "PyConDE",
        "pyconde2022",
        "pydata",
        "PyDataBerlin",
        "pydataberlin2022"
    ]
}
