{
  "copyright_text": null,
  "description": "With \"mobile first\" as vision statement, we harness significant power of using Python and django to produce clean back-ends especially using django-piston as key library.\nThe Django framework is quite well known. It is a extremely quick and easy way to develop web sites and apps. Backed by strong developer community and wealth of knowledge available online, it is natural first choice for web-development. But in this case, we use it as an excellent web-app back-end which we drive a mobile front-end.\nSencha is fast becoming an important framework for developing mobile apps which runs elegantly on both Android and iPhone. With almost native API like look and feel, it works like a charm on Android and iPhone platform reducing development time dramatically.\nI will try to address the classic problem of disconnect between mobile and web-apps. Putting the system of producing both within single development cycle. Using django-piston as center piece library. We will use extensively to create well defined APIs. These APIs will in turn be used with Sencha based front-ends.\nExtending further we will take a look at integration testing of this framework towards creating a rock solid mobile experience. This will be followed by discussion on merits of using browser over native app frameworks. ",
  "duration": 227,
  "language": "eng",
  "recorded": "2012-09-30",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://in.pycon.org/2012/index.html#schedule"
    },
    {
      "label": "Presenter Notes",
      "url": "https://docs.google.com/document/d/1YCQh8k_tHc_tQuni_R0Zlc6gnTXm31k4gmQy99lgkXQ/edit"
    },
    {
      "label": "Session Information",
      "url": "https://in.pycon.org/2012/funnel/pyconindia2012/35-mobile-apps-with-python-quick/"
    },
    {
      "label": "Part 1",
      "url": "https://www.youtube.com/watch?v=wvCpBsbdASc"
    },
    {
      "label": "Part 2",
      "url": "https://www.youtube.com/watch?v=lXF7YnnRPRE"
    },
    {
      "label": "Part 3",
      "url": "https://www.youtube.com/watch?v=f8dbzZDrp-Y"
    },
    {
      "label": "Part 4",
      "url": "https://www.youtube.com/watch?v=YHm4Vpjj4Gw"
    }
  ],
  "speakers": [
    "Supreet Sethi"
  ],
  "tags": [
    "mobile",
    "mobile first",
    "sencha",
    "django"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/YHm4Vpjj4Gw/maxresdefault.jpg",
  "title": "Mobile apps with Python, Quick! - part4",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YHm4Vpjj4Gw"
    }
  ]
}
