{
  "description": "\"How To Get On This Stage (And What To Do When You Get There)\" by: Mark Smith\nSpeaking at a programming conference may seem like an impossible goal for many people, for a number of reasons: fear of public speaking, the feeling that you don’t know enough to give a talk, you don’t think you have any good ideas for a talk, or maybe the idea that public speaking is very difficult. I’m going to persuade you that you should get up on stage and give a talk to your peers. Once I’ve persuaded you that you should give a talk, then I’m going to show you how.\n\nComing up with an idea\nComing up with an idea can sometimes be the hardest part! I’ll cover how to get (and keep) ideas by looking at what you do every day, what you know most about, and keeping a notebook of ideas so that when the time comes to submit a proposal, you’ll have plenty of choice.\n\nSubmitting a proposal\nSubmitting a proposal to a CFP can seem quite daunting. Even if it doesn’t seem daunting, there are a bunch of things you can get wrong that make it less likely for your talk to be accepted. I’ll give you several tips for increasing your chances of being selected. I’ll also talk about rejection and why you shouldn’t feel dejected about being rejected. (It happens to everyone!)\n\nWriting a talk\nI’ll describe some processes for writing a talk and building a slide deck to match (if you want to!) I’ll cover some different styles of public speaking, including how to find your own style, and I’ll talk about live coding. (With a strong recommendation that you shouldn’t do it - at least until you’ve got more experience.)\n\nPreparation\nPractice, practice, practice! Many inexperienced speakers underestimate how much rehearsal is required to give a great talk; I’m going to correct this misunderstanding! I’ll cover some different approaches to ensuring that you’re less nervous when it’s time to step on to the stage, and you’ve maximized your chances of your talk going smoothly.\n\nGiving your talk\nAfter you’ve had an idea, had your proposal accepted, written your talk, designed your slides, and practiced (and practiced and practiced) it’ll be time to step behind the lectern and give your talk! I’ll give you tried and tested advice from experienced speakers to help your talk go smoothly.\n\nAnd you know what? Even if some things go wrong you’ll still be applauded enthusiastically by an audience of your peers!\n\nRecorded at the 2021 Python Web Conference (https://2021.pythonwebconf.com)",
  "duration": 2321,
  "language": "eng",
  "recorded": "2021-03-22",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2021.pythonwebconf.com/schedule"
    },
    {
      "label": "Talk announcement",
      "url": "https://2021.pythonwebconf.com/presentations/how-to-get-on-this-stage-and-what-to-do-when-you-get-there"
    }
  ],
  "speakers": [
    "Mark Smith"
  ],
  "tags": [
    "PythonWebConf",
    "PythonWebConf2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/5bbtLTT2360/hqdefault.jpg",
  "title": "How To Get On This Stage (And What To Do When You Get There)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5bbtLTT2360"
    }
  ]
}
