{
  "description": "\"Mystery Machine Learning: Classifying Text with Recurrent Neural Networks, Keras, and Scoob and the Gang\" by: Guy Royse\n\nJinkies! Spoiler Alert! If you’ve seen Scooby-Doo, you know who the monster always is—Old Man Withers, the guy who runs the amusement park. Amusement park operators like Old Man Withers have caused Mystery, Inc. all sorts of problems over the years. Problems that could be avoided with a properly trained recurrent neural network. With RNNs, Scoob and the Gang could have built a model to classify everyone’s speech. This would show them that Old Man Withers and Redbeard’s Ghost sounded a lot alike!\n\nWe can help Mystery, Inc. with this problem by building a recurrent neural network to do just that. You know we got a mystery to solve, and we’re going to solve it by building our model using lines from Scooby-Doo, Keras, and TensorFlow. Once we have our model, we’ll host it on RedisAI so we can quickly build an application to make use of it. Well, we’ve got some work to do now.\n\nI will also explain what neural networks are in general, what recurrent neural networks are in particular, and discuss some practical use of this technology. When we’re done, you’ll know how to build RNNs with Keras, use them to classify text, and integrate them into your application. But more importantly, you’re going to have yourself a Scooby snack! That’s a fact!\n\nRecorded at the 2021 Python Web Conference (https://2021.pythonwebconf.com)",
  "duration": 2743,
  "language": "eng",
  "recorded": "2021-03-22",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2021.pythonwebconf.com/schedule"
    },
    {
      "label": "Talk announcement",
      "url": "https://2021.pythonwebconf.com/presentations/plone-for-news-portals"
    }
  ],
  "speakers": [
    "Guy Royse"
  ],
  "tags": [
    "PythonWebConf",
    "PythonWebConf2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/RAa9UWu2v6c/hqdefault.jpg",
  "title": "Mystery ML: Classifying Text w/ Recurrent Neural Networks, Keras, Scoob and the Gang",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RAa9UWu2v6c"
    }
  ]
}
