{
  "description": "\"Python's NLU library: 1,000+ Models, 200+ Languages, State of the Art Accuracy, 1 Line of Code\" by: Christian Kasim Loan\nHarness the power of 1,000+ production-grade, scalable, free & open-source NLP models for 200+ languages - using just 1 line of Python code by leveraging the NLU library which is powered by the award-winning Spark NLP.\n\nThis webinar covers, using live coding in real-time, how to deliver summarization, translation, unsupervised keyword extraction, emotion analysis, question answering, spell checking, named entity recognition, document classification, BERTology Embeddings, and other common NLP tasks. This is all done with a single line of code, that works directly on Python strings or pandas data frames. Since NLU is based on Spark NLP, no code changes are required to scale processing to a multi-core or cluster environment - integrating natively with Ray, Dask, or Spark data frames.\n\nThe recent releases for Spark NLP and NLU include pre-trained models for over 200 languages and language detection for 375 languages. This includes 20 languages families; non-Latin alphabets; languages that do not use spaces for word segmentation like Chinese, Japanese, and Korean; and languages written from right to left like Arabic, Farsi, Urdu, and Hebrew. We'll also cover some of the algorithms and models that are included. The code notebooks will be freely available online.\n\nRecorded at the 2021 Python Web Conference (https://2021.pythonwebconf.com)",
  "duration": 2122,
  "language": "eng",
  "recorded": "2021-03-22",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2021.pythonwebconf.com/schedule"
    },
    {
      "label": "Talk announcement",
      "url": "https://2021.pythonwebconf.com/presentations/john-snow-labs-nlu-the-simplicity-of-python-the-power-of-spark-nlp"
    }
  ],
  "speakers": [
    "Christian Kasim Loan"
  ],
  "tags": [
    "PythonWebConf",
    "PythonWebConf2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/90Om99th56o/hqdefault.jpg",
  "title": "Python's NLU library: 1,000+ Models, 200+ Languages, 1 Line of Code",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=90Om99th56o"
    }
  ]
}
