{
  "description": "Mar Bartolomé presents \"Hiring demystified\"\n\nFor the questions about the talk to the original speaker, please, use the following link:\nhttps://comunidad.es.python.org/t/hiring-demystified/371\n\nAbstract:\nIt's not secret that the hardest problems in computer science are cache invalidation and naming things... oh, and hiring.\nIn our industry we've developed a culture and a mysticism around hiring, with certain rituals and practices which are often so detached from \nreality that you see numerous jokes and memes about the subject.\nHiring is a difficult problem, yet important to get right. Many developers are faced with the challenge of hiring other team members, without much clue into how to proceed, and end up just copying the well known rituals without stopping to analyse their effectiveness or implications. Often, this results in hindering both companies and candidates, especially those of under represented demographics.\nIn this talk I'll share my experiences and personal opinions both as a candidate and as an interviewer, analyze the implications of popular hiring tactics, and discuss what I consider effective ones, in order to hire the right developers for your team with minimum hassle for both sides.\n\n---\nLa octava edición de la PyConES se celebra como un evento en línea y totalmente gratuito durante el día 3 de Octubre de 2020.\nWeb: https://2020.es.pycon.org/\nAgenda: https://2020.es.pycon.org/index.html#agenda",
  "duration": 979,
  "language": "eng",
  "recorded": "2020-10-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2020.es.pycon.org/"
    },
    {
      "label": "https://2020.es.pycon.org/index.html#agenda",
      "url": "https://2020.es.pycon.org/index.html#agenda"
    },
    {
      "label": "https://2020.es.pycon.org/",
      "url": "https://2020.es.pycon.org/"
    },
    {
      "label": "https://comunidad.es.python.org/t/hiring-demystified/371",
      "url": "https://comunidad.es.python.org/t/hiring-demystified/371"
    }
  ],
  "speakers": [
    "Mar Bartolomé"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/UBLTaQ_tRl4/maxresdefault.jpg",
  "title": "Hiring demystified",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UBLTaQ_tRl4"
    }
  ]
}
