{
  "description": "Antonio José Soto nos presenta una charla sobre Machine Learning con Python\n\nPara las preguntas relacionadas con la charla a los propios autores, por favor, utiliza el siguiente foro:\nhttps://comunidad.es.python.org/t/interpretabilidad-de-modelos-de-machine-learning-con-python/365\n\nResumen:\nTodavía a día de hoy es bastante común encontrarse con clientes o colegas que perciben los modelos de Machine Learning como una caja negra capaz de realizar magia o alquimia para darle al cliente lo que quiere. Sin embargo, la cruda realidad es que sin una comprensión razonable de como funcionan los modelos de ML, los proyectos del mundo real rara vez tienen éxito. Teniendo en cuenta que cualquier proyecto de este estilo tiene un componente de negocio muy relevante y que el objetivo final de estos modelos es que tomen decisiones de forma automática por los usuarios, estos tienen el derecho de plantear preguntas como '¿Cómo puedo confiar en este modelo?' o '¿Cómo toma las decisiones el modelo?' Responder a estas preguntas puede convertirse en todo un reto y es una de las áreas donde se está invirtiendo más esfuerzos hoy en día.\n\n---\nLa octava edición de la PyConES se celebra como un evento en línea y totalmente gratuito durante el día 3 de Octubre de 2020.\nWeb: https://2020.es.pycon.org/\nAgenda: https://2020.es.pycon.org/index.html#agenda",
  "duration": 1313,
  "language": "spa",
  "recorded": "2020-10-03",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2020.es.pycon.org/"
    },
    {
      "label": "https://2020.es.pycon.org/",
      "url": "https://2020.es.pycon.org/"
    },
    {
      "label": "https://2020.es.pycon.org/index.html#agenda",
      "url": "https://2020.es.pycon.org/index.html#agenda"
    },
    {
      "label": "https://comunidad.es.python.org/t/interpretabilidad-de-modelos-de-machine-learning-con-python/365",
      "url": "https://comunidad.es.python.org/t/interpretabilidad-de-modelos-de-machine-learning-con-python/365"
    }
  ],
  "speakers": [
    "Antonio José Soto"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/CoghIHdAMSM/maxresdefault.jpg",
  "title": "Interpretabilidad de Modelos de Machine Learning con Python - PyConES 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CoghIHdAMSM"
    }
  ]
}
