{
  "alias": "video/2216/getting-the-most-out-of-stack-overflow",
  "category": "PyCon AU 2013",
  "copyright_text": "CC-BY-SA",
  "description": "",
  "duration": 30,
  "id": 2216,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-07",
  "slug": "getting-the-most-out-of-stack-overflow",
  "speakers": [
    "Adam Forsyth"
  ],
  "summary": "Stack Overflow is the single greatest repository of coding knowledge in\nthe world. Now approaching five years old, its community-moderated,\nstrict Q&A format has made it far more useful than other similar sites.\n\nContributing to it, however, can be intimidating. The questions of new\nusers are often voted down or closed with little comment, or edited by\nthe community in was the original poster doesn't understand. Answering\nis even worse. How do other people manage to post a detailed answer to a\nspecific question in minutes, or even seconds? How could I possibly know\nso much about such a broad range of topics, even within a single\nprogramming language or framework?\n\nOver the past three years, I've learned a lot from contributing to Stack\nOverflow. It has honed my research, technical writing, and rapid\nprototyping skills, as well as greatly expanded my knowledge of the\nPython ecosystem, standard library, and CPython internals.\n\nI'll share not only how to use the site to learn, but also how to\ncompete effectively with the thousands of other programmers who answer\nquestions there on a daily basis -- we all like to win. I'll talk about\nwhat goes into a good answer, as well as a good question. I'll also talk\nabout how contributing to Stack Overflow is like contributing to any\nother open source project in many ways -- in what you gain, as well as\nwhat the community gains, partly because of the CC-by-SA licensing used\nby the Stack Exchange network of sites.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/CSULRDoF8-g/hqdefault.jpg",
  "title": "Getting the most out of Stack Overflow",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/ndvpyconau2013/Getting_the_most_out_of_Stack_.mp4"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CSULRDoF8-g"
    }
  ]
}
