{
  "alias": "video/2202/making-python-more-fun-for-everyone",
  "category": "PyCon AU 2013",
  "copyright_text": "CC-BY-SA",
  "description": "",
  "duration": 45,
  "id": 2202,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-07",
  "slug": "making-python-more-fun-for-everyone",
  "speakers": [
    "Chris Boesch"
  ],
  "summary": "We spent the first part of our careers developing products and managing\nsoftware teams at IBM, Dell, and Texas Instruments. After moving to\nSingapore, we each found are way into the education space and found\nourselves teaching Python to a variety of audiences. We developed our\nfirst Python game for a friend of ours who was teaching computer science\nin a local high school. Since then, it has been a continual journey to\nsee how fun we could make learning python before our now 10-year old\ndaughter was ready to pickup the keyboard and start helping out. In this\ntalk, we will talk about where our journey started, where we are today,\nand where we hope to be in the near future. We will discuss the\nTournament-based Teaching methodology that we developed to increase\nstudent preparation, in-class engagement, and peer-based learning. Then\nwe will talk about our research in to using mobile devices such as the\niPad to help students practice reading and working with python to gain\nconfidence before moving on to writing code. We will discuss our latest\nfamily project where we have worked with our children to create a fun\npython quest to encourage learners around the world to practice their\npython for just a few minutes more each week. Then looking forward, we\nwill talk about our latest research in to pair-based programming\nassignments, pair-programming tournaments, team-based logic\ncompetitions, encouraging more girls to try programming, and the goal to\nframe programming as a very healthy habit. Our hope is that this talk\nwill be interesting for educators looking to increase student engagement\nand interest, for managers looking for fun ways to increase the\nproductivity of their development teams, and for parents looking for\nadditional ways to enable their children to experiment with python.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/-hsxIqQG548/hqdefault.jpg",
  "title": "Making Python More Fun for Everyone",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/ndvpyconau2013/Making_Python_More_Fun_for_Eve.mp4"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-hsxIqQG548"
    }
  ]
}
