{
  "alias": "video/2228/scikit-learn-machine-learning-and-cybercrime-att",
  "category": "PyCon AU 2013",
  "copyright_text": "CC-BY-SA",
  "description": "",
  "duration": 30,
  "id": 2228,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-06",
  "slug": "scikit-learn-machine-learning-and-cybercrime-att",
  "speakers": [
    "Robert Layton"
  ],
  "summary": "The scikit-learn library is a rapidly growing open source toolkit for\nmachine learning in python. It allows for practitioners and researchers\nto apply machine learning in a variety of applications and is used by\ncompanies worldwide. Developed by programmers from around the world, the\nproject has a large (and increasing) number of machine learning\nalgorithms, a very useful set of utility functions and has also spawned\na set of detailed tutorials. Written in python with the aid of numpy,\nscipy and cython, this library is featured, fast and extensible.\n\nIn this talk, I will introduce scikit-learn, giving an overview of the\nlibrary, its features and how to use it for a number of different\napplications. Next talk about some of the tutorials that are actively\nbeing developed for learning machine learning and scikit-learn and also\nhow to contribute. Through this, I'll introduce some key machine\nlearning concepts and how you can apply them to a variety of tasks. The\nfocus will be on practical uses, rather than theoretical advances.\n\nTo end the presentation, I'll briefly overview the research I perform at\nthe Internet Commerce Security Laboratory (University of Ballarat) in\ncybercrime attribution, where I work with our industry partners to\ndisrupt cybercrime. While it can be very difficult to do direct network\nbased attribution, indirect methods through criminal profiling may\nassist in stopping crimes such as phishing or online fraud. I'll walk\nthrough some of our results in identifying the size and scope of the\noperations behind some of these attacks.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/onYs20ykbBY/hqdefault.jpg",
  "title": "scikit-learn, machine learning and cybercrime attribution",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/ndvpyconau2013/scikitlearn_machine_learning_a.mp4"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=onYs20ykbBY"
    }
  ]
}
