{
  "alias": "video/2230/software-carpentry-arrives-down-under",
  "category": "PyCon AU 2013",
  "copyright_text": "CC-BY-SA",
  "description": "",
  "duration": 30,
  "id": 2230,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-06",
  "slug": "software-carpentry-arrives-down-under",
  "speakers": [
    "Damien Irving"
  ],
  "summary": "Scientists are required to do more and more programming these days,\nhowever they are almost always self-taught. They spend a large\npercentage of their time wrestling with software, reinvent a lot of\nwheels, and still don’t know if their results are reliable. For\nproficient software developers, particularly those employed to assist\nthese scientists, this computational illiteracy is easy to identify, but\nmuch harder to remedy. What do you teach a scientist, given their time\nconstraints, background knowledge and work requirements? This\npresentation will give an answer to that question, by describing what\ngets taught at a Software Carpentry boot camp.\n\nSoftware Carpentry is a volunteer organisation that has been teaching\nbasic software development to scientists for over a decade. Supported by\nthe Sloan Foundation and Mozilla, Software Carpentry has refined its\nteaching methods over time and has recently settled on a model centred\naround the delivery of intensive short courses known as “boot camps”.\nInstitutions such as Oxford University, MIT, University of California\nBerkeley and the International Centre for Theoretical Physics have all\nhosted boot camps in the past 12 months.\n\nDr. Greg Wilson, the founder of Software Carpentry, flew out to\nAustralia in February 2013 to host a series of two day boot camps with\nthe Genes to Geoscience Research Centre in Sydney and the Australian\nMeteorological and Oceanographic Society (AMOS) and ARC Centre for\nExcellence in Climate System Science in Melbourne. These two events were\nthe first ever boot camps held outside of North America and Europe, were\nbooked out in a matter of days, and received rave reviews from\nparticipants. Given this success, there are already plans afoot to host\na pair of boot camps for the bioinformatics community in Brisbane and\nAdelaide later this year, plus another for the weather/climate community\nin Hobart.\n\nThis presentation will describe what gets taught at a Software Carpentry\nboot camp (hint: there's lots of Python), how it's taught and why it's\nso effective (hint: we take an evidence-based approach to teaching). All\nSoftware Carpentry teaching materials can be freely re-used under open\naccess licenses, so at the conclusion of the talk you can take anything\nyou've learned and apply it to your own work and/or teaching. Better\nstill, you'll find out how to join the Australian Software Carpentry\nteam, so that you can organise and/or teach a boot camp for your own\ndiscipline.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/-AGgugxn4RM/hqdefault.jpg",
  "title": "Software Carpentry arrives Down Under!",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/ndvpyconau2013/Software_Carpentry_arrives_Dow.mp4"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-AGgugxn4RM"
    }
  ]
}
