{
  "alias": "video/2236/using-python-to-drive-australian-water-availabili",
  "category": "PyCon AU 2013",
  "copyright_text": "CC-BY-SA",
  "description": "",
  "duration": 30,
  "id": 2236,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2013-07-07",
  "related_urls": [
    "http://bom.gov.au/water/hrs.",
    "http://bom/gov.au/water/ssf"
  ],
  "slug": "using-python-to-drive-australian-water-availabili",
  "speakers": [
    "David Kent"
  ],
  "summary": "With Andrew MacDonald and Daehyok Shin\n\nThe Australian Bureau of Meteorology provides water availability\nforecasts to the public and to key stakeholders at different time-scales\nacross the nation. A number of the systems driving these forecasts make\nextensive use of Python. Python is used throughout the forecasting\nprocess - from data ingestion and management, to hydrological modelling\nand data analysis through to graphical product generation. A wide\nvariety of packages are used heavily. These include NumPy, SciPy,\nMatplotlib, PyTables and Pandas. Such a suite of scientific computing\npackages for Python enables us to complete the development of fully\nautomated systems quickly even with limited resources.\n\nThis presentation will give an overview of the systems used by the\nBureau in the generation of water availability forecasts and highlight\nthe wide variety of tasks and processes enabled by Python. In\nparticular, we will introduce the Hydrologic Reference Stations (HRS)\ntoolkit and the Water Availability Forecasts for Australian Rivers\n(WAFARi) system. The HRS toolkit analyses time-series of streamflow data\nand produces a huge number of products describing mean state, trends and\nvariability in that data, which are released at\nhttp://bom.gov.au/water/hrs. WAFARi is used to generate probabilistic\nseasonal streamflow forecasts along with a suite of graphical products\nfor each of those forecasts. The system is being used to update\nstreamflow forecasts available at http://bom/gov.au/water/ssf every\nmonth.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/Gr9MPKTLXpY/hqdefault.jpg",
  "title": "Using Python to drive Australian water availability forecasting",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/ndvpyconau2013/Using_Python_to_drive_Australi.mp4"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Gr9MPKTLXpY"
    }
  ]
}
