{
  "category": "PyCon APAC 2015",
  "slug": "orchestrating-the-execution-of-workflows-for-media",
  "title": "Orchestrating the execution of workflows for media streaming ... - Shuen-Huei Guan (PyCon APAC 2015)",
  "summary": "",
  "description": "Orchestrating the execution of workflows for media streaming service and even more\nSpeaker: Shuen-Huei Guan\n\nOne of advantages about cloud computing is potentially huge-scale resources for your task. And it's especially beneficial to data driven process with heavy computing. In this talk, the idea of job script to orchestrate the execution of workflows across multiple computing nodes is introduced. An implementation based on AWS SWF (Simple Workflow) is described with examples of processing for music streaming and video streaming in KKBOX.\n\n\nAbout the speaker\n\nShuen-Huei Guan, or just Drake, started his career as a technical director and, then, R&D manager in animation industry for 9 years with Hollywood experts and ingenious artists. What he has been playing with are Pixar's RenderMan, stereoscopic vision, or even other computer graphics research papers. The only common thing within is Python, which he uses to build prototype or even final product. And then, he brought what cultivated from that visual industry into music industry, KKBOX. But, this time, the challenges come from video streaming service. Quite dramatic, right!\n\n個人網頁連結 http://about.me/drakeguan\nTwitter @drakeguan\n組織/公司 KKBOX\n頭銜 Sr. Principal Engineer\n\nhttps://tw.pycon.org/2015apac/zh/program/92",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "Standard YouTube Licence",
  "thumbnail_url": "https://i.ytimg.com/vi/aCDt3RJoV54/sddefault.jpg",
  "duration": 2197,
  "videos": [
    {
      "length": 2197,
      "url": "https://www.youtube.com/watch?v=aCDt3RJoV54",
      "type": "youtube"
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=aCDt3RJoV54",
  "tags": [],
  "speakers": [
    "Shuen-Huei Guan"
  ],
  "recorded": "2015-08-24"
}