{
  "summary": "",
  "speakers": [
    "Van Lindberg"
  ],
  "source_url": "https://www.youtube.com/watch?v=I9tOYv8DcRQ",
  "description": "Speaker: Van Lindberg\n\nVan Lindberg has worked professionally as an engineer, as a lawyer, and as an executive. He currently has a dual legal/technical role at Rackspace, and has worked out of both the legal department and the Office of the CTO. In April 2012, the American Bar Association Journal named Van as one of \"America's Top 12 Techiest Attorneys.\" He has been involved with open source since 1994, when a friend introduced him to Linux.\n\nOn the legal side, Van leads Rackspace's Intellectual Property program, directing Rackspace's strategy and policy around patent, copyright, trademark, trade secret, and open source matters. Van also heads Rackspace's lobbying efforts relative to patent reform.\n\nOn the technical side, Van runs Rackspace's technical leadership corps, known internally as the \"TCT.\" Van also works in technical strategy and ecosystem engagement at Rackspace, identifying emerging technologies, separating out differentiating versus non-differentiating product elements, and using open source strategies to be more competitive.\n\nPreviously, Van worked at the law firm of Haynes and Boone, where he wrote \"Intellectual Property and Open Source,\" published by O'Reilly and Associates, and grew an open source practice helping businesses with everything from open source compliance to business strategy.\n\nIn addition to Van's open source practice, he did IP transactional work, patent prosecution, litigation, and post-grant actions (ex parte and inter partes reexams/reviews).\n\nVan currently serves as chairman of the board of the Python Software Foundation, on the board of the OpenStack Foundation, and as the chair of the Docker Governance Advisory Board.\n\nhttps://tw.pycon.org/2015apac/zh/program/keynote-speaker/",
  "title": "R0 DAY1-K1 Ecosystem Threats to Python - Van Lindberg  (PyCon APAC 2015)",
  "thumbnail_url": "https://i.ytimg.com/vi/I9tOYv8DcRQ/sddefault.jpg",
  "quality_notes": "hd",
  "tags": [],
  "duration": 2891,
  "copyright_text": "Standard YouTube Licence",
  "language": "en",
  "recorded": "2015-08-24",
  "category": "PyCon APAC 2015",
  "videos": [
    {
      "type": "youtube",
      "length": 2891,
      "url": "https://www.youtube.com/watch?v=I9tOYv8DcRQ"
    }
  ],
  "slug": "r0-day1-k1-ecosystem-threats-to-python-van-pycon"
}