{
  "category": "PyCon APAC 2015",
  "slug": "r1-day1-05-network-security-and-analysis-with-lee",
  "title": "R1 DAY1-05 Network Security and Analysis with Python - Lee Yang Peng (PyCon APAC 2015)",
  "summary": "",
  "description": "Speaker: Lee Yang Peng\n\nI developed and evaluated Analytics, a tool that analyses packet data to learn information about network protocol formats. Analytics attempts to discover constants and enumeration fields among packet data, while providing visualization to aid analysts. My experiments on fixed length protocol headers show that the heuristics implemented for Analytics in detecting constants and enumeration fields are mostly accurate. It has an average accuracy in detecting constants of 76.8% and an average accuracy in detecting enumeration fields of 88.6%. As Analytics consists of heuristics to detect the targeted fields in network traces, it can also be applied onto proprietary or unknown protocols.\n\nFrom my talk, audience can learn about network security and its significance. Poor network security can result in vulnerabilities in an organization, which may result in commercial espionage, the leakage of company secrets, or the control of computers connected to the network to perform illegal activities. Audience can also benefit from my talk by learning about Deep Packet Inspection, a common process used in large organizations to maintain network security and prevent the transfer or malicious data through a network. Experts in the field can appreciate the tool, 'Analytics', that demonstrates the use of Python in garnering information about unknown network protocol formats.\n\nAbout the speaker\n\nI'm a 16 year old student from Dunman High School\n\n組織/公司 Dunman High School\n頭銜 Student",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "Standard YouTube Licence",
  "thumbnail_url": "https://i.ytimg.com/vi/7qsixKitI18/sddefault.jpg",
  "duration": 2258,
  "videos": [
    {
      "length": 2258,
      "url": "https://www.youtube.com/watch?v=7qsixKitI18",
      "type": "youtube"
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=7qsixKitI18",
  "tags": [],
  "speakers": [
    "Lee Yang Peng"
  ],
  "recorded": "2015-08-24"
}