{
  "category": "PyCon APAC 2015",
  "slug": "r2-day2-05-for-physics-in-blender-or-what-light",
  "title": "R2 DAY2-05 for physics in blender: (or, what light looks like) - David Mikolas (PyCon APAC 2015)",
  "summary": "",
  "description": "Speaker: David Mikolas\n\nWhen I first told my friends and family that I was taking some time off to learn about blender and python for scientific visualization, some of them became confused and worried, thinking I had snakes in my kitchen. In fact, I'm a scientist/engineer and I need an environment to calculate things and show the results, and these two open source packages offered everything I need!  \n\nPython has become a popular platform in physics for both professional research and teaching settings. Scipy and numpy have most of the goodies we need, and there are plenty of other libraries out there. However, depending on one's previous experience with other tools, learning to really use python \"pythonically\" can sometimes be a little bumpy. \n\nIn this talk I'll first give a quick tutorial on how to get started doing physics in python the right way - the tutorial that I *wish* I could have read in the beginning. I'll give some examples of interactive programs using the matplotlib widgets as a user interface, for a variety of engineering and physics applications. This is the International Year of Light [1] celebrating a number of optical \"birthdays\", so we'll look at some of those with Python.\n\nThen I'll show some results where I cast a complicated math/optics problem as a collection of python objects (in python, everything is an object!) to make the solution more tangible. Since blender - a rendering and animation environment with python scripting built-in - eats python objects for breakfast, one can just transfer the code into blender and make animated 3D visualization of the problem setup, calculation, and final results. \n\n[1]  www.nature.com/news/light2015-1.16846\n\n\nAbout the speaker\n\nDavid enjoys physics, math, optics, engineering... and now, python! He's worked in the semiconductor industry, both in process development and metrology. Currently he's looking at \"what's next\" in optical communications.  Note: check the personal link close to PyCon for additional information about talk. \n\nNEW LINK (July 2015)!! Works better. I'll be adding posts regularly now.\n\n個人網頁連結 http://davidmikolas.blogspot.tw/\n頭銜 Engineer/Scientist",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "Standard YouTube Licence",
  "thumbnail_url": "https://i.ytimg.com/vi/_6LXW3KAI-A/sddefault.jpg",
  "duration": 1831,
  "videos": [
    {
      "length": 1831,
      "url": "https://www.youtube.com/watch?v=_6LXW3KAI-A",
      "type": "youtube"
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=_6LXW3KAI-A",
  "tags": [],
  "speakers": [
    "David Mikolas"
  ],
  "recorded": "2015-08-24"
}