{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nAn introduction to Python on hardware from the perspective of writing device drivers for embedded systems.\n\nAbstract\nMy talk will start with an overview of embedded development and working with sensors, highlighting differences compared to normal computing. Once the broad strokes are covered I will explain the high level goals and techniques of writing drivers specifically before diving into the details I will first discuss using datasheets to determine how a device works and what it's capabilities are. Following that I will discuss using the device’s capabilities by writing to and reading from registers and will include a review of basic bitwise operations. Next will discuss the common communication protocols used in embedded development before talking about the CircuitPython libraries that support them. Finally I will discuss some newer libraries that I use that make developing drivers very simple and compare it with traditional embedded development practices.\n\nOriginal slides: \n\nAbout the speaker\nAfter braving the first 15 years of my professional life as a web developer, I was recently given a once in a lifetime opportunity to turn my passion into my profession. I turned in my software spurs to work full time as an embedded engineer for an amazing open source hardware and software company and have been living the dream ever since. Hardware provides a hands on relationship with the fruits of your labor that is hard to find in pure software and I find makes the work especially rewarding.\n\nOutside of work I am a kayak fisherman, music aficionado, endless tinkerer, accomplished jerry-rigger, father to 3 cats, two dogs, 6 fish, and a chinchilla, and husband to an amazing artist and teacher.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3 #gdb",
  "recorded": "2019-08-17",
  "speakers": [
    "Bryan Siepert"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/DdB3QS4_QQU/hqdefault.jpg",
  "title": "Accelerating Driver Development with CircuitPython",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DdB3QS4_QQU"
    }
  ]
}
