{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nSQL can seem like an obscure but somehow useful language. In this talk we will look into things that SQL can do, sometimes more easily than using python, and how to get it in your ORM, running in your application. During this talk we will use an application analysing the lyrics of my favorite teenage band and show fun examples of these SQL statements, and how to integrate them in your code\n\nAbstract\nThis talk has as a goal to go into the SQL language and see what ORMs (django, sql alchemy) support them. At the end of the talk what I would like is: for developers to understand SQL, and how ORM executes SQL better to discover fun SQL things that they might not know, and what can or can't be used with simple ORMs call and if it's not (yet) in the ORM, how can I execute it beautifully\n\nThe talk will take an example of analysing song lyrics of an artist, with fun queries on frequency of words over the years, most common patterns etc. There will be a simple django app and I will show how the following can be done, and how it is useful: joins group by aggregations window functions lateral joins ctes grouping sets\n\nOriginal slides: https://t.ly/B0jV7\n\nAbout the speaker\nI'm a software developer at citus data (Microsoft). I have been using django for over 5 years and enjoy working on performance using my two favorite things: python and SQL. I have also been involved in the postgres and postgresWomen community. I have talked to django con europe and pycarribean, and love the python community !\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3",
  "recorded": "2019-08-17",
  "speakers": [
    "Louise Grandjonc"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/tphMOCl6p6Y/hqdefault.jpg",
  "title": "Amazing things your ORM can or can't do",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tphMOCl6p6Y"
    }
  ]
}
