{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nIf you had to build a software application right now, how would you do it? First step, Python. But then what?\n\nThis talk looks at over 200 of the most-successful open-source Python applications to provide advice on building effective software to reach the masses. Architecture, testing, licensing, packaging and distribution, these projects hold lifetimes of work and wisdom, waiting to be learned!\n\nAbstract\nIf you had to build a software application right now, how would you do it? First step, Python. But then what?\n\nThis talk looks at over 200 of the most-successful open-source Python applications to provide empirical advice for building effective software to reach the masses. We'll look at architecture, testing, licensing, and even packaging and distribution. Each of these applications contains answers to every question raised during application development.\n\nWhy spend days and weeks piecing together the basics from first principles (blog posts and Stack Overflow), when Python's rich ecosystem readily provides? Go farther by following in the footsteps of such giants as Deluge, Reddit, Pi-Hole, FreeCAD, Unknown Horizons, Calibre, Magic Wormhole, Synapse, Zulip, Anki, Sage Math, Sentry, and more.\n\nIn this presentation, we'll explore many questions, just a few of which include:\n\nWhat userbases do Python-based applications reach?\nWhere in software is Python leading, and what domains represent its biggest gaps?\nWhat library dependencies appear in the application zeitgeist?\nWhat copyright licenses are used by applications, and how do these practices differ from libraries?\nHow many projects rely only on donations, as opposed to having foundation or corporation support?\nWhat can Python developers do to support and get involved in Python's rich application space?\nA production application is worth a hundred blog posts and a thousand Stack Overflow answers. You've already heard all the talk about best practices, now come hear about the practical practices from real Python applications.\n\nOutline:\n\n3m - Defining the \"application\"\n3m - Distinguishing between open-source application and library development\nThe top 200 open-source Python applications (methodology and taxonomy)\n3m - Exemplars (e.g., Deluge, Anki, Synapse, yum/dnf, etc.)\n3m - Methodology and prior art\n2m - Taxonomy and organization\nCommon patterns and antipatterns in Python application design\n3m - Architecture\n4m - Dependencies\n5m - Packaging and distribution\n2m - Documentation\n3m - Licensing\n3m - The role of open-source in future Python usage\n3m - Getting involved in open-source\nTotal: 37 minutes\n\nOriginal slides: https://t.ly/dwXG8\n\nAbout the speaker\nMahmoud Hashemi is a backend engineer and architect, open-source library maintainer, and Wikipedian, with ten years of experience building enterprise software. He authored O'Reilly's Enterprise Software with Python, host of the Pyninsula Python meetup group in the San Francisco Bay Area, and presenter of talks on Python and architecture, delivered all around the world.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3 #gdb",
  "language": "eng",
  "recorded": "2019-08-16",
  "speakers": [
    "Mahmoud Hashemi"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/JSiukgTcI4k/hqdefault.jpg",
  "title": "Ask the Ecosystem: Lessons from 200+ FOSS Applications",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JSiukgTcI4k"
    }
  ]
}
