{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nToo often, the people giving talks have already arrived at big fancy titles: Directors of Engineering, Chief Scientists, and Founders. But at some point, all of us will interview for that dream job, and most of us will suffer a coding interview or two or twenty. Fortunately, Python is an ideal language for many coding interviews. Come discover tools and tips for technical interviews with Python.\n\nAbstract\nThe dreaded technical interview: 45 minutes, an algorithmic puzzle, your career, and hundred(s) of thousands of dollars all hanging in the balance. An odd niche of programming, the technical interview will often require tradeoffs which you would not make in daily work. We'll look at three kinds of technical interviews: algorithmic, object-oriented, and coding; and many kinds of solutions: brute-force, greedy, divide-and-conquer, recursive, back-tracking, dynamic-programming, recurrence relations, and finite state machines.\n\nWe'll review the big-O of Python's core data type abstractions (sequences, mappings, sets) along with helpful standard library modules like collections, heapq, bisect, and itertools. There's a number of core language features like iteration, lexicographic ordering, and the numeric hierarchy that are helpful. And dozens of tips around placeholders, managing two-dimensional data structures, and gotcha-differences between Python and other languages.\n\nI recently decided to return to the corporate world and had the (mis)fortune to endure dozens of coding interviews across Facebook, Apple, Amazon, LinkedIn, Google, and startups. Learn from my mistakes! Like, pitfalls with an interviewer that doesn't know Python? Or how and where to practice? Come learn the assets and liabilities of Python as applied to the technical interview.\n\nOriginal slides: https://t.ly/Yrg2E\n\nAbout the speaker\nGrant Jenks is a technical leader with a proven track record of turning research and product ideas into high performance software. He has eleven years of experience in software engineering. After five years at Microsoft as a compiler engineer on the Midori OS incubation project, Grant founded an adtech company and applied his expertise in distributed systems and machine learning to predicting search engine rankings. Grant loves Python and looks for opportunities to give back to the open-source community.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3",
  "language": "eng",
  "recorded": "2019-08-17",
  "speakers": [
    "Grant Jenks"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/HF-83WaQq8A/hqdefault.jpg",
  "title": "Be Ye Therefore Wise As Serpents",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HF-83WaQq8A"
    }
  ]
}
