{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nBrowsers provide many ways to help keep your users and their data secure. In this talk, learn about what security features are available and how to enable them in Flask, Django, or other web applications. This talk is targeted at intermediate web developers, but should be useful for beginners as well.\n\nAbstract\nEach section will discuss a type of vulnerability and how the browser can be configured to protect users. Examples will be shown using Flask, but are applicable to other applications.\n\nOverview of how browsers behave by default and what configuration is available.\nCross-site Scripting and the X-XSS-Protection header\nContent sniffing and the X-Content-Type-Options header\nClickjacking, using frames to trick users into clicking hidden content, and the X-Frame-Options header\nCookie header options and content security\nHistory information and the Referrer-Policy header\nHTTPS headers: TLS certificates, HTTP redirection, and Strict Transport Security\nContent-Security-Policy controls where different types of content can be loaded from. Explain how to determine a good policy for an application.\nValidating security configuration\nhttps://www.ssllabs.com/ssltest/\nhttps://securityheaders.com/\nUsing these tools and interpreting results. What do good and bad configurations look like?\n\nAbout the speaker\nDavid Lord is a core maintainer of Flask and manages the Pallets open source organization. He is a member of San Diego Python, where he helps organize a weekly Python study group.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3 #gdb",
  "recorded": "2019-08-16",
  "speakers": [
    "David Lord"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ZsrjRhFi90s/hqdefault.jpg",
  "title": "Browser security with HTTP headers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZsrjRhFi90s"
    }
  ]
}
