{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nIn Django, we have a powerful tool called ORM to manipulate databases easily. For small queries, it can be quite simple, but what happens when you need to do tricks like nested queries or computed values? One of the answers is query expressions. In this talk, we'll learn how to power-up queries with them by walking through comparisons and examples with a dataset.\n\nAbstract\nIt's known that ORMs are a powerful tool to manipulate databases with ease. In Django, there are a set of out-of-the-box abstractions to help perform queries and shape them through annotations, aggregations, order by, and so on, hence saving one's time. A common solution to filtering when models grow larger over time is creating redundant fields; a better solution is using Django built-in resources called query expressions.\n\nQuery expressions are smart yet straightforward functions that one can use to compute values on query execution and do string manipulation, calculations, among others, thus removing the burden of having unnecessary extra columns in our database. Using query expressions effectively can help to generate performant queries, avoiding potential inconsistencies and separating concerns.\n\nThis talk focuses on further optimizing Django queries by walking through code comparisons and examples with a dataset, diving into subjects such as custom database functions, conditional expressions, and filtering so to answer questions about the data.\n\nOriginal slides: https://t.ly/7P2mb\n\nAbout the speaker\nI'm a full stack developer at Vinta Software (www.vinta.com.br) and Django Girls organizer at my hometown, Recife. When not coding and working on personal projects, I'm usually cooking and watching Grey's Anatomy.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3 #gdb",
  "language": "eng",
  "recorded": "2019-08-16",
  "speakers": [
    "Vanessa Barreiros"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/vZz6IjiG80g/hqdefault.jpg",
  "title": "Building effective Django queries with expressions",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vZz6IjiG80g"
    }
  ]
}
