{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nKiva has provided an enormous amount of data transparency for over a decade. The data has powered economics studies and machine learning research. Attendees will be introduced to the one of the largest publicly available data sets for micro finance.\n\nAbstract\nKiva has supported a thoroughly documented REST api that resulted in many academic research papers that can be found at https://www.kiva.org/build/research as well as applications such as KivaLens (http://www.kivalens.org/#/search) , http://www.kivajapan.org/, https://www.wakibi.nl/.\n\nThis talk introduces the work completed around use of Kiva's open data, as well as an introduction to Kiva's GraphQL api and an announcement of the deprecation of the REST api.\n\nOriginal slides: https://t.ly/JJlA2\n\nAbout the speaker\nMelissa Fabros is a Software Engineer at Kiva. She comes to programming from the world of nonprofits and higher education. Melissa’s interest in programming started in middle school where she was a founding member of the computer club. However, she majored in English and American Literature in college. Even in academia, Melissa still maintained her coding interests by making small web page projects. Melissa transitioned from lecturing at the University of California (Merced) to working at Kiva by taking part-time coding classes, completing Google Summer of Code, a full-stack bootcamp, Rails Girls Summer of Code and Fast.ai.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3 #gdb",
  "language": "eng",
  "recorded": "2019-08-16",
  "speakers": [
    "Melissa Fabros"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/pn86zThtnww/hqdefault.jpg",
  "title": "Data Access at Kiva org",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pn86zThtnww"
    }
  ]
}
