{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nI will present strategies to create effective data representations using a variety of python libraries. This talk will contain effective data visualization principles contextualized through Python examples. We will focus on commonly used techniques such as bar charts, pie charts, and will also discuss new strategies such as small multiples & use of animation and interaction for data exploration.\n\nAbstract\nThe world produces 2.5 quintillion bytes of data every day, and 90% of all data has been created in the last two years. Data visualization provides an avenue to gain a better understanding into this complex and vast deluge of multiattribute, time-varying data.\n\nIn this talk, I will present strategies to present data effectively using a variety of Python libraries such as seaborn, plotly, networkx, and geoplotlib. Specifically, I will present strategies that discuss how to effectively choose between using bar charts, pie charts, parallel coordinates, slope charts, and so on when representing data. I will discuss scenarios when it is appropriate to use the \"small multiples\" technique to visualize multivariate data using seaborn and plotly.\n\nWhen visualizing geographical data, choropleth maps or graduated/scaled symbols are widely used, but it is crucial to understand the limitations of these techniques. I will present alternatives to visualize geographical data effectively using geoplotlib.\n\nFor examining relationships between entities graphs/networks are frequently used. Edge crossings are highly undesirable when tracing paths and exploring incoming/outgoing edges. I will present \"edge bundling\" and discuss their use with chord diagrams to alleviate problems associated with edge crossings. We will examine networkx for visualizing networks.\n\nLastly, I plan to provide critical tips related to labeling, animation, interaction, and possibly strategies to convey uncertainty in data visualization.\n\nAbout the speaker\nAlark Joshi is a Data Visualization Researcher and an Associate Professor of Computer Science at the University of San Francisco. He has published many research papers in the field of data visualization and has been on award-winning panels at the top Data Visualization conferences. He has taught Data Visualization courses to Computer Science as well as Data Science majors. He was awarded the Distinguished Teaching Award at the University of San Francisco in 2016. He received his Ph.D in Computer Science from the University of Maryland Baltimore County.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3 #gdb",
  "recorded": "2019-08-16",
  "speakers": [
    "Alark Joshi"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Cg0VPgPwT28/hqdefault.jpg",
  "title": "Effective Visual Representations using Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Cg0VPgPwT28"
    }
  ]
}
