{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\n3D printers are becoming more and more accessible, but to create your own objects, you need to know how to generate 3D models. Get started by using OpenPyScad, a Python library that generates 3D-modeling source code.\n\nThis talk will go over the challenges I encountered while learning 3D modeling, including deciding on which tools to use and how to think about 3D objects in code.\n\nAbstract\nI am a software engineer who likes making physical things, which is my motivation for learning 3D modeling using Python. I'll start with an intro on how to think about 3D objects (ie creating a polygon, extruding, adding/subtracting volume using Boolean operations, etc). Then I’ll go into the 3D modeling tools I tried and why I ended up not using them (Solidworks, Blender), which led me to OpenSCAD and discovering the OpenPyScad library, which lets me programmatically generate 3D models using Python. I’ll also show some quirks with OpenPyScad/OpenScad that I encountered.\n\nOriginal slides: https://t.ly/GYzp0\n\nAbout the speaker\nJulia enjoys making things from technology, art, or a combination of both. She likes to call her projects “physical puns” as they are often built upon some word play. She currently works as a software engineer on the Google Surveys team.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3 #gdb",
  "language": "eng",
  "recorded": "2019-08-16",
  "speakers": [
    "Julia Ma"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/sXmraYomR1E/hqdefault.jpg",
  "title": "Generate Extrude Build",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sXmraYomR1E"
    }
  ]
}
