{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nPytest is a widely-used, full-featured Python testing tool that helps you write better programs. Did you know that you can easily enhance and customize Pytest through the use of plugins? In this talk, you will learn all about some of the useful Pytest plugins that are available, and learn how to create your own plugins.\n\nAbstract\nPytest is a widely-used, full-featured Python testing tool that helps you write better programs. Whether you have been using Pytest for years or are just getting started, you may find features of Pytest that you would like to modify or customize for your own environment or specific use cases. Did you know that you can easily enhance and customize Pytest through the use of plugins? In this talk, you will learn all about some of the useful Pytest plugins that are available, and learn how to create your own plugins. We will walk through the plugin creation process by creating a plugin to upload Pytest reports to a Google Cloud Storage bucket.\n\nOriginal slides: https://t.ly/RX8Yp\n\nAbout the speaker\nDarlene Wong is a Silicon Valley native, currently working as a Sr. Software Development Engineer in Test at Palo Alto Networks. In the past, she worked on engineering velocity tools at Tango, security tools at Juniper, data engineering at NearbyNow, and developer productivity tools at Cisco. Darlene holds an MS in Computer Engineering from Santa Clara University and a BS in Computer Science from UCLA. She enjoys dance, volunteering, and travel.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3 #gdb",
  "language": "eng",
  "recorded": "2019-08-17",
  "speakers": [
    "Darlene Wong"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/QwDhzFkE9J4/hqdefault.jpg",
  "title": "How to Write Pytest Plugins",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QwDhzFkE9J4"
    }
  ]
}
