{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nLearn how to build a network web in Python to reflect conversations between people based on Slack conversations. Then, build a natural language processing model to evaluate what all those people are talking about, and which conversations determine who in the network carries “technical knowledge”.\n\nAbstract\nWhat can you do with your Slack data? Turns out, a lot! In this presentation, we will go over the basics of how to build a network map in Python, in this instance, using your conversations in Slack regarding who is talking to who. From there, we will dive deeper into the diagram by building a rule-based natural language processing model and a basic machine learning model to understand the context of the conversations that we’ve mapped. Which conversations are social and which are work-related? Which conversations are people asking for advise or technical questions? Who are the main players in the map who answer people’s questions quickly and effectively? Through this process, we are able to find 5 “influencers” out of 200,000 Slack messages.\n\nOriginal slides: https://t.ly/2JZzd\n\nAbout the speaker\nEva Sasson is a technical Product Marketer at Sentry.io, an open source & SaaS startup that supports developers on the wild journey to debug the code they build. In addition to working at Sentry and advising impact startups, Sasson has an MSc in Business Analytics and Management Science from University College London, where she explored building data science models in Python and dove into a handful of subjects from bias in machine learning to prediction models. Sasson presented about Network Graphs at the Sunbelt Conference in Utrecht, Netherlands, Pycon Canada, PyTennessee and about Machine Learning Bias at DataDay Mexico, in addition to speaking engagements at the United Nations Human Rights Counsel in Geneva, and at the startup conferences in Silicon Valley, Mobile Beat and Demo. A college entrepreneur and technical product marketer, Sasson’s passion is to support women and underrepresented communities in tech, in addition to transitioning to a zero waste lifestyle and keeping lots of things in jars.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3 #gdb",
  "language": "eng",
  "recorded": "2019-08-17",
  "speakers": [
    "Eva Sasson"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/nX6anUO7xqk/hqdefault.jpg",
  "title": "Identifying influencers via Slack Messages in Python using Network Analysis and NLP",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nX6anUO7xqk"
    }
  ]
}
