{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nEveryone deserves to make the most of their career opportunities, but it can be difficult to ask for a raise or negotiate an offer. This talk will not only inspire you to stop holding back from advocating for yourself, but also give you a concrete mental model and specific statements you can use to build healthy employment relationships with recruiters and managers.\n\nAbstract\nIt is easy to overlook the offer stage of hiring because it is stressful, and it can feel like an accomplishment simply being hired. However, the terms of one’s employment are the foundation of a rich, long-term relationship that will continue to include conversations about responsibilities, performance, compensation and growth. Unfortunately, many engineers look back with regret at early employment conversations, and find themselves catching up to repair or reinvent their narrative and compensation years later.\n\nMastering your job and feeling competent and confident about your work doesn’t automatically make you good at advocating for yourself or knowledgeable about corporate budgets and compensation decisions. This talk shares information about how companies think and talk about employment, as well as specific mental models and statements you can use to improve your own skills in advocating for yourself. You’ll walk away with fresh thoughts on how to create healthy employment relationships and make the most of your opportunities and personal goals.\n\nOriginal slides: https://t.ly/Agj87\n\nAbout the speaker\nLusen/they/them co-founded DangoorMendel to level the corporate playing field and work directly with engineers on their interviewing and negotiation skills. Lusen is also Director of Interviewing at Karat and deeply invested in creating healthy organizational, management and employment relationships that works for everyone.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3 #gdb",
  "language": "eng",
  "recorded": "2019-08-17",
  "speakers": [
    "Lusen Mendel"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/0io2mN4n9xU/hqdefault.jpg",
  "title": "Make the Most of it: Negotiation and Self Advocacy",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0io2mN4n9xU"
    }
  ]
}
