{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nGraphQL has become the de facto successor to REST. How does this impact Django developers? In this talk, we will explore the state of Django web API libraries focusing in on the Django REST Framework and Graphene.\n\nAbstract\nGraphQL has become the defacto successor to REST. How does this impact Django developers? In this talk, we will explore the state of Django web API libraries focusing in on Django REST Framework and Graphene. We will start with a brief history overview where we will cover the origins of each library. Then we will move on to a comparative analysis of both along three axes: functionality, performance, and support. For functionality, we will look at how to perform CRUD operations under each. For performance, we will go over benchmarks of how each library handles a high throughput scenario and large data volume scenario. Lastly, we will look at how well supported each library both in terms of documentation, maintainer activity, and immediate online support.\n\nOriginal slides: \n\nAbout the speaker\nManish Sinha is the founder and Principal of North Star Labs we he has built software for numerous clients including Kleiner Perkins, Mobilize America, and The Last Mile. He has trained new engineers at UBS, TIAA, and Credit Suisse. He is also active in the Django community where he serves as a contributor to the graphene-django project and occasionally gives related talks.\n\nPrior to that, he worked at Morgan Stanley in a big data group. Manish started his career as one of a handful software engineers in the White House under the Obama administration.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3 #gdb",
  "recorded": "2019-08-17",
  "speakers": [
    "Manish Sinha"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Jl4QRouhDIM/hqdefault.jpg",
  "title": "Migrating from REST to GraphQL in Django",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Jl4QRouhDIM"
    }
  ]
}
