{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nAs the demand grows for data science in industry and research, so does the need for tools to conduct, document, and share analysis. Project Jupyter has stepped up to meet this need with \"open-source software, open-standards, and services for interactive computing across dozens of programming languages.\" Jupyter is now used by everyone from individuals doing personal projects on GitHub to major universities and corporations, including Microsoft and Google.\n\nThis talk will give an introduction to two key products of Project Jupyter: the Jupyter Notebook document and the multi-user JupyterHub. We will then share examples of how Jupyter is being leveraged to do data science accessibly, collaboratively, and at scale at UC Berkeley.\n\nOriginal slides: https://t.ly/5q1DP\n\nAbout the speaker\nKeeley is the Modules Program Coordinator for the UC Berkeley Division of Data Sciences. She assists faculty across all academic fields with incorporating targeted data science lessons into their existing courses and trains undergraduate students to support data science instruction and create open-source curriculum materials in Jupyter notebooks. She also facilitates the Pathways seminar for the Data Scholars program, which provides underrepresented minority and nontraditional students with data science career exploration and professional development.\n\nKeeley graduated from UC Berkeley in May 2018 with a B.A. in Cognitive Science.  Prior to her time at Berkeley, she worked for three years designing and facilitating internal training workshops for the Northern California affiliate of Planned Parenthood. Whether working with Python or pap smears, she seeks to make technical subjects accessible to everyone impacted by them.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3 #JupyterNotebook",
  "recorded": "2019-08-16",
  "speakers": [
    "Keeley Takimoto"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/4qj0CcEsbUA/hqdefault.jpg",
  "title": "Project Jupyter: Tools for Interactive, Reproducible Data Science",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4qj0CcEsbUA"
    }
  ]
}
