{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nAs the complexity and volume of data grows, data teams are optimizing their analytics workflows to support more complex logic, advanced transformations and customized visualizations that will be crucial in supporting machine learning and AI. Britton Stamper of Periscope Data by Sisense will share the impact data analysts are seeing from leveraging the strengths of SQL, Python and R together into their workflows.\n\nAbstract\nAs the complexity and volume of data grows, data teams are working quietly behind the scenes to improve their methods of analysis.\n\nThere isn’t an abundance of external conversation about the languages used to analyze these massive quantities of data, but customers are getting more sophisticated as their field matures, evolving to work with bigger data sets and integrating new techniques into their workflow. This means more than just finding new ways to innovate with SQL — advanced languages like R and Python have become a more critical part of their everyday analysis.\n\nThis talk will share the impact that data scientists can see from bringing the workflows of SQL, Python and R together on one platform. Python has been one of the most popular languages for development, but for those in data environments the current workflows with Python are entirely disjointed. Python development environments don’t typically run SQL on databases, which means you’d have to query the data elsewhere, bring that data into the environment where Python runs, then take the output and migrate it back to a place where others can consume the results.\n\nThere are some who may have become accustomed to conducting R or Python analysis by connecting SQL to a Jupyter Notebook, or via an API, but those solutions aren’t outcome focused. Using a notebook can make it really difficult to connect analysis back to your original data set, to keep data consistently fresh, or to get reviews from your colleagues and share results across the organization.\n\nData scientists and developers need functionality that enables them to add a finishing touch, be it clustering, regressions or predictions, that delivers exactly what their stakeholders need to make important business decisions. These tasks are much simpler to pull off in R or Python, and come with a whole new set of customization options for visualization.\n\n\nAbout the speaker\nBritton Stamper is a Senior Sales Engineer at Periscope Data by Sisense. He's a data visualization evangelist who empowers data teams to build easy to understand and actionable data tools. Prior to Periscope Data he served as a BI analyst in the financial services industry.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3 #gdb",
  "language": "eng",
  "recorded": "2019-08-17",
  "speakers": [
    "Britton Stamper"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/eC29Fma3_MA/hqdefault.jpg",
  "title": "Python and R for Advanced Analytics",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eC29Fma3_MA"
    }
  ]
}
