{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nIn this talk I will present a project (coined py2store) whose goal is to develop tools that allow developers to interact with a variety of data sources and sinks, local or remote, through a consistent and simple interface.\n\nHow simple? The simplest. Objects that feel like built-ins (dicts, lists, sets).\n\nAbstract\nPy2Store might make you think about ORMs. If so, think again. The intent of py2store is not to map objects to db entries, but rather to offer a consistent interface for basic storage operations. In that sense, py2store is more akin to an implementation of the data access object (DAO) pattern. Of course, the difference between ORM and DAO can be blurry, so all this should be taken with a grain of salt.\n\nHow many times did someone share some data with you in the form of a zip of some nested folders whose structure and naming choices are fascinatingly obscure? And how much time do you then spend to write code to interface with the freakish structure?\n\nOne of the intents of py2store is to make that easier to do. You still need to understand the structure of the data store and how to deserialize these datas into python objects you can manipulate. But with the proper tool, you shouldn't have to do much more than that.\n\nYou have a new project or need to write a new app. You'll need to store stuff and read stuff back. Stuff: Different kinds of resources that your app will need to function. Some people enjoy thinking of how to optimize that aspect. I don't. I'll leave it to the experts to do so when the time comes. Often though, the time is later, if ever. Few proof of concepts and MVPs ever make it to prod.\n\nSo instead, I'd like to just get on with the business logic and write my program. So what I need is an easy way to get some minimal storage functionality. But when the time comes to optimize, I shouldn't have to change my code, but instead just change the way my DAO does things.\n\nOriginal slides: https://t.ly/y8dVb\n\nAbout the speaker\nEx-Mathematician, Ex-CTO of OtoSense, sound recognition start-up in the silicon valley, sold to Analog Devices. Now works as a director of AI research at Analog Devices.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3 #gdb",
  "recorded": "2019-08-16",
  "speakers": [
    "Thor Whalen"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/6lx0A6oVM5E/hqdefault.jpg",
  "title": "Talking to data as you would with built in types",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6lx0A6oVM5E"
    }
  ]
}
