{
  "description": "This talk was presented at PyBay2019 - 4th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for more information about this talk.\n\nDescription\nCurious what's coming next for Python? Well, Python 3.8 is being released just a few short months. It already includes a number of new features such as assignment expressions, improved debugging, more string formatting features, and many smaller changes. Come learn about the big ones and some of the more interesting small ones too!\n\nAbstract\nI'll start out with the major new features and their PEPs (listed below, but also including any more added before the talk):\n\nAssignment expressions\n\nThere is new syntax (the “walrus operator”, :=) to assign values to variables as part of an expression.\n\nPositional-only parameters\n\nThere is new syntax (/) to indicate that some function parameters must be specified positionally (i.e., cannot be used as keyword arguments).\n\nParallel filesystem cache for compiled bytecode files\n\nThe new PYTHONPYCACHEPREFIX setting (also available as -X pycache_prefix) configures the implicit bytecode cache to use a separate parallel filesystem tree, rather than the default pycache subdirectories within each source directory.\n\nDebug build uses the same ABI as release build\n\nPython now uses the same ABI whether it built in release or debug mode. On Unix, when Python is built in debug mode, it is now possible to load C extensions built in release mode and C extensions built using the stable ABI.\n\nf-strings now support = for quick and easy debugging\n\nAdd = specifier to f-strings. f'{expr=}' expands to the text of the expression, an equal sign, then the repr of the evaluated expression. So:\nThen I'll talk about a few of the smaller features such as continue inside finally, iterable unpacking in yield and return, new SyntaxWarnings, etc.\n\nAbout the speaker\nI'm an Engineering and Community Lead @ Braintree. At work I do a variety of things from technical architecture and planning to facilitating conference and event sponsorships. Outside of work, I'm coding enthusiast and frequent traveler, splitting my time between the city and the Great North Woods. Find me online or at local Python events in either Chicago or Burlington, VT.\n\nSponsor Acknowledgement\nThis and other PyBay2019 videos are via the help of our media partner AlphaVoice (https://www.alphavoice.io/)!\n\n#pybay #pybay2019 #python #python3",
  "language": "eng",
  "recorded": "2019-08-17",
  "speakers": [
    "Adam Forsyth"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/OtdQN24Z5MA/hqdefault.jpg",
  "title": "What's Coming in 3.8: Assignment Expressions & More!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OtdQN24Z5MA"
    }
  ]
}
