{
  "description": "Categoría: Desarrollo web,  Computación científica, Testing, Seguridad\n\nCuando se desarrolla software dentro de un equipo de desarrollo, existen varios elementos a considerar dependiendo del problema y del proyecto a abordar, como guías de estilo o convenciones, paquetes a utilizar, gestores de paquetes, linters, formateadores de código, aspectos de seguridad de los paquetes que se utilizan, pruebas unitarias y su cobertura para garantizar un cierto grado de calidad de nuestro código fuente, entre otros.\n\nEn Python, existe una multitud de herramientas que nos permiten ver todo esto, algunas conocidas o populares y algunas no.\n\nEn esta charla no solo veremos una forma de establecer una convención en común o flujo para forzar buenas prácticas de programación en Python de forma concreta, sino que también una correcta utilización de estructuras como listas y diccionarios junto a una correcta utilización de algunos paquetes de Python como pandas y la utilidad de algunos módulos y funciones estándar. Además, veremos las mejores formas de abordar la gestión de dependencias mediante herramientas como Poetry y la utilidad de las pruebas unitarias.\n\nPara finalizar, veremos un par de casos reales donde se aplica todo lo anterior: un caso real laboral y un caso real de un side-project personal.\n\nRecursos:\n• https://github.com/ecastillob/pycon-chile-2021\n\nContacto:\n• https://linkedin.com/in/https:cl.linkedin.cominerick-castillo-25350637\n\n----------------------------------------------------------------------------------------------------------------------------------------------------\n\nPyCon Chile 2021 - https://pycon.cl/\n\nPyCon Chile es un evento gratuito organizado por la comunidad Python Chile, para promover la divulgación y enseñanza de Python. Esta conferencia busca reunir a todos los entusiastas de Python, desde principiantes hasta usuarios avanzados, para compartir distintas temáticas relacionadas al lenguaje.\n\nSi te interesa utilizar Python en áreas tan variadas como ciencia de datos, inteligencia artificial, astronomía, geología, optimización matemática o ciencias sociales, entre otras, ¡este evento te encantará!\n\n★ ¡Únete a la comunidad! ★\n\n• Twitter: https://twitter.com/pythonchiledev\n• Facebook: https://www.facebook.com/groups/pytho...\n• Telegram: https://t.me/pythonchile\n• Discord: https://discord.gg/dTHMfJvauS",
  "duration": 1706,
  "language": "spa",
  "recorded": "2021-11-07",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pycon.cl/2021/"
    },
    {
      "label": "https://twitter.com/pythonchiledev",
      "url": "https://twitter.com/pythonchiledev"
    },
    {
      "label": "https://linkedin.com/in/https:cl.linkedin.cominerick-castillo-25350637",
      "url": "https://linkedin.com/in/https:cl.linkedin.cominerick-castillo-25350637"
    },
    {
      "label": "https://www.facebook.com/groups/pytho...",
      "url": "https://www.facebook.com/groups/pytho..."
    },
    {
      "label": "https://pycon.cl/",
      "url": "https://pycon.cl/"
    },
    {
      "label": "https://t.me/pythonchile",
      "url": "https://t.me/pythonchile"
    },
    {
      "label": "https://github.com/ecastillob/pycon-chile-2021",
      "url": "https://github.com/ecastillob/pycon-chile-2021"
    },
    {
      "label": "https://discord.gg/dTHMfJvauS",
      "url": "https://discord.gg/dTHMfJvauS"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Computación Científica",
    "Educación",
    "pycon chile",
    "python chile"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/L9NGtc61W0Q/maxresdefault.jpg",
  "title": "Buenas práticas de desarrollo en Python - Erick Castillo",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=L9NGtc61W0Q"
    }
  ]
}
