{
  "description": "Tania Allard es codirectora de Quansight Labs y anteriormente una Sr. Developer Advocate en Microsoft. Tiene una vasta experiencia en investigación académica y entornos industriales. Sus principales áreas de especialización son las aplicaciones de uso intensivo de datos, la informática científica y el aprendizaje automático.\n\nTania ha realizado un extenso trabajo en la mejora de procesos, reproducibilidad y transparencia en investigación, ciencia de datos e inteligencia artificial. Le apasiona la tutoría, el código abierto y su comunidad, y está involucrada en una serie de iniciativas destinadas a construir comunidades más diversas e inclusivas. También es colaboradora, mantenedora y desarrolladora de varios proyectos de código abierto y la fundadora de Pyladies NorthWest.\n\nDesde el 2019 ella es Python Fellow, y desde el 2021, es parte de la junta directiva de la Python Software Foundation.\n\nContacto:\n• https://twitter.com/ixek\n• https://trallard.dev/\n\n----------------------------------------------------------------------------------------------------------------------------------------------------\n\nPyCon Chile 2021 - https://pycon.cl/\n\nPyCon Chile es un evento gratuito organizado por la comunidad Python Chile, para promover la divulgación y enseñanza de Python. Esta conferencia busca reunir a todos los entusiastas de Python, desde principiantes hasta usuarios avanzados, para compartir distintas temáticas relacionadas al lenguaje.\n\nSi te interesa utilizar Python en áreas tan variadas como ciencia de datos, inteligencia artificial, astronomía, geología, optimización matemática o ciencias sociales, entre otras, ¡este evento te encantará!\n\n★ ¡Únete a la comunidad! ★\n\n• Twitter: https://twitter.com/pythonchiledev\n• Facebook: https://www.facebook.com/groups/pytho...\n• Telegram: https://t.me/pythonchile\n• Discord: https://discord.gg/dTHMfJvauS",
  "duration": 3395,
  "language": "spa",
  "recorded": "2021-11-07",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pycon.cl/2021/"
    },
    {
      "label": "https://twitter.com/pythonchiledev",
      "url": "https://twitter.com/pythonchiledev"
    },
    {
      "label": "https://www.facebook.com/groups/pytho...",
      "url": "https://www.facebook.com/groups/pytho..."
    },
    {
      "label": "https://pycon.cl/",
      "url": "https://pycon.cl/"
    },
    {
      "label": "https://trallard.dev/",
      "url": "https://trallard.dev/"
    },
    {
      "label": "https://t.me/pythonchile",
      "url": "https://t.me/pythonchile"
    },
    {
      "label": "https://discord.gg/dTHMfJvauS",
      "url": "https://discord.gg/dTHMfJvauS"
    },
    {
      "label": "https://twitter.com/ixek",
      "url": "https://twitter.com/ixek"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/8d6rZIug9LA/maxresdefault.jpg",
  "title": "FOSS for fun and profit o cómo participar en código abierto y no morir en el intento - Tania Allard",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8d6rZIug9LA"
    }
  ]
}
