{
  "copyright_text": "CC-BY-NC-SA 4.0",
  "description": "(André Roberge) When beginners encounter tracebacks, they are often intimidated and do not know what to do with the information, which may tempt them to give up. In this talk, I will demonstrate a tool that can help them (and you) get all the information necessary to find the exact cause of an exception as well as some possible hints leading you to a solution.\n\nhttps://2021.pycon.org.au/program/EKJR9K/\n\npython, pycon, australia, programming, conference, technical, pyconline, developers, panel, sessions, libraries, frameworks, community, sysadmins, students, education, data, science\n\nVideos licensed as CC-BY-NC-SA 4.0\r\n\r\nPyCon AU is the national conference for the Python programming community, bringing together professional, student and enthusiast developers, sysadmins and operations folk, students, educators, scientists, statisticians, and many others besides, all with a love for working with Python.\r\n\r\nPyCon AU informs the country’s Python developers with presentations, tutorials and panel sessions by experts and core developers of Python, as well as the libraries and frameworks that they rely on.\n\nProduced by Next Day Video Australia: https://nextdayvideo.com.au\n\nFri Sep 10 11:00:00 2021 at Education",
  "duration": 1510,
  "language": "eng",
  "recorded": "2021-09-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2021.pycon.org.au/program/"
    },
    {
      "label": "https://nextdayvideo.com.au",
      "url": "https://nextdayvideo.com.au"
    },
    {
      "label": "https://2021.pycon.org.au/program/EKJR9K/",
      "url": "https://2021.pycon.org.au/program/EKJR9K/"
    }
  ],
  "speakers": [
    "André Roberge"
  ],
  "tags": [
    "AndréRoberge",
    "pyconau",
    "pyconau_2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/NrXmEwSD8Cs/maxresdefault.webp",
  "title": "It doesn't work!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NrXmEwSD8Cs"
    }
  ]
}
