{
  "description": "Ponente: Alexandre Mamani Mendoza\nResumen: Exploraremos el mundo de la programación de hardware con MicroPython. Comenzaremos desde los fundamentos de la programación en MicroPython, incluyendo la sintaxis, los tipos de datos y las estructuras de control de flujo. A partir de ahí, avanzaremos a la programación de hardware, utilizando los módulos y bibliotecas disponibles para interactuar con dispositivos externos. Mostraremos ejemplos prácticos de proyectos con hardware que pueden ser implementados con MicroPython, y discutiremos las ventajas de utilizar MicroPython para programar hardware en comparación con otros lenguajes de programación. También hablaremos sobre la comunidad de usuarios de MicroPython y los recursos disponibles para seguir aprendiendo y experimentando con la programación de hardware.\nEsta charla está dirigida a personas interesadas en la programación de hardware con MicroPython, desde principiantes hasta expertos que deseen profundizar en el tema. No se requiere experiencia previa en programación de hardware o en MicroPython.\n\nPyDay La Paz: https://bento.me/pydaylapaz\nPython La Paz: https://linktr.ee/pythonlapaz\nPyLadies La Paz: https://www.meetup.com/La-Paz-PyLadies-Meetup",
  "duration": 1743,
  "language": "eng",
  "recorded": "2023-10-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pyday.pylapaz.org/2023/"
    },
    {
      "label": "https://www.meetup.com/La-Paz-PyLadies-Meetup",
      "url": "https://www.meetup.com/La-Paz-PyLadies-Meetup"
    },
    {
      "label": "https://linktr.ee/pythonlapaz",
      "url": "https://linktr.ee/pythonlapaz"
    },
    {
      "label": "https://bento.me/pydaylapaz",
      "url": "https://bento.me/pydaylapaz"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/6nPv_iOXk8g/maxresdefault.jpg",
  "title": "PROGRAMACIÓN MICROPYTHON PARA EL RASPBERRY PI PICO - PYDAY LA PAZ 2023",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6nPv_iOXk8g"
    }
  ]
}
