{
  "description": "Ponente: K. Marlon Soza Mamani\nResumen: El presente proyecto plantea el desarrollo de una librería de programación enfocada al estudio, enseñanza y aprendizaje de conceptos de robótica móvil con base en un modelo implementativo y real. El trabajo presentado busca la representación de conceptos en robótica educativa y robótica avanzada bajo un marco de practicidad y simplificación que sirva como herramienta para el estudio de teorías más complejas. El marco de desarrollo abarca la creación, verificación, validación e implementación de funciones de programación basadas en lenguaje Python como código base de programación. Posteriormente se procede al desarrollo de herramientas, en las mismas funciones, que permitan la compatibilidad con robots de baja gama y costo reducido. El desarrollo del proyecto involucra el estudio y la implementación de áreas de investigación como ser sistemas de control, sistemas de navegación, sistemas de comunicación y visión artificial.\n\nPyDay La Paz: https://bento.me/pydaylapaz\nPython La Paz: https://linktr.ee/pythonlapaz\nPyLadies La Paz: https://www.meetup.com/La-Paz-PyLadies-Meetup",
  "duration": 1482,
  "language": "eng",
  "recorded": "2023-10-10",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pyday.pylapaz.org/2023/"
    },
    {
      "label": "https://www.meetup.com/La-Paz-PyLadies-Meetup",
      "url": "https://www.meetup.com/La-Paz-PyLadies-Meetup"
    },
    {
      "label": "https://linktr.ee/pythonlapaz",
      "url": "https://linktr.ee/pythonlapaz"
    },
    {
      "label": "https://bento.me/pydaylapaz",
      "url": "https://bento.me/pydaylapaz"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/KrgS_Frfbk4/maxresdefault.webp",
  "title": "PYCORE_ROBOT: LIBRERÍA DE DESARROLLO PARA ROBÓTICA MÓVIL BASADA EN PYTHON - PYDAY LA PAZ 2023",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KrgS_Frfbk4"
    }
  ]
}
