{
  "copyright_text": null,
  "description": "Have you ever been in a meeting where a colleague says “I’m a great\nsupporter of gender equality, but I’m totally opposed to quotas!” Or, “I\nbelieve in diversity, but I won’t stand for positive discrimination.”\nMaybe you felt a bit troubled by such statements, thinking: that sounds\nfair, but somehow I don’t think it is… how do I rebut this? We all know\nthat bias is omnipresent in our society, and some of us are keenly aware\nof rampant bias in sectors like technology, engineering and politics.\nEfforts to thwart the effects of bias in communities and institutions\nprompt a spectrum of diversity initiatives. Many times these lead to\nbacklash. It’s been just a year since the memo \"Google's Ideological\nEcho Chamber” spread through the company’s internal channels, before\nbecoming public. Yet, another wrangle already is blasting online with\nthe recent article \"Why Women Don’t Code,” by a university lecturer.\nWhat do we do when privileged individuals continue to turn a blind eye\non the injustices around them? They insist on points like “women are\nless likely to choose computer science,” and that’s just due to natural\ndifferences. Community and institution leaders have much of the power to\ncatalyze change, but in the meantime, I want us to build, share and\nrefine a portfolio of rebuttals for the recurring themes of the\nanti-diversity manifestos. Let’s get started.Presenter(s): Speaker:\nLorena Barba, George Washington University\n",
  "duration": 3182,
  "language": "eng",
  "recorded": "2018-07-12",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://scipy2018.scipy.org/ehome/299527/721463/"
    },
    {
      "label": "Conference slides",
      "url": "https://github.com/deniederhut/Slides-SciPyConf-2018"
    }
  ],
  "speakers": [
    "Lorena Barba"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/vQH3ZGJ2mvY/maxresdefault.jpg",
  "title": "Diversity Luncheon: Bias, Diversity, Backlash, Manifestos, and Rebuttals",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vQH3ZGJ2mvY"
    }
  ]
}
