{
  "copyright_text": null,
  "description": "bqplot is a Python plotting library based on d3.js that offers its\nfunctionality directly in the Jupyter Notebook, including selections,\ninteractions, and arbitrary css customizations. bqplot is built to\ngenerate professional looking, highly interactive plots and dashboards\nwith minimal code. This enables the rapid generation of full fledged web\napplications directly in the Notebook with just a few lines of Python\ncode. We will then go over bqplot's library of statistical and machine\nlearning focused higher level abstractions and tools which are built to\naid a Data Scientist or a Machine Learning researcher to interactively\nanalyze the data, and arrive at useful insights. The seamless\ninteractivity enables the creation of custom visualizations that allow\nresearchers to understand their models and data in a much richer\nfashion. The talk will also cover bqplot's seamless integration with the\nnumerous other libraries in the Jupyter widgets ecosystem such as\nipyleaflet or ipyvolume. We will then explain how to link these widgets\ntogether using callback functions and share a few examples of advanced\napplications from various disciplines built using other open source\nprojects. We will wrap up by previewing the latest features we are\nadding to bqplot.Presenter(s): Speaker: Sylvain Corlay, QuantStack\n",
  "duration": 1606,
  "language": "eng",
  "recorded": "2018-07-13",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://scipy2018.scipy.org/ehome/299527/721463/"
    },
    {
      "label": "Conference slides",
      "url": "https://github.com/deniederhut/Slides-SciPyConf-2018"
    }
  ],
  "speakers": [
    "Sylvain Corlay"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Dmxa2Kyfzxk/maxresdefault.jpg",
  "title": "bqplot: Seamless Interactive Visualizations and Dashboards in the Jupyter Notebook",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Dmxa2Kyfzxk"
    }
  ]
}
