{
  "copyright_text": null,
  "description": "Building environmental simulation workflows is typically a slow process\ninvolving multiple proprietary desktop tools that do not interoperate\nwell. In this work, we demonstrate building flexible, lightweight\nworkflows entirely in Jupyter notebooks. We demonstrate these\ncapabilities through examples in hydrology and hydrodynamics using the\nAdH and GSSHA simulators. The goal is to provide a set of tools that can\neasily be reconfigured and repurposed as needed to rapidly solve\nspecific emerging issues. (https://pyviz.github.io/EarthSim/) As part of\nthis work, extensive improvements were made to several general-purpose\nopen source packages, including support for annotating and editing plots\nand maps in Bokeh and HoloViews, rendering large triangular meshes and\nregridding large raster data in HoloViews, GeoViews, and Datashader, and\nwidget libraries for Param. In addition, two new open source projects\nare being released for triangular mesh generation and environmental data\naccess.Presenter(s): Speaker: Dharhas Pothina, U.S. Army Engineer\nResearch and Development Center Speaker: James A. Bednar, Solutions\nArchitect, Anaconda, Inc. Speaker: Scott Christensen, U.S. Army Engineer\nResearch and Development Center Speaker: Kevin Winters, U.S. Army\nEngineer Research and Development Center Speaker: Christopher Ball,\nAnaconda, Inc. Speaker: Gregory Brener, Anaconda Inc. Speaker: Philipp\nRudiger, Software Engineer, Anaconda, Inc.\n",
  "duration": 1779,
  "language": "eng",
  "recorded": "2018-07-12",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://scipy2018.scipy.org/ehome/299527/721463/"
    },
    {
      "label": "Conference slides",
      "url": "https://github.com/deniederhut/Slides-SciPyConf-2018"
    }
  ],
  "speakers": [
    "Dharhas Pothina"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/KTbd_oUkP4Q/maxresdefault.jpg",
  "title": "EarthSim: Flexible Environmental Simulation Workflows Entirely Within Jupyter Notebooks",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KTbd_oUkP4Q"
    }
  ]
}
