{
  "copyright_text": null,
  "description": "For the last two years the Jupyter team has been working on the new\nJupyter frontend: JupyterLab. While JupyterLab does of course allow the\nuse of Jupyter Notebooks, it goes beyond the classic Jupyter Notebook by\nproviding a flexible and extensible web application with a set of\nreusable components. Users can arrange multiple notebooks, text editors,\nterminals, output areas, and custom components using tabs and\ncollapsible sidebars. These components are carefully designed to enable\nthe user to use them together or separately (for example, a user can\nsend code from a file to a console with a keystroke, or can pop out an\noutput from a notebook to work with it alone). JupyterLab is based on a\nflexible application plugin system provided by PhosphorJS that makes it\neasy to customize existing components or extend it with new components.\nFor example, users can install or write third-party plugins to view\ncustom file formats, such as GeoJSON, interact with external services,\nsuch as Dask or Apache Spark, or display their data in effective and\nuseful ways, such as interactive maps, tables, or plots. In this\ntutorial we’ll walk users thought the best way to make use of\nJupyterLab, how to transition from the “classic” Jupyter Notebook\nfrontend to JupyterLab, and how to make the best use of the new powerful\nfeatures of JupyterLab.Presenter(s): Speaker: Matthias Bussonnier,\nJupyter/Ipython, University of California, Berkeley Speaker: Jason\nGrout, Bloomberg LP\n",
  "duration": 7619,
  "language": "eng",
  "recorded": "2018-07-10",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://scipy2018.scipy.org/ehome/299527/721463/"
    },
    {
      "label": "Conference slides",
      "url": "https://github.com/deniederhut/Slides-SciPyConf-2018"
    }
  ],
  "speakers": [
    "Matthias Bussonnier",
    "Jason Grout"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Gzun8PpyBCo/maxresdefault.jpg",
  "title": "Getting Started with JupyterLab (Beginner Level)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Gzun8PpyBCo"
    }
  ]
}
