{
  "copyright_text": null,
  "description": "Scientists and engineers like to use Python for interactive data\nscience, machine learning, and online computing. However, computations\nthat are simple to perform at small scales (e.g., on a laptop) can\neasily become prohibitively difficult as data sizes and analysis\ncomplexity grows. For example, efficient interactive analysis at scale\ncan require real-time management of parallel and/or cloud computing\nresources, orchestration of remote task execution, and data staging\nacross wide area networks. In this talk we introduce Parsl (Parallel\nScripting Library), a pure Python library for orchestrating the\nconcurrent and parallel execution of interactive and many-task\nworkloads, and demonstrate how it integrates with the scientific Python\necosystem and how it is being used in a variety of scientific domains.\nThe talk is intended for attendees interested in interactive and\nparallel computing.Presenter(s): Speaker: Kyle Chard, Computation\nInstitute, University of Chicago and Argonne National Lab Speaker: Yadu\nBabuji, University of Chicago Speaker: Ian Foster, University of Chicago\nand Argonne National Laboratory Speaker: Daniel Katz, University of\nIllinois at Urbana-Champaign Speaker: Mike Wilde, University of Chicago\nSpeaker: Anna Woodard, University of Chicago Speaker: Justin Wozniak,\nArgonne National Laboratory\n",
  "duration": 1641,
  "language": "eng",
  "recorded": "2018-07-13",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://scipy2018.scipy.org/ehome/299527/721463/"
    },
    {
      "label": "Conference slides",
      "url": "https://github.com/deniederhut/Slides-SciPyConf-2018"
    }
  ],
  "speakers": [
    "Kyle Chard"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/_OAiO8Oo6tA/maxresdefault.jpg",
  "title": "Parsl: Enabling Scalable Interactive Computing in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_OAiO8Oo6tA"
    }
  ]
}
