{
  "description": "Ahmet Melek Presents:\n\nWhat is X up to? - NER and Relationship Extraction for Information Extraction\n\nDealing with unstructured text to obtain information is one of the biggest aims in the field of natural language processing. In this talk, we will be demoing a solution where we have unstructured text on a particular topic, and we apply named entity recognition, together with relationship extraction, to extract structured data. We will be introducing our data source, the models that we use, and will be inspecting the end results, viewing particular statistics, and hovering over a graph, extracted from the raw text.\n\nGithub: https://github.com/ahmetmeleq/PyData2022_NER_RelEx\nSlides: https://pydata.org/london2022/wp-content/uploads/2022/07/What-is-X-up-to_.pdf\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 1912,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://github.com/ahmetmeleq/PyData2022_NER_RelEx",
      "url": "https://github.com/ahmetmeleq/PyData2022_NER_RelEx"
    },
    {
      "label": "https://pydata.org/london2022/wp-content/uploads/2022/07/What-is-X-up-to_.pdf",
      "url": "https://pydata.org/london2022/wp-content/uploads/2022/07/What-is-X-up-to_.pdf"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/nO59pdwWELA/maxresdefault.jpg",
  "title": "Ahmet Melek - What is X up to? - NER and Relationship Extraction for Information Extraction",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nO59pdwWELA"
    }
  ]
}
