{
  "description": "Asya Frumkin Presents:\n\nCan You Read This? (Or: How I Improved Text Readability on the Web for the Visually Impaired)\n\nThis talk will describe how Asya Frumkin used deep learning to identify texts on background images that are illegible for people with vision impairments. Frumkin explains the challenges ncountered when using different OCR architectures for this task, and talks about the original solution she came up with. \n\nThe web is a visual amusement park, full of colorful images, playful gifs, and funny videos. But when that visual richness is combined with text, people with low vision or color blindness increasingly struggle with the basic function of reading and thus can’t fully enjoy what the web has to offer. In this talk, Frumkin dives into the science of colors and how different people perceive them. She discusses how color contrast affects text readability, and explains the challenge of estimating color contrast for text on image. Frumkin also explores how modern deep learning tools such as OCR and text detection can be used for text classification based on readability. In addition, Frumkin shares her personal experience of working with visual data whilst having a visual impairment. \n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 2211,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/HYDm9O-KTuU/maxresdefault.jpg",
  "title": "Asya Frumkin - Can you Read This? How I Improved Text Readability Online for Visually Impaired",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HYDm9O-KTuU"
    }
  ]
}
