{
  "description": "Adam Klimont and Tomasz Bartczak Present:\n\nBeyond Medical Image Segmentation. The Road Towards Cinical Insights\n\nRecent progress in deep learning for medical imaging has led to impressive results. Among them is a fully automatic human organ segmentation from Computed Tomography (CT) scans. Organ segmentation can be the end goal in itself, e.g. when it is directly viewed by clinical teams. It can also serve as an input to diagnostic aid tools. Moreover, specific knowledge can be extracted out of segmentations to build databases. These databases can then be used for reasoning about the anatomy or planning treatment.\n\nIn this talk, Klimont and Bartczak describe a multi-stage pipeline for processing CT scans for abdominal aortic aneurysm (AAA) treatment planning. They share their experience in sub-organ multilabel segmentation. Klimont and Bartzak discuss the challenges with common loss functions, and with metrics not being well aligned with clinical significance. The pair will show how enhanced segmentation can be used to represent patient anatomy in an accessible way for end-users who plan treatment for new patients.\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 2152,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/HoARFQQA83I/maxresdefault.jpg",
  "title": "Bartczak, Klimont - Beyond Medical Image Segmentation. The Road Towards Clinical Insights",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HoARFQQA83I"
    }
  ]
}
