{
  "description": "Davide Frazzetto Presents:\n\nA Hitchhiker Guide to MLOps\n\nBringing Machine Learning (ML) applications to a live production phase comes with all the same challenges of traditional software development, and more. Examples are: large datasets, tracking data quality and models quality, experiments reproducibility, and monitoring a live application. This talk is a grounded introduction to monitoring the ML lifecycle with only open source software.\n\nSlides: https://github.com/dave-frazzetto/hitchhiker-guide-mlops\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 2417,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://github.com/dave-frazzetto/hitchhiker-guide-mlops",
      "url": "https://github.com/dave-frazzetto/hitchhiker-guide-mlops"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/_M0sLnZTLog/maxresdefault.jpg",
  "title": "Davide Frazzetto - A Hitchhiker Guide to MLOps | PyData London 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_M0sLnZTLog"
    }
  ]
}
