{
  "description": "Dillon Gardner Presents:\n\nAUC is Worthless: Lessons in Transitioning From Academic to Business Data Science\n\nNew data scientists often struggle to make major impacts on solving business problems despite impressive technical skills. A core challenge is the gap between how academics think about performance of models and what matters for a company. As an example, academic work summarizes a model’s receiver operator characteristic (ROC) curve with the area under the curve (AUC). This summary statistic is useless for business applications, which will always have unique trade-offs and constraints. Effective approaches to optimize model performance requires understanding the specific business requirements and how to map that to a well framed data science problem.\n\nIn this talk, I will go through a framework of how to think effectively about model trade-offs in terms of maximizing business utility. Through this exercise, we will build intuition for what is required for a model in production to be a success and how to collaborate more effectively with non-technical co-workers.\n\nSlides: https://pydata.org/london2022/wp-content/uploads/2022/07/AUC_is_Worthless_DR_Gardner.pdf\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 2420,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://pydata.org/london2022/wp-content/uploads/2022/07/AUC_is_Worthless_DR_Gardner.pdf",
      "url": "https://pydata.org/london2022/wp-content/uploads/2022/07/AUC_is_Worthless_DR_Gardner.pdf"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/aTJPvfQ_fLY/maxresdefault.jpg",
  "title": "Dillon Gardner - AUC is Worthless: Lessons to Transition From Academic to Business Data Science",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aTJPvfQ_fLY"
    }
  ]
}
