{
  "description": "Dr. Susan Mulcahy Presents:\n\nKeynote: Lighthearted Thoughts on Conversing About Data\n\nBy bringing more of us into the conversation on data, we can represent an array of colleagues and specialisms, not all of which are technical. We’ll look at some examples of breaking down your message to its essential components in order to bridge the gap of differing specialisms. And of course, with some lighthearted points woven into the talk for good measure.\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 2029,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/62ylM6-9lh0/maxresdefault.jpg",
  "title": "Dr. Susan Mulcahy - Keynote: Lighthearted Thoughts on Conversing About Data | PyData London 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=62ylM6-9lh0"
    }
  ]
}
