{
  "description": "Franz Kiraly presents: \n\nSktime - Python Toolbox for Time Series: How to Implement Your Own Estimator\n\nSktime is a widely used scikit-learn compatible library for learning with time series. Sktime is easily extensible by anyone, and interoperable with the PyData/NumFOCUS stack. This tutorial explains how to write your own Sktime estimator. E.g., forecaster, classifier, transformer, by using Sktime’s extension templates and testing framework. A custom estimator can live in any local code base, and will be compatible with Sktime pipelines, or scikit-learn. A continuation of the Sktime introductory tutorial at PyData. https://www.youtube.com/watch?v=ODspi8-uWgo \n\nGithub Repo: https://github.com/sktime/sktime-tutorial-pydata-global-2021\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 5183,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://www.youtube.com/watch?v=ODspi8-uWgo",
      "url": "https://www.youtube.com/watch?v=ODspi8-uWgo"
    },
    {
      "label": "https://github.com/sktime/sktime-tutorial-pydata-global-2021",
      "url": "https://github.com/sktime/sktime-tutorial-pydata-global-2021"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/S_3ewcvs_pg/maxresdefault.jpg",
  "title": "Franz Kiraly - Sktime—Python Toolbox for Time Series: How to Implement Your Own Estimator",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=S_3ewcvs_pg"
    }
  ]
}
