{
  "description": "Hanna van der Vlis Presents:\n\nClusterf*ck: A Practical Guide to Bayesian Hierarchical Modeling in PyMC3\n\nAt Apollo Agriculture, a Kenya based agro-tech startup, one of the challenging problems we face is to predict yields of Kenyan maize farmers. Like almost all data-sets, this data-set has a hierarchical structure: farmers within the same region aren’t independent. By ignoring this fact, a model could predict yields entirely from the region of the farmer, but fails to find any other meaningful insights, and we may not even realize. However, if we “overcorrected,” treating each region as completely separate, each individual analysis could be underpowered. Enter the hero of our story: Bayesian hierarchical modeling. Using a practical example in Pymc3, we’ll follow this hero as they identify and overcome clustered data-sets.\n\nSlides: https://pydata.org/london2022/wp-content/uploads/2022/07/Clusterf_ck_-A-practical-guide-to-Bayesian-hierarchical-modeling-in-Pymc3.pdf\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 2149,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://pydata.org/london2022/wp-content/uploads/2022/07/Clusterf_ck_-A-practical-guide-to-Bayesian-hierarchical-modeling-in-Pymc3.pdf",
      "url": "https://pydata.org/london2022/wp-content/uploads/2022/07/Clusterf_ck_-A-practical-guide-to-Bayesian-hierarchical-modeling-in-Pymc3.pdf"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/pbcxb9xpTBI/maxresdefault.jpg",
  "title": "Hanna van der Vlis - Clusterf*ck: A Practical Guide to Bayesian Hierarchical Modeling in PyMC3",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pbcxb9xpTBI"
    }
  ]
}
