{
  "description": "Ian Ozsvald Presents:\n\nBuilding Successful Data Science Projects\n\nYour data science projects haven't worked out so well - maybe you didn't have a plan, you suffered from surprising unknowns or you couldn't deliver what someone else promised. Ozsvald shares both some painful past experiences and explains choices that will increase your success. Ozsvlad roots this in a recently shipped solution worth $1 million for a client.\n\nSlides: https://speakerdeck.com/ianozsvald/building-successful-data-science-projects\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 2425,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://speakerdeck.com/ianozsvald/building-successful-data-science-projects",
      "url": "https://speakerdeck.com/ianozsvald/building-successful-data-science-projects"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/X7E916dfHuE/maxresdefault.jpg",
  "title": "Ian Ozsvald - Building Successful Data Science Projects | PyData London 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=X7E916dfHuE"
    }
  ]
}
