{
  "description": "Jay Alammar Presents:\n\nLarge Language Models for Real-World Applications - A Gentle Intro\n\nMachine language understanding and generation has been undergoing rapid improvements due to recent breakthroughs in machine learning (e.g. large language models like GPT and BERT). And while big tech and NLP engineers were quick to capitalize on these models, the broader developer community lags in adopting these models and realizing their potential in their business domains.\n\nThis talk provides a gentle and highly visual overview of some of the main intuitions and real-world applications of large language models. It assumes no prior knowledge of language processing and aims to bring attendees up to date with the fundamental intuitions and applications of large language models.\n\nwww.pydata.org\n\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 2177,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/xSGX8gBQDO8/maxresdefault.jpg",
  "title": "Jay Alammar - Large Language Models for Real-World Applications - A Gentle Intro",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xSGX8gBQDO8"
    }
  ]
}
