{
  "description": "Kajanan Sangaralingam and Anindya Datta present:\n\nFeature Engineering Made Simple\n\nOf all the choices made by data scientists in the course of building and operating models, feature engineering & selection is one of the most critical. Features have a substantive impact on a model’s quality, including its predictive accuracy and resilience. Unfortunately, as most ML scientists and practitioners are aware, feature engineering is more art than science. It is ad-hoc, messy, error-prone and ends up consuming 70-80% of the time and effort when building models, often resulting in sub-optimal feature selection leading to low-quality models. In this tutorial, we will introduce new ways of performing feature engineering, turning it into a systematic, procedural and scalable process, which is substantively more efficient than how it occurs currently. Participants will perform a hands-on, end-to-end, feature building exercise, with particular emphasis on feature engineering using Anovos (https://anovos.ai/ or https://github.com/anovos/anovos)\n\nIn this tutorial, we will introduce new ways of performing feature engineering, turning it into a systematic, procedural and scalable process, which is substantively more efficient than how it occurs currently.\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 5258,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://github.com/anovos/anovos",
      "url": "https://github.com/anovos/anovos"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    },
    {
      "label": "https://anovos.ai/",
      "url": "https://anovos.ai/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/DvDxS4uKj5Q/maxresdefault.jpg",
  "title": "Kajanan Sangaralingam and Anindya Datta - Feature Engineering Made Simple | PyData London 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DvDxS4uKj5Q"
    }
  ]
}
