{
  "description": "Laszlo Sragner Presents:\n\nClean Architecture: How to Structure Your ML Projects to Reduce Technical Debt.\n\nSoftware engineering principles are frequently mentioned as a solution to data science's productivity problem. Unfortunately, rarely in a comprehensive format to be actionable or adopted for data-intensive use.\n\nIn this talk, I will present a framework that enables practitioners to structure their projects and manage changes throughout the product lifecycle at low effort.\n\nAudience will also learn about a minimum set of programming concepts to make this a reality.\n\nThe key takeaway for any Data Scientist is that you don't need to be a master programmer to start taking care of your own codebase.\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 2207,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/QXfsS-ZOeyA/maxresdefault.jpg",
  "title": "Laszlo Sragner - Clean Architecture: How to Structure Your ML Projects to Reduce Technical Debt",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QXfsS-ZOeyA"
    }
  ]
}
