{
  "description": "Pedro Tabacof Presents:\n\nUnlocking the Power of Gradient-Boosted Trees (using LightGBM)\n\nGradient-boosted trees (XGBoost, LightGBM, Catboost) have become the staple of machine learning for tabular datasets. While most data scientists have made use of them at some point, many don’t know the true power those Python libraries provide. I will take LightGBM as an example and show in practice how it handles missing value imputation and categorical encoding natively, the different loss functions it provides for different problems (including the creation of your own loss function!), and how to interpret the resulting models. My aim is to show how LightGBM is like a Swiss army knife for machine learning and why it is the most pragmatic choice for tabular problems.\n\nGithub: https://github.com/catboost/catboost/blob/master/slides/2019_PyData_London/2019_PyData_London.pdf\nSlides: https://pydata.org/london2022/wp-content/uploads/2022/07/PyData-London-2022_-Unlocking-the-power-of-LightGBM-summarized.pdf\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 2237,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://pydata.org/london2022/wp-content/uploads/2022/07/PyData-London-2022_-Unlocking-the-power-of-LightGBM-summarized.pdf",
      "url": "https://pydata.org/london2022/wp-content/uploads/2022/07/PyData-London-2022_-Unlocking-the-power-of-LightGBM-summarized.pdf"
    },
    {
      "label": "https://github.com/catboost/catboost/blob/master/slides/2019_PyData_London/2019_PyData_London.pdf",
      "url": "https://github.com/catboost/catboost/blob/master/slides/2019_PyData_London/2019_PyData_London.pdf"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/qGsHlvE8KZM/maxresdefault.jpg",
  "title": "Pedro Tabacof - Unlocking the Power of Gradient-Boosted Trees (using LightGBM) | PyData London 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qGsHlvE8KZM"
    }
  ]
}
