{
  "description": "Richard Pelgrim presents:\n\nData Science at Scale with Dask\n\nThis tutorial is an introduction to Dask, an OSS Python library for distributed computing. We will walk through the many ways you can apply Dask to scale your Python code to work with larger datasets and/or transcend other compute-bound limitations. The tutorial assumes no prior knowledge of Dask.\n\nThis tutorial will cover\n\n- How to scale pandas with Dask\n- How to scale NumPy with Dask\n- How to parallelise your existing Python code with Dask\n- How to scale to the cloud with Dask and Coiled\n\nGithub Repo: https://github.com/rrpelgrim/dask-mini-tutorial\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 5049,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    },
    {
      "label": "https://github.com/rrpelgrim/dask-mini-tutorial",
      "url": "https://github.com/rrpelgrim/dask-mini-tutorial"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/UnUPjjnkB3g/maxresdefault.jpg",
  "title": "Richard Pelgrim - Data Science at Scale with Dask | PyData London 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UnUPjjnkB3g"
    }
  ]
}
