{
  "description": "Sam Morley Presents:\n\nSignature Methods for Time Series Data \n\nSignatures are a mathematical tool that arise in the study of paths. Roughly speaking, they capture the fine structure of a path. It turns out that signatures are extremely useful for analysing time series data in a data science context. This is party because they can take irregularly sampled, highly oscillatory data and produce a single array of values of fixed size which can then be used as features in predictors etc. In this talk I will give a brief introduction to signatures and give a brief demonstration of how you can use them to analyse time series data. No mathematical background will be assumed.\n\nSlides: https://github.com/inakleinbottle/talks/blob/9e6cdcb74dae62767a851194530fca6bcbdb6aa6/signatures-methods-for-time-series-data.pdf\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 2892,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://github.com/inakleinbottle/talks/blob/9e6cdcb74dae62767a851194530fca6bcbdb6aa6/signatures-methods-for-time-series-data.pdf",
      "url": "https://github.com/inakleinbottle/talks/blob/9e6cdcb74dae62767a851194530fca6bcbdb6aa6/signatures-methods-for-time-series-data.pdf"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/pkZhtscaX1M/maxresdefault.jpg",
  "title": "Sam Morley - Signature Methods for Time Series Data | PyData London 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pkZhtscaX1M"
    }
  ]
}
