{
  "description": "Sarah Diot-Girard Presents: \n\n“Off with their I/Os!” - Or How to Contain Madness by Isolating Your Code\n\nEngulfed in a tedious refactoring of your code, you’re adding the 7th layer of mocks to a test when you realise something must have gone wrong somewhere. But what? You’ve written readable code, split into functions and classes to avoid long chunks of code, and yet, every time, you end up with hardly testable code, a test suite that runs for hours, functions with seventeen arguments. You wonder if it’s you mocking the code, or the code mocking you. \n\nFollow the white rabbit with Sarah Diot-Girard to learn about usual problems of code organization and I/O architecture and some tricks on how to handle I/Os and dependencies isolation. We might encounter a bit of SOLID advice, and maybe even a nice hat!\n\nSlide Deck: http://sdg.jlbl.net/slides/architecture-principles-for-datascientists/#/\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 2154,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    },
    {
      "label": "http://sdg.jlbl.net/slides/architecture-principles-for-datascientists/#/",
      "url": "http://sdg.jlbl.net/slides/architecture-principles-for-datascientists/#/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/8sFG23k2FJ0/maxresdefault.jpg",
  "title": "Sarah Diot-Girard - Off with their I/Os!—Or How to Contain Madness by Isolating Your Code",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8sFG23k2FJ0"
    }
  ]
}
