{
  "description": "Sylvain Corlay Presents:\n\nPossible Futures for Jupyter\n\nJupyter has changed the way we think about interactive computing, scientific communication, and science education as it has been adopted globally, both in academia and industry.\n\nIn this talk, Corlay presents a bold vision for future applications and developments in the Jupyter ecosystem, some of which are just around the corner, while others are still mere possibilities, but have the potential for significant impact, for an even greater number of people. \n\nwww.pydata.org\n\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 1227,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/4041pEGsW6w/maxresdefault.jpg",
  "title": "Sylvain Corlay - Possible Futures For Jupyter | PyData London 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4041pEGsW6w"
    }
  ]
}
