{
  "description": "Tania Allard Presents:\n\nKey Challenges in the PyData Ecosystem and How We Can All Make a Difference\n\nThe PyData - and more broadly the scientific computing - ecosystem has seen massive growth both in adoption and complexity over the last few years, maybe decades. As for many other open-source ecosystems, this growth has also opened the door to complex socio-technical challenges. Many of which can directly impact the long-term sustainability of the ecosystem and its community.\n\nThis talk will dive into some of these current challenges and opportunities for us, the users, contributors, maintainers, activists, sponsors, and insert many other hats to help overcome those hurdles.\n\nAll while being intentional about the core tenents of collaboration, transparency, and openness that fuel our ecosystem.\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVi...",
  "duration": 3212,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVi...",
      "url": "https://github.com/numfocus/YouTubeVi..."
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/curmiRtbciA/maxresdefault.jpg",
  "title": "Tania Allard - Key Challenges In the PyData Ecosystem and How we Can All Make a Difference",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=curmiRtbciA"
    }
  ]
}
