{
  "description": "Thomas Wiecki Presents:\n\nSolving Real-World Business Problems with Bayesian Modeling\n\nAmong Bayesian early adopters, digital marketing is chief. While many industries are embracing Bayesian modeling as a tool to solve some of the most advanced data science problems, marketing is facing unique challenges for which this approach provides elegant solutions. Among these challenges are a decrease in quality data, driven by an increased demand for online privacy and the imminent \"death of the cookie\" which prohibits online tracking. In addition, as more companies are building internal data science teams, there is an increased demand for in-house solutions.\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n0:05 Speaker introduction and PyMC 4 release announcement\n1:15 PyMC Labs- The Bayesian consultancy\n2:39 Why is marketing so eager to adopt Bayesian solutions\n3:49 Case Study: Estimating Marketing effectiveness\n6:00 Estimating Customer Acquisition Cost (CAC) using linear regression\n7:36 Drawbacks of linear regression in estimating CAC\n10:02 Blackbox Machine learning and its drawbacks\n11:27 Bayesian modelling\n11:52 Advantages of Bayesian modelling\n14:12 How does Bayesian modelling work?\n16:53 Solution proposals(priors)\n17:26 Model structure\n19:57 Evaluate solutions\n20:16 Plausible solutions(posterior)\n22:36 Improving the model\n23:38 Modelling multiple Marketing Channels\n24:51 Modelling channel similarities with hierarchy\n26:13 Allowing CAC to change over time\n28:00 Hierarchical Time Varying process\n30:05 Comparing Bayesian Media Mix Models\n30:47 What-If Scenario Forecasting\n31:53 Adding other data sources as a way to help improve or inform estimates\n33:00 When does Bayesian modelling work best?\n33:35 Intuitive Bayes course\n34:38 Question 1: Effectiveness of including variables seasonality?\n36:03 Question 2: What is your recommendation for the best way to choose priors?\n38:16 Question 3: How to test if an assumption about the data is valid?\n39:07 Question 4: Do you take the effect of different channels on each other into account?\n41:33 Thank you!",
  "duration": 2504,
  "language": "eng",
  "recorded": "2022-06-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2022/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/twpZhNqVExc/maxresdefault.jpg",
  "title": "Thomas Wiecki - Solving Real-World Business Problems with Bayesian Modeling | PyData London 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=twpZhNqVExc"
    }
  ]
}
