{
  "id": 3527,
  "category": "PyData Paris 2015",
  "slug": "industrial-uses-of-scikit-learn-business-roundta",
  "title": "Industrial uses of Scikit-Learn (business roundtable)",
  "alias": "video/3527/industrial-uses-of-scikit-learn-business-roundta",
  "summary": "",
  "description": "Industrial uses of scikit-learn (business roundtable)\n\n::\n\n    Bio: Julien Sananikone is Project manager at PriceMinister.\n\n    Benjamin Guinebertière is technical evangelist at Microsoft. Benjamin works with startups and companies of different sizes to help them technically adopt Microsoft Azure cloud, should they use Big Data, Machine Learning or other technologies. He also speaks at conferences, writes (blogs, …) and takes feedback.\n\n    Combining a strong background in webmining and big data technologies with a deep interest in machine learning, Samuel Charron has earned the title of Big Data Sergeant at Data Publica, where he alternates between contributions to the development of the infrastructure of the C-Radar product and stints of rapid prototyping with Python data science libs (such as pandas, sklearn). In particular, he works on NLP related problems using unstructured web-scraped data to enrich corporate information.\n\n    Thomas is Dataiku’s Chief Data Scientist. Thomas started his career in data mining for large retail and telecommunications companies. Then he lead the data mining team and geo-marketing initiatives at Apple Europe. He was lead data scientist at qunb, a data visualization startup. He spent most of his career deriving value from large datasets using cutting-edge innovations. He is fluent in all the data scientists linguas: R, Python, SAS…\n\n",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "youtube",
  "thumbnail_url": "https://i.ytimg.com/vi/XROaMMHhVDc/hqdefault.jpg",
  "duration": null,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=XROaMMHhVDc",
      "type": "youtube",
      "length": 0
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=XROaMMHhVDc",
  "tags": [],
  "speakers": [
    "Benjamin Guinebertière",
    "Julien Sananikone",
    "Kenji Lefevre",
    "Samuel Charron"
  ],
  "recorded": "2015-04-21"
}