{
  "alias": "video/4042/integrating-django-with-identity-management-syste",
  "category": "PyCon AU 2015",
  "copyright_text": "creativeCommon",
  "description": "Most Django developers are familiar with authentication and\nauthorisation on the open web, but the requirements and technologies\nused inside companies and large organisations are different:\n\n-  Identities and groups are probably stored in an external identity\n   management system's directory rather than in an application's\n   database tables.\n\n-  Authorisation decisions will be based on group membership and\n   policies that are defined outside the application.\n\n-  Users may be expected or required to use a *single sign-on*\n   technology such as Kerberos or SAML to authenticate to applications.\n\nThis talk will familiarise the audience with these technologies and\ndemonstrate how Django applications can be integrated with an identity\nmanagement system to meet business requirements while providing a\npositive user experience. Particular technologies covered will include:\n\n-  FreeIPA: an open-source identity management solution, for defining\n   users, groups and authorisation policies\n\n-  mod\\_auth\\_gssapi / mod\\_auth\\_kerb: Apache modules for Kerberos\n   authentication\n\n-  mod\\_lookup\\_identity: Apache module to retrieve user information\n   from a directory\n\nThe talk will conclude with discussion about upcoming Kerberos features,\ntechniques for dealing with multiple authentication methods, and\nprogress in making identity management integration easier for Django\ndevelopers.\n\nPeople developing or deploying Django applications in business\nenvironments or for large open source projects with centralised identity\nmanagement will get the most out of this talk.\n",
  "duration": null,
  "id": 4042,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-08-04",
  "slug": "integrating-django-with-identity-management-syste",
  "speakers": [
    "Fraser Tweedale"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/HhcotmeioT8/hqdefault.jpg",
  "title": "Integrating Django with Identity Management Systems",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HhcotmeioT8"
    }
  ]
}
