{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "My purpose is help people to learn how to collect and use their personal\ndata to better understand and improve yourself.\n\nCurious how you are being tracking? Already like many people today\ntracking your life but wondering what more you can do with your personal\ndata?\n\nIt’s easier than ever to track our lives, work and bodies with a\nsmartphone, wearable, home sensor or computer. If you have an Android or\niPhone, use a wearable like Fitbit, or even just watch videos on\nYoutube, then you already got plenty of personal data, and we haven’t\neven started to formally track our lives.\n\nWith a world of data, the question becomes: **What can we do with all\nthis tracking data? Can it help you become a “better” version of\nyourself?**\n\nThere are a lot of great ways to work with and use your personal data,\neven spreadsheet applications like Excel and Google Sheets and more\npowerful data visualization tools like Tableau and Google Data Studio\ncan help.\n\nBut if you want to become a master of your personal data, then one of\nthe best tools is Python. Python is a great tool for not only\naggregating, collecting and cleaning up your data. But python enables\nyou to do robust data analysis and machine learning too too.\n\nIn this talk / workshop, we are exploring personal data, self-tracking,\nand personal data analysis. In the first part, I’ll show the basics on\nyou how to track your life and all about the so-called “quantified\nself.” In the second part on `QS Ledger`_, I’ll explain how to use\nPython and its data science toolkit (Pandas, Matplot, Seaborn, etc.) for\ndata collection and data processing. Part 3 looks at how to do your own\nData Exploration, Analysis and Visualization on your own tracking data.\nThrough some simple code, you can even create your own Personal Data\nDashboard. Finally, in Part 4, we look at Machine Learning. We look at\nwhere ML is typically used for personal data and some examples of how\nyou can use ML to better understand and improve yourself. In the\nconclusion, I share some of tips and recommendations for anyone wanting\nto pursue a data-driven life.\n\nBring together your personal data in interesting ways. Clean and process\nit. Find patterns with some simple data analysis. Make it beautiful with\ndata visualization. Discover meaning, insights, and correlations using\npredictive analytics and machine learning. Finally, improve your life by\ntransforming personal data into a data-driven life.\n\nIn short, can self-tracking and personal data help us become more\nproductive, healthier, and happier? I think it can. Learn how to engage\nwith your data to be smarter, make more informed decisions and become\ndata-driven!\n\n**Outline**:\n\n-  Part 1: QS / Self-Tracking: How to measure a life?\n-  Part 2: Data Collection / Extraction / Processing of Personal Data\n   with Python and `QS Ledger`_\n-  Part 3: Data Exploration and Data Viz with Python and Tableau\n-  Part 4: Machine Learning for QS and Personal Tracking Data \n-  Conclusion: Tips on How to Become a Data-Driven You\n\n.. _QS Ledger: https://github.com/markwk/qs_ledger\n",
  "duration": 2419,
  "language": "eng",
  "recorded": "2018-06-02",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pycon.sg/schedule/"
    },
    {
      "label": "Talk slides",
      "url": "https://rawgit.com/markwk/python4selftrackers/master/slides/index.html"
    },
    {
      "label": "Talk repository",
      "url": "https://github.com/markwk/python4selftrackers"
    }
  ],
  "speakers": [
    "Mark Koester"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/2Ik36zJA5Jw/maxresdefault.jpg",
  "title": "Python For Self-Trackers: How To Become A Data-Driven You",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2Ik36zJA5Jw"
    }
  ]
}
