{
  "description": "The European MaRs Analogue Station for Advanced Technologies Integration (ERAS -- www.erasproject.org) is a program spearheaded by the Italian Mars Society (IMS) which main goal is to provide an effective test bed for field operation studies in preparation for manned missions to Mars.\n\nPreliminarily to ERAS construction, IMS has started the development of an immersive Virtual Reality (VR) simulation of the Station (V-ERAS). The major advantage of such virtualization isthat it will be possible to undertake training sessions with a crew that can interact with its future environment before the actual station is built. This way a more effective design of the station and associated missions and a strong reduction of costs could be obtained. The main objective of this activity will be the achievement of adequate fidelity simulations and validation of the data obtained during the training sessions so that they can be used for the design of the station itself. Many ergonomics and human factors will be considered in the virtual model in order to be verified and validated before the actual ERAS habitat construction.\n\nThe development effort is currently divided in three main activities: • ERAS Station simulation using an appropriate game engine supporting a virtual reality headset • Upper body and hands gestures tracking • Integration of an omnidirectional treadmill\n\nRelevant part of the software development associated to V-ERAS will be undertaken by international students within the Google Summer of Code 2014 (GSoC) program were IMS participate as mentor organization.\n\nThe final goal will be the construction of a classroom in which four (or six, depending on the targeted crew size) VR stations will be installed and the definition of appropriate crew rotations in which different training sessions are performed. The availability of a single VR station prototype is targeted for September 2014 and multi-user integration, able to support four stations, should be ready for October/November 2014.\n\nPython is the language of choice for the project, and the presentation will explain how is it used.",
  "duration": 3420,
  "recorded": "2014-05-25",
  "speakers": [
    "Ezio Melotti",
    "Franco Carbognani"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/3EYTym-vTzE/hqdefault.jpg",
  "title": "V-ERAS: Un ambiente virtuale per l'esplorazione planetaria",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3EYTym-vTzE"
    }
  ]
}
