{
    "copyright_text": "CC BY",
    "description": "Como dice la famosa frase de Brett Cannon, algunas personas “vienen por\nel lenguage, pero se quedan por la comunidad”. Por lo general, empezamos\nparticipando en meetups locales o grupos enfocados como PyLadies, y a\nveces queremos ayudar, pero no estamos exactamente seguros de cómo\nhacerlo. Y yendo aún existe la posibilidad de extender nuestro trabajo\nno solo localmente sino también ayudando a las comunidades de todo el\nmundo. En esta charla, discutiremos las formas en que podemos cooperar\ndentro de la comunidad de Python en movimientos que se pueden realizar\ntanto a nivel local como fuera de nuestro país de forma voluntaria. Para\nempezar, discutiremos qué es contribuir a la comunidad y las diferentes\nformas en que puede contribuir. Además, explicaremos un poco sobre\nPython Software Foundation y sus grupos de trabajo, el papel de estos\ngrupos y cómo proceder si está interesado en ponerse en contacto y\nayudar. Destacaremos el trabajo del grupo de Diversidad e Inclusión y\ntambién el grupo de trabajo de traducción y su importancia para la\ncomunidad en general. También se presentarán algunos trabajos que están\nen proceso, como el trabajo masivo de nuestros colegas latinoamericanos\ncon Python en Español, que tiene un grupo de Discord y un grupo de\nTelegram para estudiar y cooperar juntos. Otro caso de éxito que se\npresentará es que el encuentro brasileño Python Python Brasil se esforzó\ndurante 2020 y 2021 debido a la cooperación internacional: una mujer\nbrasileña que coopera con EuroPython 2020 nos abrió el camino.\nHablaremos de lo importante que es ver a alguien como nosotros, que\nhabla el mismo idioma que nosotros, ocupando estos espacios y llevando\nnuestras inquietudes a otras mesas de discusión. Y que si no hay alguien\nque se parezca a nosotros, hay un lugar que podemos ocupar.\n",
    "language": "spa",
    "recorded": "2023-04-22",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2023/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2023/schedule/presentation/113/"
        }
    ],
    "speakers": [
        "Débora Azevedo"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/AMe1cPyJ4hE/maxresdefault.jpg",
    "title": "Cooperación internacional en la comunidad de Python",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=AMe1cPyJ4hE"
        }
    ]
}