{
    "copyright_text": "CC BY",
    "description": "While most folks aren't at the scale of cloud giants or black hole\nresearch teams that analyze Petabytes of data every day, you can easily\nfall into a situation where your laptop doesn't have quite enough power\nto do the analytics you need.\n\n\"Big data\" refers to any data that is too large to handle comfortably\nwith your current tools and infrastructure. As the leading language for\ndata science, Python has many mature options that allow you to work with\ndatasets that are orders of magnitudes larger than what can fit into a\ntypical laptop's memory.\n\nIn this hands-on tutorial, you will learn the fundamentals of analyzing\nmassive datasets with real-world examples on actual powerful machines on\na public cloud – starting from how the data is stored and read, to how\nit is processed and visualized.\n\nYou will understand how large-scale analysis differs from local\nworkflows, the unique challenges associated with scale, and some best\npractices to work productively with your data. By the end, you will be\nable to answer:\n\nWhat makes some data formats more efficient at scale? Why, how, and when\n(and when not) to leverage parallel and distributed computation\n(primarily with Dask) for your work? How to manage cloud storage,\nresources, and costs effectively? How interactive visualization can make\nlarge and complex data more understandable (primarily with hvPlot)? How\nto comfortably collaborate on data science projects with your entire\nteam?\n\nThe tutorial focuses on the reasoning, intuition, and best practices\naround big data workflows, while covering the practical details of\nPython libraries like Dask and hvPlot that are great at handling large\ndata. It includes plenty of exercises to help you build a foundational\nunderstanding within three hours.\n",
    "language": "eng",
    "recorded": "2023-04-19",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2023/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2023/schedule/presentation/64/"
        }
    ],
    "speakers": [
        "Pavithra Eswaramoorthy",
        "Dharhas Pothina"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/a94qqU6rpyE/maxresdefault.jpg",
    "title": "Data of an Unusual Size: A practical guide to analysis and interactive visualization of massive datasets",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=a94qqU6rpyE"
        }
    ]
}
