{
    "copyright_text": "CC BY",
    "description": "When we think about what Python is for, we often think of things like\nanalytics, machine learning, and web apps but python is a workhorse that\nplays a tremendous and often invisible role in our day-to-day lives,\nfrom medicine to finance, and even the transportation of goods from\nmanufacturers to the shelves of our neighborhood stores.\n\nTransportation networks are highly dynamic, goods are always moving from\npoint A to point B and money every minute is being gained or lost.\nImproving efficiency in a transportation network is critical to the\nsurvival of a business that provides transportation and distribution\nservices as well as ensuring timely delivery of goods to customers.\n\nThis talk examines 3 real-world examples of how Python is used to\nimprove the efficiency of transportation networks, particularly we will\nexplore:\n\n-  Finding the optimal match between a driver and a load at the lowest\n   possible cost using google's ``ortools``.\n-  Generating recommendations for macro level optimizations to a\n   transportation network using ``networkX``.\n-  Helping the descision making process by answering the question\n   \"Should I accept this work?\" using ``skfuzzy``.\n\nKey Takeaways:\n\n-  Graph analytics and data science concepts that facilitate getting\n   goods from manufacturers to stores more efficiently and at a lower\n   cost to businesses.\n-  An appreciation of the complexity of the logistics industry and the\n   role Python plays in making the life of drivers better.\n",
    "language": "eng",
    "recorded": "2023-04-21",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2023/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2023/schedule/presentation/61/"
        }
    ],
    "speakers": [
        "Uzoma Nicholas Muoh"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/J0W3_C0HjpE/maxresdefault.jpg",
    "title": "Into the Logisticverse: Improving Efficiency in Transportation Networks using Python",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=J0W3_C0HjpE"
        }
    ]
}