{
    "copyright_text": "CC BY",
    "description": "(English version below)\n\nAprende a hacer una API lista para producción en muy poco tiempo usando\nFastAPI... explicado con memes.\n\nCon documentación y validación de datos automáticas, basada en\nestándares, alto desempeño y otras ventajas.\n\nAdemás, puedes escribir todo el código con autocompletado y chequeos de\nerrores de tipos, incluso para tus propios datos.\n\nEn esta charla verás de qué se trata FastAPI, qué beneficios te da y por\nqué sería útil para ti.\n\nTambién verás cómo declarar datos para recibir en cada request (cada\nmensaje HTTP), usando tipos de Python estándar. Incluyendo parámetros en\nel path, en queries, y en cuerpos (body) de mensajes.\n\nTambién verás cómo declarar cuerpos de mensajes complejos con datos muy\nanidados. Y así, aún con código muy simple, tener documentación para\ntodo tu API, serialización (conversión de datos) y validación, todo\nsiguiendo estándares, y todo automáticamente.\n\n--------------\n\nLearn how to create an API ready for production in very little time\nusing FastAPI... explained with memes.\n\nYour API will have automatic validation, documentation based on\nstandards, high performance, and several other features.\n\nAll this, having editor support including autocompletion everywhere.\n\nIn this talk you will learn what FastAPI can do, and how it could\nbenefit you.\n\nYou will see how to declare the data you want to receive in each request\nusing standard Python type annotations. Including path parameters, query\nparameters, body payloads with JSON, etc.\n\nYou will also see how to use simple, standard, Python type annotations\nto declare complex JSON body payloads with deeply nested structures, and\nget automatic data validation, serialization, and documentation.\n",
    "language": "spa",
    "recorded": "2023-04-21",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2023/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2023/schedule/presentation/18/"
        }
    ],
    "speakers": [
        "Sebastián Ramírez"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/lgP9i7ugjw0/maxresdefault.jpg",
    "title": "Introducción a FastAPI",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=lgP9i7ugjw0"
        }
    ]
}