{
    "copyright_text": "CC BY",
    "description": "Se verá el área de reconocimiento de patrones y texto en imágenes\ndiversas, el procesamiento que requiere capturar, decodificar y analizar\npara finalmente obtener texto a partir de imágenes o archivos digitales.\nA partir de estas premisas, se verá el uso de la librería OpenCV y su\ncomplementación con Tesseract, (en conjunto con Python) ya que ambas\npermiten obtener datos visuales con facilidad, para posteriormente\ngenerar información textual que es de gran utilidad para funciones\ncomplejas dentro de la industria automotriz, conducción autónoma,\nregistro de actividades, señalización y sensores, robótica entre otros\nmuchos campos de aplicación. La recuperación de texto a partir de\nimágenes es un pilar fundamental para la ejecución de múltiples\ncategorías de tratamiento de datos, lo cual demuestra su gran\nimportancia como factor base para una gran variedad de aplicaciones. El\nuso de librerías de Python permite contrastar la facilidad y manejo de\ninformación gráfica, su complementación permitirá entender un poco mejor\nlas ramas de aplicación que posee el estudio de las imágenes y la visión\nartificial.\n",
    "language": "spa",
    "recorded": "2023-04-21",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2023/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2023/schedule/presentation/55/"
        }
    ],
    "speakers": [
        "Alison Orellana Rios"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/TGogVf73HGo/maxresdefault.jpg",
    "title": "OCR, Reconocimiento y obtención de información a través de imágenes",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=TGogVf73HGo"
        }
    ]
}