{
    "copyright_text": "CC BY",
    "description": "Conda is an open source, language agnostic package and environment\nmanagement system for Linux, macOS, and Windows. The conda ecosystem,\nincluding the `conda-forge <https://conda-forge.org/>`__ package\nrepository, is widely used to install, run and update packages and their\ndependencies.\n\nIn this tutorial you will learn how to create a full-fledged and easy to\ninstall Python software package using conda. We will start by\nintroducing software packaging and packaging concepts (package\ndependencies, open source licensing, ...), and an introduction to the\nconda ecosystem and how conda implements software packaging.\n\nMost of our time will be spent doing a hands-on walk through of how to\nprepare a Python software package for conda, and then how to submit that\npackage to the conda-forge, a widely used community driven package\nrepository.\n\nThe workshop is a hands-on workshop, where participants use their own\nlaptops to prepare a full-fledged Python software package that is\nsubmission-ready for the conda-forge package repository. **Participants\nneed to bring a WiFi enabled laptop with a web browser, a command line\ninterface, a text editor program, and git and/or a GitHub client already\ninstalled.**\n\n*Workshop participants will gain a basic understanding of software\npackaging, and how to prepare and publish their packages in the conda\necosystem.*\n",
    "language": "eng",
    "recorded": "2023-04-20",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2023/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2023/schedule/presentation/94/"
        }
    ],
    "speakers": [
        "Dave Clements",
        "Bianca Henderson",
        "Mahe Iram Khan",
        "Valerio Maggio"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/NSgTFf40vHQ/maxresdefault.jpg",
    "title": "Publishing your Python project, the conda way",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=NSgTFf40vHQ"
        }
    ]
}
