{
    "copyright_text": "CC BY",
    "description": "En mi desempeño como Ingeniera en Sistemas de Información en el area de\nInformatica Forense del Poder Judicial en Argentina, realizo pericias\ninformáticas referentes a todo tipo de delitos y crímenes: homicidios,\nfemicidios, robos, secuestros y muchos más. Uno de los delitos más\ncomúnmente denunciados es el delito de Grooming (en mi pais tiene una\npena de 6 meses a 4 años de prision), el cual consiste en una práctica\nde ciberacoso por medio de telecomunicaciones electrónicas en la que un\nadulto engaña a un menor de edad con una finalidad sexual, a travez de\nredes sociales o la aplicación Whatsapp.\n\nCuando una persona denuncia este delito y se ordena una pericia\ninformatica por parte de la Justicia, realizo una extracción forense del\ndispositivo celular en cuestión, obteniendo así las conversaciones\nrealizadas entre el presunto autor del delito y el/la menor de edad. Las\nconversaciones pueden contener pocas o cientos de oraciones y no siempre\ntienen contenido explicito relacionado al delito, lo que es complicado\nen tiempo y esfuerzo para los operadores de la Justicia analizar el\nsignificado de cada una de ellas y contextualizarlo. Allí entra en\nescena el modelo que desarrollé con Python que por medio del\nprocesamiento del lenguaje natural (NLP) y técnicas de machine learning\ny Deep learning le dan una solución rapida a la confirmación del delito.\nEn el futuro este modelo podrá ser extensible a otros crímenes tal como\npor ejemplo el femicidio, ya sea previamente al hecho: una mujer pueda\nutilizarlo desde una aplicación web accesible desde cualquier punto\ngeográfico y pueda predecir en habla hispana una conducta en una\nconversación realizada con su posible agresor referente al machismo o\nmisoginia, entre otras, o una vez sucedido para confirmar el hecho\nobjeto del crimen por parte de los administradores de la Justicia.\n",
    "language": "spa",
    "recorded": "2023-04-22",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2023/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2023/schedule/presentation/22/"
        }
    ],
    "speakers": [
        "Carolina Passarello"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/g77IjJUaNew/maxresdefault.jpg",
    "title": "Resolviendo crimenes con Python mediante el Procesamiento del Lenguaje Natural (NLP)",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=g77IjJUaNew"
        }
    ]
}