{
    "copyright_text": "CC BY",
    "description": "We usually associate the future of computing as large clusters being\nable to perform tasks in a fraction of a second, but is it really the\nonly scenario on how computational hardware will evolve?\n\nMachine learning has become an important component in our societies, we\nsee how people, communities, and global companies are focusing their\nresources into improving their technological stack, and being the leader\ninto the next generation of AI. At the same time that we see clusters\ngetting larger, GPUs more powerful, and our phones are practically\ncomputers being capable of doing almost everything, we do see that some\nof the smart devices are becoming smaller.\n\nThe Internet of Things has been flourishing for many years, and Python\nhas been playing an important role on the “easy to automate” topic for\nmany devices, but can Python help us in all scenarios? One of the\nchallenges for the next generation ML is to think small, you read that\nright “thinking small”.\n\nIt’s time to start being able to have mechanisms with super well-trained\nML models in small-devices: ML on Microcontrollers.\n\nWe are going to dive into TinyML and evaluate different setups to\ninteract with sensors on microcontrollers. We will discuss the different\nhardware options and frameworks to start with, while checking different\nuse cases that TinyML can solve, like: agriculture, conservation, health\nissues detection, ecology monitoring, autonomous vehicles, etc.\n\nIn this talk, you will learn about Tiny Machine Learning (TinyML), which\nis an approach that explores machine learning to be deployed in embedded\nsystems that enable run ML on microcontrollers. Similarly, I will talk\nabout Micropython and CircuitPython, and how they have been conquering\nthe microcontroller scene. Lastly, we will discuss a real use-case,\npredictive machine learning model to predict anomalies for predictive\nmaintenance problems.\n",
    "language": "eng",
    "recorded": "2023-04-21",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2023/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2023/schedule/presentation/105/"
        }
    ],
    "speakers": [
        "Maria Jose Molina Contreras"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/hWHmPHofHDo/maxresdefault.jpg",
    "title": "Start thinking small: Next level Machine Learning with TinyML and Python",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=hWHmPHofHDo"
        }
    ]
}