{
    "copyright_text": "CC BY",
    "description": "In this 3.5 hour tutorial, attendees will learn how to use the streamlit\nlibrary in Python to create interactive graphical user interfaces (GUIs)\nfor their data science projects. Through a series of hands-on exercises,\nattendees will gain practical experience using streamlit to build and\ncustomize their own interactive GUIs.\n\nThe tutorial will begin by introducing attendees to the basics of\nstreamlit, including how to install and set up the library, as well as\nthe key concepts and components of streamlit applications. Attendees\nwill then learn how to use streamlit to create simple, yet effective,\nGUIs for their data science projects, including how to display and\ninteract with data, add text and images, and create custom layouts and\nwidgets.\n\nAs the tutorial progresses, attendees will have the opportunity to work\non more advanced topics, such as using streamlit to create custom\ninteractive plots and charts, and integrating streamlit with other\npopular libraries such as Pandas and Altair. By the end of the tutorial,\nattendees will have a solid understanding of how to use streamlit to\ncreate effective and engaging interactive GUIs for their own data\nscience projects.\n\nThe tutorial will be led by an experienced data scientist with a strong\nbackground in Python and streamlit, and will include plenty of hands-on\nexercises to help attendees apply what they learn in a practical\nsetting. Attendees will also have access to detailed tutorial materials\nand code samples, as well as support from the instructor and other\nattendees throughout the tutorial.\n",
    "language": "eng",
    "recorded": "2023-04-19",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2023/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2023/schedule/presentation/45/"
        }
    ],
    "speakers": [
        "Lisa Carpenter"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/cw44529_OU8/maxresdefault.jpg",
    "title": "Streamlit for Python - How to create beautiful interactive GUIs and web apps",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=cw44529_OU8"
        }
    ]
}