{
    "copyright_text": "CC BY",
    "description": "QGIS is a freely downloadable open source GIS software suite that\ncontains a desktop option, mobile, and web component. QGIS is free to\ndownload and use, it is released with a GPL v3 license which is a non\ncommercial license allowing users to download and use it without\nconcerns compared to other commercial GIS software.\n\nQGIS core support in creating different types of maps, thanks to the\nrecent features updates QGIS version 3.14 was released with a Temporal\nController feature that is responsible for handling all the temporal\nlayers inside QGIS. Temporal support was added in the core part of QGIS\nhence users can now easily create animation maps from temporal location\ndatasets inside QGIS without any additional plugin.\n\nQGIS has scripting support using Python language, it also allows\nenhancement to its functionality through plugins that are written using\nPython language. This usage of the Python language in QGIS (PyQgis) is\nachieved by using SIP and PyQt. Through the bindings QGIS has exposed\nits core functionality via PyQgis API that can be used to create\nstandalone python applications that can use QGIS features in making\nmaps.\n\nThe aim of this talk will be to showcase how one could use Python and\nQGIS to build map animations from temporal location data using the QGIS\nTemporal Controller Python API. The session will also provide a guide on\nPyQgis Temporal API, python scripting inside QGIS, how to build\nstandalone python applications and how to create QGIS python plugins\nthat can help in making maps.\n\nThe talk is aimed at Python geospatial programmers and anyone looking to\nlearn how to use open source tools in analyzing location data. Expecting\nto raise the participant's awareness and value about the work done and\non the open source tools used in the geospatial field.\n",
    "language": "eng",
    "recorded": "2023-04-21",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2023/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2023/schedule/presentation/96/"
        }
    ],
    "speakers": [
        "Samweli Mwakisambwe"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/py93-Z8BUBY/maxresdefault.jpg",
    "title": "Using Python and PyQgis to make cool maps",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=py93-Z8BUBY"
        }
    ]
}