{
    "copyright_text": null,
    "description": "As Python becomes more widely used, the demand for learning Python is also increasing. Python can be easily installed through the official website, and there are many cases where it is pre-installed depending on the operating system. However, installing libraries for data science along with the widely used notebook environment is a bit more complicated. I will introduce the process of creating a notebook app that runs on a browser engine to teach Python to children. In this presentation, I will look at Python implementations based on WebAssembly and web-based interfaces that have shown various application possibilities in the past two years. I will introduce the process of building Pyodide, a WASM-based Python environment, together with JupyterLite, a complete notebook environment, to enable simple practice of Python in a notebook environment. I will also introduce the process of developing an implementation that uses the Python environment of the local PC as a kernel environment in JupyterLite. I will demo the process of packaging the notebook environment created in this way as a desktop app and testing the results in various ways. I will also share the results of creating a notebook app that bundles various examples along with benchmark results and having children use it. Finally, I'd like to share my personal views on browser-based Python, which has recently become famous through pyscript, and the interesting development environments that could be possible when combined with JavaScript containers.",
    "duration": 1672,
    "language": "kor",
    "recorded": "2022-10-01",
    "related_urls": [
        {
            "label": "Building a Serverless Jupyter Notebook App for Teaching Python to Kids",
            "url": "https://2022.pycon.kr/program/talk-schedule"
        }
    ],
    "speakers": [
        "Shin Jeong-gyu"
    ],
    "tags": [
        "Life / Social"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/sX1h0aAscZc/maxresdefault.jpg",
    "title": "Building a Serverless Jupyter Notebook App for Teaching Python to Kids",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=sX1h0aAscZc"
        }
    ]
}