{
    "copyright_text": null,
    "description": "Shareholder management software ZUZU is a product of a kind that has never existed in the world. It is a SaaS software that helps companies handle tasks related to shareholders, stocks, and stock options. You may be wondering why this service is a product of a kind that has never existed in the world. In order to create software like ZUZU, it must be implemented in accordance with domestic circumstances based on laws such as the Commercial Act and the Capital Market Act. In addition, the range of users who use the software is very diverse. It is a very challenging task to create a service that can be used by all of them, including the company's CEO, shareholders, and employees who have received stock options, as well as lawyers, legal advisors, and tax accountants who handle related tasks. It is a very challenging task to create a service that can be used by all of them. It is really difficult for startups to find developers these days. In order to develop software with complex requirements like the above with limited development resources, we have been developing and releasing an MVP (Minimum Viable Product), receiving feedback, and continuously improving it. I would like to share that experience in this presentation. The first part of the presentation briefly introduces ZUZU's development stack, Django and GraphQL. We will discuss the security that we paid special attention to while using Django and GraphQL, and the performance issues that we have experienced through trial and error. In the latter part of the presentation, I will share my experience on how I set up the development team structure and R&R for rapid MVP development, what efforts I made to effectively handle issues in situations where the development team resources were insufficient, and how I wrote tests since product verification is important due to the nature of the product.",
    "duration": 1767,
    "language": "kor",
    "recorded": "2022-10-02",
    "related_urls": [
        {
            "label": "Django + GraphQL Rapid MVP Development Strategy",
            "url": "https://2022.pycon.kr/program/talk-schedule"
        }
    ],
    "speakers": [
        "Jeong Jin-kyung"
    ],
    "tags": [
        "Web Service"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/P8HbMnyGH4I/maxresdefault.jpg",
    "title": "Django + GraphQL Rapid MVP Development Strategy",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=P8HbMnyGH4I"
        }
    ]
}