{
    "copyright_text": null,
    "description": "I am a clinical psychologist and currently work in psychiatry and counseling centers, providing psychological counseling and psychological evaluations. In this presentation, I will talk about how I, a non-developer working as a clinical psychologist, learned Python and was able to utilize it in my actual work, and how easy and highly usable Python is. In clinical settings, we deal with a lot of psychological data. In this video, I will introduce how to download the graded psychological evaluation results, preprocess them, and create graphs when writing a psychological evaluation report, and how to implement the search process of the DSM-5 diagnosis search program, which is a patient diagnosis system. In addition, I will introduce the procedure for automatically grading and calculating the results, storing, and managing the results by conducting pre- and post-psychological tests on Colab instead of on paper to see the effects before and after counseling for those receiving counseling. In addition, I will show you the results of implementing a graph to see how much of the effects of the pre- and post-test results were for each individual after the group counseling program. After that, I would like to show you how I write functions to register and save information when I actually do neurofeedback counseling and write my clients' diaries and manage them. Finally, I would like to wrap up by thinking about how our clinical psychologists can utilize and apply Python.",
    "duration": 1300,
    "language": "kor",
    "recorded": "2022-10-01",
    "related_urls": [
        {
            "label": "[Keynote] I tried Do clinical psychology with Python",
            "url": "https://2022.pycon.kr/program/talk-schedule"
        }
    ],
    "speakers": [
        "Go Eun-kyung"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/YA5oANXtzS8/maxresdefault.jpg",
    "title": "[Keynote] I tried Do clinical psychology with Python",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=YA5oANXtzS8"
        }
    ]
}