{
    "copyright_text": null,
    "description": "In this presentation, I will share a case of using Python in the office. It is a non-developer office worker version of \"Do anything with python\". It is a story of an office worker's struggle to finish work easily and quickly and leave work with Python in real-life situations such as \"Let's put these files on a USB and give them as a souvenir\", \"This English report is good, let's translate it (but it's 300 pages)\", \"The survey results come out on Saturday, let's report on Monday\", \"Don't use the work automation alone, make it so that we can use it and distribute it\". In terms of Python's functions and modules, I will introduce folder and file handling (os module), PDF parsing (pdfminer module), data refinement (pandas module), and creating an automation of Hangul (hwp) in a GUI and distributing it as an exe file (win32com, tkinter, pyinstaller module). In this presentation, I wanted to show that Python can be useful in workplaces without developers and in general office work that is not related to development. Although it is difficult to change what we do, we can at least change the way we work. It is using Python like Excel and Word in the office. I hope to introduce Python to those around me, learn it together, and promote the use of Python by non-developer office workers and expand the community. I expect that if more people use Python on a daily basis in the office, the code will develop further and more people will be able to work with less effort. I thought that this might be the way to realize Python's vision of \"Computer programming for everybody\" in Korean offices in the 2020s. * Presentation materials, code: https://sites.google.com/view/jaeyoon-kim/pycon",
    "duration": 1272,
    "language": "kor",
    "recorded": "2022-10-01",
    "related_urls": [
        {
            "label": "Small office coding",
            "url": "https://2022.pycon.kr/program/talk-schedule"
        }
    ],
    "speakers": [
        "Kim Jae-yoon"
    ],
    "tags": [
        "Life / Social"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/H80e4vJjYbk/maxresdefault.jpg",
    "title": "Small office coding",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=H80e4vJjYbk"
        }
    ]
}