{
    "copyright_text": null,
    "description": "Python is an essential language for technical artists around the world. Maya, one of the most widely used DCC (Digital Content Creation) tools, also uses Python as a scripting language in addition to MEL (Maya Embedded Language). Blender, which has recently emerged as a rising powerhouse in DCC, has also adopted Python as a scripting language, which is useful for creating plugins and building pipelines. This lecture shares the concept of how Python is used in actual game development from the perspective of a technical artist, from the perspective of a technical artist to practical experience. Technical Art is a craft that connects engineers and artists, and practitioners in this job are called technical artists. The work areas of technical artists are diverse, including rendering or building asset pipelines, shader writing, optimization, and profiling, and these work areas also vary by industry. Technical art is a bridge between technology and art, and depending on each individual's capabilities, some individuals have strong capabilities as engineers while others have weak capabilities as artists. Blender, like Maya, uses Python as a scripting language, so all Blender plugins are made in Python. In this reality, Python, which automates unnecessary repetition in artists' daily lives and easily provides necessary tools and functions, is an essential language for building a game development pipeline using Blender. In this session, we will introduce the concept of \"pipeline\" for building a pipeline, which is one of the core capabilities of a technical artist. In addition, we will introduce an extension of Visual Studio Code that facilitates Blender scripting using Python, and share our experience building an asset pipeline that is actually used in game development.",
    "duration": 1557,
    "language": "kor",
    "recorded": "2022-10-02",
    "related_urls": [
        {
            "label": "Technical Art 101 Building a Blender Pipeline with Python",
            "url": "https://2022.pycon.kr/program/talk-schedule"
        }
    ],
    "speakers": [
        "Park Sung-guk"
    ],
    "tags": [
        "Development Method with Python"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/9eMlzLo1m_A/maxresdefault.jpg",
    "title": "Technical Art 101 Building a Blender Pipeline with Python",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=9eMlzLo1m_A"
        }
    ]
}