{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2011", "speakers": ["Alan Franzoni"], "title": "Dependency injection is your friend", "quality_notes": "", "video_flv_length": null, "recorded": "2011-07-07", "video_mp4_length": null, "description": "Dependency injection is a technique that has been around since long, and it's\nwidely used in many programming languages and environments, but it's not that\nwidespread in the Python world.\n\nMany think that using dependency injection will force writing large-and-\ncomplex xml blobs, break encapsulation, or reduce code readability, or just\nthat it's unneeded in an highly expressive language like Python is.\n\nOn the contrary, I'll show you that DI: - doesn't require any library or\nframework; - encourages peer role identification; - helps keeping a class\nfocused and cohesive; - encourages separation between wiring from applicative\ncode; - makes your code more reusable, expressive and testable; - doesn't\nbreak encapsulation; - turns part of your coding efforts into configuration\n\nLarge applications, by the way, might just get a great maintenance boost by\nusing a real DI container, hence I'll briefly cover Pydenji, the Python(ic)\ndependency injection toolkit, and what it can do for your application.\n\nA basic knowledge of object oriented design and SOLID principles is required\nin order to fully appreciate the content of this talk.\n\n", "video_mp4_url": null, "tags": ["design", "maintenance", "xml"], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=PSeSWINJ5YM", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2011] Alan Franzoni - 24 June 2011 in \"Track Spaghetti\"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/PSeSWINJ5YM/hqdefault.jpg", "video_flv_url": null}