{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2011", "speakers": ["Federico Caboni"], "title": "Healthcare process management in Python: a use case", "quality_notes": "", "video_flv_length": null, "recorded": "2011-07-13", "video_mp4_length": null, "description": "In this talk I'll describe our successful experience in introducing Python\ninto a system for blood collection tube labeling in laboratory and hospital\nenvironments, based on IHE Technical Frameworks –the industry standard for\nmodeling and streamlining healthcare processes– and designed to avoid human\nerrors and ensure process traceability.\n\nDuring the talk I will explain why we chose Python in the first place, how\nwe've been able to leverage the language's features and characteristics for\nour specific field and what problems and limitations we faced.\n\nI will show specific instances of Python usage in different parts of the\nproject, including a low-level driver for laboratory automation machinery, an\nasynchronous messaging module, the implementation of IHE-compliant actors and\nthe inevitable end-user web application, implemented with Django.\n\nUsing Python greatly helped us in building our system, allowing very rapid\nprototyping cycles for both hardware and software, but during the talk I'll\nalso point out what we found was missing, and what would be nice to have to\nensure Python has its proper place as a viable platform for designing\nstreamlined healthcare workflows based on established international standards.\n\n", "video_mp4_url": null, "tags": ["asynchronous", "prototyping", "web"], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=MsmmrfkLuvY", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2011] Federico Caboni - 24 June 2011 in \"Track Tagliatelle \"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/MsmmrfkLuvY/hqdefault.jpg", "video_flv_url": null}