{
  "id": 1126, 
  "category": "EuroPython 2011", 
  "slug": "meteorology-climate-and-python-desperately-tryi", 
  "title": "Meteorology, Climate and Python: desperately trying to forget technical details", 
  "summary": "[EuroPython 2011] Claude Gibert - 24 June 2011 in \"Track Lasagne\"\n\n", 
  "description": "# Contents\n\nPython is a great language for writing programming frameworks. Python\nframeworks are normally addressed to software developers who are Python\nprofessionals. I developed a software package in a scientific institution,\ndesigned to be used by non-programmers, but also designed to enable\ncustomisation through programming by some users. I finally designed a three\nlevel package:\n\n  * A Python programming framework, addressed whoever wanted to invest in Python and had plans to develop applications;\n\n  * An application built on that framework with an interface designed for non-programmers;\n\n  * Ways of customising the behaviour of the application by providing some basic Python functions or more elaborated code.\n\nOne of the challenges was to offer an application with an easy to use\ninterface, not graphical, not web-based and not requiring Python programming.\nThis interface was necessary for batch processing.\n\nThis talk addresses how this project was carried out, the technical solutions\nadopted and how Python was introduced in an operational scientific institution\n([http://www.ecmwf.int](http://www.ecmwf.int)) where most users were Fortran\nprogrammers. Python was introduced as early as 2004 and it was a challenge to\ngain acceptance. I will also make a parallel with a project I am currently\nworking on for NASA\n([http://gmao.gsfc.nasa.gov/](http://gmao.gsfc.nasa.gov/)). _Desperately\ntrying to forget technical details_ summarises how I tried, using Python, to\nhelp Meteorology scientists to focus on their domain of expertise instead of\nconstantly solving technical problems.\n\n# Background:\n\nThe disciplines of Meteorology and Climate involve numerical modelling of\nphysical phenomena. The amount of data going in and out of the model is\nconsiderable. The organisation and the storage of data is complicated, their\npost-processing is a challenge. Scientists need to access and process input\nand output data to monitor the trends of the input data and to evaluate the\nperformance of their models. Those statistics, diagnostics, plots and\nverifications are crucial to the improvement of the quality of the models.\nFinding the right data, decoding it, transforming it to be ready for use are\nnecessary steps to initiate the pre-processing. All these actions are\nfundamentally the same between different prediction centres, but the data\norganisation and file formats can differ.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Standard YouTube License", 
  "thumbnail_url": "http://i.ytimg.com/vi/zZY-5cHZsT0/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=zZY-5cHZsT0", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=zZY-5cHZsT0", 
  "tags": [
    "framework", 
    "nasa", 
    "parallel", 
    "performance", 
    "python,", 
    "scientific"
  ], 
  "speakers": [
    "Claude Gibert"
  ], 
  "recorded": "2011-07-13"
}