{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2011", "speakers": ["Jonas Bardino"], "title": "MiG - A Complete Grid Middleware (mostly) in Python", "quality_notes": "", "video_flv_length": null, "recorded": "2011-07-21", "video_mp4_length": null, "description": "Grid computing was all the buzz in the beginning of the millennium and still\nhas serious attention in different forms although many of the original grand\npromises were never delivered. The general level of ambitions have instead\nslowly but steadily degraded to those of the latest buzz word, Cloud.\n\nWe as a project have proven that most of the original promises _can_ actually\nbe delivered and we have done so using Python almost solely as the\nimplementation language. The choice of Python provided us with a stable and\nversatile base for quickly getting this far and it significantly eases\nextending and maintaining our middleware in the future. MiG is currently about\n50000 lines of source code but it still offers more features than competing\ngrid systems with millions of lines of code.\n\nApart from introducing the open source MiG middleware and summarizing how we\ngot here, this talk will outline some of the core technologies used to reach\nthat goal and underline why it can make a lot of sense to choose Python for\ncomplex HPC projects like MiG, too. Talk keywords include Network Programming,\nOpen Source Python projects, Science and Math and Web-based Systems. There's\nno special intended audience, but a certain level of Python knowledge and\nexperience may be an advantage. Please refer to\n[http://code.google.com/p/migrid/](http://code.google.com/p/migrid/) for\nfurther MiG information.\n\n", "video_mp4_url": null, "tags": ["forms", "hpc", "network", "science"], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=aRYvBuYXcjk", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2011] Jonas Bardino - 22 June 2011 in \"Track Tagliatelle \"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/aRYvBuYXcjk/hqdefault.jpg", "video_flv_url": null}