{
  "id": 1016, 
  "category": "EuroPython 2011", 
  "slug": "scraping-techniques-to-extract-advertisements-fro", 
  "title": "Scraping Techniques to Extract Advertisements from Web Pages", 
  "summary": "[EuroPython 2011] Mirko Urru,Stefano Cotta Ramusino - 24 June 2011 in \"Track\nTagliatelle \"\n\n", 
  "description": "Online Advertising is an emerging research field, at the intersection of\nInformation Retrieval, Machine Learning, Optimization, and Microeconomics. Its\nmain goal is to choose the right ads to present to a user engaged in a given\ntask, such as Sponsored Search Advertising or Contextual Advertising. The\nformer puts ads on the page returned from a Web search engine following a\nquery. The latter puts ads within the content of a generic, third party, Web\npage. The ads themselves are selected and served by automated systems based on\nthe content displayed to the user.\n\nWeb scraping is the set of techniques used to automatically get some\ninformation from a website instead of manually copying it. In particular,\nwe're interested in studying and adopting scraping techniques for: i.\naccessing tags as object members ii. finding out tags whose name, contents or\nattributes match selection criteria iii. accessing tag attributes by using a\ndictionary-like syntax.\n\nIn this talk, we focus on the adoption of scraping techniques in the\ncontextual advertising field. In particular, we present a system aimed at\nfinding the most relevant ads for a generic web page p. Starting from p, the\nsystem selects a set of its inlinks (i.e., the pages that link p) and extracts\nthe ads contained into them. Selection is performed querying the Google search\nengine, whereas extraction is made by using suitable scraping techniques.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Standard YouTube License", 
  "thumbnail_url": "http://i.ytimg.com/vi/IL4o0HSGOsU/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=IL4o0HSGOsU", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=IL4o0HSGOsU", 
  "tags": [
    "google", 
    "scraping", 
    "search", 
    "web"
  ], 
  "speakers": [
    "Mirko Urru", 
    "Stefano Cotta Ramusino"
  ], 
  "recorded": "2011-07-24"
}