{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2011", "speakers": ["Alessandro Dentella"], "title": "Sqlkit: empowering database access", "quality_notes": "", "video_flv_length": null, "recorded": "2011-07-24", "video_mp4_length": null, "description": "It's very easy to access databases with Python, and there are many ORMs\nallowing a high level of abstraction. Still, it's a long road from there to\ninteractive handling of data, even for very simple tasks.\n\nSqlkit tries to act as a bridge, offering some mega-widgets that allow you to\nbuild GUI applications or directly access data using the 'sqledit'\napplication, shipped with sqlkit; sqlkit is built with PyGTK and SQLAlchemy.\n\nThis presentation covers some of the most powerful features of sqlkit, and\nshows how easy it is to build small programs for personal use, as well as rich\nand complex applications. It primarily focuses on two points: how easy it is\nto create data forms (eventually with one2many or many2many, thanks to a\noriginal definition of layouts), and the template system based on OpenOffice\nwhich allows easy report creation.\n\nThis presentation shows how sqlkit can be used both as application development\nframework and as a tool to help us while developing other applications (e.g.:\nDjango, OpenERP,… ).\n\nTo deliver a gradual presentation, we'll use the configuration system of\nsqledit, starting from a minimal configuration (a single URL) we'll add\nelements to that until we'll have a full application.\n\n", "video_mp4_url": null, "tags": ["database", "forms", "framework", "gui", "openoffice", "python,"], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=UwV2Hdb8XQQ", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2011] Alessandro Dentella - 23 June 2011 in \"Track Spaghetti\"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/UwV2Hdb8XQQ/hqdefault.jpg", "video_flv_url": null}