{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2011", "speakers": ["Alessandro Dentella"], "title": "Sqlkit: database ad accesso immediato", "quality_notes": "", "video_flv_length": null, "recorded": "2011-07-18", "video_mp4_length": null, "description": "È molto facile accedere ad un database con Python e ci sono molti ORM che\npermettono un alto livello di astrazione. Da qui c'é ancora una lunga strada\nper arrivare a manipolare interattivamente i dati anche per semplici compiti.\n\nSqlkit cerca di coprire questa distanza fornendo alcuni mega-widgets che\npermettono di costruire ogni applicazione GUI o accedere direttamente ai dati\ncon l'applicazione 'sqledit', che viene distribuita con sqlkit. Sqlkit è\ncostruita con PyGTK e SQLAlchemy.\n\nQuesta presentazione esplora alcune fra le più potenti caratteristiche di\nsqlkit e mostra quanto sia semplice costruire piccoli programmini ad uso\npersonale o applicazioni ricche ed articolate. Si focalizza principalmente su\ndue punti: quanto sia facile creare maschere per editare dati (anche relazioni\non2many o many2many, grazie al modo originale di definire i layout) e al\nsistema di template basato su OpenOffice che rende incredibilmente semplice\ncreare report.\n\nQuesta presentazione vuole mostrare come sqlkit può essere usato sia come\nframework di sviluppo di applicazioni, sia come strumento che ci aiuta mentre\nsviluppiamo altre applicazioni (es.: Django, OpenERP,… ).\n\nPer rendere la presentazione più graduale, sfrutteremo il sistema di\nconfigurazione di sqledit Partendo da una configurazione minima -un URL-\naggiungeremo elementi fino ad ottenere una vera applicazione.\n\n", "video_mp4_url": null, "tags": ["ci", "database", "framework", "gui", "openoffice", "orm"], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=nx04zGh3gME", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "Italian", "video_webm_length": null, "summary": "[EuroPython 2011] Alessandro Dentella - 21 June 2011 in \"Track Italiana Big\nMac\"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/nx04zGh3gME/hqdefault.jpg", "video_flv_url": null}