{
  "id": 1012, 
  "category": "EuroPython 2011", 
  "slug": "the-political-implications-of-having-fun-while-p", 
  "title": "The political implications of having fun (while programming open source)", 
  "summary": "[EuroPython 2011] Benno Luthiger - 23 June 2011 in \"Track Spaghetti\"\n\n", 
  "description": "What are the implications for the society if people enjoy their work, because\nthis work is perceived as rewarding by itself? It is this question that\noccupies me since I have finished my Ph.D. research about the motivation of\nopen source programmers. In my research, I have been able to show that fun is\nan important driver for open source programmers. Moreover, fun plays an\nimportant role not only for hobbyists, but for developers who are paid for\ntheir work too (open or closed source).\n\nThese findings contrast with the traditional efforts of leftist parties and\nlabor unions. For those political organizations, labor is perceived as\ncompulsion and exploitation and, therefore, people have to be liberated from\nlabor. The resulting political praxis is to send people into retirement as\nsoon as possible and, on the other hand, to make the life for unemployed\npeople carefree.\n\nIs the software developers‘ world a little Shangri-La, apart from the real\nworld, delineated by the leftist parties, or is the open source model\ngeneralizable? What happens with the values generated through the labor if the\nwork as such is rewarding? The open source mode of production is part of our\nmodern reality and in my presentation I would like to consider this big\nreality from the perspective of open source.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Standard YouTube License", 
  "thumbnail_url": "http://i.ytimg.com/vi/SVXq0LfuPUE/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=SVXq0LfuPUE", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=SVXq0LfuPUE", 
  "tags": [], 
  "speakers": [
    "Benno Luthiger"
  ], 
  "recorded": "2011-07-24"
}