{
  "id": 1062, 
  "category": "EuroPython 2011", 
  "slug": "using-python-in-software-for-the-medical-industry", 
  "title": "Using Python in Software for the Medical Industry", 
  "summary": "[EuroPython 2011] wesley chun - 21 June 2011 in \"Track Tagliatelle\"\n\n", 
  "description": "The medical industry has long been dominated by custom software written by\nmanufacturers of medical equipment. With the widespread use of lower-cost\ncomputing power and abundance of software developers using cost-beneficial\nopen source development tools, it is no surprise that this is a rapidly-\ngrowing field in software engineering. In this talk, I will describe some of\nmy experiences using Python and other open source tools, temporarily\ntransitioning from the world of the web and Internet development, jumping into\nthe medical industry, an experience much like being a fish out of water. The\nexperiences of working in this field, specifically developing software for use\nin clinical trials. We describe the use of open source tools for such software\ndevelopment, the required integration with closed-source software, and the\ndocumentation rigor that is necessary in a field under the jurisdiction of the\nUS Food and Drug Administration (FDA). In particular, I'll describe direct\nexperience in building an application for the use of analyzing spinal\nfractures and the various tools that make up the application suite, whose\nprimary development language was Python. We will also discuss the particular\nrole of the my employer at the time in the clinical trials process and\nelaborate on the data flow that was necessary for all medical applications\ndeveloped at the firm, not just the one in particular.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Standard YouTube License", 
  "thumbnail_url": "http://i.ytimg.com/vi/SFi7LpBr-JY/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=SFi7LpBr-JY", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=SFi7LpBr-JY", 
  "tags": [
    "documentation", 
    "web"
  ], 
  "speakers": [
    "wesley chun"
  ], 
  "recorded": "2011-07-18"
}