{
  "id": 1011, 
  "category": "EuroPython 2011", 
  "slug": "what-is-google-app-engine", 
  "title": "What is Google App Engine?", 
  "summary": "[EuroPython 2011] wesley chun - 23 June 2011 in \"Track Tagliatelle\"\n\n", 
  "description": "Google App Engine is a unique hosting platform that lets you build\napplications and run them in Google's data centers using the massive global\ninfrastructure built to run the Internet's most powerful company. App Engine\noffers a development environment that uses familiar technologies (Java and\nPython) and provides a powerful and robust set of APIs to users while\nmaintaining security and independence from other apps running in the cloud. It\nis always free to get started so you can try it out with no risk, and if you\nneed additional computing resources, you can purchase additional computing\nresources beyond the free quota limits. (If you enable billing and trust us\nwith your credit card, we will extend your free quotas even further; you won't\nget charged until you exceed those _extended_ quotas.) Scale your application\nto millions of users and pay only for what you use at competitive market\npricing.\n\nIn this session, we provide an update of the newest features found in the most\nrecent releases of the App Engine platform. We also share some suggestions for\nbest practices to existing App Engine developers.\n\nBeginners to the App Engine platform will be interested in the introductory\nworkshop which may be offered (see description below).\n\nGoogle App Engine workshop\n\nIn this tutorial, we'll give you a comprehensive introduction to the platform\nin two/three components:\n\n  * 1-hour Introduction to Cloud computing and Google App Engine seminar\n  * 3-hour App Engine hands-on workshop/codelab\n\nIn the first hour, we review Cloud Computing as an industry and where Google\nApp Engine fits into the picture. Specifically, we discuss App Engine as a\nPaaS solution because of the inherent challenges of building web and other\napplications. We'll outline the architecture of App Engine, what it's major\ncomponents are, introduce its features and APIs, discuss the service and how\nit works (including information on the free quotas), present some information\nabout current users and usage, including integration with Google Apps, and\nfinally, give an overview of its enterprise edition called Google App Engine\nfor Business.\n\nAfter the approximately one-hour lecture, we'll show you how to create\napplications that run on App Engine by building a simple but real web\napplication from the ground up via a hands-on coding laboratory. Although\nbased on the online tutorial, this codelab goes up and beyond what's in the\ndocumentation: you will get a more detailed step-by-step instructions to\nreplicate that example as well as have the opportunity to extend your\napplication with some of the newer APIs that come with App Engine. The codelab\nwill cover the Users service, non-relational Datastore, and Memcache APIs.\nTime-permitting, we'll also discuss some of the newest features found in\nrecent App Engine releases.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Standard YouTube License", 
  "thumbnail_url": "http://i.ytimg.com/vi/YiimQ3zyxRQ/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=YiimQ3zyxRQ", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=YiimQ3zyxRQ", 
  "tags": [
    "architecture", 
    "cloud", 
    "google", 
    "hosting", 
    "infrastructure", 
    "memcache", 
    "security", 
    "web"
  ], 
  "speakers": [
    "wesley chun"
  ], 
  "recorded": "2011-07-24"
}