{
  "alias": "video/3847/hand-me-the-salt-while-i-read-my-news",
  "category": "PyCon ZA 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "Focusing on the infrastructure we built, using Salt for management; give\ninsight into the news game and provide examples of challenges our team\nare facing on a daily basis while servicing users. Expanding also on the\nworkflow put together using various solutions such for logging,\nnotifications with Python acting as the coordinator to keep all these\nsystems in line. Delving into various parts of the system from network\nmonitoring to deploying code. This talk is meant for anyone interested\nin getting a glimpse of the systems and workflow put in place that allow\nus to manage the required load and continue developing with the agility\nto make the needed quick decisions daily.\n",
  "duration": null,
  "id": 3847,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-10-02",
  "slug": "hand-me-the-salt-while-i-read-my-news",
  "speakers": [
    "Johann du Toit"
  ],
  "summary": "Millions of people read news monthly, and news tend to happen in bursts.\nThe ideal infrastructure is able to scale up or down as soon as needed\nand provide a way to let you proactively manage your servers rather than\nreactively, which in the media game is a deal breaker. It gets even\nworse when you're running most of the local publication sites, including\nsome big name players.\n",
  "tags": [
    "pyconza",
    "pyconza2014"
  ],
  "thumbnail_url": "https://archive.org/download/pyconza2014-salt-while-read-news/pyconza2014-salt-while-read-news.thumbs/3%20A%20Hand%20me%20the%20salt%20while%20I%20read%20my%20news-_000210.jpg",
  "title": "Hand me the salt while I read my news",
  "videos": [
    {
      "type": "mp4",
      "url": "https://archive.org/download/pyconza2014-salt-while-read-news/3%20A%20Hand%20me%20the%20salt%20while%20I%20read%20my%20news-.mp4"
    },
    {
      "type": "ogv",
      "url": "https://archive.org/download/pyconza2014-salt-while-read-news/3%20A%20Hand%20me%20the%20salt%20while%20I%20read%20my%20news-.ogv"
    }
  ]
}
