{"whiteboard": "ia scrape", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon ZA 2014", "speakers": ["Adam Jorgensen"], "title": "Python in the context of a Start-up: The Good, The Bad and the Ugly", "quality_notes": "", "video_flv_length": null, "recorded": "2014-10-03", "video_mp4_length": null, "description": "Python is great language for developing software that works well in a short time-span. The ability to produce code quickly that is of a reasonable quality is very important in a work environment where productivity is of extreme importance. It would thus seem to be very well suited for usage in a start-up environment. Is this really the case though?\nHere at Springlab we've been using Python to develop our product, an online platform for locating and booking with medical practitioners, since day one. Along the way we've written a lot of code, used a variety of frameworks, libraries and toolkits while experimenting with various approaches to solving the problems we've encountered. Of key importance to us has been balancing the need to produce code that works now against the desire to develop something that we won't become a serious time-sink in the future.\nFrom our position it is thus possible to go into a bit of detail about the pros, cons and extremely sharp corners encountered using Python in the context of a small start-up environment where time is of the essence and there is a lot of pressure to produce a quality product as quickly AND as well as possibly.\nMy aim with this talk is to give the listener an idea of what kind of experience to expect when using Python in an environment like ours and also to hopefully share some tips that will help others avoid some of the problems we've run into. I hope to cover issues on the subjects of back-end development involving Django + Tastypie, front-end development with Flask, client-side development involving JavaScript as well as touching on the subject of integrating with other tools and pieces of software.", "video_mp4_url": "http://archive.org/download/pyconza2014-python-in-a-start-up/12%20A%20Python%20in%20the%20context%20of%20a%20Start-up-.mp4", "tags": ["pyconza", "pyconza2014"], "copyright_text": "http://creativecommons.org/licenses/by/3.0/", "related_urls": [], "video_flv_download_only": false, "source_url": "http://archive.org/details/pyconza2014-python-in-a-start-up", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "http://archive.org/download/pyconza2014-python-in-a-start-up/12%20A%20Python%20in%20the%20context%20of%20a%20Start-up-.ogv", "language": "English", "video_webm_length": null, "summary": "Python is great language for developing software that works well in a short time-span. The ability to produce code quickly that is of a reasonable quality is very important in a work environment where productivity is of extreme importance. It would thus seem to be very well suited for usage in a start-up environment.", "thumbnail_url": "http://archive.org/download/pyconza2014-python-in-a-start-up/pyconza2014-python-in-a-start-up.thumbs/12%20A%20Python%20in%20the%20context%20of%20a%20Start-up-_000001.jpg", "video_flv_url": ""}