{
  "alias": "video/3841/python-in-the-context-of-a-start-up-the-good-th",
  "category": "PyCon ZA 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "Python is great language for developing software that works well in a\nshort time-span. The ability to produce code quickly that is of a\nreasonable quality is very important in a work environment where\nproductivity is of extreme importance. It would thus seem to be very\nwell suited for usage in a start-up environment. Is this really the case\nthough? Here at Springlab we've been using Python to develop our\nproduct, an online platform for locating and booking with medical\npractitioners, since day one. Along the way we've written a lot of code,\nused a variety of frameworks, libraries and toolkits while experimenting\nwith various approaches to solving the problems we've encountered. Of\nkey importance to us has been balancing the need to produce code that\nworks now against the desire to develop something that we won't become a\nserious time-sink in the future. From our position it is thus possible\nto go into a bit of detail about the pros, cons and extremely sharp\ncorners encountered using Python in the context of a small start-up\nenvironment where time is of the essence and there is a lot of pressure\nto produce a quality product as quickly AND as well as possibly. My aim\nwith this talk is to give the listener an idea of what kind of\nexperience to expect when using Python in an environment like ours and\nalso to hopefully share some tips that will help others avoid some of\nthe problems we've run into. I hope to cover issues on the subjects of\nback-end development involving Django + Tastypie, front-end development\nwith Flask, client-side development involving JavaScript as well as\ntouching on the subject of integrating with other tools and pieces of\nsoftware.\n",
  "duration": null,
  "id": 3841,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-10-03",
  "slug": "python-in-the-context-of-a-start-up-the-good-th",
  "speakers": [
    "Adam Jorgensen"
  ],
  "summary": "Python is great language for developing software that works well in a\nshort time-span. The ability to produce code quickly that is of a\nreasonable quality is very important in a work environment where\nproductivity is of extreme importance. It would thus seem to be very\nwell suited for usage in a start-up environment.\n",
  "tags": [
    "pyconza",
    "pyconza2014"
  ],
  "thumbnail_url": "https://archive.org/download/pyconza2014-python-in-a-start-up/pyconza2014-python-in-a-start-up.thumbs/12%20A%20Python%20in%20the%20context%20of%20a%20Start-up-_000001.jpg",
  "title": "Python in the context of a Start-up: The Good, The Bad and the Ugly",
  "videos": [
    {
      "type": "mp4",
      "url": "https://archive.org/download/pyconza2014-python-in-a-start-up/12%20A%20Python%20in%20the%20context%20of%20a%20Start-up-.mp4"
    },
    {
      "type": "ogv",
      "url": "https://archive.org/download/pyconza2014-python-in-a-start-up/12%20A%20Python%20in%20the%20context%20of%20a%20Start-up-.ogv"
    }
  ]
}
