{
  "alias": "video/3845/reaching-beyond-the-web",
  "category": "PyCon ZA 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "Using RapidSMS to power democracy in Libya. As web developers, we often\nthink of the web as being a ubiquitous resource, available to everyone.\nThe truth is that there are still large groups of people who have either\nlimited or no web access. In addition, there are people who have\nexcellent web access, yet still prefer to use simpler tools to connect\nto others. How can we reach these groups of people? While not perfectly\nubiquitous, SMS technology is much more widespread, especially in areas\nthat don't have great internet connectivity. It's also ubiquitous in the\nsense that people who have excellent internet access still use SMS\nfrequently. The government of Libya recently implemented a voter\nregistration system and chose to use SMS as the implementation\ntechnology, largely because of these reasons. In this talk, I will\nexplain how we used RapidSMS, a Django-based SMS framework, to build\nthis groundbreaking voter registration system. We will discuss the\nbasics of the RapidSMS framework, and show concrete examples from our\nLibyan project. I will mostly describe concepts at a high level, though\nfamiliarity with Python code may help you understand the details. If you\ntruly want your tools to reach everyone, adding SMS connectivity will\nspread the power of your web apps.\n",
  "duration": null,
  "id": 3845,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-10-03",
  "slug": "reaching-beyond-the-web",
  "speakers": [
    "Vinod Kurup"
  ],
  "summary": "The government of Libya recently implemented a voter registration system\nand chose to use SMS as the implementation technology, In this talk, I\nwill explain how we used RapidSMS, a Django-based SMS framework, to\nbuild this groundbreaking voter registration system.\n",
  "tags": [
    "pyconza",
    "pyconza2014"
  ],
  "thumbnail_url": "https://archive.org/download/pyconza2014-reaching-beyond-the-web/pyconza2014-reaching-beyond-the-web.thumbs/14%20A%20Reaching%20Beyond%20the%20Web-_000450.jpg",
  "title": "Reaching Beyond the Web",
  "videos": [
    {
      "type": "mp4",
      "url": "https://archive.org/download/pyconza2014-reaching-beyond-the-web/14%20A%20Reaching%20Beyond%20the%20Web-.mp4"
    },
    {
      "type": "ogv",
      "url": "https://archive.org/download/pyconza2014-reaching-beyond-the-web/14%20A%20Reaching%20Beyond%20the%20Web-.ogv"
    }
  ]
}
