{
  "alias": "video/3827/the-elephant-in-the-web-application",
  "category": "PyCon ZA 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "In this talk, I'd like to convince you that developing a web application\ntoday is an unnecessarily cumbersome and error prone task. It is time\nfor web frameworks to evolve and become more like graphical user\ninterface (GUI) frameworks: these provide abstractions called \"windows\"\nor \"widgets\" that let a programmer write an application using terms that\ndescribe what is being built, with less (if any) focus on the underlying\ntechnologies needed to accomplish drawing these items on a screen. A web\napplication programmer (in contrast to a GUI programmer) needs to know\nquite a few different technologies and a fair bit of effort is required\nto orchestrate these tools into achieving an end result: a template\nlanguage, HTML, HTTP, CSS, JavaScript, etc. Reusing something\nsubstantial is especially difficult, which means in a sizeable web\napplication the same dragons need to be fought several times over. If a\nprogrammer has to constantly deal with all this subject matter, it takes\nfocus away from what actually needs to be built: the application itself.\nWhy are we putting up with having to know HTML and similar low-level\ntechnologies? Is it an elephant in the room? Something we pretend not to\nsee, yet we accept the burden of having to work around it? I will show\nyou what it takes to build a web application; what repetitive tasks\nthere are and what a programmer needs to be aware of. I hope to convince\nyou that there's a better way, and that what was perhaps an idealistic\ndream a decade ago can now be done - not only by our own fully-featured\nPython web framework (Reahl), but also by a small number of others\nbeyond the realm of Python.\n",
  "duration": null,
  "id": 3827,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-10-02",
  "slug": "the-elephant-in-the-web-application",
  "speakers": [
    "Iwan Vosloo"
  ],
  "summary": "Developing a web application today is an unnecessarily cumbersome and\nerror prone task. It is time for web frameworks to evolve and become\nmore like graphical user interface (GUI) frameworks\n",
  "tags": [
    "pyconza",
    "pyconza2014"
  ],
  "thumbnail_url": "https://archive.org/download/pyconza2014-elephant-in-the-web-app/pyconza2014-elephant-in-the-web-app.thumbs/2%20A%20The%20elephant%20in%20the%20web%20application-_001410.jpg",
  "title": "The elephant in the web application",
  "videos": [
    {
      "type": "mp4",
      "url": "https://archive.org/download/pyconza2014-elephant-in-the-web-app/2%20A%20The%20elephant%20in%20the%20web%20application-.mp4"
    },
    {
      "type": "ogv",
      "url": "https://archive.org/download/pyconza2014-elephant-in-the-web-app/2%20A%20The%20elephant%20in%20the%20web%20application-.ogv"
    }
  ]
}
