{
  "alias": "video/3842/using-python-in-blender",
  "category": "PyCon ZA 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "Python is such a beautiful language, and is used as a scripting language\nin many open source graphical applications. By using the power of Python\nwithin Blender, we can easily automate so many things, and make long\ntedious tasks seem like child's play. In this talk I wanted to share a\nfew real world examples where I used Python to do something that would\notherwise be impossible (Or just take too long!) At first, we will take\na quick look at the API, and how to get started. Here we will look at\nwhere you can find what you are looking for, and how it all comes\ntogether. This wont be too in-depth, but just enough to give you a\ntaste. We will play with the console a bit and see how to wield the\nmighty sword that is Python. And then, we will look at some scripts.\nThese are a few of the scripts that I wrote while I was working on some\nrandom things. This will cover some things such as: Adding new mesh\nobjects, updating object coordinates, changing special properties (such\nas modifers), and setting keyframes all from the console. This talk is\nfor anyone interested in seeing just how to leverage the power of Python\nin Blender. You need not have any experience with Blender since this\nwill be mostly focussed on the Python side of things, so I wont be\ncovering parts of Blender such as rendering, modeling etc.\n",
  "duration": null,
  "id": 3842,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-10-02",
  "slug": "using-python-in-blender",
  "speakers": [
    "Albert Nel"
  ],
  "summary": "Python is such a beautiful language, and is used as a scripting language\nin many open source graphical applications. By using the power of Python\nwithin Blender, we can easily automate so many things, and make long\ntedious tasks seem like child's play.\n",
  "tags": [
    "pyconza",
    "pyconza2014"
  ],
  "thumbnail_url": "https://archive.org/download/pyconza2014-python-in-blender/pyconza2014-python-in-blender.thumbs/5%20a%20Using%20Python%20in%20Blender-_000450.jpg",
  "title": "Using Python in Blender",
  "videos": [
    {
      "type": "mp4",
      "url": "https://archive.org/download/pyconza2014-python-in-blender/5%20a%20Using%20Python%20in%20Blender-.mp4"
    },
    {
      "type": "ogv",
      "url": "https://archive.org/download/pyconza2014-python-in-blender/5%20a%20Using%20Python%20in%20Blender-.ogv"
    }
  ]
}
