{
  "alias": "video/3840/what-i-learned-about-python-and-about-guidos-t",
  "category": "PyCon ZA 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "",
  "duration": null,
  "id": 3840,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-10-03",
  "slug": "what-i-learned-about-python-and-about-guidos-t",
  "speakers": [
    "David Mertz"
  ],
  "summary": "One of the ways that changes enter the Python language is via their\nprior discussion on the python-ideas mailing list. Many core\ncontributors read and contribute to this list, some do not, and a large\nnumber of other interested Python programmers also participate in the\ndiscussion. A recurring element of these fascinating discussions is that\nideas which seem compelling at first blush, upon deeper discussion\nreveal the greater wisdom of doing things just the way Python already\ndoes. Not always, of course, but often. A wonderful case study of this\nprocess is the innocuous seeming built-in 'sum()'. This function has an\nintricate history, with a great deal of dispute over just what its\nsemantics and performance characteristics can or should be. A particular\nthread on python-ideas, rich with discussions of use cases and subtle\nsemantics, led both to the creation of the 'statistics' module in Python\n3.4 (which contains a \"private\" version of the function,\n'statistics.\\_sum()') and to a rejection of performance \"optimizations\"\nwhen operating over collections of collections (which may or may not\nseem obvious to \"sum\" in the first place).\n",
  "tags": [
    "pyconza",
    "pyconza2014"
  ],
  "thumbnail_url": "https://archive.org/download/pyconza2014-python-ideas/pyconza2014-python-ideas.thumbs/8%20What%20I%20learned%20about%20Python-_000690.jpg",
  "title": "What I learned about Python – and about Guido's time machine – by reading the python-ideas mailing list",
  "videos": [
    {
      "type": "mp4",
      "url": "https://archive.org/download/pyconza2014-python-ideas/8%20What%20I%20learned%20about%20Python-.mp4"
    },
    {
      "type": "ogv",
      "url": "https://archive.org/download/pyconza2014-python-ideas/8%20What%20I%20learned%20about%20Python-.ogv"
    }
  ]
}
