{
  "alias": "video/3824/writing-python-code-to-decide-an-election",
  "category": "PyCon ZA 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "This is not something we could get wrong. We combined agile development\nwith best practices in testing and QA to build an open source tally\nsystem that was well tested, accurate, and easy to use. We will describe\na success story of iterative behavior/test-driven-development under\nextreme conditions. Did the structure of the data change the day before\nthe election? Yes. Did we have the tests to ensure that our\nimplementation changes would not compromise the system's integrity? Yes,\nand they didn't. This talk provides a narrative to both Software\nEngineers and Tech/Product Managers describing why best practices are\nessential for any organization and any project of any size. We will\nprovide the audience with: 1. Real world examples they can implement in\ntheir own workflow and organizations, 2. Insight into what succeeded\n(quick iteration with prioritization) and what was challenging (nothing\nbeing static), 3. Anecdotes and coherent arguments they can take back to\ntheir organization to advocate for best practices.\n",
  "duration": null,
  "id": 3824,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-10-02",
  "slug": "writing-python-code-to-decide-an-election",
  "speakers": [
    "Peter Lubell-Doughtie"
  ],
  "summary": "Earlier this year Ona was given three weeks to write the software that\nwill tally votes in the Libyan elections and decide who wins and who\nloses. This is not something we could get wrong.\n",
  "tags": [
    "pyconza",
    "pyconza2014"
  ],
  "thumbnail_url": "https://archive.org/download/pyconza2014-code-to-decide-election/pyconza2014-code-to-decide-election.thumbs/1%20Writing%20Python%20Code%20to%20Decide%20an%20Election-_002250.jpg",
  "title": "Writing Python Code to Decide an Election",
  "videos": [
    {
      "type": "mp4",
      "url": "https://archive.org/download/pyconza2014-code-to-decide-election/1%20Writing%20Python%20Code%20to%20Decide%20an%20Election-.mp4"
    },
    {
      "type": "ogv",
      "url": "https://archive.org/download/pyconza2014-code-to-decide-election/1%20Writing%20Python%20Code%20to%20Decide%20an%20Election-.ogv"
    }
  ]
}
