{
  "abstract": "*> N*\n\nYou have found a secret room in the castle! You gain 26 xp.\n\nYou enter a large interior space with stone walls and a high stone\nceiling. Torches flicker in wall brackets. A large self-referential\ntapestry hanging on the north wall shows a guild workshop full of happy\nweavers busily weaving the very tapestry in which they are depicted.\nThere are exits to the east, west, and south.\n\n**Linden** , another player, is here. **Gwyrian** , another player, is\nhere.\n\n*> say \"Hi\"*\n\nYou say \"Hi\"\n\nGwyrian says \"Hey! Do you want to explore this area together?\"\n\nLinden attacks you with a critical hit from their sword!\n\nYou are dead!\n\nOther people: sometimes difficult to work with and often impossible to\npredict. In your technical or documentation project, how can you get the\nright people interested and involved? How can you keep those people\nhappily engaged until the work is done? Is there anything you can do to\nprevent griefing… err, “interpersonal difficulties” from causing delays?\nAnd why do some people seem to thrive in an environment with poor\ndocumentation and how can you encourage them to participate in\neffectively documenting everything anyway?\n\nIn this talk, I'll explore ways to accomplish these aims, using\nstrategies drawn from “Player Type Theory” . For 20 years, this theory\nhas been employed by game designers to encourage stable long-term play\ncommunities in online multiplayer games. These are strategies that I\nhave used successfully in my workplace and they can work for you too.\n",
  "copyright_text": null,
  "description": "",
  "duration": 1793,
  "language": "eng",
  "recorded": "2017-05-15",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/na/2017/"
    }
  ],
  "speakers": [
    "Kenzie Woodbridge"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/BiYSJ5dkoM0/maxresdefault.jpg",
  "title": "Everyone's a player (in a mid-90s MUD)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BiYSJ5dkoM0"
    }
  ]
}
