{
  "abstract": "For developers in newsrooms, whose work supports great writing and\njournalism all day long, writing their own docs often falls by the\nwayside. News deadlines can leave little time for cleanup and\ndocumentation (much less the planning that leads to reusable code). At\nOpenNews, these developers, designers, and data analysts are our\ncommunity, and we designed a series of small events to address that time\ncrunch. We bring people together a few times a year to refine, document,\nand release open-source projects, because a common set of tools means\nmore time spent covering the news, less time on recreating code.\n\nDuring these events, we''ve seen a common set of cultural and technical\nquestions come up before, during, and after projects--but our community\ndidn''t have a common pool of answers.\n\nSo last year, we did something about it. Inspired by collaborative book-\nwriting projects, we put together a community documentation sprint in\nDecember 2016. The goal: to draft a guidebook for releasing newsroom\ncode. Over two intensive days, 11 contributors gathered with us in\nWashington, D.C., and another dozen signed on as remote editors.\nTogether, they captured our community''s best practices for\nopen-sourcing software, specifically in the context of newsrooms and\njournalism. They worked in pairs or small groups, clustered around\nlaptops, collaborating for long stretches of writing. We fed them many\nsnacks.\n\nThe Field Guide to Open Source in the Newsroom launched in February, and\nwe learned a lot as it came together. We''d love to tell you:\n\n-  How we recruited and prepared a diverse, expert team of participants\n   for a productive event\n\n-  How we ran the two-day documentation sprint, with a flexible,\n   supportive structure\n\n-  How we built in time for followthrough after the event, with plans\n   for outreach, adoption and onboarding\n\n-  And how we made the whole thing human-friendly\n",
  "copyright_text": null,
  "description": "",
  "duration": 1581,
  "language": "eng",
  "recorded": "2017-05-15",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/na/2017/"
    }
  ],
  "speakers": [
    "Ryan Pitts",
    "Lindsay Muscato"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/08l9FGJOz5E/maxresdefault.jpg",
  "title": "No Community Members Were Harmed in the Making of This Doc Sprint: How we ran a 48-hour event to collect community wisdom into a guidebook for newsroom developers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=08l9FGJOz5E"
    }
  ]
}
