{
  "abstract": "The Wisdom of Crowds:Crowdsourcing Minimalism in an Open Organization by\nIngrid Towey, Brice Fallon-Freeman, and Aneta Petrová\n\nWhat does choosing flavors of LaCroix sparkling water for the Red Hat\nbreakroom have to do with improving technical documentation? At Red Hat,\neverything.\n\nYou see, when we wanted to make a culture shift in our approach to\ndocumentation, we couldn't legislate the change from the top down.\nManagers and experts just don't have that kind of authority at Red Hat.\nChanging the way we write has had to be a grassroots, bottom-up effort.\nJust like we all get to vote on which flavors of sparkling water and\nother beverages are stocked in our fridge, writers, editors, content\nstrategists, and managers ALL have a say in our latest writing trends.\nAt Red Hat, we have an open culture where people expect to have a voice\nin decisions and aren't afraid to speak their minds. This open culture\naffects every aspect of our working lives.\n\nWhat Did We Want to Change? We wanted to introduce our teams to\nminimalist writing. But first we had to convince people that minimalism\nisn't just about shorter sentences and less fluffy documentation.\nMinimalist writing means that you focus like a laser on just what your\ncustomers need at the moment. It's harder than it sounds.\n\nHow Did We Do It?First, we formed an international team that could\ninfluence writers across all our geographical regions (geos). Brice\nFallon-Freeman (from Australia), Aneta Petrová (from the Czech\nRepublic), and I (from the US) became this team and brainstormed ways to\nintroduce these concepts to our departments.\n\nAneta and Brice came up with the idea of crowdsourcing minimalist\nwriting critiques, and all three of us tried the concept in our\ndifferent geos. We got volunteers to join our groups, and then we got\nmore volunteers who were willing to have their content critiqued. This\n“crowd” of writers and editors then worked together to give meaningful\nfeedback to the people who had been brave enough to volunteer their\ncontent.\n\nThe beauty of this model is that it gives experienced writers a way to\nteach more junior writers without the process being apparent. No one has\nto admit to being ignorant. Inexperienced writers get to learn about\nminimalism by watching other people apply it to real content and not in\nsome kind of fake training situation.\n\nThis talk will discuss our strategies and methods in more detail and\nshow examples of content before and after crowdsourced minimalism.\n",
  "copyright_text": null,
  "description": "",
  "duration": 2004,
  "language": "eng",
  "recorded": "2017-05-15",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/na/2017/"
    }
  ],
  "speakers": [
    "Ingrid Towey"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/s3Em8QSXyn8/maxresdefault.jpg",
  "title": "The Wisdom of Crowds: Crowdsourcing Minimalism in an Open Organization",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=s3Em8QSXyn8"
    }
  ]
}
