{
  "abstract": "Last spring, as I approached reworking the information architecture of\nthe NPR One Developer Center, I started by interviewing several of our\npartner developers to find out what pain points they encountered when\ndeveloping on our platform.\n\nOverwhelmingly, the responses included complaints about confusing site\nnavigation and frustration around having to search multiple pages to\nstring together the necessary information to implement features. After\nconsidering this feedback, we redesigned the documentation site to focus\non information needed to complete a desired task, and while we still\nprovide endpoint reference documentation, my focus now is to start from\nthinking about what a developer is trying to accomplish, rather than\nwhat data an endpoint is capable of providing. Essentially, the focus of\nthe docs shifted away from what the API can do, towards what “I”, as the\ndeveloper, can do with this API.\n\nTaking a task-oriented approach allowed us to reorganize and revise our\ncontent in a way that has significantly shortened our onboarding process\nfor partner developers, shortening the app verification process and\ntime-to- market, and most importantly allows us to better collaborate\nwith our partners to develop exciting new experiences for NPR listeners.\nFor those who work on documenting hypermedia APIs, this can be a\nparticularly useful approach, since these services tend to have fewer\nspecific endpoints, and the documentation needs to focus much more on\nhow the client can successfully navigate links to accomplish the desired\ntask. In this 30-minute talk, I' ll discuss how you can successfully\nintegrate this approach to your workflow when considering everything\nfrom overall information architecture, to deciding which content assets\nto prioritize, to refining the tone used throughout your developer\ncommunications.\n",
  "copyright_text": null,
  "description": "",
  "duration": 1676,
  "language": "eng",
  "recorded": "2017-05-15",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/na/2017/"
    }
  ],
  "speakers": [
    "Sarah Hersh"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/R8yjmtIWEKQ/maxresdefault.jpg",
  "title": "Start with the tasks, not the endpoints",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=R8yjmtIWEKQ"
    }
  ]
}
