{
  "abstract": "This talk is about the verifiability crisis in science, politics, and\ntechnology, and how methods developed to address verifiablity in\nstatistical publishing can be adapted to other areas such as technical\nwriting.\n\n-  In 2015, a group of researchers set out to replicate the results\n   obtained in a set of 100 published psychology research papers. It\n   turned out that only 29 out of the 100 could be replicated.\n\n-  In the 2016 elections, so-called \"fake news\"--fabricated news\n   published on venues such as Facebook--influenced many voters in their\n   choice of candidates.\n\n-  In the field of technical writing, it is not uncommon to discover\n   that technical documentation is inaccurate. Although the docs might\n   have been accurate when first published, the underlying technology\n   evolved rendering the docs obsolete.\n\nAcademic, public-policy, and business decisions are sometimes made after\naccepting published (mis)information at face value. The costs can\nbeconsiderable.\n\nThe information often arrives in the form of an electronic document,\nsuch as a web page or PDF file. To verify the information, someone has\nto \"fact check\" it. But what if the document could, in some sense,\n\"speakfor itself\" and demonstrate the veracity of what it is saying?\n\nIn response to the verifiability crisis in science, statisticians\nhavedeveloped technology to create \"intelligent documents\" that not\nonlyreport the results of a statistical analysis, but can also re-create\ntheanalysis itself.\n",
  "copyright_text": null,
  "description": "",
  "duration": 1676,
  "language": "eng",
  "recorded": "2017-05-15",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/na/2017/"
    }
  ],
  "speakers": [
    "Carl Parker"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/kOzQPpc-KDo/maxresdefault.jpg",
  "title": "Intelligent Documents and the Verifiability Crisis in Science, Tech Writing, and Life",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kOzQPpc-KDo"
    }
  ]
}
