{
  "abstract": "Are you interested in developing docs like code? Are you frustrated by\nthe lack of available information as to what that really means and how\nexactly you're supposed to do it? Welcome to the club!\n\n\"Treating documentation like code\" is somewhat of a buzzword bingo term\nthese days. You can find any number of blog posts, presentations, and\narticles online expounding on the theory and merits of the idea. When I\nwas presented with an opportunity to truly integrate documentation into\nthe agile development process almost 2 years ago, I couldn't find any\ninformation that could teach me how to treat docs like code. Since then,\nI've worked with a team of passionate software engineers to bring a long\nlist of 'awesome-future' ideas for treating documentation like code into\npractice. In this presentation, I'll lay out how we create, test, build,\nand publish our documentation using agile methodologies, so others\nstarting down the same road have a path to follow.\n\nIn the beginning, we had a great idea - documentation should be\ndeveloped, tested, and built just like the products we make. The\nkeystone of this grand vision was the idea that docs live in the same\nrepositories as the code, use the same development tools and code review\nprocesses, and follow a continuous delivery model. I'll go over the\ntools we chose to write, build, and test the docs; the responsibilities\nof the software engineers and technical writer, respectively, for\ncreating and maintaining content; the docs information architecture we\ndeveloped; how we incorporated syntax and grammar checks into code\ntesting; and how we build and deploy our documentation automatically.\n",
  "copyright_text": null,
  "description": "",
  "duration": 1408,
  "language": "eng",
  "recorded": "2017-05-15",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/na/2017/"
    }
  ],
  "speakers": [
    "Jodie Putrino"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Mzu-c-FoOdw/maxresdefault.jpg",
  "title": "Treating documentation like code: a practical account",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Mzu-c-FoOdw"
    }
  ]
}
