{
  "abstract": "Come along on a tour of common types of documentation system\nadministrators use to get their jobs done.\n\nAs an enterprise software developer, system administrators are my\ncustomers and colleagues. In this session, learn not just what gets\nused, but also what internal and informal sources to look for to create\nbetter docs. I'll share what I've learned sysadmins want from the\nwritten information they rely on daily. I'll also talk about what ops\nteams write for themselves that can add important details to your\ndocuments.\n\nWe'll go beyond glossy presentation slides of instructor-led training to\ndelve into what's meaningful for day-to-day tasks. For example,\nintegration and migration: to accomplish this smoothly, sysadmins need\nreferences and examples to install, configure, and customize new tools\nto work with existing systems. Tutorials can show how, real-world\nconfiguration examples show what, and cookbooks provide ready-made\nexamples to customize as needed. Deployment checklists ensure the\nrollout goes smoothly.\n\nEmergencies can happen at any hour:raw-latex:`\\u2`014which is why\nrunbooks can be so valuable. With step-by-step details so staff can\nrespond without making mistakes. A junior engineer can resolve an issue\nwithout calling a developer for help. Manifests, dependency lists, and\nlogs become necessary adjuncts to documentation, providing critical data\nfor root cause analysis.\n\nLearn about these sources, not just how others use them, but where you\ncan find valuable detail to enhance the documents you write for\noperations.\n",
  "copyright_text": null,
  "description": "",
  "duration": 1659,
  "language": "eng",
  "recorded": "2017-05-15",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/na/2017/"
    }
  ],
  "speakers": [
    "Andrea Longo"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/QDxoqWpyzo8/maxresdefault.jpg",
  "title": "Do you know a runbook from a flip book? How sysadmins use documentation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QDxoqWpyzo8"
    }
  ]
}
