{
  "id": 248, 
  "category": "PyCon US 2010", 
  "slug": "creating-rich-client-applications-using-dabo", 
  "title": "Creating Rich Client Applications Using Dabo", 
  "summary": "", 
  "description": "Creating Rich Client Applications Using Dabo\n\nPresented by Ed Leafe and Paul McNett\n\nWhile web applications seem to get all the attention these days, many\nbusinesses still rely on desktop, or \"rich client\", applications to run their\nbusiness. For those who prefer to do their coding with Python, Dabo is the\nonly full-featured desktop app framework.\n\nIn this tutorial, we'll cover the general structure and approach to\napplication development used in Dabo, including lots of interactive work where\nwe will all develop applications that will be able to query a database,\ndisplay the results, allow the user to edit the data, and then save it back to\nthe database. We will cover the various tools available in Dabo to help you\ndevelop your applications, and how they work together.\n\nIntended Audience\n\nDevelopers with basic to intermediate Python experience.\n\nClass Outline\n\nIntroduction: The thinking and design approach behind the framework. (15 min).\n\n  * Explanation of the framework design. Frameworks are great if you're working with them, but not if you're constantly fighting them! We'll outline the various parts of the framework, and how they work together to create applications. \n\nBuilding an app in 30 seconds. (15 min)\n\n  * You can use the AppWizard to create a completely functional CRUD application in less than 30 seconds. We'll demonstrate how to use the AppWizard, and how you can build on and further customize the application it creates. \n\nThe primary non-UI classes in Dabo (15 min)\n\n  * There are lots of classes in Dabo, but only a few main ones that are used in every app. This section will cover them: the application class, the business object class, and the DBAPI data adapter class. \n\nIntroduction to the Dabo Tools (30 min)\n\n  * One of the benefits of a framework is that the mundane, repetitive tasks are handled by the framework, leaving you to focus on the creative parts of app development. In this section we'll discuss several of the visual tools available to help you create Dabo applications faster and easier. \n\nDeveloping an actual application, part 1 (15 min)\n\n  * Talk is fine, but here's where we begin creating an actual application. Attendees will learn how to create a new Dabo app, along with database connections, menus and a main form. In the second half of the tutorial we'll use this app as the basis for more complex development. \n\nREFRESHMENT BREAK\n\nOverview of UI Classes (30 min)\n\n  * This is where we talk about the \"rich\" in \"rich client\". Dabo has a full set of UI widgets, based on the wxPython toolkit. We've taken those widget classes and added a consistent interface, so that the developer uses the same properties and methods to accomplish the same thing in all the classes, making developing smoother and more intuitive. We'll cover all of the most-commonly used controls, and how to work with them. \n\nDeveloping an actual application, part 2 (30 min)\n\n  * The basic app created in the first half was an impressive result for such a short amount of time, but here's where we'll start to make it more interesting. We'll create several related business objects, bind them to the UI elements, and have it all work seamlessly with a database. After that, we'll show how to create and run reports against that same data. We'll then wrap up by explaining how to deploy your finished application. \n\nRich Client Web Applications with Dabo (10 min)\n\n  * HTML web apps are trying to get a richer client experience through the increased use and sophistication of Javascript-based tools. That's great if you like spending your time in Javascript, but not so great if you are a Python dev. We take the opposite approach: taking our rich-client apps and deploying them over the web so that users can run them without first installing the app. \n\nFuture plans for Dabo (5 min)\n\n  * Dabo is being actively developed, and we have plans for future enhancements that we'll cover here. \n\nWrap-up and Final Questions (15 min)\n\nRequirements\n\nStudents do not need to have a computer, but they will not get as much out of\nthe session if they cannot actively participate in creating the example\napplications. They should have the following prerequisites installed, using\nthe latest available stable releases except where specific version numbers are\nindicated:\n\n  * Python 2.5.4 \n  * wxPython 2.8.10.1 unicode \n  * MySQLdb \n  * reportlab \n  * Python Imaging Library \n  * Dabo 0.9.2 \n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2010CreatingRichClientApplicationsUsingDabo644-559.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2010/248_creating-rich-client-applications-using-dabo.m4v", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2010/248_creating-rich-client-applications-using-dabo.ogv", 
      "length": 955215464, 
      "type": "ogv"
    }
  ], 
  "source_url": "", 
  "tags": [
    "dabo", 
    "pycon", 
    "pycon2010", 
    "tutorial"
  ], 
  "speakers": [
    "Ed Leafe", 
    "Paul McNett"
  ], 
  "recorded": "2010-02-19"
}