{
  "description": "www.pydata.org\n\nIn this talk, I’ll share my journey of animating UMAP, a cutting-edge dimensionality reduction algorithm, by visualizing not just its final output but each intermediate step as well. I’ll explain why and how I modified UMAP’s source code, while also demonstrating the use of Polars for data wrangling, Plotnine for visualization, and ffmpeg for animation. The result ultimately earned me a runner-up position in the 2024 Plotnine plotting contest.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n01:06 Plotnine contest\n02:18 Hoi! I'm Jeroen\n03:13 Visualizing the behavior of an algorithm\n07:58 Keeping track of intermediate predictions\n09:23 Tool: UMAP\n12:31 Tool: Polars\n13:15 Python Polars: The Definitive Guide\n13:40 MNIST dataset\n14:46 Tool: Plotnine\n17:04 Tool: FFmpeg\n18:58 Final result\n19:38 To conclude\n20:40 Q & A",
  "duration": 1649,
  "language": "eng",
  "recorded": "2024-09-18",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20240822042916/https://amsterdam.pydata.org/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/xdD8r84sqYY/maxresdefault.jpg",
  "title": "Jeroen Janssens - How I hacked UMAP and won at a plotting contest | PyData Amsterdam 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xdD8r84sqYY"
    }
  ]
}
