{
  "description": "Ponente\nNombre: Adriana Mendoza Rodriguez y Jesús Genil\nTítulo: ASM: La revolución del modelo de mantenimiento de productos tradicional y uso de Python para asegurar la excelencia\nSala: Fañabé\n——————\n¿Alguna vez te has parado a pensar que el modelo o formato habitual de equipos de mantenimiento de aplicaciones no funciona correctamente? ¿Equipos deslocalizados, desacoplados y poco integrados con los equipos de producto? ¿Cómo puede afectar eso al éxito y el funcionamiento de los productos?\nEn Cepsa hemos creado un equipo de mantenimiento multidisciplinar (formado por científicos de datos, ingenieros de datos, desarrolladores, arquitectos…) que trabajan en equipo para analizar y resolver los problemas asociados a los productos. El equipo ASM tiene mucho que decir (y decidir) ya que están presentes e integrados con todos los equipos desde la fase de ideación del producto. Ellos son los responsables de asegurar un estándar, y guían en cada iteración a los equipos técnicos para asegurar que estos cumplen con el “production ready”.\nUn equipo dedicado además a investigar y definir nuevos procedimientos centrándose en la eficiencia y en la agilidad. Con ese enfoque, se ha construido una herramienta desarrollada en Python para asegurarnos de una manera efectiva y rápida de que todos los productos estén en perfecto estado.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 1948,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Adriana Mendoza Rodriguez",
    "Jesús Genil"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/r0RaM7ICfws/maxresdefault.webp",
  "title": "ASM: La revolución del modelo de mantenimiento de productos tradicional",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=r0RaM7ICfws"
    }
  ]
}
