{
  "description": "Ponente\nNombre: Andros Fenollosa\nTítulo: LiveView, un enfoque moderno de desarrollo Web\nSala: Patos\n——————\nEl enfoque de LiveView, o HTML sobre WebSockets, simplifica el desarrollo de aplicaciones de una sola página (SPA). Por un lado, evitar la construcción de una API (reduciendo costes), minimizas las esperas sustituyendo las peticiones HTTP por un protocolo más rápido (WebSockets), y puedes olvidarte de implementar un framework de JavaScript para renderizar el HTML, ya que lo harás desde el backend. Una técnica de desarrollo web que permite trabajar con lo mejor de un Server-side Rendering con la flexibilidad de una Single-page Application sin renunciar a un SEO de 100 puntos en PageSpeed Insights. Un enfoque moderno de desarrollo Web que evita el uso de APIs, la complejidad en el frontend y da respuestas en tiempo real.\n\nEn la charla enseñaré sus secretos usando de base a Django. Desde la arquitectura, casos de éxitos que he vivido con clientes, ventajas, desventajas, aplicaciones, herramientas actuales, libros y un pequeño framework en Django.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 1826,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Andros Fenollosa"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/P4j_RrsZITk/maxresdefault.jpg",
  "title": "Andros Fenollosa - LiveView, un enfoque moderno de desarrollo Web",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=P4j_RrsZITk"
    }
  ]
}
