{
  "description": "Ponente\nNombre: Artur Costa Pazo\nTítulo: Monadas en Python: Menos Excepciones y Más Tipado en Nuestro Código\nSala: Fañabé\n——————\nLa gestión de los errores es una parte muy importante de nuestros sistemas. En Python, como en muchos lenguajes de programación, tenemos disponibles las excepciones. Pero, ¿existen formas más elegantes para encapsular los resultados de nuestras funciones?\n\nEn esta charla, se presentará un concepto muy interesante con origen en la programación funcional, las Monadas o también llamadas Either, Result, etc. Este patrón nos puede ayudar a mejorar nuestro código, y por suerte, en el ecosistema de Python tenemos disponible bibliotecas que nos pueden ayudar a introducirnos en este mundo. El uso de estas herramientas nos permitirá mejorar mucho el tipado de nuestro código y reducir el ruido visual que pueden añadir los try except infernales en algunos casos de uso.\n\nPara ilustrar los ejemplos, se utilizará la biblioteca meiga, y casos de usos reales (lo llevamos utilizando en producción casi 4 años). :)\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2080,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Artur Costa Pazo"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/8KT165QWxJc/maxresdefault.webp",
  "title": "Artur Costa - Monadas en Python: Menos Excepciones y Más Tipado en Nuestro Código",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8KT165QWxJc"
    }
  ]
}
