{
  "description": "Ponente\nNombre: Ben Lomax\nTítulo: The Art of the Pull Request\nSala: Antequera\n——————\nWant to be a better teammate? Want to get your work merged faster?\n\nFor a lot of devs (especially newer ones) the important part of a PR is the code, not the PR itself. However, the way commits in a PR are put together to guide another dev through the review can be massively impactful. This talk looks at how to effectively craft that review experience.\n\nAims of a PR\n\nAt a superficial level, the aims of a PR are to get code checked for bugs, and to allow it to get merged and deployed. On a deeper level, it's also where a lot of mentoring and learning happens. I will make the argument that both of these are massively improved by ensuring one thing: the PR is crafted for the convenience of the reviewer.\n\nSpecific tips\n\nI'll then look at some of the specific processes and tips that I've found most useful when putting together PRs. These include creating modular commits, laying the groundwork at the start of the PR, how to best comment the code, using conventions and automatic formatters, and reviewing your own PRs.\n\nDealing with feedback\n\nFinally I'll look at how to deal with feedback. This will touch on both the human aspect of getting feedback, as well as how to best show changes made in response to comments.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2567,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Ben Lomax"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/YLnj9iTbrA8/maxresdefault.jpg",
  "title": "Ben Lomax - The Art of the Pull Request",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YLnj9iTbrA8"
    }
  ]
}
