{
  "description": "Ponente\nNombre: Çağıl Uluşahin Sönmez\nTítulo: The coding conventions that makes our lives easier\nSala: Antequera\n——————\nEngineers review code as often as they write it and use a lot of tools to improve this process, such as linters and auto-formatters. One tool that is also very useful is coding conventions. It is a collection of references that can be used during code reviews while also serving as a valuable day-to-day reference and guide for the entire team.\n\nThis talk will explore several different conventions from the open-source conventions repository, offering an in-depth exploration of how they improve the quality of the codebase and serve as a tool for knowledge transfer among engineering teams.\n\nThe structure of the talk will follow:\n\nWhat are coding conventions, and why do we use them?\nExamples of some of the most useful coding conventions and how they enhance code quality.\nHow to establish your own coding conventions?\nHow to uphold your coding conventions with the help of linters?\n\nAttendees will leave with a comprehensive understanding of the concept of coding conventions and how to implement them within their own team.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2535,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Çağıl Uluşahin Sönmez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/8E8J8gHV564/maxresdefault.jpg",
  "title": "Çağıl Uluşahin Sönmez - The coding conventions that makes our lives easier",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8E8J8gHV564"
    }
  ]
}
