{
  "description": "Ponente\nNombre: Carlos López Pérez y Juan Miguel Álvarez\nTítulo: X-men al rescate: ¿cómo un puñado de mutantes puede ayudarte a mejorar tus tests?\nSala: Fañabé\n——————\nContexto de la charla o problema:\nUsar la técnica de mutation testing para mejorar la calidad de los tests y el código.\nDefinición del problema:\nDispones de una base de código con tests pero no tienes el nivel de confianza en ellos para realizar cambios sin riesgo a introducir bugs en producción.\n¿Por qué es importante buscar una solución a ese problema?\nDisponer de buenos tests permite realizar cambios con mayor rapidez y reduciendo los errores en producción, pero mejorar la calidad de los tests es una tarea complicada y que consume bastante tiempo. Utilizando una técnica como mutation testing puede ayudar a encontrar defectos en los tests con un mecanismo sencillo y abordable de forma incremental.\n¿Qué se hablará y qué aprenderá la gente que asista?\nDel testing, la calidad de los tests y la importancia relativa del nivel de cobertura. Los asistentes tendrán una nueva herramienta para mejorar la calidad de su tests y en consecuencia del código.\nRequerimientos previos o comentarios adicionales de tu charla:\nConocimientos básicos sobre testing, no se requieren conocimientos específicos de ningún framework.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2107,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Carlos López Pérez",
    "Juan Miguel Álvarez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/CxkvIUjE8dc/maxresdefault.webp",
  "title": "X-men al rescate",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CxkvIUjE8dc"
    }
  ]
}
