{
  "description": "Ponente\nNombre: Cheuk Ting Ho\nTítulo: Untangle Python Spaghetti - Deep dive into environments and dependencies management\nSala: Antequera\n——————\nAfter learning doing in Python, we started multiple Python or Data Science projects. Dependency management becomes a skill that we need to avoid requirement conflicts among projects. In this talk, we will learn how dependencies management tools work and how to choose the right one to use.\n\nIn this talk, we will use venv, the environment managing tool that comes with CPython, and conda, the tool that is popular among data science practitioners to decipher how environment and dependency management works. First, we will go through some basic knowledge of how Python \"sees\" your package and knows where to import them when needed. Then, we will make the audience aware that, to avoid the requirement conflict among different projects, we need a new set of environments for each project.\n\nThen, we will see how tools like venv and conda can create a new set of environments. We will cover both the practical aspect - how to use the tools and which one to use, and the theoretical aspect - the inner working of the tools and why they are different. This will make the audience get familiar with some tools that are at their disposal and inspire them to start using them for their work.\n\nThis talk is for beginner Pythonistas or data scientists who started to use Python professionally and those who are curious to know how the environment and dependency management tools work.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2688,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Cheuk Ting Ho"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/vuQA9aQPs8U/maxresdefault.jpg",
  "title": "Cheuk Ting Ho - Untangle Python Spaghetti - Deep dive into environments and dependencies management",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vuQA9aQPs8U"
    }
  ]
}
