{
  "description": "Ponente\nNombre: Dácil Hernández\nTítulo: Trascendiendo el Hype: La realidad de la IA en las empresas\nSala: Fañabé\n--------\nEstá por todas partes, la inteligencia artificial aquí y allá. Para muchos la IA se considera la última revolución industrial y su impacto potencial se compara con avances tecnológicos históricamente significativos como la rueda, el motor a vapor, el ordenador e Internet.\n\nEn los negocios, ¿se trata de un campo de juego nivelado?\n\nLos gigantes globales (Meta, Google, Microsoft) tienen los recursos para construir una plataforma tecnológica sólida y aprovechar el poder del Big Data para liberar todo el potencial de la IA. Para mantener el ritmo, organizaciones de menor tamaño deben ser creativas, trabajar dentro de sus limitaciones y planificar cuidadosamente cómo implementar proyectos de Inteligencia Artificial.\n\nDacil Hernández, Directora de Data e IA en Nagarro compartirá su experiencia y la ecuación del éxito para que una empresa pueda sobrevivir en este nuevo escenario.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2166,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Dácil Hernández"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/3oAsR9BQXuE/maxresdefault.jpg",
  "title": "Trascendiendo el Hype: La realidad de la IA en las empresas",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3oAsR9BQXuE"
    }
  ]
}
