{
  "description": "Ponente\nNombre: David Carrasco Cano\nTítulo: Make it Easier, Make it Powerful: A Pythonic solution for IoT in the Rusty Way\nSala: Patos\n--------\nLa charla se mostrará una solución sencilla hecha en Python para interactuar mediante protocolo MQTT con un dispositivo esp32 y un xiaomi Mi Plant y que usa pequeña librería escrita en Rust para la securización, se mostrará el uso del producto escrito en Python esphome para la programación del esp32, se dejarán en la sala 10 dispositivos IoT programados para que puedan ver su interacción en pantalla.\n\nEntrando en ese concepto de IoT se escucha mucho de ello y cada vez hay soluciones más manejables como esphome, NodeRED o PlatformIO, sin embargo tampoco está muy extendido en cuanto a perfiles técnico como podría parecer, de algún modo se hace inaccesible o es difícil verlo.\n\nEn lo que respecta a la seguridad, siempre queda mucho por hacer, en esta charla se abordará un poco esta parte para concienciar, usando una securización sencilla en Rust que se integrará en la solución que se ha desarrollado con Python mediante un binding, la idea de darle visibilidad a Rust es por su cada vez mayor presencia en librerías de Python, así como su enfoque a la optimización y seguridad que justamente puede potenciar a Python donde palidece o es más débil, hay una sinergia entre ambos lenguajes que cada vez está siendo una realidad.\n\nEn cuanto a asistentes, la charla dada la limitación de tiempo, se busca es romper el miedo o la inseguridad ante el IoT, que se vaya conociendo lo que es el lenguaje de programación Rust y hacia que va enfocado, hacer hincapié en la seguridad y por supuesto mostrar que Python pueda ser una estupenda apuesta para integrar dispositivos IoT.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2196,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "David Carrasco Cano"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/0o-RJRtiOBQ/maxresdefault.jpg",
  "title": "Make it Easier, Make it Powerful: A Pythonic solution for IoT in the Rusty Way",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0o-RJRtiOBQ"
    }
  ]
}
