{
  "description": "Ponente\nNombre: Edelmín y María del Socorro García Román\nTítulo: Machine Learning en el sector portuario con Python\nSala: Patos\n--------\nEl uso de tecnologías habilitadoras, como Internet de las Cosas (IoT), Big Data o el Machine Learning, entre otras, se han comenzado a emplear en el sistema portuario como factores clave de la tendencia actual de los puertos hacia la búsqueda de la excelencia a través de la competitividad. Estos habilitadores permiten el intercambio de información de alto valor añadido, en tiempo real, entre los diferentes agentes que operan en el ecosistema portuario.\n\nUno de los principales problemas en los que se está trabajando en el sector portuario a nivel global es el cálculo de una mejor aproximación del tiempo estimado de llegada de un buque a un puerto (Estimated Time to Arrival, en adelante, ETA). Actualmente, hay una primera aproximación que es facilitada por el consignatario a la Autoridad Portuaria del puerto de destino y, aunque es obligatorio que el ETA se actualice a lo largo del viaje (ETA dinámico), en la práctica apenas se hace.\n\nDisponer del ETA dinámico tiene una gran relevancia tanto para las Autoridades Portuarias, como para todos los agentes del ecosistema portuario que dan servicios a los buques durante las escalas. Los recursos y los espacios del puerto son limitados, por lo que es de vital importancia tener una planificación de las llegadas y salidas para movilizar a los agentes y operarios necesarios en las maniobras de los buques de forma óptima. Por esto, contar con un modelo para conocer el ETA dinámico, con un horizonte lejano, permite mejorar la eficiencia de la planificación y habilita la toma de decisiones en tiempo real.\n\nLa obtención del ETA dinámico permite a la Torre de Control realizar una gestión “Just in time”, facilitándole al buque una nueva hora de llegada pudiendo éste adaptar su velocidad. Con ello se evitan esperas innecesarias y maniobras de fondeo, repercutiendo positivamente en el coste de los servicios de la escala, consumo de combustible y en la huella de carbono.\n\nEn la charla se explicará cómo se ha creado el modelo predictivo de Machine Learning para el cálculo del ETA dinámico. Se expondrán los desafíos encontrados en la manipulación de los datasets empleados y cómo se afrontaron con el apoyo de las librerías como Pandas, Folium y MatPlotLib de Python, entre otras. Finalmente, se hablará de la metodología empleada para la resolución del cálculo del ETA, los resultados obtenidos hasta el momento y las librerías de Python que los hicieron posible.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2753,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Edelmín Rodríguez Castro",
    "María del Socorro García Román"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/62-up6Jn7so/maxresdefault.jpg",
  "title": "Machine Learning en el sector portuario con Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=62-up6Jn7so"
    }
  ]
}
