{
  "description": "Ponente\nNombre: Federico Mon\nTítulo: Desentrañando el código: La magia de la instrumentación en Python\nSala: Bollullo\n--------\nA medida que nuestros programas en Python aumentan en complejidad, también lo hacen los problemas que nos encontramos: desafíos en el código que no se ven a simple vista, bugs extraños que pasamos días depurando o problemas de rendimiento que no son evidentes.\n\nPara poder indagar a fondo en estos problemas y saber qué está ocurriendo con nuestro código o incluso para escribir tests en los que reproducir estos casos, vamos a necesitar herramientas que parecen mágicas. La mayoría de estas herramientas usan técnicas de instrumentación de código.\n\nEn esta charla veremos qué es la instrumentación de código, las principales técnicas de instrumentación que tenemos disponibles en Python, como el monkey patching, AST patching o bytecode patching, así como las librerías más usadas para conseguir una instrumentación robusta y fiable. Finalmente veremos un par de ejemplos prácticos donde la instrumentación nos permite depurar nuestro código o medir los tiempos de ejecución.\n\nEl objetivo final de la charla es que entendamos cómo funciona la instrumentación de código y por tanto las herramientas que se basan en este principio, y dejen de parecernos magia fuera de nuestro alcance.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2264,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Federico Mon"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/nFKEseqTh8E/maxresdefault.jpg",
  "title": "Desentrañando el código: La magia de la instrumentación en Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nFKEseqTh8E"
    }
  ]
}
