{
  "description": "Ponente\nNombre: Jaime Crespo y Roc Massaguer\nTítulo: Cómo Outconsumer y yo domamos a la IA machista de la Kings League\nSala: Bollullo\n--------\nA principios de 2023, el famoso YouTuber y streamer Outconsumer tuvo la idea de usar ChatGPT para construir, simplemente como aprendizaje y divertimento, algunos bots que publicaran cosas graciosas en Twitter de manera autónoma. Yo le ayudé a escribir un bot en Python usando las APIs de la NBA, Twitter y OpenAI, así como web scrapping para obtener prompts. El bot tuvo una primera recepción bastante positiva y fue un proyecto muy divertido en el que colaborar. El problema vino cuando el bot comenzó a decir cosas machistas y xenófobas de forma totalmente inesperada...\n\nUna mirada a las nuevas tecnologías teniendo en cuenta aspectos sociales, y de cómo la diversidad, la ética y la responsabilidad son más importantes que nunca para hacer más humano un mundo dominado por las IAs.\n\nEn esta charla contaremos cómo surgió la idea, detalles técnicos de cómo se construyó, el problema que tuvimos y cómo decidimos solucionarlo, haciendo al final una reflexión y dando consejos sobre cómo usar las IAs generativas, abierta a todos los públicos.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2417,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Jaime Crespo",
    "Roc Massaguer"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/tbkTK2PTCyU/maxresdefault.jpg",
  "title": "Cómo Outconsumer y yo domamos a la IA machista de la Kings League",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tbkTK2PTCyU"
    }
  ]
}
