{
  "description": "Ponente\nNombre: Jesús R. Nieto\nTítulo: Geppetto: Python en la creación de personajes en películas de animación\nSala: \n——————\nSiendo la creación de personajes un proceso muy complejo y técnico, es realizado por artistas que necesitan herramientas intuitivas que potencien su creatividad y faciliten el proceso con tal de no frustrar sus esfuerzos. Geppetto es una herramienta python clave en nuestro arsenal de creación de personajes en Skydance que hemos diseñado siguiendo algunos de los patrones clásicos de programación para hacer que este proceso sea más eficiente y creativo.\n\nLos personajes son una parte esencial en las películas de animación. Dan vida a la historia y nos transportan a lugares increíbles donde vivir experiencias únicas. Una película puede tener del orden de 5 a 10 personajes primarios, otros tantos secundarios y muchos extras para dar más credibilidad al mundo en el que ocurre la historia.\n\nEn la creación de cada personaje intervienen muchos departamentos. Los creadores del modelo 3D a partir de los diseños, el departamento que prepara el personaje para ser animado (rigging), animación, efectos de personaje (pelo, ropa, plumas...), multitudes...\n\nEn definitiva, un personaje está compuesto por muchas piezas elaboradas por varios artistas que trabajan en paralelo la mayoría del tiempo. Este proceso puede ser muy complejo y sobre todo muy técnico, limitando el número de personas capaces de dominarlo. En Skydance hemos canalizado todo el ensamblaje de personajes y la gestión de sus variaciones a través de un software propietario llamado Geppetto, escrito en Python, que pretende simplificar todo este proceso y hacerlo más artístico.\n\n——\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2625,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Jesús R. Nieto"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/I4hRztqUtXM/maxresdefault.jpg",
  "title": "Geppetto: Python en la creación de personajes en películas de animación",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=I4hRztqUtXM"
    }
  ]
}
