{
  "description": "Ponente\nNombre: Juan Luis Cano Rodríguez\nTítulo: Python para un mundo mejor: informe desde la trinchera\nSala: Bollullo\n——————\nEquidad, trabajo digno, cooperación, sostenibilidad ecológica, reparto justo de la riqueza, compromiso con el entorno. No es ficción, sueño, ni utopía: es un sector que representa el 10 % del PIB en España, que ha sido recientemente impulsado por la ONU, y del que puedes formar parte. Hablamos de la Economía Social y Solidaria.\n\n¿Y qué tiene que ver Python en todo esto? Alerta spoiler: la madurez tecnológica de la ESS madrileña y más allá deja mucho que desear, así que no vas a escuchar sobre metaversos, blockchains, ni \"inteligencias artificiales\" en esta charla. Lo que sí vas a escuchar es un resumen sobre el estado actual de la cuestión, el papel que juega el software libre, y sobre todo nuestra experiencia utilizando Python para gestionar cientos de entidades y socias, automatizar tareas, y en definitiva ayudar a crear un mundo mejor.\n\nComenzaremos haciendo una breve introducción de la carta de principios de la Economía Social y Solidaria, contaremos cómo estaba el panorama tecnológico cuando llegamos (prepárate para llevarte las manos a la cabeza), desmenuzaremos los avances que hemos hecho en el último año gracias a Python (desde Django hasta reportlab pasando por Odoo e incluso una alternativa a Mastodon llamada Takahē), y cerraremos la charla con una nota de esperanza, una hoja de ruta muy ambiciosa, y una invitación a colaborar.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2433,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Juan Luis Cano Rodríguez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/teVqkugbBDI/maxresdefault.webp",
  "title": "Python para un mundo mejor: informe desde la trinchera",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=teVqkugbBDI"
    }
  ]
}
