{
  "description": "Ponente\nNombre: Maialen Berrondo\nTítulo: ¿Cómo montar un sistema de experimentación con mlflow?\nSala: Tejita\n——————\nEn el campo del Machine Learning, la gestión y seguimiento de experimentos es fundamental para obtener resultados confiables y reproducibles. Sin embargo, muchos equipos se enfrentan al desafío de implementar un sistema efectivo de experimentación. En esta charla, abordaremos el problema y presentaremos MLflow como una solución para montar un sistema de experimentación robusto.\n\nExploraremos la importancia de buscar una solución a este problema, destacando cómo un sistema de experimentación bien implementado puede mejorar la reproducibilidad de resultados, facilitar la colaboración entre equipos y permitir un control de versiones adecuado de los modelos de Machine Learning.\n\nDurante la charla, discutiremos los pasos necesarios para montar un sistema de experimentación utilizando MLflow. Cubriremos la instalación de MLflow, la configuración del entorno de trabajo, la integración con sistemas de almacenamiento en la nube, la creación de experimentos, el registro de parámetros y métricas, el seguimiento del rendimiento, la gestión de modelos y el despliegue en diferentes entornos.\n\nLos asistentes aprenderán cómo utilizar MLflow para montar un sistema de experimentación efectivo y obtendrán conocimientos prácticos sobre cómo registrar, rastrear y comparar experimentos. Además, discutiremos casos de uso y ejemplos prácticos que ilustrarán cómo MLflow puede ser aplicado en diferentes industrias y proyectos de Machine Learning.\n\nNo se requieren conocimientos previos específicos, pero es recomendable tener familiaridad con los conceptos básicos de Machine Learning y la experimentación con modelos. Esta charla proporcionará a los asistentes las herramientas y el conocimiento necesario para implementar un sistema de experimentación con MLflow de manera exitosa en sus proyectos.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2165,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Maialen Berrondo"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/R_bYKCJZH4o/maxresdefault.jpg",
  "title": "¿Cómo montar un sistema de experimentación con mlflow",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=R_bYKCJZH4o"
    }
  ]
}
