{
  "description": "Ponente\nNombre: Manuel Díaz y Pedro Quilles Campo\nTítulo: En mi dataset funcionaba - monitorizando modelos de machine learning\nSala: Bollullo\n——————\nEn la actualidad los modelos de machine learning se han consolidado como parte clave de la toma de decisiones en diversas industrias. Aunque la evaluación de estos modelos en datos no vistos es un paso esencial antes de su implementación, esto no es suficiente para desplegar un modelo y olvidarse de él. Una vez desplegados, fenómenos como el data drift pueden deteriorar la calidad de las predicciones, ocasionando posibles pérdidas de negocio. Por ello, la monitorización de los modelos es fundamental.\n\nEn esta charla abordaremos las diferentes causas del deterioro de los modelos y las implicaciones de no abordar el problema a tiempo. Explicaremos los diferentes tipos de data drift, las técnicas para detectarlo y la importancia de monitorizar tanto los datos de entrada como la calidad de las predicciones, incluyendo sus distribuciones. También discutiremos como la monitorización nos permite tomar mejores decisiones a la hora de reentrenar.\n\nUtilizando Python y una variedad de herramientas de código abierto, mostraremos ejemplos prácticos de cómo implementar una estrategia de monitoreo de modelos en producción, asegurando que los modelos de ML se mantengan confiables, precisos y valiosos para la toma de decisiones en cualquier entorno empresarial.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 1600,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Manuel Díaz",
    "Pedro Quilles Campo"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/Sy2Z-4O4ICw/maxresdefault.webp",
  "title": "Manuel Díaz / Pedro Quilles Campo - En mi dataset funcionaba - monitorizando modelos de machine learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Sy2Z-4O4ICw"
    }
  ]
}
