{
  "description": "Ponente\nNombre: Marina Moro López y Helena Gómez Pozo\nTítulo: Diseño de vacunas contra el cáncer con Python\nSala: Antequera\n——————\nEl cáncer es uno de los mayores problemas de salud a nivel mundial, pero aún no tiene una cura definitiva. Por otra parte, Python es tremendamente versátil y potente. Así que, ¿por qué no juntar ambas cosas? Eso es exactamente lo que haremos en esta charla. Empezaremos con una breve introducción a los mecanismos básicos del cáncer y un repaso de genética, abarcando lo justo y necesario para entender a la perfección el caso práctico. Éste consistirá en plantear algunos de los innumerables tipos de vacunas contra el cáncer y diseñar un par de ellas con un script de Python para el tratamiento de un tumor específico. Finalmente, revisaremos asuntos esenciales de la regulación y control de calidad de estas vacunas. Todo esto nos servirá para ver el tremendo potencial de la sinergia entre la biotecnología y Python en el ámbito sanitario como diagnóstico y tratamiento de enfermedades como el cáncer.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2084,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Marina Moro López",
    "Helena Gómez Pozo"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/axky2xs_eR0/maxresdefault.jpg",
  "title": "Marina Moro López y Helena Gómez Pozo - Diseño de vacunas contra el cáncer con Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=axky2xs_eR0"
    }
  ]
}
