{
  "description": "Ponente\nNombre: Miguel Sánchez Novo\nTítulo: Generación sintética de imágenes para detección y segmentación\nSala: Tejita\n——————\nLa generación sintética de imágenes es un campo en rápido crecimiento en el mundo de la inteligencia artificial, que juega un papel crucial en la detección y segmentación de imágenes. A medida que los conjuntos de datos naturales se vuelven cada vez más difíciles de obtener debido a problemas de privacidad, costos y tiempo, la generación sintética de imágenes proporciona una solución prometedora, generando datos realistas y ricos en variedad para el entrenamiento de modelos de aprendizaje profundo.\n\nEl desafío principal en la detección y segmentación de imágenes radica en la escasez de datos de entrenamiento anotados de alta calidad. Aquí es donde la generación sintética de imágenes juega un papel crucial, ya que puede generar un número infinito de imágenes de entrenamiento etiquetadas automáticamente, evitando los costes y el tiempo asociados a la anotación manual.\n\nEstas imágenes generadas sintéticamente pueden cubrir una amplia gama de escenarios, objetos y condiciones que podrían no estar presentes en los conjuntos de datos de entrenamiento existentes. Esta diversidad mejora la robustez de los modelos de detección y segmentación de imágenes, permitiéndoles manejar situaciones más variadas y complejas.\n\nAdemás, las imágenes generadas sintéticamente pueden ser utilizadas para la detección y segmentación de objetos raros o anómalos, situaciones en las que los datos reales podrían ser excepcionalmente escasos. Por lo tanto, la generación sintética de imágenes puede ser un recurso invaluable para mejorar el rendimiento de los modelos de computer vision en una variedad de aplicaciones.\n\nEn conclusión, la generación sintética de imágenes abre nuevas vías para superar los desafíos en la detección y segmentación de imágenes, principalmente en términos de escasez de datos y diversidad de situaciones.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2302,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Miguel Sánchez Novo"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/7J4CgB6bfpA/maxresdefault.jpg",
  "title": "Miguel Sánchez - Generación sintética de imágenes para detección y segmentación",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7J4CgB6bfpA"
    }
  ]
}
