{
  "description": "Ponente\nNombre: Mireya Gutiérrez Castro y Jorge Raúl Gómez\nTítulo: Dominando el Tiempo: Cómo abordar tus problemas de predicción de series temporales sin morir en el intento\nSala: Patos\n——————\nHay dos tipos de Data Scientists: los que se han atascado alguna vez en un problema de previsión de series temporales y los que se atascarán en algún momento en un problema de series temporales. Las series temporales son omnipresentes en nuestra realidad, y el interés por explotarlas es algo muy común. El uso de datos de ventas diarias, ingresos del BCE, el tiempo meteorológico de cada día puede transformarse en conocimiento: previsión de la demanda, saber el crecimiento de un país, conocer si tengo que sacar las botas de agua mañana, etc.\n\nEsta capacidad de inferir es fruto de construir un modelo, pero ¿cuál se ajusta mejor a cada caso? ¿Necesitas predecir una única serie temporal o varias?, ¿el conjunto de series temporales a predecir están relacionadas entre sí? ¿Dispones de información futura? Conocer qué modelo es el adecuado para cada caso impactará en la calidad de las predicciones y en el tiempo necesario de desarrollo.\n\nEn esta charla aprenderás a reconocer y afrontar estos desafíos ayudándote de Python y las librerías más potentes de hoy en día. Se explorarán diferentes modelos y criterios de selección, con el objetivo de equiparte con las habilidades necesarias para escoger el modelo que mejor se adapte a tus necesidades particulares.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2077,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Mireya Gutiérrez Castro",
    "Jorge Raúl Gómez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/edcCT0U9u7g/maxresdefault.jpg",
  "title": "Mireya y Jorge - Cómo abordar tus problemas de predicción de series temp sin morir en el intento",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=edcCT0U9u7g"
    }
  ]
}
