{
  "description": "Ponente\nNombre: Pablo García Sánchez\nTítulo: Survival of the fittest: usando el paquete inspyred para entrenar IAs que juegan a videojuegos\nSala: Patos\n——————\nLos videojuegos son un campo de pruebas apasionante para el estudio de la Inteligencia Artificial. Debido a que son entornos dinámicos, complejos, con interacción persona/ordenador rica, y que además proporcionan una gran cantidad de datos, podemos aplicar una gran variedad de técnicas vanguardistas de IA, ya sea para jugar al juego, para crear contenido, o para modelar a las personas que lo juegan.\n\nEn concreto, la creación de agentes que juegan a videojuegos es un ejemplo de problema muy difícil de resolver, pero el uso de Algoritmos Evolutivos (AEs) se ha demostrado como una técnica muy competente. Los AEs son algoritmos de optimización que simulan la teoría de la selección natural: las soluciones compiten entre sí, las más exitosas se reproducen y pasan sus mejoras a la siguiente generación.\n\nEn esta charla introduciremos distintas técnicas de IA usadas en el ámbito de la investigación en videojuegos y nos centraremos en los algoritmos evolutivos y algunas de sus variantes, como los Algoritmos Genéticos, la Programación Genética o las Estrategias de Evolución. Usaremos el paquete \"inspyred\" como ejemplo, ya que tiene una curva de aprendizaje más asequible para ver lo fácil que es crear tu primer EA, y lo integraremos con algún videojuego, como Hearthstone, para comprobar cómo puede generar agentes tan competentes que incluso pueden ganar competiciones de IA.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2195,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Pablo García Sánchez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/KP4eZMQlk3k/maxresdefault.jpg",
  "title": "Pablo García - Survival of the fittest: usando el paquete inspyred para entrenar IAs que juegan",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KP4eZMQlk3k"
    }
  ]
}
