{
  "description": "Ponente\nNombre: Pablo Rodríguez Pérez\nTítulo: Cómo adaptar un programa Python para tus amigos no-programadores\nSala: Tejita\n——————\nEsta charla trata sobre distintas formas de conseguir que nuestro código Python funcione en otros ordenadores de forma local y ejecutados directamente por un usuario no técnico, al que no se le puede pedir que instale dependencias, use la terminal, ejecute celdas de Jupyter, etc...\n\nEn primer lugar presentaré frameworks con los que utilizar Python a través de una interfaz gráfica (PyQT, Dash, Streamlit, ...), después la forma de crear ejecutables para Windows, macOS y Linux (Pynstaller, Pynsist, ...) y finalmente paquetes basados en Pyodide que simplemente con un doble clic se ejecuten correctamente a través de nuestro navegador.\n\nTodo esto contado desde una perspectiva de un data scientist con experiencia en el procesado de datos pero sin práctica con herramientas de frontend. La idea es conseguir una forma rápida de crear herramientas para compartir con compañeros, clientes, amigos, familia, etc...\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 2340,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Pablo Rodríguez Pérez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/LNPFpq1IVVQ/maxresdefault.jpg",
  "title": "Pablo Rodríguez - Cómo adaptar un programa Python para tus amigos no-programadores",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LNPFpq1IVVQ"
    }
  ]
}
