{
  "description": "Ponente\nNombre: Ricardo Fernández Jiménez y Carlos Alberto Gomez Gonzalez\nTítulo: GAN’s and Roses – redes generativas para iniciados\nSala: Bollullo\n——————\n¿Te suena la palabra “deepfake” o modelos como Midjourney y DALLE-2 entre otros? Si en estos últimos años no has vivido en una cueva, seguramente te suenen, ¿pero sabes realmente que son? Si eres de los curiosos que buscan ir un paso más allá, esta es tu charla.\n\nDurante los últimos años, la popularidad de los modelos generativos, especialmente las Redes Generativas Adversarias (GANs) ha crecido exponencialmente, despertando tanto interés como temor. A parte de para calmar nuestra curiosidad por esta nueva tecnología ¿Cómo podemos aprovechar los datos sintéticos generados por estos modelos?\n\nEn esta charla, exploraremos las bases de las GANs y revisaremos los diferentes tipos que existen según el caso de uso y los datos disponibles. Utilizando ejemplos reales, te mostraremos cómo estas potentes herramientas pueden sustituir (hasta cierto punto) datos reales en situaciones donde la privacidad sea clave o la obtención de nuevas muestras sea costosa en términos económicos o de otros recursos. Finalmente, hablaremos sobre los modelos de difusión y el futuro de los modelos generativos.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 1834,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Ricardo Fernández Jiménez",
    "Carlos Alberto Gomez Gonzalez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/xdfX4zb3KE0/maxresdefault.jpg",
  "title": "GAN’s and Roses – redes generativas para iniciados",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xdfX4zb3KE0"
    }
  ]
}
