{
  "description": "Ponente\nNombre: Sergio Gil Gavela\nTítulo: De píxeles a predicciones: la magia detrás de la clasificación de imágenes con redes neuronales\nSala: Fañabé\n——————\nVisión general\n\nLa clasificación de imágenes es una rama de la inteligencia artificial con numerosas aplicaciones. En Python existen algunas librerías como Pytorch y Tensorflow que ofrecen herramientas para entrenar redes neuronales para visión artificial.\n\nActualmente algunas de las aplicaciones más relevantes de la clasificación de imágenes son:\n\nConducción autónoma.\n\nAplicaciones médicas, como el análisis de imágenes de resonancia magnética o tomografías computarizadas.\n\nReconocimiento facial.\n\nAutomatización industrial, como por ejemplo la detección automática de desperfectos en cadenas de montaje.\n\nContenido\n\nEn esta charla exploraremos cómo entrenar este tipo de redes neuronales para detectar los objetos que aparecen en una imagen. Para ello cubriremos técnicas imprescindibles como data augmentation, fine-tuning y el uso de redes preentrenadas del Estado del Arte para mejorar la precisión de nuestros modelos. Concretamente trataremos los siguientes puntos:\n\nIntroducción a los métodos actuales para clasificación de imágenes.\n\nIntroducción a las librerías de Python PyTorch y huggingface 🤗 timm para entrenar modelos de clasificación de imágenes y usar redes neuronales ya entrenadas del Estado del Arte que permiten resolver tú problema sin apenas esfuerzo.\n\nCómo utilizar AISee, una librería de Python que permite aplicar todas estas técnicas avanzadas de clasificación de imágenes en muy pocas líneas de código.\n\nAl final de la charla, los asistentes habrán aprendido cómo funcionan las redes neuronales para clasificación de imágenes y serán capaces de usar modelos del Estado del Arte en sus proyectos.\n\nPúblico objetivo\n\nLa charla está dirigida a todos los públicos, aquellas personas sin conocimientos previos en clasificación de imágenes o redes neuronales podrán disfrutar de una introducción desde cero a estos conceptos. Por otra parte, aquellas personas con experiencia previa en visión artificial podrán aprender cuál es el Estado del Arte en este campo y las técnicas más avanzadas que existen en la actualidad.\n\n—\nPython España: https://es.python.org/\nPython Canarias: https://pythoncanarias.es/\nTwitter/X: @PyConES\nMastodon: https://fosstodon.org/@pycones",
  "duration": 1928,
  "language": "spa",
  "recorded": "2023-10-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.es.pycon.org/"
    },
    {
      "label": "https://fosstodon.org/@pycones",
      "url": "https://fosstodon.org/@pycones"
    },
    {
      "label": "https://es.python.org/",
      "url": "https://es.python.org/"
    },
    {
      "label": "https://pythoncanarias.es/",
      "url": "https://pythoncanarias.es/"
    }
  ],
  "speakers": [
    "Sergio Gil Gavela"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/FyVc0JaTAPk/maxresdefault.webp",
  "title": "De píxeles a predicciones: la magia detrás de la clasificación de imágenes con redes neuronales",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FyVc0JaTAPk"
    }
  ]
}
