{
  "abstract": "The aviation industry has made flying long distances at high speeds one\nof the safest ways to travel. How did they do it? In part with the help\nof the humble but effective checklist! In this talk, you’ll learn to\nadapt the checklist practices of high-risk environments, like flight\ndecks and operating rooms, to avoid mistakes and improve your\ndocumentation process.\n\nHave you ever missed an important step that you’ve done a hundred times\nbefore, or are you worried that you might someday? Or have you ever\nrepeatedly made the same, avoidable mistake? A well-designed checklist\nmight help you avoid errors large and small and increase confidence in\nyour workflow. In this talk, you’ll learn:\n\n-  How to write a checklist that you’ll actually want to use\n-  How to choose the right time and place to follow your checklist\n-  How to extend your checklists with automation or teamwork\n\nInspired by research and practices in aerospace safety (such as “ Human\nFactors of Flight Deck Checklists: The Normal Checklist” by Degani &\nWiener), medical safety (such as “The Checklist Manifesto” by Atul\nGawande), and cognitive psychology (such as “Human Error” by James\nReason), this talk will guide you through the process of making and\nusing checklists in the day-to-day work of creating documentation.\n\nFrom what distinguishes a checklist from a to-do list to developing\nchecklist habits, you’ll learn how to use checklists to help you write\nthe docs.\n",
  "copyright_text": null,
  "description": "Full talk description: http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-daniel-beck\n\nFollow us on Twitter @writethedocs\nJoin our next events: http://www.writethedocs.org/",
  "duration": 1453,
  "language": "eng",
  "recorded": "2016-09-18",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2016/schedule/"
    },
    {
      "label": "Speaker information",
      "url": "http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-daniel-beck"
    }
  ],
  "speakers": [
    "Daniel Beck"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/mltBPPGsuTg/maxresdefault.jpg",
  "title": "Checklist the Docs",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mltBPPGsuTg"
    }
  ]
}
