{
  "abstract": "As documentarians, our primary goal is delivering the content that users\nneed in order to use our products. This might sound simple, but we are\noften writing about complex systems, which will be used by people of\nvarying skill levels. Our final publications may have all the words in\nthe right order, but sometimes our biggest challenge is getting access\nto the right content in the first place.\n\nDeciding on what is the right content can often be hard, and extracting\nit from the development team can be even harder. Some of us might be\nable to read the codebase to decipher what information a user will need.\nSome of us might get to sit in planning and strategy meetings to gain a\nthorough understanding of our user and their documentation requirements.\nMost of us though will find something in the middle - we sit with\ndevelopers and engineers, build relationships, and elbow our way into\ntheir process.\n\nThis talk will look at several ways in which to mentor your engineering\nand marketing specialists so that everyone in your team can contribute\nto the documentation process. I call this \"Documentoring\" - its about\ntraining the people around you to understand the requirements of a\ndocumentarian, and to truly value the docs as part of the product\nlifecycle.\n\nThrough my experience at IBM, and then at a small startup in Bristol,\nI've seen (and tried) various techniques at getting everyone in your\nteam invested in quality documentation. I'll share stories of my\nsuccesses and failures, and show you how documentation really can be a\nteam effort, even if you stand alone in your company as the sole owner\nof the docs.\n",
  "copyright_text": null,
  "description": "Full talk description: http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-david-oliver\n\nFollow us on Twitter @writethedocs\nJoin our next events: http://www.writethedocs.org/",
  "duration": 1354,
  "language": "eng",
  "recorded": "2016-09-18",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2016/schedule/"
    },
    {
      "label": "Speaker information",
      "url": "http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-david-oliver"
    }
  ],
  "speakers": [
    "David Oliver"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/5LRagMvlEuk/maxresdefault.jpg",
  "title": "Documentoring: Growing a \"Love The Docs\" community",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5LRagMvlEuk"
    }
  ]
}
