{
  "abstract": "Open source communities attract and boast passionate, idealistic people,\nand many of us invest copious amounts of time and effort to contribute\nto our projects and support our communities. This underlying emotional\nattachment can make us more vulnerable to elevated stress, burnout and\nconflicts. And then there are those of us who also manage mental\nillness. More often than not, we suffer these struggles in silence,\nfeeling (and fearing) that we’re alone in our trouble. Here, our\ncommunities can make a huge difference, by building a positive and safe\nenvironment where we can blossom and support ourselves and our peers,\nand feel included. This talk will take a look at open-source communities\nthrough the eyes of various mental well-being issues and struggles, show\nvarious things that some communities already do. We will also cover\nseveral new initiatives from the community around Django, a common open-\nsource web framework for Python, to further promote the well-being of\nour community members. This will hopefully inspire more communities to\nhelp foster healthy minds in a healthy environment.\n",
  "copyright_text": null,
  "description": "Full talk description: http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-erik-romijn\n\nFollow us on Twitter @writethedocs\nJoin our next events: http://www.writethedocs.org/",
  "duration": 2595,
  "language": "eng",
  "recorded": "2016-09-18",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2016/schedule/"
    },
    {
      "label": "http://www.writethedocs.org/",
      "url": "http://www.writethedocs.org/"
    },
    {
      "label": "http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-erik-romijn",
      "url": "http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-erik-romijn"
    }
  ],
  "speakers": [
    "Erik Romijn"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/A6oQKrdtr0c/maxresdefault.jpg",
  "title": "Healthy Minds in a Healthy Community",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=A6oQKrdtr0c"
    }
  ]
}
