{
  "abstract": "Writing professionally in English as a non-native speaker is a\nterrifying task sometimes. \"The limits of my language mean the limits of\nmy world.\" You have less limit when writing in your mother tongue. And\nyou may experience hard boundaries when you have to deal with other\nlanguages on a professional level.\n\nAs a beginner (non-native English) content creator, I had hard times\nduring my work. Most of the problems came from me because the lack of\nconfidence and the lack of practice. To grow faster, I had to build a\nprocess (rather a routine) that I can follow during my work on a daily\nbasis. I had to find the most effective supporting tools. And maybe the\nmost important: I had to figure out how can I keep myself motivated in\nspite of every failure.\n\nHow can a junior writer overcome the initial difficulties? My\npresentation tries to answer this question through real life examples to\nhelp other juniors in their struggles. And offers some writing tools,\nhabits, and methods that may be worth to take a chance.\n\nI would like to present what I've learned during my journey so far.\n",
  "copyright_text": null,
  "description": "Full talk description: http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-istvan-zoltan-szabo\n\nFollow us on Twitter @writethedocs\nJoin our next events: http://www.writethedocs.org/",
  "duration": 1506,
  "language": "eng",
  "recorded": "2016-09-18",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2016/schedule/"
    },
    {
      "label": "Speaker information",
      "url": "http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-istvan-zoltan-szabo"
    }
  ],
  "speakers": [
    "István Zoltán Szabó"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/KWqhW4Guo5k/maxresdefault.jpg",
  "title": "Writing as a non-native speaker",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KWqhW4Guo5k"
    }
  ]
}
