{
  "abstract": "Treating docs as code, an approach that more and more teams and\ncompanies are moving toward, involves more than putting the two together\nin a repo. We discuss some of the details that often get lost in as dev\nand docs learn to work together in new ways. Because if all we do is put\ndoc files next to code files in source control, or use parts of the same\nworkflow for code and docs, we're still isolating docs as a separate\nsort of responsibility, free from the obligations of systematic review\nand testing without which code would never be accepted into production.\n\nSome missing parts of this newer approach to documentation workflow that\nwe'll discuss include:\n\n-  Outlining a documentation lifecycle that describes how material moves\n   from initial draft to final production, to help people unfamiliar\n   with documentation development understand better how to efficiently\n   manage documentation review and testing.\n-  Mapping GitHub workflow clearly to documentation workflow. This can\n   help writers and editors understand better just how to use GitHub\n   effectively, and equally important how it can help other contributors\n   (notably programmers) understand the parts of the writer workflow\n   that can be lost when docs move next to code.\n-  Creating an information architecture. Words need structure to provide\n   meaning, usability, and discoverability. A strong content\n   architecture provides logical places for adding new content,\n   especially for doc projects at scale.\n-  Developing and enforcing a style guide: terminology, voice, tone.\n   These things make the difference between words that users might\n   understand, and documentation that can truly assist.\n-  Reviewing and line/copy editing. Because you wouldn't do any less for\n   code, right?\n",
  "copyright_text": null,
  "description": "Full talk description: http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-margaret-eker\n\nFollow us on Twitter @writethedocs\nJoin our next events: http://www.writethedocs.org/",
  "duration": 1654,
  "language": "eng",
  "recorded": "2016-09-18",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2016/schedule/"
    },
    {
      "label": "Speaker information",
      "url": "http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-margaret-eker"
    }
  ],
  "speakers": [
    "Margaret Eker",
    "Jennifer Rondeau"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/JvRd7MmAxPw/maxresdefault.jpg",
  "title": "Docs as Code: The Missing Manual",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JvRd7MmAxPw"
    }
  ]
}
