{
  "abstract": "The success of an API crucially depends on how well its documentation\nmeets the information needs of software developers. But what information\ndo developers need? What information do they want, and what information\nare they actually using when starting to learn a new API and solve\nprogramming tasks with it? In this talk, I will present the results of\nsome empirical studies I conducted with my team to better understand the\ninformation needs of software developers. One the one hand, we ran more\nthan 20 semi-structured interviews with junior and senior developers and\nasked them – among other things – to tell us about the questions they\nraise first when approaching a new API, the type of documentation they\nlook for, and general expectations and experiences regarding API\ndocumentation. Key findings derived from the interviews were then\nfollowed up on by a standardized survey in which more than 110\ndevelopers participated. Our second study took a different approach.\nInstead of asking developers what they find important about API\ndocumentation, we asked them to solve a few tasks on a simple (REST)-API\nthat was unfamiliar to them. The goal of this study was to observe how\nthe developers approach the tasks and which pieces of the documentation\nprovided with the test API they actually use. Besides presenting the\ndesign and main findings of our studies, I will also discuss\nimplications the results may have regarding the contents, structure and\ndesign of API documentation.\n",
  "copyright_text": null,
  "description": "Full talk description: http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-michael-meng\n\nFollow us on Twitter @writethedocs\nJoin our next events: http://www.writethedocs.org/",
  "duration": 1754,
  "language": "eng",
  "recorded": "2016-09-18",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2016/schedule/"
    },
    {
      "label": "Speaker information",
      "url": "http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-michael-meng"
    }
  ],
  "speakers": [
    "Michael Meng"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/soQSOBwiXdA/maxresdefault.jpg",
  "title": "API documentation: Exploring the information needs of software developers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=soQSOBwiXdA"
    }
  ]
}
