{
  "abstract": "So you had an idea for an awesome software product and started to build\nup your team of engineers around it. Two things are almost inevitable:\nyou chose some super cool programming language like Clojure and you're\ndoing Scrum for the process. Good for you.\n\nWhen your company grows, you end up with multiple Scrum teams. But you\nalso end up with new activities: documentation, blogging, demos,\nsubmissions to conferences to show-off your awesome heap of Clojure. How\nare you going to get all of /that/ done?\n\n\"The book\" tells you to mix all these activities in with your Scrum\nengineering teams. \"The Book\" was also probably written by someone who\nhas never had to do devrel in their lives (or, who hates devrel\nengineers). Numerous problems exist at the interface between product\nengineering and devrel and the result is your devrel backlog can get\nbacked-up.\n\nDr. Paul (not a real doctor) has the laxative you need! In this talk he\npresents his experience of structuring multiple Scrum teams at Crate.IO\nin order to loosen-up the devrel backlog: ensuring highly quality\nfeature documentation, getting out those blog posts and showing-off our\nlovely heap of Clojure\\*.\n\n\\*Crate is written in Java.\n",
  "copyright_text": null,
  "description": "Full talk description: http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-paul-adams\n\nFollow us on Twitter @writethedocs\nJoin our next events: http://www.writethedocs.org/",
  "duration": 1647,
  "language": "eng",
  "recorded": "2016-09-18",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2016/schedule/"
    },
    {
      "label": "Speaker information",
      "url": "http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-paul-adams"
    }
  ],
  "speakers": [
    "Paul Adams"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/MD-RwSw-NGA/maxresdefault.jpg",
  "title": "Postulating The Backlog Laxative",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MD-RwSw-NGA"
    }
  ]
}
