{
  "abstract": "Most discussions of information architecture (IA) treat it as a\nhigh-level discipline: it’s that thing we do site-wide, obsessing\nhappily about taxonomies, hierarchies, and metadata, so that our content\nis more maintainable, navigable, and searchable. But what do your\nreaders do when they actually find the information that they’re looking\nfor? They read it. They read the words. Where’ s your information\narchitecture now?\n\nIn this talk I’ll identify a few different ways that we can apply IA\nprinciples productively also at the micro levels of paragraph, sentence,\nand phrase. We’ll focus on a series of syntactic structures that prove\ntheir special architectural significance, based on the results of\nongoing content testing at docs.shopify.com and on recent work in the\nfield of psycholinguistics. These key examples show how far we can\nimprove sentence processing speed, and thereby reader engagement, when\nwe use grammar deliberately as information micro-architecture. The\ncomposition and revision strategies that this approach suggests are\nespecially useful for anyone who’s writing, editing, or optimizing\ncontent for use at scale.\n",
  "copyright_text": null,
  "description": "Full talk description: http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-rory-tanner\n\nFollow us on Twitter @writethedocs\nJoin our next events: http://www.writethedocs.org/",
  "duration": 878,
  "language": "eng",
  "recorded": "2016-09-18",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2016/schedule/"
    },
    {
      "label": "Speaker information",
      "url": "http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-rory-tanner"
    }
  ],
  "speakers": [
    "Rory Tanner"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/GuAECnt4eJI/maxresdefault.jpg",
  "title": "Information micro-architecture: grammar, syntax, and cognitive rhetoric",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GuAECnt4eJI"
    }
  ]
}
