{
  "abstract": "Two years ago, Atlassian had no consistent voice guidelines across its\ncontent channels and product suite, creating a disjointed brand\nexperience. Today, our Information Experience writers now own the\nAtlassian voice and tone, and are teaching everyone from developers,\nproduct managers, designers, and marketers how to voicify their content.\n\nIn this talk, Sarah Karp (Information Experience Team Lead) will answer\nthe following questions:\n\n-  What is the Atlassian voice?\n-  Why is a consistent voice important?\n-  How can you apply voice and tone to a piece of UI copy?\n\nAlong the way, Sarah will share ways in which the Information Experience\nwriters have applied voicify guidelines across the entire organization.\nShe'll also share a couple of lessons on voice and tone gone wrong and\nhow to learn from those mistakes.\n\nAt the end of the talk, you'll come away with an understanding of why\nsuccessful products have a distinctive voice and tone. You'll also come\naway with great examples of voice and tone wins (and fails), and\npractical tips about how to create voicify guidelines for writers and\nnon-writers alike.\n",
  "copyright_text": null,
  "description": "Full talk description: http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-sarah-karp\n\nFollow us on Twitter @writethedocs\nJoin our next events: http://www.writethedocs.org/",
  "duration": 1254,
  "language": "eng",
  "recorded": "2016-09-18",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2016/schedule/"
    },
    {
      "label": "Speaker information",
      "url": "http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-sarah-karp"
    }
  ],
  "speakers": [
    "Sarah Karp"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/MeyKS4LwTds/maxresdefault.jpg",
  "title": "Watch that tone! Creating an information experience in the Atlassian voice",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MeyKS4LwTds"
    }
  ]
}
