{
  "abstract": "Writing fiction and writing documentation have much more in common that\ntyping out large blocks of text. This talk will talk about elements of\nfiction writing that improve the process of writing docs: Understanding\naudience: the tools fiction writers use to understand their audience (as\nwell as to communicate with them) offer deeper looks at who reads what.\nThe process of connecting with an audience is integral to fiction, but\noften overlooked in documentation — resulting in hard-to-use docs that\ndon’t help users. Building story arcs: arguably, all fiction boils down\nto about seven different plots, retold in millions of different ways.\nUnderstanding underlying story structure makes the process of writing\nnew tales much easier. Those story structures and plot elements can map\ndirectly to parts of documentation, as well as show options for creating\nstanding elements for documentation. \\* Writing prose worth reading:\ndocumentation can be enjoyable to read, provided a writer is willing to\ninvest time in crafting good reading material. This talk will draw on\nexamples from both popular fiction and documentation out in the world\ntoday.\n",
  "copyright_text": null,
  "description": "Full talk description: http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-thursday-bram\n\nFollow us on Twitter @writethedocs\nJoin our next events: http://www.writethedocs.org/",
  "duration": 1828,
  "language": "eng",
  "recorded": "2016-09-18",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/eu/2016/schedule/"
    },
    {
      "label": "Speaker information",
      "url": "http://www.writethedocs.org/conf/eu/2016/speakers/#speaker-eu-2016-thursday-bram"
    }
  ],
  "speakers": [
    "Thursday Bram"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/HaWWcJp2yo4/maxresdefault.jpg",
  "title": "What Writing Fiction Teaches You About Writing Documentation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HaWWcJp2yo4"
    }
  ]
}
