{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": 1635, "video_ogv_download_only": false, "category": "PyCon FR 2013", "speakers": ["Éric Alber", "Yannick Jost"], "title": "Brewery : mettez un Python dans votre robot !", "quality_notes": "", "video_flv_length": null, "recorded": "2013-11-30", "video_mp4_length": null, "description": "", "video_mp4_url": "", "tags": [], "copyright_text": "", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=ud_E7D7l5Oc", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "French", "video_webm_length": null, "summary": "La BH Team participe depuis 7 ans à la Coupe de France de Robotique.\r\n\r\nCe challenge consiste en la conception et la réalisation complète d'un robot autonome en énergie et en commande. Les robots ainsi réalisés s'affrontent dans des matchs d'une durée de 90 secondes, sans intervention de leurs concepteurs. La principale difficulté de cette compétition est que son règlement, diffusé 9 mois à l'avance seulement, implique systématiquement un changement presque total des contraintes du jeu.\r\n\r\nA un moment de notre parcours, nous avons eu le besoin de pouvoir décrire dans un langage de haut niveau notre stratégie. Notre expérience dans le développement logiciel nous a amené à choisir le langage Python.\r\n\r\nTrois ans après la première édition du framework \"Brewery\", voici une présentation de ses capacités et des avantages qu'il confère à l'équipe.\r\n\r\nNous commencerons par une explication du contexte de la compétition, de l'évolution des différents modules développés par l'équipe au fur et à mesure des années, et enfin nous détaillerons les points remarquables du framework.", "thumbnail_url": "", "video_flv_url": ""}