{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": 1904, "video_ogv_download_only": false, "category": "PyCon FR 2013", "speakers": ["Olivier Grisel"], "title": "Comment faire pousser des forets aleatoires dans les nuages", "quality_notes": "", "video_flv_length": null, "recorded": "2013-11-30", "video_mp4_length": null, "description": "", "video_mp4_url": null, "tags": [], "copyright_text": "", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=DDnyRC2Lkdc", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "French", "video_webm_length": null, "summary": "Présentation de l'implémentation d'une méthode d'apprentissage statistique à la mode avec scikit-learn, IPython.parallel et des machines dans le cloud.\n\nscikit-learn est une lib de Machine Learning écrite en Python. Son implémentation de l'algorithme des forets aléatoires a beaucoup de succès auprès des \"Data Scientists\" [1] qui participent aux compétitions de Machine Learning sur le site kaggle.com. Cette présentation sera l'occasion de présenter comment paralléliser la culture de telles forets grâce à un cluster de calcul provisionné dans le cloud.\n\nCette présentation sera l'occasion de rappeler les concepts de base du Machine Learning et de présenter rapidement les projets scikit-learn et IPython.\n\nNous nous intéresseront ensuite plus particulièrement à l'algorithme des random forests (ou plutôt de sa variante belge appelée Forests of Extremely Randomized Trees) et comment accélérer l'apprentissage de grandes forets grâce au module de calcul distribué du projet IPython et à un cluster de machines monté dans un cloud public tel que Amazon, Rackspace, Microsoft Azure ou Digital Ocean.\n\nSi vous êtes sage vous aurez peut être droit à une démo live.\n\n[1] un statisticien qui utilise un macbook air.", "thumbnail_url": "https://i.ytimg.com/vi/DDnyRC2Lkdc/maxresdefault.jpg", "video_flv_url": null}