{
  "id": 3736,
  "category": "PyCon FR 2013",
  "slug": "deployment-and-continuous-integration-of-a-plone",
  "title": "Deployment and Continuous integration of a Plone/Zope application",
  "summary": "Cette conférence vous montrera comme nous utilisons Jenkins, Puppet et\nd'autres outils pour automatiser le déploiement et le test d'une\napplication python de type Zope/Plone sur plusieurs machines. Ce que\nnous avons appris, les logiciels que nous utilisons, ce qui n'a pas\nfonctionné...\n\nLe système de buildout de plone et virtualenv sont des outils largement\nutilisés pour développer et déployer des applications plone. Mais une\nfois qu'il y a plusieurs nodes à déployer et que vous souhaitez être sur\nde la fiabilité de votre code avant vos déploiements, un buildout manuel\nsur chaque serveur est à proscrire.\n\nNous utilisons Jenkins, Puppet, mcollective et d'autres outils pour\npackager et tester l'application, avant le déploiement sur nos serveurs.\nNous l'avons fait pour déployer plus vite avec moins de risques un code\nde meilleure qualité.\n\nNous avons énormément appris et souhaitons partager notre expérience.\n\nThe Plone/Zope Buildout system and virtualenv are common tools to\ndevelop and build your plone application. But once you have several\nnodes to deploy and you want to trust your code before deploying it, and\na manual buildout is something you should avoid.\n\nWe use Jenkins, Puppet, Mcollective and some other tools to package and\ntest the application, before deploying it to several nodes. We made it\nhappen to be confident with our code and to deploy faster with less\nrisks.\n\nWe learned a lot and we want to share our experience about it.\n",
  "description": "",
  "quality_notes": "",
  "language": "French",
  "copyright_text": "",
  "thumbnail_url": "https://i.ytimg.com/vi/ykzN8gSpIjM/maxresdefault.jpg",
  "duration": 1653,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=ykzN8gSpIjM",
      "type": "youtube",
      "length": 0
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=ykzN8gSpIjM",
  "tags": [],
  "speakers": [
    "Julien Pivotto"
  ],
  "recorded": "2013-11-30"
}