{
  "copyright_text": null,
  "description": "Talk: Real-time web apps with (just) Python and Postgres\n\nThe design and documentation of the leading Python web frameworks are heavily focused on building web sites, with HTML content rendered on the server, and require significant effort to support modern web apps that use RESTful APIs, real-time updates over websockets, and Javascript-based user interfaces.If we start with a clean slate and design a framework around the needs of a real-time single-page-application, several things become apparent:Using the well-known TodoMVC application as an example, this presentation will give a tour of a simple Python backend that provides live syncing between browsers using just Python, Postgres, and a Werkzeug based micro framework that integrates REST endpoints and websockets into a single, coherent API.Though approachable to beginners, this talk will be of greatest interest to intermediate-level Python programmers who have used Django in the past and wondered how to move on to something more modern, but not more complicated.\n\nSpeaker: Brent Tubbs. Brent Tubbs is the Deputy Technical Director at YouGov, an online market research and political polling firm. He is the primary author of Velociraptor, an open source platform-as-a-service for deploying Heroku-compatible applications, and of Mettle, a data pipeline framework being open sourced at the PyWaw conference.\n\nSlides: http://btubbs.com/documents/RealTimeWebApps.pdf\n\nLicense: For reuse of this video under a more permissive license please get in touch with us. The speakers retain the copyright for their performances.\n\nhttp://summit.pywaw.org",
  "duration": 1868,
  "language": "eng",
  "recorded": "2015-11-02",
  "related_urls": [
    {
      "label": "http://btubbs.com/documents/RealTimeWebApps.pdf",
      "url": "http://btubbs.com/documents/RealTimeWebApps.pdf"
    },
    {
      "label": "http://summit.pywaw.org",
      "url": "http://summit.pywaw.org"
    }
  ],
  "speakers": [
    "Brent Tubbs"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/BCI6F09k9dE/maxresdefault.jpg",
  "title": "Real-time web apps with (just) Python and Postgres",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BCI6F09k9dE"
    }
  ]
}
