{
  "copyright_text": null,
  "description": "Talk: Beyond the basics with Elasticsearch\n\nSince 2008 Honza has been building content web sites for fun and profit. During this time he discovered Elasticsearch which lead to him joining the company behind it in 2013 to work on the Python drivers. Elasticsearch has many use cases, some of them fairly obvious and widely used, like plain searching through documents or analytics. In this talk I would like to go through some of the more advanced scenarios we have seen in the wild. Some examples of what we will cover:If we end up with some time to spare we can explore some other ideas about how we can utilize the features of a search engine to drive non-trivial data analysis.\n\nSpeaker: Honza Král. Honza is a Python programmer and Django core developer – since he is scared of the bright and shiny world of browsers, designers, and users he prefers to stay buried deep in the infrastructure code and just provides others with tools to do the actual site-building.\n\nSlides: https://speakerdeck.com/elasticsearch/beyond-the-basics-with-elasticsearch\n\nLicense: For reuse of this video under a more permissive license please get in touch with us. The speakers retain the copyright for their performances.\n\nhttp://summit.pywaw.org",
  "duration": 1887,
  "language": "eng",
  "recorded": "2015-11-02",
  "related_urls": [
    {
      "label": "https://speakerdeck.com/elasticsearch/beyond-the-basics-with-elasticsearch",
      "url": "https://speakerdeck.com/elasticsearch/beyond-the-basics-with-elasticsearch"
    },
    {
      "label": "http://summit.pywaw.org",
      "url": "http://summit.pywaw.org"
    }
  ],
  "speakers": [
    "Honza Král"
  ],
  "tags": [
    "Elasticsearch"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/g03dyjyDggY/maxresdefault.jpg",
  "title": "Beyond the basics with Elasticsearch",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=g03dyjyDggY"
    }
  ]
}
