{
  "copyright_text": null,
  "description": "Talk: On snakes and elephants\n\nEveryone knows you can connect to PostgreSQL from Python, but not everyone knows you can actually make the PostgreSQL server process execute Python code in an embedded interpreter.PL/Python is a stored procedure language for PostgreSQL, allowing extending Postgres with Python.The use cases are limitless, from moving your business logic into the database, to doing number crunching inside the database server process without having to ship raw data to external worker nodes.We'll talk about how would you write an embedded Python procedure inside Postgres, what functionality it offers and what are the quirks and challenges posed by running a Python interpreter inside a database server process.\n\nSpeaker: Jan Urbański. I've been using Python profesionally since 2009. I'm a developer and an Open Source contributor for a number of projects. I added some features to Postgres embedded Python bindings, maintain an asynchronous Postgres driver for Twisted called txpostgres and wrote a Twisted connector for Pika (a Python AMQP library). Currently, I work as Lead Developer for New Relic, an Application Performance Monitoring company, after they acquired a startup I founded earlier.\n\nSlides: https://wulczer.org/pywaw-summit.pdf\n\nLicense: For reuse of this video under a more permissive license please get in touch with us. The speakers retain the copyright for their performances.\n\nhttp://summit.pywaw.org",
  "duration": 2150,
  "language": "eng",
  "recorded": "2015-11-02",
  "related_urls": [
    {
      "label": "http://summit.pywaw.org",
      "url": "http://summit.pywaw.org"
    },
    {
      "label": "https://wulczer.org/pywaw-summit.pdf",
      "url": "https://wulczer.org/pywaw-summit.pdf"
    }
  ],
  "speakers": [
    "Jan Urbański"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/xkzbE5zon18/maxresdefault.jpg",
  "title": "On snakes and elephants",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xkzbE5zon18"
    }
  ]
}
