{
  "copyright_text": null,
  "description": "Talk: A Brief Introduction to Practical Robotics in Python\n\nVery few of us would write our own web server from scratch using first principals. The python ecosystem has so many tools to make it fast and easy to create a fairly sophisticated web application. But what about if you want to build a robot? It turns out that one of the best robotics packages in the world has python hooks, and you can use it to do all sorts of awesome things. This talk will give a brief introduction to Robot Operating System and how to interface with it in python. In this talk we will cover the basics of ROS setup, package building, and robot software development. In particular we will look at how to interface with different bits of hardware, build up complex robot behaviors from that hardware, and then deploy the results.\n\nSpeaker: Katherine Scott. Katherine Scott is a software engineer who specializes in computer vision and robotics applications. She holds undergraduate degrees in computer engineering and electrical engineering from the University of Michigan and a Master's degree in computer science from Columbia University. She is the co-founder and software lead at Tempo Automation a manufacturing robotics company.\n\nSlides: https://github.com/kscottz/PyCon2015Talk/blob/master/RobotsRobotsRARARA.ipynb\n\nLicense: For reuse of this video under a more permissive license please get in touch with us. The speakers retain the copyright for their performances.\n\nhttp://summit.pywaw.org",
  "duration": 2031,
  "language": "eng",
  "recorded": "2015-11-02",
  "related_urls": [
    {
      "label": "http://summit.pywaw.org",
      "url": "http://summit.pywaw.org"
    },
    {
      "label": "https://github.com/kscottz/PyCon2015Talk/blob/master/RobotsRobotsRARARA.ipynb",
      "url": "https://github.com/kscottz/PyCon2015Talk/blob/master/RobotsRobotsRARARA.ipynb"
    }
  ],
  "speakers": [
    "Katherine Scott"
  ],
  "tags": [
    "Robotics (Industry)"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/F_uvb5KbZkQ/maxresdefault.jpg",
  "title": "A Brief Introduction to Practical Robotics in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=F_uvb5KbZkQ"
    }
  ]
}
