{
  "copyright_text": null,
  "description": "Talk: The Python Community - Present, Past and Future\n\nIn this keynote, I will take the audience on a tour through the development of the Python community. Starting 20 years ago, looking at important milestones, showing current developments and giving an outlook of where we might be heading in the next few years. Hope you'll enjoy the ride.\n\nSpeaker: Marc-André Lemburg. Marc-Andre is the CEO and founder of eGenix.com, a Python-focused project and consulting company based in Germany. He has a degree in mathematics from the University of Düsseldorf. His work with and for Python started in 1993/1994. He is a Python Core Developer, designed and implemented the Unicode support in Python 1.6, and author of the mx Extensions, e.g. mxTools, mxDateTime and mxODBC, which are now distributed and maintained through eGenix.com. Marc-Andre is a Python Software Foundation (PSF) Fellow and board member, an EuroPython Society (EPS) board member and co-founded a local Python meeting in Düsseldorf (PyDDF). More infos are available at https://wiki.python.org/moin/MarcAndreLemburg\n\nSlides: https://downloads.egenix.com/python/PyWaw-Summit-2015-Python-Community-Keynote.pdf\n\nLicense: For reuse of this video under a more permissive license please get in touch with us. The speakers retain the copyright for their performances.\n\nhttp://summit.pywaw.org",
  "duration": 2526,
  "language": "eng",
  "recorded": "2015-11-02",
  "related_urls": [
    {
      "label": "http://summit.pywaw.org",
      "url": "http://summit.pywaw.org"
    },
    {
      "label": "https://wiki.python.org/moin/MarcAndreLemburg",
      "url": "https://wiki.python.org/moin/MarcAndreLemburg"
    },
    {
      "label": "https://downloads.egenix.com/python/PyWaw-Summit-2015-Python-Community-Keynote.pdf",
      "url": "https://downloads.egenix.com/python/PyWaw-Summit-2015-Python-Community-Keynote.pdf"
    }
  ],
  "speakers": [
    "Marc-André Lemburg"
  ],
  "tags": [
    "Community"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/mU41n3jqWN8/maxresdefault.jpg",
  "title": "The Python Community - Present, Past and Future",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mU41n3jqWN8"
    }
  ]
}
