{
  "copyright_text": null,
  "description": "Talk: Designing Large-Scale Applications in Python\n\nConcepts for designing large and scalable Python applications that work in practice. Python is often referred to as a scripting language. While Python is an ideal platform for scripting, integration or plugin tasks, it does in fact cover all the concepts needed for truly large-scale object oriented application development. However, complex applications bring new challenges. The talk draws on my experience with large-scale application design using Python as central implementation language and provides a cookbook approach to many of the problems you face when designing and organizing complex application frameworks. The approach has been used in many real-life projects, ranging from web application servers in varying fields of application to complete finance trading systems. Python has always proven to be a truly good choice with an outstanding time-to-market advantage over other implementation languages such as Java or C++. It allows small software development companies to successfully compete against multi-million dollar ventures.\n\nSpeaker: Marc-André Lemburg. Marc-Andre is the CEO and founder of eGenix.com, a Python-focused project and consulting company based in Germany. He has a degree in mathematics from the University of Düsseldorf. His work with and for Python started in 1993/1994. He is a Python Core Developer, designed and implemented the Unicode support in Python 1.6, and author of the mx Extensions, e.g. mxTools, mxDateTime and mxODBC, which are now distributed and maintained through eGenix.com. Marc-Andre is a Python Software Foundation (PSF) Fellow and board member, an EuroPython Society (EPS) board member and co-founded a local Python meeting in Düsseldorf (PyDDF). More infos are available at https://wiki.python.org/moin/MarcAndreLemburg\n\nSlides: https://downloads.egenix.com/python/PyWaw-Summit-2015-Large-Scale-Applications.pdf\n\nLicense: For reuse of this video under a more permissive license please get in touch with us. The speakers retain the copyright for their performances.\n\nhttp://summit.pywaw.org",
  "duration": 2479,
  "language": "eng",
  "recorded": "2015-11-02",
  "related_urls": [
    {
      "label": "http://summit.pywaw.org",
      "url": "http://summit.pywaw.org"
    },
    {
      "label": "https://downloads.egenix.com/python/PyWaw-Summit-2015-Large-Scale-Applications.pdf",
      "url": "https://downloads.egenix.com/python/PyWaw-Summit-2015-Large-Scale-Applications.pdf"
    },
    {
      "label": "https://wiki.python.org/moin/MarcAndreLemburg",
      "url": "https://wiki.python.org/moin/MarcAndreLemburg"
    }
  ],
  "speakers": [
    "Marc-André Lemburg"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/hjZoBWh8z5M/maxresdefault.jpg",
  "title": "Designing Large-Scale Applications in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hjZoBWh8z5M"
    }
  ]
}
