{
  "copyright_text": null,
  "description": "Talk: Snakes, ponies and balloons: stories of teaching Python to thousands of women.\n\nDjango Girls is a workshop for total beginners into the world of web building. Started by two Polish girls in Berlin and now organized all over the world in 45 cities, Django Girls aim to inspire women to fall in love with programming. Ola will share with you how she went from not knowing anything about teaching programming or feminism, to knowing a little bit more thanks to thousands of people who participated in the workshop formula Django Girls created. You'll learn the secrets of explaining the Internet, servers or ORM to people who never done this before. And how to find 100+ women who want to learn to code just about anywhere. This talk is your introduction to the world of getting girls excited about snakes, ponies and balloons.\n\nSpeaker: Ola Sitarska. Ola Sitarska is a Django Developer at Potato. She started working with Django 6 years ago, when she discovered the power of Django admin and quickly fell in love with the beauty of Python. Last year, Ola started Django Girls, an initiative to inspire more women to become programmers. Together with Ola Sendecka, she also co-authored the Django Girls Tutorial, which has been visited by more than 30.000 people so far. She is also a member of the Django Team and was responsible for the shipping djangoproject.com redesign. In 2015, she became a Django Software Foundation board member. Ola is also known as A Person With The Django Circus Idea™. She thinks her superpower is the unstoppable enthusiasm.\n\nSlides: https://speakerdeck.com/olasitarska/django-girls-stories-of-teaching-python-and-django-to-thousands-of-women\n\nLicense: For reuse of this video under a more permissive license please get in touch with us. The speakers retain the copyright for their performances.\n\nhttp://summit.pywaw.org",
  "duration": 1714,
  "language": "eng",
  "recorded": "2015-11-02",
  "related_urls": [
    {
      "label": "http://summit.pywaw.org",
      "url": "http://summit.pywaw.org"
    },
    {
      "label": "https://speakerdeck.com/olasitarska/django-girls-stories-of-teaching-python-and-django-to-thousands-of-women",
      "url": "https://speakerdeck.com/olasitarska/django-girls-stories-of-teaching-python-and-django-to-thousands-of-women"
    }
  ],
  "speakers": [
    "Ola Sitarska"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/OU_XM4P6cgc/maxresdefault.jpg",
  "title": "Snakes, ponies and balloons",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OU_XM4P6cgc"
    }
  ]
}
