{
  "alias": "video/2718/a-common-scientific-compute-environment-for-resea",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "As the line between developer and researcher becomes ever more blurred,\nthe challenge of sharing your compute environment with students and\ncolleagues becomes ever more complex. Large, private organizations have\nbeen grappling with this issue for a while, spawning a great deal of\nenthusiasm around tools like Docker, Puppet, Vagrant, and Packer. And\nlet’s not forget notable python-based upstarts, Ansible and Salt! These\ntools can generate immense enthusiasm, followed by the question, “Why\nare we doing this?”\n\nThe problem is that researcher / developers can become overwhelmed by\nthe complexity and variety inherent in devops tools - all the while\nlosing sight of the real reason for using these tools: a philosophy of\ndocumenting your research compute environments in a reproducible\nfashion, with a focus on scripting as much as is reasonable.\n\nAt UC Berkeley, members of the D-Lab, the Statistical Compute Facility,\nComputer Science and Research IT have organized a project to develop the\nBerkeley Common Environment (BCE). I’ll provide an overview of the\nchallenges we’ve tackled in both educational and research contexts, and\nthe needs served by the above-mentioned devops tools. In the end, I\nargue that a coherent, easy-to-understand philosophy around scientific\ncompute environments is fundamental - the tools are just a way to make\nyour collaboration architecture a little easier for the people building\nthese environments a few times a year. What we should focus on, though,\nis end-user experience and research community buy-in.\n",
  "duration": null,
  "id": 2718,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "slug": "a-common-scientific-compute-environment-for-resea",
  "speakers": [
    "Dav Clark"
  ],
  "summary": "I provide an overview of the challenges we’ve tackled at UC Berkeley\ndeploying scientific compute environments in both educational and\nresearch contexts. After a discussion of how these needs can be served\nby devops tools like Docker and Ansible, I argue that a coherent,\neasy-to-understand philosophy around reproducible compute environments\nis fundamental.\n",
  "tags": [
    "devops",
    "reproducible research"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/e7jaZ5SFvFk/hqdefault.jpg",
  "title": "A Common Scientific Compute Environment for Research and Education",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=e7jaZ5SFvFk"
    }
  ]
}
