{
  "alias": "video/2804/a-python-framework-for-3d-gamma-ray-imaging",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "**Introduction and Motivation**\n\nGamma-rays are photons with energies typically thousands to millions of\ntimes greater than the energy of visible light photons. The vastly\nhigher energies of gamma-rays means that they interact differently with\nmatter, necessitating new sensors and imaging methods to localize gamma\nray sources. Many sensors and imaging approaches have been developed to\nimage gamma-rays in 2D, as in a conventional camera, with applications\nin astronomy, medical imaging, and nuclear security. We have developed a\nmobile gamma-ray imaging system that merges data from both visual and\ngamma-ray imaging sensors to generate a visualization of the 3D\ngamma-ray distribution in real-time. This creates 3D maps of the\nphysical environment and correlates that with the objects emitting\ngamma-rays. We have used Python to develop a flexible software framework\nfor acquiring data from the multiple sensors, analyzing and merging data\nstreams, and finally visualizing the resulting 3D gamma-ray maps.\n\n**Methods**\n\nThe system consists of a cart that contains a state-of-the art gamma-ray\nimaging system, called a Compton Imager, coupled with an RGB-D imaging\nsystem, a Microsoft Kinect. The software package has three main tasks:\ngamma-ray acquisition and processing, visual data processing, and\nfinally the merger of these two streams. The gamma-ray data processing\npipeline involves many computationally intensive tasks, thus a threaded\nstructure built with multiprocessing forms the basis of the gamma-ray\nimaging framework. Furthermore, many other Pythonic tools have been used\nto meet our real-time goal; including numexpr, cython, and even the\nPython/C API. Several GUI frontends, built with TraitsUI or PySide for\nexample, are used to monitor and control how the acquired data is\nprocessed in real-time, while a suite of real-time diagnostics are\ndisplayed with matplotlib. The visual pipeline is based on an\nopen-source implementation of RGBDSLAM (http://wiki.ros.org/rgbdslam),\nwhich is built on the Robot Operating System (ROS) framework. Finally,\nthese two data streams are sent to a laptop computer via pyzmq, where\nthe final merger and imaging (by solving a statistical inversion problem\nconstrained by the visual data) is accomplished. The results are then\ndisplayed as they are produced by the imaging algorithm using mayavi.\n\n**Results**\n\nLink to Video: `Moving Cart 3D\nscene <https://www.dropbox.com/s/1w5yrqwepjcbpt1/Moving%20Cart%203D%20scene.mov>`__\n\nThis system has been used to demonstrate real-time volumetric gamma ray\nimaging for the first time [1]. The results from a typical run are shown\nin the above video. The red line indicates the movement of the system\nthrough the environment, while the blue arrows represent an aspect of\nthe gamma-ray data. The 3D point-cloud provided by RGBDSLAM appear\nincrementally as the system traverses the environment. In the end, the\nlocation of a small gamma-ray emitting source is correctly identified\nwith the hotspot in the image.\n\n[1]\n[https://www.nss-mic.org/2013/ConferenceRecord/Details.asp?PID=N25-4]\n",
  "duration": null,
  "id": 2804,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-13",
  "related_urls": [
    "http://wiki.ros.org/rgbdslam),",
    "https://www.dropbox.com/s/1w5yrqwepjcbpt1/Moving%20Cart%203D%20scene.mov",
    "https://www.nss-mic.org/2013/ConferenceRecord/Details.asp?PID=N25-4]"
  ],
  "slug": "a-python-framework-for-3d-gamma-ray-imaging",
  "speakers": [
    "Andrew Haefner",
    "Ross Barnowski"
  ],
  "summary": "A system capable of imaging gamma rays in 3D in near real time has been\ndeveloped. A flexible software framework has been developed using Python\nto acquire, analyze, and finally visualize data from multiple sensors,\nincluding novel gamma ray imaging detectors and a Microsoft Kinect.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/I_YpsekEhhg/hqdefault.jpg",
  "title": "A Python Framework for 3D Gamma Ray Imaging",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=I_YpsekEhhg"
    }
  ]
}
