{
  "alias": "video/2736/bokeh-interactive-visualizations-in-the-browser",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "With support from the DARPA XDATA Initiative, and contributions from\ncommunity members, the Bokeh visualization library\n(http://bokeh.pydata.org) has grown into a large, successful open source\nproject with heavy interest and following on GitHub\n(https://github.com/ContinuumIO/bokeh). The principal goals of Bokeh are\nto provide capability to developers and domain experts:\n\n-  easily create novel and powerful visualizations\n-  that extract insight from remote, possibly large data sets\n-  published to the web for others to explore and interact\n\nThis talk will describe how the architecture of Bokeh enables these\ngoals, and demonstrate how it can be leveraged by anyone using python\nfor analysis to visualize and present their work. We will talk about\ncurrent development and future plans, including a brief discussion of\nJoseph Cottam's exciting academic work on abstract rendering for large\ndata sets that is going into Bokeh\n(https://github.com/JosephCottam/AbstractRendering).\n",
  "duration": null,
  "id": 2736,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "related_urls": [
    "http://bokeh.pydata.org)",
    "https://github.com/ContinuumIO/bokeh).",
    "https://github.com/JosephCottam/AbstractRendering)."
  ],
  "slug": "bokeh-interactive-visualizations-in-the-browser",
  "speakers": [
    "Bryan Van de Ven"
  ],
  "summary": "Bokeh is a Python visualization library for large datasets that natively\nuses the latest web technologies. Its goal is to provide concise\nconstruction of novel graphics, while delivering high-performance\ninteractivity over large data to thin clients. This talk will cover the\nmotivation and architecture behind Bokeh, demonstrate interesting uses\nand capability, and discuss future plans.\n",
  "tags": [
    "bokeh",
    "vis"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/B9NpLOyp-dI/hqdefault.jpg",
  "title": "Bokeh: Interactive Visualizations in the Browser",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=B9NpLOyp-dI"
    }
  ]
}
