{
  "alias": "video/2782/cartopy",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "The practice of representing geospatial data upon a flat surface is\nknown as cartography, and the topological implications of projecting\nfundamentally 3D data onto a 2 dimensional surface has been the\nchallenge of map-makers since time immemorial. Geospatial visualisation\nsoftware is often implemented without consideration for the 3rd\ndimension and this commonly results in problems around the dateline or\nat the poles. For small areas these problems are often not apparent and\nmostly surmountable, but at a global scale, such as when visualising\noutput from GCMs (General circulation models), the underlying\nrepresentation must be addressed head-on in order to visualise the data\n\"impact free\".\n\nCartopy is a Python package which builds on top of Proj.4 to define\ncoordinate reference systems for the transformation and visualisation of\ngeospatial data. As well as the fundamental transformations there is\nalso a matplotlib interface allowing easy generation of maps with the\nsame publication quiality expected of matplotlib. Cartopy employs\nseveral techniques to handle geospatial data correctly, including true\nspherical interpolation for raster data, and Shapely geometry\ninterpolate-and-cut transformations for geospatial vector data.\n\nThis talk will outline some of the capabilities of cartopy, and continue\nonto its practical application within the realm of scientific\npresentation of geospatial data.\n",
  "duration": null,
  "id": 2782,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-14",
  "slug": "cartopy",
  "speakers": [
    "Richard Hattersley"
  ],
  "summary": "Cartopy is a Python package which builds on Proj.4 to define coordinate\nreference systems for the transformation and visualisation of geospatial\ndata. It has a simple matplotlib interface for publication quality\nvisualisation. This talk will outline some of cartopy's functionality\nand demonstrate some practical applications within the realm of\nscientific presentation of geospatial data.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/Ax75kA4_kRo/hqdefault.jpg",
  "title": "Cartopy",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ax75kA4_kRo"
    }
  ]
}
