{
  "alias": "video/2792/codalab-a-new-service-for-data-exchange-code-ex",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "CodaLab is a web-based open source platform that allows researchers to\nshare and browse code, data, and create experiments in a truly\nreproducible manner. CodaLab focuses on accomplishing the following:\n\n-  Serve as a data repository for data sets including large scale data\n   sets that could only be hosted in a cloud computing environment\n-  Serve as an algorithm repository that researchers can use in their\n   experimentation, to teach and learn from others\n-  Host the execution of experiments as worksheets, sometimes referred\n   to as \"executable papers\", which are annotated scientific documents\n   that combine textual process descriptions with live data sets and\n   functioning code.\n-  Enable the creation of benchmarks\n\nCodaLab is a community-driven effort led by Percy Liang from Stanford\nUniversity who built the precursor of CodaLab, namely, MLComp. From a\ndevelopment viewpoint CodaLab supports both the Linux and Windows\ncommunities with code in GitHub and Python as one of the main language\nused to support the scientific community.\n\nAt SciPi, we invite the community to participate in CodaLab by creating\nexperiments as executable papers and by sharing them with the rest of\nthe community at http://codalab.org. These worksheets or \"executable\npapers\" can then be freely reproduced, appended, and otherwise modified\nto improve productivity and accelerate the pace of discovery and\nlearning among data-driven scientific professionals.\n",
  "duration": null,
  "id": 2792,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-13",
  "related_urls": [
    "http://codalab.org."
  ],
  "slug": "codalab-a-new-service-for-data-exchange-code-ex",
  "speakers": [
    "Christophe Poulain"
  ],
  "summary": "Learn, Share and Collaborate with CodaLab -- A new open source platform\nwhich lets communities create and explore experiments together and\nengage in benchmarking and competitions to enable true reproducibility\nand advance the state of the art in data-driven research\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/vla-EQaPHYU/hqdefault.jpg",
  "title": "CodaLab: A New Service for Data Exchange, Code Execution, Benchmarks & Reproducible Research",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vla-EQaPHYU"
    }
  ]
}
