{
  "alias": "video/2735/conda-a-cross-platform-package-manager-for-any-b",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "We will look at the issues that have plagued packaging in the Python\necosystem in the past, and discuss how Conda solves these problems. We\nwill show how to use conda to manage multiple environments. Finally, we\nwill look at how to build your own conda packages.\n\n-  What is the packaging problem? We will briefly look at the history of\n   the problem and the various solutions to it. There are two sides to\n   the packaging problem: the problem of installing existing packages\n   and the problem of building packages to be installed. We look at the\n   history of distutils, setuptools, distribute, and pip, the some of\n   the problems they solved, and issues that arose, particularly for the\n   scientific Python community.\n\n-  We will look at the conda package format, the design decisions that\n   guided the format, and the implications of those decisions. A conda\n   package is a bz2 compressed tarfile of all the files installed in a\n   prefix, along with a metadata directory for the package. A conda\n   package is typically installed by hard linking these files into the\n   install prefix. Conda packages should be relocatable, so that they\n   can be installed into any prefix. This allows conda packages to be\n   installed into many virtual environments at once. A conda package is\n   not Python specific.\n\n-  We will look at how basic commands for installation and environment\n   management. Conda uses a SAT solver to solve package dependency\n   constraints, which is a simple, rigorous, and modern way to ensure\n   that the set of packages that are installed are consistent with one\n   another.\n\n-  Conda has an extensive build framework which allows anybody to build\n   their own conda packages. We will show how to use these tools and how\n   to upload them to Binstar, a free packaging hosting service.\n\n\n",
  "duration": null,
  "id": 2735,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "slug": "conda-a-cross-platform-package-manager-for-any-b",
  "speakers": [
    "Aaron Meurer",
    "Dr. Ilan Schnell"
  ],
  "summary": "Conda is an open source package manager, which can be used to manage\nbinary packages and virtual environments on any platform. It is the\npackage manager of the Anaconda Python distribution, although it can be\nused independently of Anaconda. We will look at how conda solves many of\nthe problems that have plagued Python packaging in the past, followed by\na demonstration of its features.\n",
  "tags": [
    "conda",
    "packaging"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/UaIvrDWrIWM/hqdefault.jpg",
  "title": "Conda: A Cross Platform Package Manager for any Binary Distribution",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UaIvrDWrIWM"
    }
  ]
}
