{
  "alias": "video/2714/frequentism-and-bayesianism-whats-the-big-deal",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "In scientific data mining and machine learning, a fundamental division\nis that of the frequentist and Bayesian approaches to statistics. Often\nthe fodder for impassioned debate among statisticians and other\npractitioners, the subtle philosophical differences between the two\ncamps can lead to surprisingly different practical approaches to the\nanalysis of scientific data.\n\nIn this talk I will delve into both the philosophical and practical\naspects of Bayesian and frequentist approaches, drawing from a `series\nof\nposts <http://jakevdp.github.io/blog/2014/03/11/frequentism-and-bayesianism-a-practical-intro/>`__\nfrom my blog.\n\nI'll start by addressing the philosophical differences between\nfrequentism and Bayesianism, which boil down to different definitions of\nprobability. I'll next move briefly into the mathematical details behind\nthe two approaches, at a level which will be informative to a general\nscientific audience. I'll then show some examples of the two approaches\napplied to some increasingly more complicated problems using standard\nPython packages, namely: `NumPy <http://numpy.org>`__,\n`SciPy <http://scipy.org>`__, `Matplotlib <http://matplotlib.org>`__,\nand `emcee <http://dan.iel.fm/emcee/>`__.\n\nWith this combination of philosophy and practical examples, the audience\nshould walk away with a much better understanding of the differences\nbetween frequentist and Bayesian approaches to statistical analysis, and\nespecially how the philosophy of each approach affects the practical\naspects of computation in data-intensive scientific research.\n",
  "duration": null,
  "id": 2714,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "related_urls": [
    "http://dan.iel.fm/emcee/",
    "http://jakevdp.github.io/blog/2014/03/11/frequentism-and-bayesianism-a-practical-intro/",
    "http://matplotlib.org",
    "http://numpy.org",
    "http://scipy.org"
  ],
  "slug": "frequentism-and-bayesianism-whats-the-big-deal",
  "speakers": [
    "Jake VanderPlas"
  ],
  "summary": "Statistical analysis comes in two main flavors: frequentist and\nBayesian. The subtle differences between the two can lead to widely\ndivergent approaches to common data analysis tasks. After a brief\ndiscussion of the philosophical distinctions between the views, I’ll\nutilize well-known Python libraries to demonstrate how this philosophy\naffects practical approaches to several common analysis tasks.\n",
  "tags": [
    "statistics"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/KhAUfqhLakw/hqdefault.jpg",
  "title": "Frequentism and Bayesianism: What's the Big Deal?",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KhAUfqhLakw"
    }
  ]
}
