{
  "alias": "video/2743/fundamentals-of-the-ipython-display-architecture",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "IPython provides an architecture for interactive computing. The IPython\nNotebook is a web-based interactive computing environment for\nexploratory and reproducible computing. With the IPython Notebook, users\ncreate documents, called notebooks, that contain formatted text,\nfigures, equations, programming code, and code output.\n\nThe IPython Notebook generalizes the notion of output to include images,\nLaTeX, video, HTML, JavaScript, PDF, etc. These output formats are\ndisplayed in the Notebook using IPython’s display architecture, embedded\nin notebook documents and rendered on the IPython Notebook Viewer. By\ntaking advantage of these rich output formats users can build notebooks\nthat include rich representations and visualizations of data and other\ncontent. In this tutorial, we will describe the display architecture,\nexisting Python APIs and libraries that already use it (mpld3, vincent,\npolotly, etc.), and how users can define custom display logic for their\nown Python objects.\n\nAs of version 2.0, the IPython Notebook also includes interactive\nJavaScript widgets. These widgets provide a way for users to interact\nwith UI controls in the browser that are tied to Python code in running\nin the kernel. We will begin by covering the highest-level API for these\nwidgets, “interact,” which automatically builds a user interface for\nexploring a Python function. Next we will describe the lower-level\nwidget objects that are included with IPython: sliders, text boxes,\nbuttons, etc. However, the full potential of the widget framework lies\nwith its extensibility. Users can create their own custom widgets using\nPython, JavaScript, HTML and CSS. We will conclude with a detailed look\nat custom widget creation.\n",
  "duration": null,
  "id": 2743,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "slug": "fundamentals-of-the-ipython-display-architecture",
  "speakers": [
    "Brian Granger",
    "Jonathan Frederic"
  ],
  "summary": "In this tutorial, attendees will learn how to use the IPython Notebook’s\ndisplay architecture and interactive widgets. As we cover these topics,\nattendees will learn about the underlying architecture, how to use\nIPython’s existing APIs, and how to extend them for their own purposes.\nThis tutorial will not cover the basics of the IPython Notebook.\n",
  "tags": [
    "ipython"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/aIXED26Wppg/hqdefault.jpg",
  "title": "Fundamentals of the IPython Display Architecture+Interactive Widgets",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aIXED26Wppg"
    }
  ]
}
