{
  "alias": "video/2709/geospatial-data-in-python-database-desktop-and",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Tools and libraries for working with geospatial data in Python are\ncurrently undergoing rapid development and expansion. Libraries such as\nshapely, fiona, rasterio, geopandas, and others now provide Pythonic\nways of reading, writing, editing, and manipulating geographic data. In\nthis tutorial, participants will be exposed to a number of new and\nlegacy geospatial libraries in Python, with a focus on simple and rapid\ninteraction with geospatial data.\n\nWe will utilize Python to interact with geographic data from a database\nto a web interface, all the while showcasing how Python can be used to\naccess data from online resources, query spatially enabled databases,\nperform coordinate transformations and geoprocessing functions, and\nexport geospatial data to web-enabled formats for visualizing and\nsharing with others. Time permitting, we will also briefly explore\nPython plugin development for the QGIS Desktop GIS environment.\n\nThis tutorial should be accessible to anyone who has basic Python\nknowledge (though familiarity with Pandas, NumPy, matplotlib, etc. will\nbe helpful) as well as familiarity with IPython Notebook. We will take\nsome time at the start of the tutorial to go over installation\nstrategies for geospatial libraries (GDAL/OGR, Proj.4, GEOS) and their\nPython bindings (Shapely, Fiona, GeoPandas) on Windows, Mac, and Linux.\nSome knowledge of geospatial concepts such as map projections and GIS\ndata formats will also be helpful.\n\nOutline\n~~~~~~~\n\n-  Introduction to geospatial data\n\n   -  Map projections, data formats, and looking at maps\n\n-  Introduction to geospatial libraries\n\n   -  GDAL/OGR (Fiona); Shapely (GEOS); PostGIS; GeoPandas; and more\n\n-  GeoPandas\n\n   -  Reading data from various sources\n   -  Data manipulation and plotting\n   -  Writing data to various sources\n   -  Getting data from the web\n   -  Pushing data to the web (for maps)\n\n-  Putting it all together\n\n   -  Quick example: From database to web\n\n-  Introduction to QGIS Desktop GIS (time permitting)\n\n   -  Python interface (PyQGIS)\n   -  Building a simple plugin\n   -  Plugin deployment\n\n\n",
  "duration": null,
  "id": 2709,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "slug": "geospatial-data-in-python-database-desktop-and",
  "speakers": [
    "Carson Farmer"
  ],
  "summary": "Using the wide range of tools and libraries available for working with\ngeospatial data, it is now possible to transport geospatial data from a\ndatabase to a web-interface in only a few lines of code. In this\ntutorial, we explore some of these libraries and work through examples\nwhich showcase the power of Python for geospatial data.\n",
  "tags": [
    "geospatial",
    "gis",
    "tutorial"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/ctdjAir4TUg/hqdefault.jpg",
  "title": "Geospatial data in Python: Database, Desktop, and the Web part 1",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ctdjAir4TUg"
    }
  ]
}
