{
  "alias": "video/2752/image-analysis-in-python-with-scipy-and-scikit-im",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Image analysis is central to a boggling number of scientific endeavors.\nGoogle needs it for their self-driving cars and to match satellite\nimagery and mapping data. Neuroscientists need it to understand the\nbrain. NASA needs it to `map\nasteroids <http://www.bbc.co.uk/news/technology-26528516>`__ and save\nthe human race. It is, however, a relatively underdeveloped area of\nscientific computing. Attendees will leave this tutorial confident of\ntheir ability to extract information from their images in Python.\n\nAttendees will need a working knowledge of numpy arrays, but no further\nknowledge of images or voxels or other doodads. After a brief\nintroduction to the idea that images are just arrays and vice versa, we\nwill introduce fundamental image analysis operations: filters, which can\nbe used to extract features such as edges, corners, and spots in an\nimage; morphology, inferring shape properties by modifying the image\nthrough local operations; and segmentation, the division of an image\ninto meaningful regions.\n\nWe will then combine all these concepts and apply them to several\nreal-world examples of scientific image analysis: given an image of a\npothole, measure its size in pixels compare the fluorescence intensity\nof a protein of interest in the centromeres vs the rest of the\nchromosome. observe the distribution of cells invading a wound site\n\nAttendees will also be encouraged to bring their own image analysis\nproblems to the session for guidance, and, if time allows, we will cover\nmore advanced topics such as image registration and stitching.\n\nThe entire tutorial will be coordinated with the IPython notebook, with\nvarious code cells left blank for attendees to fill in as exercises.\n",
  "duration": null,
  "id": 2752,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "related_urls": [
    "http://www.bbc.co.uk/news/technology-26528516"
  ],
  "slug": "image-analysis-in-python-with-scipy-and-scikit-im",
  "speakers": [
    "Juan Nunez-Iglesias",
    "Tony Yu"
  ],
  "summary": "From telescopes to satellite cameras to electron microscopes, scientists\nare producing more images than they can manually inspect. This tutorial\nwill introduce automated image analysis using the \"images as numpy\narrays\" abstraction, run through various fundamental image analysis\noperations (filters, morphology, segmentation), and finally complete one\nor two more advanced real-world examples.\n",
  "tags": [
    "scikit"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/pWnYjqudKHs/hqdefault.jpg",
  "title": "Image analysis in Python with scipy and scikit image 4",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pWnYjqudKHs"
    }
  ]
}
