{
  "alias": "video/2798/ipython-revealjs-attacks-again-but-now-it-is",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "**Detailed Abtract**\n\nIn the last years, **IPython**, a comprehensive environment for\ninteractive and exploratory computing, has arose as must-have\napplication to run in the daily scientific *work-flow* because provides,\nnot only an enhanced interactive **Python** shell (terminal or\nqt-based), but also a very popular interactive browser-based\n**notebook** with an unimaginable scope.\n\nThe presentation of our research results and the teaching of our\nknownledge are very important steps in the scientific research\nwork-flow, and recently, the **IPython Notebook** has began to be used\nfor all kind of oral communications in several conferences, curses,\nclasses and bootcamps.\n\nDespite the fact that we can present our talks with the IPython notebook\nitself or through a static **Reveal.js**-based slideshow powered by\nIPython.nbconvert (a tool we presented at SciPy 2013), there is not a\n**full-featured** and **executable** (live) IPython presentation tool\navailable. So, we developed a new **IPython**-**Reveal.js**-powered\n**live** slideshow extension, designed specifically to be used\n**directly** from the IPython notebook and to be as **executable** as\nthe notebook is (because deep inside, it is the notebook itself but\nrendered with another face), and also powered with a lot of *features*\nto address the most common tasks performed during the oral presentation\nand spreading of our scientific work, such as: main slides and nested\nslides, fragments views, transitions, themes and speaker notes.\n\nTo conclude, we have developed a new visualization tool for the\n**IPython Notebook**, suited for the final steps of our scientific\nresearch *work-flow*, providing us with, not only an enhanced and new\nexperience in the oral presentation and communication of our results,\nbut also with a super-powerful tool at teaching time, helping us to\neasily tranfer our concepts and spread our knowledge.\n\n**Important**\n\nYou can see the extension in action in the following video link:\nhttps://www.youtube.com/watch?v=Pc-1FS0l2vg\n\nAnd you can also see the source code of the extension at the following\nrepository: http://github.com/damianavila/live_reveal\n",
  "duration": null,
  "id": 2798,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-13",
  "related_urls": [
    "http://github.com/damianavila/live_reveal",
    "https://www.youtube.com/watch?v=Pc-1FS0l2vg"
  ],
  "slug": "ipython-revealjs-attacks-again-but-now-it-is",
  "speakers": [
    "Damián Avila"
  ],
  "summary": "Recently, the IPython Notebook has began to be used for presentations in\nseveral conferences. But, there is not a full-featured and executable\nIPython presentation tool available. So, we developed a new\nReveal.js-powered live slideshow extension, designed specifically to be\nused directly from the notebook and to be as executable as the notebook\nis, and also powered with great features.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/sZBKruEh0jI/hqdefault.jpg",
  "title": "IPython-Reveal.js Attacks Again, But Now... It Is Alive!",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sZBKruEh0jI"
    }
  ]
}
