{
  "alias": "video/2807/mapping-networks-of-violence",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Violence remains a significant problem in New York City's poor\nneighborhoods. There were more than 9,000 gun homicides in 2008 (FBI,\n2009) and the CDC (2012) reports that there were more than 71K non-fatal\nwounds in the US. One novel approach to the problem of violence is the\nCure Violence Model (Ransford, Kane and Slutkin 2009; Slutkin 2012).\nCure Violence treats violence as a disease passed between people in a\nsocial network. The program tries to use the same network to change how\npeople who are prone to and have been the victims of violence react to\nstress and conflict. Cure Violence is viewed as having been successful\nin Chicago and shown promising in other cities (Skogin 2009, Wilson\n2010, Webster 2009). All of these studies have used reported incidents\nof violence before and after the program to assess the efficacy. The NYC\nCouncil and Robert Wood Johnson Foundation have commited significant\nresoures to this approach. Both have retained the CUNY John Jay Research\n& Evaluation center to evaluate the efficacy. Our research adds to the\nliterature by being the first to attempt to measure the change in the\npropensity to violence of people in the community. Novel preliminary\nresearch is presented on network cliques of respondents and the\ndemographic, education, victimization experiences that constitute\ngreatest risk. All of the analysis was conducted in Python libraries\nincluding IPython, PySAL, Numpy, Basemap, Fiona, Shapely, Matplotlib,\nbNetworkX, Pandas and scikit-learn.\n",
  "duration": null,
  "id": 2807,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-13",
  "slug": "mapping-networks-of-violence",
  "speakers": [
    "Evan Misshula",
    "Sheyla Delgado"
  ],
  "summary": "A novel approach to both violence prevention and the measurement of\npropensity to violence is presented. The work is part of the evaluation\nof Cure Violence's (Ransford, Kane and Slutkin 2009; Slutkin 2012)\nimplementation in NYC. Python libraries such as IPython, PySAL, Numpy,\nBasemap, Fiona, Shapely, Matplotlib, bNetworkX, Pandas and scikit-learn\nfeature prominently in the work.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/SDi4TNqaR2s/hqdefault.jpg",
  "title": "Mapping Networks of Violence",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SDi4TNqaR2s"
    }
  ]
}
