{
  "alias": "video/2745/multibody-dynamics-and-control-with-python-part-2",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "In this tutorial, attendees will learn how to derive, simulate, and\nvisualize the motion of a multibody dynamic system with Python tools.\nThe tutorial will demonstrate an advanced symbolic and numeric pipeline\nfor a typical multibody simulation problem. These methods and techniques\nplay an important role in the design and understanding of robots,\nvehicles, spacecraft, manufacturing machines, human motion, etc. At the\nend, the attendees will have developed code to simulate the uncontrolled\nand controlled motion of a human or humanoid robot.\n\nWe will highlight the derivation of realistic models of motion with the\nSymPy Mechanics package. We will walk through the derivation of the\nequations of motion of a multibody system (i.e. the model or the plant),\nsimulating and visualizing the free motion of the system, and finally we\nwill addfeedback controllers to control the plants that we derive.\n\nIt is best if the attendees have some background with calculus-based\ncollege level physics. They should also be familiar with the SciPy\nStack, in particular IPython, SymPy, NumPy, and SciPy. Our goal is that\nattendees will come away with the ability to model basic multibody\nsystems, simulate and visualize the motion, and apply feedback\ncontrollers all in a Python framework.\n\nThe tutorial materials including an outline can be viewed here:\n\nhttps://github.com/pydy/pydy-tutorial-pycon-2014\n",
  "duration": null,
  "id": 2745,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "related_urls": [
    "https://github.com/pydy/pydy-tutorial-pycon-2014"
  ],
  "slug": "multibody-dynamics-and-control-with-python-part-2",
  "speakers": [
    "Jason K. Moore"
  ],
  "summary": "In this tutorial, attendees will learn how to derive, simulate, and\nvisualize the motion of a multibody dynamic system with Python tools.\nThese methods and techniques play an important role in the design and\nunderstanding of robots, vehicles, spacecraft, manufacturing machines,\nhuman motion, etc. Attendees will develop code to simulate the motion of\na human or humanoid robot.\n",
  "tags": [
    "robots",
    "simulation",
    "sympy"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/1-KqRvNX0po/hqdefault.jpg",
  "title": "Multibody Dynamics and Control with Python part 2",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1-KqRvNX0po"
    }
  ]
}
