{
  "alias": "video/2795/ocean-model-assessment-for-everyone",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "To assess how well ocean models are performing, the model products need\nto be compared with data. Finding what models and data exist has\nhistorically been challenging because this information is held and\ndistributed by numerous providers. Accessing data has been challenging\nbecause ocean models produce gigabytes or terabytes of information, is\nusually stored in scientific data formats like HDF or NetCDF, while\nocean observations are often stored in scientific data formats or in\ndatabases.\n\nTo solve this problem, the Integrated Ocean Observing System (IOOS) has\nbeen building a distributed information system based on standard web\nservices for discovery and access. IOOS is now embarking on a nationwide\nsystem-test using python to formulate queries, process responses, and\nanalyze and visualize the data. An end-to-end\n(search-access-analyze-visualize) workflow for assessing storm-driven\nwater levels predicted by coastal ocean models will be discussed, which\nuses ``OWSLib`` for OGC CSW service catalog access, ``Iris`` for ocean\nmodel access and ``pyoos`` (which wraps OWSLib) for Sensor Observation\nService data access. Analysis and visualization is done with ``Pandas``\nand ``Cartopy``, and the entire end-to-end workflow is shared as in\nIPython Notebook with custom environment in Wakari.\n",
  "duration": null,
  "id": 2795,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-13",
  "slug": "ocean-model-assessment-for-everyone",
  "speakers": [
    "Richard Signell"
  ],
  "summary": "An end-to-end workflow for assessing storm-driven water levels predicted\nby coastal ocean models will be discussed which uses ``OWSLib`` for CSW\nCatalog access, ``Iris`` for ocean model access and ``pyoos`` for Sensor\nObservation Service data access. Analysis and visualization is done with\n``Pandas`` and ``Cartopy``, and the entire workflow is shared as in\nIPython Notebook with custom environment in Wakari.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/WHjU_rg81BI/hqdefault.jpg",
  "title": "Ocean Model Assessment for Everyone",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WHjU_rg81BI"
    }
  ]
}
