{
  "alias": "video/2769/perceptions-of-matplotlib-colormaps",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "The choice of colormap in a scientific figure significantly affects the\nway the presented information is perceived by the viewer. This follows\non Damon McDougall's talk on how to choose a colormap for an application\nby delving deeper into several important issues and how well many of the\navailable Matplotlib colormaps stand up against the concerns. For\nexample, it is known that the human brain is better able to interpret\nchanges in magnitude of the luminance and saturation of colors in\ncolormaps instead of the hue. Also, some research has shown that\nlogarithmic changes in brightness are perceived as linear changes. Next,\nbeing able to print a color plot in black and white from a published\npaper is sometimes mandatory and often desirable, and is related to the\ngrey scale in a colormap. Finally, it is important to account for\nvarious types of color blindness when choosing a divergent colormap for\nthe plot to be as accessible as possible. All of these concerns have\nimplications for the design of colormaps, and will be examined in the\ncontext of the properties of the available Matplotlib colormaps in order\nto make a best choice for a given application.\n\nAbstract and slides available `on\nGithub. <https://github.com/dmcdougall/scipy14-colormaps>`__\n",
  "duration": null,
  "id": 2769,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-14",
  "related_urls": [
    "https://github.com/dmcdougall/scipy14-colormaps"
  ],
  "slug": "perceptions-of-matplotlib-colormaps",
  "speakers": [
    "Kristen M. Thyng"
  ],
  "summary": "On several issues related to the perception of colormaps...\n",
  "tags": [
    "vis"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/rkDgBvT-giw/hqdefault.jpg",
  "title": "Perceptions of Matplotlib Colormaps",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rkDgBvT-giw"
    }
  ]
}
