{
  "alias": "video/2726/practical-experience-in-teaching-numerical-method",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Traditional university teaching is based on the use of lectures in class\nand textbooks out of class. The medium (lecture or book) discourages the\nnatural curiosity that can lead to deeper understanding by investigating\nthe result of changing a parameter, or looking at the full results of a\ntime-dependent simulation.\n\nThe IPython notebook provides a single medium in which mathematics,\nexplanations, executable code, and animated or interactive visualization\ncan be combined. Notebooks that combine all of these components can\nenable new modes of student-led inquiry: the student can experiment with\nmodifications to the code and see the results, all without stepping away\nfrom the mathematical explanations themselves. When notebooks are used\nby students in the classroom, students can quickly share and discuss\nresults with the instructor or other class members. The instructor can\nfacilitate deeper learning by posing questions that students may answer\nthrough writing appropriate code, during class time.\n\nFor the past four years, I have taught a graduate numerical analysis\ncourse using SAGE worksheets and IPython notebooks. I will show examples\nof the notebooks I've developed and successfully used in this course. I\nwill describe some practical aspects of my experience, such as:\n\n-  Tradeoffs between using IPython and SAGE\n-  Experiences with use of cloud computing platforms\n-  Dealing with students' installation issues\n-  Quickly getting students up to speed with the Python language and\n   packages\n-  Testing and evaluating homework in a math course that is\n   programming-intensive\n\n",
  "duration": null,
  "id": 2726,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "slug": "practical-experience-in-teaching-numerical-method",
  "speakers": [
    "David I. Ketcheson"
  ],
  "summary": "New tools like the IPython notebook can enhance both lectures and\ntextbooks, by making class time and individual study more interactive\nthrough the inclusion of executable code and animations. I will demo\nsome materials and activities I've provided for students using the\nIPython notebook. I will focus on practical issues I've faced that are\nparticular to this teaching approach.\n",
  "tags": [
    "education",
    "ipynb"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/OaP6LiZuaFM/hqdefault.jpg",
  "title": "Practical Experience in Teaching Numerical Methods with IPython Notebooks",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OaP6LiZuaFM"
    }
  ]
}
