{
  "alias": "video/2727/project-based-introduction-to-scientific-computin",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Computational tools and skills are as critical to the training of\nphysics majors as calculus and math, yet they receive much less emphasis\nin the undergraduate curriculum. One-off courses that introduce\nprogramming and basic numerical problem-solving techniques with\ncommercial software packages for topics that appear in the traditional\nphysics curriculum are insufficient to prepare students for the\ncomputing demands of modern technical careers. Yet tight budgets and\nrigid degree requirements constrain the ability to expand computational\ncourse offerings for physics majors.\n\nThis talk will present an overview of a recently revamped course at Cal\nPoly San Luis Obispo that uses Python and associated scientific\ncomputing libraries to introduce the fundamentals of open-source tools,\nversion control systems, programming, numerical problem solving and\nalgorithmic thinking to undergraduate physics majors. The spirit of the\ncourse is similar to the bootcamps organized by `Software\nCarpentry <http://software-carpentry.org>`__ for researchers in science\nbut is offered as a ten-week for-credit course. In addition to having a\ntraditional in-class component, students learn the basics of Python by\ncompleting tutorials on `Codecademy <http://www.codecademy.com>`__'s\nPython track and practice their algorithmic thinking by tackling\n`Project Euler <http://projecteuler.net>`__ problems. This approach of\nincorporating online training may provide a different way of thinking\nabout the role of MOOCs in higher education. The early part of the\ncourse focuses on skill-building, while the second half is devoted to\napplication of these skills to an independent research-level\ncomputational physics project. Examples of recent projects and their\nresults will be presented.\n",
  "duration": null,
  "id": 2727,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "related_urls": [
    "http://projecteuler.net",
    "http://software-carpentry.org",
    "http://www.codecademy.com"
  ],
  "slug": "project-based-introduction-to-scientific-computin",
  "speakers": [
    "Jennifer Klay"
  ],
  "summary": "This talk will present an overview of a project-based introductory\ncourse in scientific computing using python for physics majors at Cal\nPoly San Luis Obispo.\n",
  "tags": [
    "education",
    "physics"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/eJhmMf6bHDU/hqdefault.jpg",
  "title": "Project based introduction to scientific computing for physics majors",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eJhmMf6bHDU"
    }
  ]
}
