{
  "alias": "video/2789/pysi-a-python-framework-for-spatial-interaction",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Functions from libraries such as scipy.optimize, scipy.spatial,\nstatsmodels, and numdifftools comprise the core of the pySI.calibrate\nroutines, which are automatically constructed depending upon the\nspecified model inputs. As a result, the user can focus on identifying\ndifferent flow systems and understanding the associated spatial\nprocesses, rather than the algorithmic divergences which emerge between\ndifferent models. After calibration is completed, the estimated\nparameters and their diagnostic statistics can be reported in a uniform\nfashion. Using functions within pySI.simulate, the parameter estimates\ncan act as inputs in order to predict new flows. More recently developed\nmodels, which do not require input parameters, are also made available,\nallowing comparisons amongst results from differing conceptual\nformulations. Finally, results may be visualized with plots and networks\nvia matplotlib, igraph, and networkx. Overall, the pySI framework will\nincrease the accessibility of spatial interaction modelling while also\nserving as a tool which can help new users understand the associated\nmethodological intricacies.\n\nWithin this presentation, the concept of spatial interaction and a few\nkey modelling terms will first be introduced, along with several example\napplications. Next, two traditional techniques for calibrating spatial\ninteraction models, Poisson generalized linear regression and direct\nmaximum likelihood estimation will be contrasted. It will then be\ndemonstrated how this new framework will allow users to execute either\nform of calibration using identical input variables, which are based\nupon a pandas DataFrame specification, without any significant\nmathematical or statistical training. Results from two different\nconceptual models will be compared to illustrate how pySI can be used to\nexplore different methods and models of spatial interaction.\n",
  "duration": null,
  "id": 2789,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-13",
  "slug": "pysi-a-python-framework-for-spatial-interaction",
  "speakers": [
    "Taylor Oshan"
  ],
  "summary": "Spatial Interaction Modelling is a method for calibrating parameters for\ncomponents within a system of flows, such as migration or trade, and\nthen using those parameters to estimate new flows. Despite their\npopularity, a unified Python framework to employ them does not exist. In\nresponse, pySI was created as a coherent tool for calibrating models and\nsimulating flows for a variety of models.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/VokeBZarsNM/hqdefault.jpg",
  "title": "pySI  A Python Framework for Spatial Interaction Modelling",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VokeBZarsNM"
    }
  ]
}
