{
  "alias": "video/2722/python-backends-for-climate-science-web-apps",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "NIWA has developed two tools dedicated respectively to the\nreconstruction of the climates of the past and to the rapid and flexible\ndevelopment of climate services connected to a widely used\nmeteorological database.\n\n**PICT (Past Interpretation of Climate Tool** allows the user, given a\nclimate proxy or set of proxies, to reconstruct likely anomalies\nassociated with specific proxy epochs. The tool implements the concept\nof climate analogs, and reconstruct paleo-climate anomalies in terms of\nmean atmospheric circulation and sea-surface-temperatures, as well as in\nterms of the possible changes in the probabilities of synoptic weather\nregimes (or 'attractors' in the climate system). The whole backend of\nthis application has been exclusively developed using Python with Numpy,\nscipy, pandas and matplotlib scientific libraries. We present a brief\noverview of the underlying science before exposing the choices made in\ndesigning the python-based compute and data visualisation layer.\n\n**Clidesc** is an application layer, running in the browser, built on\ntop of **CLIDE**, an open-source database specialized in handling\nmeteorological data in real-time and facilitating its long-term storage.\nIt has been developed using open standards, and facilitate the rapid\ndevelopment of climate services (data analysis and visualisations\ndeveloped to increase climate intelligence and early warning systems).\nClidesc is currently being deployed in several Pacific Islands National\nMeteorological services. Services can be developed using either R or\nPython. Development in Python is based on Anaconda and psycopg2, which\nprovides the interface with the postgresql-based Clide database. We\npresent the context and rationale for using open-standards, and give\nexamples of how a user with minimum python knowledge can use templates\nto rapidly implement a new service tailored to her needs.\n",
  "duration": null,
  "id": 2722,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "slug": "python-backends-for-climate-science-web-apps",
  "speakers": [
    "Nicolas Fauchereau"
  ],
  "summary": "We present two web applications: (PICT: Past Interpretation of Climate\nTool), a paleo-climates reconstruction tool and CLIDESC, a climate\nservices layer built on top of the Clide database, a database system\nused widely in the National Meteorological services across the Pacific.\nBoth these tools have been developed at NIWA in New Zealand.\n",
  "tags": [
    "climate"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/yqMqTr3LB7o/hqdefault.jpg",
  "title": "Python Backends for Climate Science Web Apps",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yqMqTr3LB7o"
    }
  ]
}
