{
  "alias": "video/2809/reflexive-data-science-on-scipy-communities",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Background/Motivation\n~~~~~~~~~~~~~~~~~~~~~\n\nThe Scientific Python community's contributions to greater scientific\nunderstanding have been underappreciated by academic institutions. One\nreason for this is that software engineering is widely misunderstood and\nnot recognized as research work in its own right, as opposed to paper\npublication and patents. A better understanding of the open source\nsoftware development process itself will help academic institutions\nrecognize the contributions of open source developers.\n\nMethods\n~~~~~~~\n\nI collect historical data from development of Scientific Python projects\nand render these into formats suitable for analysis using SciPy tools.\nTo demonstrate the potential of this work, I will show two ways of\nanalyzing this data scientifically: as a self-excited Hawkes process\nexibiting shock behavior, and as information diffusion over a social\nnetwork.\n\nResults\n~~~~~~~\n\nThe purpose of this talk is twofold.\n\nFirst, to introduce tools and techniques for turning data from open\nsource software production into scientific data suitable for analysis.\nThis talk proposes that there's an opportunity for SciPy to engage in\n*reflexive data science*, using its own data to learn more about how it\nfunctions and how to operate more efficiently.\n\nSecond, this talk will present visualizations of the data based on\ncomplex systems research and social network analysis. Building on prior\nwork, these results will focus on the role of productive bursts in\ncommunications. Drawing on social network analysis and prior work on\nroles in Usenet communities and open source communities, this talk will\nprovide historical insight into the interaction between SciPy\ncommunities.\n",
  "duration": null,
  "id": 2809,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-13",
  "slug": "reflexive-data-science-on-scipy-communities",
  "speakers": [
    "Sebastian Benthall"
  ],
  "summary": "I present tools for collecting data generated by Scientific Python\ncommunity development infrastructure (mailing list archives, pull\nrequests, issue trackers) and analyzing it with Pandas and NetworkX.\nShowing preliminery results using social network analysis and complex\nsystems modeling, I demonstrate using reflexive data science to enrich\nour understanding of open source development.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/IL9KqJtTGw0/hqdefault.jpg",
  "title": "Reflexive Data Science on SciPy Communities",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IL9KqJtTGw0"
    }
  ]
}
