{
  "alias": "video/2725/scientific-computing-in-the-undergraduate-meteoro",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Scientific computing is integrated into the undergraduate meteorology\ncurriculum at Millersville University. The curriculum guidelines\npublished by the American Meteorological Society specifically address\nscientific computing in undergraduate atmospheric sciences curricula,\nstating that students should gain “experience using a high-level\nstructured programming language (e.g., C, C++, Python, MATLAB, IDL, or\nFortran).” This is addressed at Millersville via the\nprogramming-specific courses are ESCI 282 – *Fortran Programming for the\nEarth Sciences*, and ESCI 386 – *Scientific Programming, Analysis and\nVisualization with Python*. There are also additional courses in which\nthe students are required to use scientific computing as part of their\nassignments. Examples of these courses are ESCI 445 – *Numerical\nModeling of the Atmosphere and Oceans*, and ESCI 390 – *Remote Sensing*.\n\nAlthough the university’s computer science department teaches\nprogramming courses in Java, this is not very applicable to our\nstudents’ needs for scientific programming. We therefore teach our own\nprogramming courses in-house. The required programming course taken by\nall students is the Fortran course, which teaches them the elements of\nprogramming. This is many students’ first exposure to programming. Most\nthen follow-on by taking the Python course. In the Python course,\nscientific data analysis and visualization are stressed, using the\nScientific Python, Numerical Python, and Matplotlib libraries.\n\nIn the elective numerical modeling course, students are required to\nwrite programs for finite-difference solutions to various 1-D and 2-D\npartial differential equations relevant to modeling the fluid dynamics\nof the atmosphere. They may program in any language of their choosing,\nbut the majority of students choose Python, even if they have no prior\nexperience with it. This is because of Python’s intuitive syntax and\nease of use. In the elective remote sensing course students are\nintroduced to and use IDL/ENVI for display and analysis of remote\nsensing imagery.\n\nPrior to 2012 the current Python course was instead taught as a course\nin IDL. The transition was made for several reasons. The primary reason\nwas the limited market and usage of IDL compared to more pervasive\nlanguages such as MATLAB and Python. Many students would not have access\nto IDL once they graduate. Also, Python is gaining traction in usage in\nthe atmospheric and oceanic sciences, and is not proprietary like IDL\nand MATLAB, so students will have access to it no matter where they find\nemployment or graduate school opportunities. The high cost of\nmaintaining an institutional IDL license is also an issue that the\nuniversity must address annually, and it times of lean budgets it\nbecomes an attractive target for elimination. The IDL course is still on\nthe books, but there are no immediate plans for upcoming offerings.\n",
  "duration": null,
  "id": 2725,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "slug": "scientific-computing-in-the-undergraduate-meteoro",
  "speakers": [
    "Alex DeCaria"
  ],
  "summary": "Scientific computing is an important aspect of the undergraduate\nmeteorology curriculum at Millersville University. All students take a\ncourse in Fortran, and many take additional courses in Python and\natmospheric numerical modeling. This presentation discusses how\nscientific computing is incorporated into the curriculum, and why\nFortran and Python were chosen as the languages to be taught.\n",
  "tags": [
    "education",
    "meteorology"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/igBEH7H8Ahk/hqdefault.jpg",
  "title": "Scientific Computing in the Undergraduate Meteorology Curriculum at Millersville Univ",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=igBEH7H8Ahk"
    }
  ]
}
