{
  "alias": "video/2776/software-for-panoptes-a-citizen-science-observat",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "The goal of Project Panoptes (Panoptic Astronomical Networked OPtical\nobservatory for Transiting Exoplanets Survey, see\nhttp://projectpanoptes.org/) is to build low cost, reliable, robotic\ntelescopes which can be used to detect transiting exoplanets. The\nhardware is designed to be standardized, using as many commercial off\nthe shelf components as possible so that a Panoptes \"unit\" can be\nreproduced quickly and easily by students or amateurs. In this way, many\nunits can be deployed at many different sites to provide continuous and\nredundant sky coverage. Panoptes is designed from the ground up to be a\ncitizen science project which will involve the public in all aspects of\nthe science, from data acquisition to data reduction.\n\nIn this presentation, we describe the current status of the Panoptes\nObservatory Control System (POCS, see https://github.com/panoptes/POCS),\nan open source, collaborative, python-based software package. POCS is\ndesigned to be a simple as possible in order to make it accessible to\nnon-experts. As such, POCS is a state machine which transitions between\na few well defined operating states. We make extensive use of existing\nmodules (notably astropy and pyephem). The challenge we face in writing\nPOCS to to balance our desire for simplicity and accessibility against\ncapability.\n\nWe will also briefly describe the other software challenges of our\nproject, specifically an algorithm designed to extract accurate\nphotometry from DSLR images (color images obtained using a Bayer color\nfilter array) rather than from the more traditional filtered monochrome\nCCD image.\n",
  "duration": null,
  "id": 2776,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-14",
  "related_urls": [
    "http://projectpanoptes.org/)",
    "https://github.com/panoptes/POCS),"
  ],
  "slug": "software-for-panoptes-a-citizen-science-observat",
  "speakers": [
    "Josh Walawender",
    "Michael Butterfield"
  ],
  "summary": "In this presentation, we describe the current status of software for\nProject Panoptes. Our goal is to build low cost, reliable, robotic\ntelescopes which can be used to detect transiting exoplanets. Panoptes\nis designed from the ground up to be a citizen science project which\nwill involve the public in all aspects of the science, from data\nacquisition to data reduction.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/VDWXJQggFH8/hqdefault.jpg",
  "title": "Software for Panoptes: A Citizen Science Observatory",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VDWXJQggFH8"
    }
  ]
}
