{
  "alias": "video/2801/synthesis-and-analysis-of-circuits-in-the-ipython",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Circuits, i.e., a network of interconnected components with ports, have\nfound application in various scientific and engineering domains, ranging\nfrom applications close to the physical implementation, such as\nelectrical circuits, photonic circuits for optical information\nprocessing, superconducting quantum circuits for quantum information\napplications to more abstract circuit representations of dynamical\nsystems, biological processes or even software algorithms.\n\nThis has already led to the development of quite general\ndomain-independent circuit modeling toolkits such as\n`Modelica <https://www.modelica.org/>`__, but to date, there exist very\nfew open source graphical general circuit editing environments that can\nbe tightly integrated with custom, domain-specific implementation\nsimulation or analysis backends as well as\n`IPython <http://ipython.org>`__.\n\nHere we present our first attempt at creating such a tool as well as\nsome applications from our own research on nano-photonic quantum circuit\nmodels. Our existing `QNET <http://mabuchilab.github.io/QNET/>`__\nsoftware package allows to model these circuits in a purely symbolic\nfashion and interfaces with various codes for numerical simulation.\n\nWe demonstrate that the extension of our package with a visual circuit\neditor leads to a rich integrated simulation and analysis workflow in\nwhich an engineer or researcher can receive very fast feedback when\nmaking changes to his model.\n\nAs a consequence, it is much easier to build intuition for the\nparticular kinds of circuit models and find novel and creative solutions\nto an engineering task.\n\nFinally, given the broad range of applications for circuit models and\nrepresentations, we outline how our visual circuit editor can be adapted\nto export a circuit for interfacing with other domain specific software\nsuch as Modelica.\n",
  "duration": null,
  "id": 2801,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-13",
  "related_urls": [
    "http://ipython.org",
    "http://mabuchilab.github.io/QNET/",
    "https://www.modelica.org/"
  ],
  "slug": "synthesis-and-analysis-of-circuits-in-the-ipython",
  "speakers": [
    "Nikolas Tezak"
  ],
  "summary": "Building on the new IPython 2.0 widget model and the jsPlumb package we\ncreate a schematic capture tool that allows graphically editing a\ncircuit as well as its components' parameters and then instantly\nupdating a domain specific modeling backend. This allows for an\nintegrated circuit modeling workflow and to extend widget-based user\ninterfaces for engineering and research projects.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/-kUzWdKOgqc/hqdefault.jpg",
  "title": "Synthesis and analysis of circuits in the IPython notebook",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-kUzWdKOgqc"
    }
  ]
}
