{
  "alias": "video/2712/taking-control-enabling-mathematicians-and-scien",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Good solutions to hard problems require both domain and algorithmic\nexpertise. Domain experts know *what* to do and computer scientists know\n*how* to do it well. Coordination between the algorithmic and domain\nprogrammer is challenging to do well and difficult to scale. It is also\narguably one of the most relevant blocks to scientific progress today.\n\nThis talk draws from experience supporting mathematical programmers in\nthe SymPy project. SymPy is a computer algebra system, a complex problem\nthat requires the graph manipulation algorithms of a modern compiler\nalongside the mathematics of several PhD theses. SymPy draws from a\nbroad developer base with experienced and novice developers alike and so\nstruggles to maintain a cohesive organized codebase.\n\nWe approach this development problem by separating software engineering\ninto a collection of small functions, written by domain experts,\nalongside an abstract control system, written by algorithmic\nprogrammers. We facilitate this division with techniques taken from\nother languages and compiler technologies. Notably we motivate the use\nof a few general purpose libraries for multiple dispatch, pattern\nmatching, and programmatic control.\n",
  "duration": null,
  "id": 2712,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "slug": "taking-control-enabling-mathematicians-and-scien",
  "speakers": [
    "Matthew Rocklin"
  ],
  "summary": "Good solutions to hard problems require both domain and algorithmic\nexpertise. Domain experts know what to do and computer scientists know\nhow to do it well. This talk discusses challenges and experiences trying\nto reconcile these two groups, particularly within SymPy. It proposes\nconcrete approaches including multiple dispatch, pattern matching, and\nprogrammatic strategies.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/QldxygVVj-s/hqdefault.jpg",
  "title": "Taking Control: Enabling Mathematicians and Scientists",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QldxygVVj-s"
    }
  ]
}
