{
  "alias": "video/2819/teaching-python-to-undergraduate-students",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Teaching undergraduate students in programming languages like Python is\ninteresting and challenging at the same time. You have to deal mostly\nwith two types of students: Those who have already some experience in\nprogramming (not neccessarily Python), e.g. from high school, and those\nwho have not. At Bonn University we have recently changed the structure\nof such a course for Bachelor of Science in Physics students. First, we\ninclude the Python tutorial in a lecture in the first term instead of a\nvoluntary course in the lecture-free time before the fourth semester,\nwhere the \"Numerical Methods for Physicists\" course takes place. Second,\ninstead of a weekly lecture, in which the topics are explained in\ndetail, and a 2 hours exercise class, the new system provides only one\nintroduction lecture per topic but a 3 hours exercise class per week. So\nespecially the tutors are much more responsible for the success of the\nstudents in the final report of this course. Furthermore, as a student\nrepresentative and also tutor for both courses, I have been heavily\ninvolved in this process.\n\nI like to initiate a larger discussion about how to teach programming to\nundergraduate students, especially because in the last decades\nprogramming got more and more important in science and due to e.g. the\nBologna reform in Europe, it should be easier to change between\nuniversities after e.g. the Bachelor program.\n",
  "duration": null,
  "id": 2819,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-10",
  "slug": "teaching-python-to-undergraduate-students",
  "speakers": [
    "Dominik Klaes"
  ],
  "summary": "Teaching undergraduate students in programming is interesting and\nchallenging at the same time, because one has to deal mostly with two\ntypes: Those who have already experience and those who have not. I will\npresent two models from Bonn University for Physics students with now\nmuch more responsibility for the tutors and would like to initiate\ndiscussions about different systems all over the world.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/B_WoteRvK2I/hqdefault.jpg",
  "title": "Teaching Python to undergraduate students",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=B_WoteRvK2I"
    }
  ]
}
