{
  "alias": "video/2859/teaching-numerical-methods-part-3",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "This tutorial is targeted to those who are or soon will be teaching\nnumerical methods or scientific computing and are interested in using\nPython as the programming language for their course. The tutorial will\nbe useful both to academics teaching university courses and those in\nindustry who run training sessions. No prior knowledge of the IPython\nnotebook is necessary, but participants should have some familiarity\nwith Python, Numpy, and Matplotlib.\n\nIPython notebooks are an excellent medium for teaching nuemrical methods\nsince they can include both mathematical explanations and executable\ncode in a single document. The tutorial will begin with an introduction\nto the IPython notebook, emphasizing how to overcome aspects that can be\nconfusing to students. Next we will go over available free resources for\n\n-  ensuring that students have a suitable computing environment, using\n   either a cloud platform or a packaged distribution\n-  distributing and collecting notebooks\n-  converting notebooks to other formats that may be useful in a course\n\nWe will also review a number of excellent existing resources containing\nIPython notebooks for numerical methods courses. Using these notebooks\nas examples, we will discuss how to design effective notebooks for\nteaching, including\n\n-  typesetting mathematical equations and expressions using LaTeX\n-  Formatting, referencing, and layout using Markdown\n-  inserting complete or partial code snippets\n-  embedding figures and other media\n-  embedding interactive widgets\n\nWe will briefly discuss different approaches to using IPython notebooks\nin a course, including their use as the basis for\n\n-  homework assignments\n-  short activities during a class session\n-  longer laboratory sessions\n\nFinally, participants will be asked to develop, individually or in small\ngroups, a notebook of their own that could be used as an assignment,\nclassroom exercise, or lecture.\n",
  "duration": null,
  "id": 2859,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "slug": "teaching-numerical-methods-part-3",
  "speakers": [
    "Aron Ahmadia",
    "David I. Ketcheson"
  ],
  "summary": "This tutorial will give participants an introduction to the use of\nIPython notebooks in teaching numerical methods or scientific computing,\nat the level of an undergraduate or graduate university course. Prior\nfamiliarity with notebooks is not necessary. Participants will create an\ninteractive notebook that explains and helps students to implement and\nexplore a numerical algorithm.\n",
  "tags": [
    "ipython",
    "numerical methods"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/rpGghGDEkZE/hqdefault.jpg",
  "title": "Teaching Numerical Methods with IPython Notebooks, Part 3",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rpGghGDEkZE"
    }
  ]
}
