{
  "alias": "video/2791/the-placeiq-location-based-analytic-platform",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "The surge in mobile device adoption and the subsequent abundance of\ntime-stamped location data have given rise to possibilities and interest\nin understanding movement-based human behavior. The PlaceIQ analytic\nplatform is a large-scale data analysis system that addresses this\ndemand, providing a large-scale, flexible, and reliable platform created\naround the concepts of location and audience. The platform's data\nprocessing piece ingests large volumes of mobile activity data daily and\noverlays them onto geospatial data. These data include: the\ndiscretization of the U.S. into 1 billion 100 meter by 100 m tiles; more\nthan 400,000 proprietary polygons delineating the shapes of properties\nand businesses; business listings and census data; and terabytes of\nmobile activity data. We discuss here the methodologies - namely DBSCAN\nclustering and kd-trees - used to de-dupe disparate geodata sources and\nevaluate the quality of noisy activity data at scale. The resulting\noverlays of people, places, and time create high-fidelity abstractions\nand manipulations insightful to businesses, particularly in the mobile\nadvertising domain.\n",
  "duration": null,
  "id": 2791,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-13",
  "slug": "the-placeiq-location-based-analytic-platform",
  "speakers": [
    "Eliza Chang"
  ],
  "summary": "PlaceIQ's patented platform analyzes half a trillion diverse data points\nabout location, time, and real-world behavior to define human audiences\nand allow businesses to understand consumers at scale. It ingests large\nvolumes of mobile activity data and geographic data, calling for\ncreative use machine learning techniques to enable the high-fidelity\nabstractions insightful to businesses.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/ygI1LP_jD9A/hqdefault.jpg",
  "title": "The PlaceIQ Location Based Analytic Platform",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ygI1LP_jD9A"
    }
  ]
}
