{
  "alias": "video/2762/the-kbase-narrative-bioinformatics-for-the-99",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Computional Biology and Experimental Biology are two specialities that\nwould deeply benefit from more interaction - computationalists need\naccess to data, biologists in wetlabs need computational tools. The\nKBase Narrative is a computerized laboratory notebook that puts the\npower of the KBase predictive biology platform into the hands of\nexperimentalists and students. KBase provides cluster computation,\nanalysis and modeling pipelines, large public datasets and a \"pluggable\"\narchitecture for future services. The Narrative is an interface enabling\nthe sharing of data, approaches and workflows on KBase. It also serves\nas a teaching tool and publishing platform, allowing other scientists\nand students to observe and reproduce the processes that led to the\npublished result.\n\nThe KBase Narrative is based on the IPython Notebook, extended in the\nfollowing ways:\n\n-  Notebooks are stored in a remote object store that enables\n   versioning, provenance and sharing\n-  Support for multiple users has been added, based on OAuth\n   authentication against a \"cloud\" authentication service (Globus\n   Online)\n-  A framework for dynamically building form inputs for services using\n   Python introspection and the IPython Traitlets package (a version of\n   Traits) and displaying the output in JS visualization widgets\n-  A Docker based provisioning system that builds and tears down\n   sandboxed IPython Notebook servers on demand, providing a scalable,\n   reasonable safe and easy to use environment for running hosted\n   IPython notebooks with much smaller overhead than VM's\n-  A heavily modified user interface that has been designed to support\n   computational biology workflows\n\nThe current KBase Narrative was developed over the span of roughly 6\nmonths by a small team of developers and user interface experts - the\nshort time scale was possible due to the huge amount of functionality\nalready provided by the IPython Notebook, and taking advantage of the\nproductivity and power of the Python language.\n",
  "duration": null,
  "id": 2762,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-14",
  "slug": "the-kbase-narrative-bioinformatics-for-the-99",
  "speakers": [
    "Bill Rihl"
  ],
  "summary": "The KBase Narrative builds on the IPython Notebook to provide a\nmulti-user, virtualized Bioinformatics Laboratory Notebook that brings\nExperimental/Wetlab Biologists, students and the bio-curious into the\nworld of Computational Biology. Tools for genome annotation,\nvisualization, metabolic modeling and more are made available in a\ncollaborative and educational web interface.\n",
  "tags": [
    "bioinformatics"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/52uP6NZa8rE/hqdefault.jpg",
  "title": "The KBase Narrative Bioinformatics for the 99%",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=52uP6NZa8rE"
    }
  ]
}
