{
  "alias": "video/2820/the-berkeley-institute-for-data-science-a-place-f",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "In 2013, the Gordon and Betty Moore and the Alfred P. Sloan foundations\n`awarded <http://www.moore.org/programs/science/data-driven-discovery/data-science-environments>`__\nUC Berkeley, U. Washington and NYU for a collaborative, $38M in support\nof a 5-year initiative to create novel environments for Data Science.\nThis project was driven by the recognition that computing and data\nanalysis have now become the backbone of all scientific research, and\nyet the teams, collaborations and individuals that make this possible\ntypically encounter significant barriers in today's academic\nenvironments.\n\nThe SciPy community is one of the poster children of this issue: many of\nour members live \"officially\" in traditional, discipline-oriented\nscientific research, and yet we have committed time and effort to\ncreating an open ecosystem of tools for research. As we all know, this\nis often done with little support from the standard incentive structures\nof science, be it publication venues, funding agencies or hiring, tenure\nand promotion committees.\n\nThe launch of this initiative is an important moment, as it signals the\nrecognition of this problem by important and well-respected foundations\nin science. At UC Berkeley, we took this opportunity to create the new\n`Berkeley Institute for Data\nScience <http://vcresearch.berkeley.edu/datascience/bids-launch-dec-12>`__.\nIn this effort, the open source tools of the SciPy community will play a\ncentral role.\n\nIn this talk, I will describe the larger context in which this\ninitiative has been created, as well as the scientific scope of our\nteam, our goals, and the opportunities that we will try to provide with\nthis space. We expect that this new institute, together with our\npartners at UW and NYU, will play an important role in support of the\ngreat work of the SciPy ecosystem.\n",
  "duration": null,
  "id": 2820,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-10",
  "related_urls": [
    "http://vcresearch.berkeley.edu/datascience/bids-launch-dec-12",
    "http://www.moore.org/programs/science/data-driven-discovery/data-science-environments"
  ],
  "slug": "the-berkeley-institute-for-data-science-a-place-f",
  "speakers": [
    "Fernando Pérez"
  ],
  "summary": "I will describe the new Berkeley Institute for Data Science (BIDS), part\nof a collaboration with UW and NYU funded by the Moore and Sloan\nFoundations. It will be a space for the open and interdisciplinary work\nthat is typical of the SciPy community. In the creation of BIDS, the\nrole of open source scientific tools for Data Science, and specifically\nthe SciPy ecosystem, played an important role.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/q5yAy4WWTyU/hqdefault.jpg",
  "title": "The Berkeley Institute for Data Science a place for people like us",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=q5yAy4WWTyU"
    }
  ]
}
