{
  "alias": "video/2770/transient-detection-and-image-analysis-pipeline-f",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "In preparation for the `TOROS\nproject <http://toros.phys.utb.edu/TOROS/Welcome.html%20\"TOROS%20project\">`__\ndesigned to survey the southern hemisphere sky in search for transients,\nwe develop a pipeline for image analysis and processing based on Python.\n\nThe code makes extended use of the open source image processing library\nOpenCV to align the images astrometrically and makes use of other\nastronomical specific routines like the Astropy package to deal with\nFITS files. The design will involve integration with SciDB,\nAstrometry.net, parallelization and other pythonic astronomical tools.\n\nThis automated optical transients discovery tool will be tested with\nreal (CSTAR and TORITOS telescopes) and simulated data samples as the\ninput for a machine learning classification tool of light-curves based\non AstroML and Scikit-Learn libraries.\n\nThe project is version controlled using git and we will handle future\ncollaboration among scientist from different countries using the open\nsource project manager Trac. It will be available as an open source\nproject in popular web repositories like github or bitbucket.\n",
  "duration": null,
  "id": 2770,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-14",
  "related_urls": [
    "http://toros.phys.utb.edu/TOROS/Welcome.html%20"
  ],
  "slug": "transient-detection-and-image-analysis-pipeline-f",
  "speakers": [
    "Martin Beroiz"
  ],
  "summary": "TOROS project will be an astronomical survey of the southern hemisphere\nin search of optical transients counterparts for aLIGO. This project\nwill make extended use of Machine learning techniques to identify\ninteresting transient candidates to aLIGO alerts. It also uses OpenCV\nlibrary for image aligning and some of the subsequent processing.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/Kq-hd69_1FM/hqdefault.jpg",
  "title": "Transient detection and image analysis pipeline for TOROS project",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Kq-hd69_1FM"
    }
  ]
}
