{
  "alias": "video/2715/you-win-or-you-scipy",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Python is currently one of the most popular programming languages and it\nseems that that Scientific Python has truly hit its stride in recent\nyears. With fame comes a deluge of users, but not necessarily any more\ndevelopers. Scientific Python is often held up as one of the core\nstrengths of the Python language. Why is this so? And how much does it\nactually help us? This talk intends to be a frank discussion on the\ngreat parts of the SciPy community and the parts that need work.\n\nAs a confederation of packages and projects, there are several issues\nthat affect everyone. Sometimes these issues fall through the cracks and\nother times they are vigorously tackled head on. In either case, I posit\nthat greater communication about these global topics is necessary to\nsupport and scale to the next wave of SciPy users and developers.\n\nPoints of discussion in this talk may include:\n\n-  Packaging,\n-  Education,\n-  Matplotlib - aged or awesome,\n-  Competition from other languages,\n-  Diversity,\n-  Employing our own,\n-  Interfacing with the broader Python community,\n-  The legal status of projects, and\n-  Maintaining critical packages in the ecosystem (when devs have moved\n   on).\n\nHistorically, the SciPy conference has not had many overview talks,\ntalks about the community itself, what we are doing right, and what we\nare doing wrong.\n\nThey were often relegated to keynotes if they were present at all. This\ntalk is a boots-on-the-ground attempt to rectify that.\n",
  "duration": null,
  "id": 2715,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "slug": "you-win-or-you-scipy",
  "speakers": [
    "Andy Terrel",
    "Anthony Scopatz",
    "Katy Huff"
  ],
  "summary": "Reflections on the State of Scientific Python\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/e0Z9-EuZJac/hqdefault.jpg",
  "title": "You Win or You SciPy",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=e0Z9-EuZJac"
    }
  ]
}
