{
  "alias": "video/2728/zeke-a-python-platform-for-teaching-mathematical",
  "category": "SciPy 2014",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Computational and mathematical models can yield profound insights in the\nstudy of the spread of infectious diseases, illustrating difficult\nconcepts such as herd immunity, suggesting new avenues for empirical\nresearch, and obtaining repeatable, quantifiable evidence in situations\nwhere other study designs are difficult if not impossible.\n\nTeaching infectious disease modeling presents a challenge however, as it\nrequires the development of three unrelated skill sets: the theory of\ninfectious disease models, subject-matter expertise about the diseases\nthemselves, and the programming skills needed to implement all but the\nsimplest models.\n\nRather than forcing these skill sets to be developed in parallel, *Zeke*\nis an educational platform meant to allow students to develop these\nskills in sequence. It uses a zombie epidemic to remove the need for\nspecific expertise regarding disease systems, relying instead on a\nfamiliar cultural reference. Students are allowed to first explore the\ntheory of modeling, a Django front-end enabling interaction with models\nwithout the need for scientific computing skills. All the models are\nhowever implemented to be stand-alone models that can be run using SciPy\nor other packages, and as students grow in sophistication the\nopen-source nature of *Zeke* allows them to develop both computational\nand subject-specific expertise in a stepwise fashion.\n",
  "duration": null,
  "id": 2728,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-09",
  "slug": "zeke-a-python-platform-for-teaching-mathematical",
  "speakers": [
    "Eric Lofgren"
  ],
  "summary": "Zeke is an educational platform implemented using Python, SciPy and\nDjango which allows students and researchers interested in the modeling\nof infectious diseases to learn both modeling and scientific computing\nskills in an interactive environment, without forcing theoretical and\ncomputational skills to be developed simultaneously.\n",
  "tags": [
    "education"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/bZv9Rw6Nh8M/hqdefault.jpg",
  "title": "Zeke: A Python Platform for Teaching Mathematical Modeling of Infectious Diseases",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bZv9Rw6Nh8M"
    }
  ]
}
