{
  "category": "DjangoCon 2013",
  "slug": "how-to-learn-django-the-wrong-way",
  "title": "How to Learn Django the Wrong Way",
  "summary": "How to Learn Django the Wrong Way\n\nWednesday 12:15 p.m.--1 p.m.\n\nAudience level: Novice\n\nDescription\n\nCan you remember your very first Django project and some embarrassing\nmistakes you made? Come hear about some 'aha' moments of a novice\nDjangonaut! I'll share valuable lessons I learned by doing things the\nwrong way. If you are a Django novice, you'll learn some pitfalls to\navoid. If you are a seasoned Djangonaut, you can find out challenges\nthat a new Djangonaut, your new hire or mentee may face! Abstract\n\nCan you remember your very first Django project and some mistakes you\nmade? Or are you a Django novice embarking on your first application or\nstruggling with one?\n\nCome hear about my experiences as an entry developer @InVitae. In this\ntalk, I'll give a quick overview of my first Django project and give\nsnapshots to explain how it changed over time. There will be code\nsnippets to show some horrible code I initially wrote, consequences of\nthose code, and improvements that were made later. In the process,\nyou'll find out how I learned Django (more accurately, still learning)\nby doing things the wrong way and how one can learn about good software\nengineering practices through bad practices.\n\nSome potential topics include: Where does this function belong-- in\nmodels or views or another file? Facing the consequences of bad schema\nin an agile programming environment Auto-reloading troubles to removing\nthe cache layer Migrating from function-based views to class-based views\nA posteriori testing\n\nThe goal of this talk is two-fold: to give a fresh perspective on how\nbuilding a Django application may be like for the complete newbie (those\nnew to programming and to Django), and to help prevent other beginners\nfrom making the same mistakes I made.\n",
  "description": "",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "",
  "thumbnail_url": "https://i.ytimg.com/vi/oXrHHurdyFI/hqdefault.jpg",
  "duration": 2360,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=oXrHHurdyFI",
      "length": 0,
      "type": "youtube"
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=oXrHHurdyFI",
  "tags": [],
  "speakers": [
    "Moon Limb"
  ],
  "recorded": "2013-10-03"
}