{
  "category": "DjangoCon 2013",
  "slug": "how-to-learn-django-the-wrong-way",
  "title": "How to Learn Django the Wrong Way",
  "summary": "How to Learn Django the Wrong Way\nMoon Limb\nWednesday 12:15 p.m.--1 p.m.\n\nAudience level: Novice\n\nDescription\n\nCan you remember your very first Django project and some embarrassing mistakes you made? Come hear about some 'aha' moments of a novice Djangonaut! I'll share valuable lessons I learned by doing things the wrong way. If you are a Django novice, you'll learn some pitfalls to avoid. If you are a seasoned Djangonaut, you can find out challenges that a new Djangonaut, your new hire or mentee may face!\nAbstract\n\nCan you remember your very first Django project and some mistakes you made? Or are you a Django novice embarking on your first application or struggling with one?\n\nCome hear about my experiences as an entry developer @InVitae. In this talk, I'll give a quick overview of my first Django project and give snapshots to explain how it changed over time. There will be code snippets to show some horrible code I initially wrote, consequences of those code, and improvements that were made later. In the process, you'll find out how I learned Django (more accurately, still learning) by doing things the wrong way and how one can learn about good software engineering practices through bad practices.\n\nSome potential topics include:     Where does this function belong-- in models or views or another file?     Facing the consequences of bad schema in an agile programming environment     Auto-reloading troubles to removing the cache layer     Migrating from function-based views to class-based views     A posteriori testing\n\nThe goal of this talk is two-fold: to give a fresh perspective on how building a Django application may be like for the complete newbie (those new to programming and to Django), and to help prevent other beginners from making the same mistakes I made.",
  "description": "",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "",
  "thumbnail_url": "https://i.ytimg.com/vi/oXrHHurdyFI/hqdefault.jpg",
  "duration": 2360,
  "videos": [
    {
      "length": 0,
      "url": "https://www.youtube.com/watch?v=oXrHHurdyFI",
      "type": "youtube"
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=oXrHHurdyFI",
  "tags": [],
  "speakers": [],
  "recorded": "2013-10-03"
}