{
  "alias": "video/3037/brain-waves-for-hackers",
  "category": "EuroPython 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "A new class of cheap consumer EEG devices allows ordinary hackers and\neven high school students a glimpse into the human brain.\n\nThis talk will present how to use the \"Neurosky Mindwave\" headset with\npython software, and lay out the basic scientific and technical\nbackground.\n\nThe Mindwave Mobile is a device that can be easily talked to using\nbluetooth, and it talks a binary protocol which is specifically designed\nto be useful without much computing power in the receiving device or\nadvanced knowledge of signal processing. In fact, an Arduino with a few\nlines of code is perfectly capable of parsing some of the byte stream\nand reacting to the mental state of the user, while fully-featured\npython software can do advanced analysis using PyEEG and Pandas.\n\nThe same hardware module and protocol is used in the Nekomimi headset\n(mind-controlled cat ears for cosplay) and some Boardgames (MindFlex).\n\nA python library for interfacing with the headset is presented and will\nbe demonstrated on stage. Mostly kivy applications will be used.\n\nAlso I will present some data analysis you can perform with pandas and\nscipy.\n\nNeurofeedback is a type of mental exercise where a computer uses the EEG\ndata to direct the user towards certain mental states. In the easiest\nconfiguration a program would display a bar with the \"concentration\"\nlevel, and the user would learn how to tilt this bar upwards. In more\ncomplicated setups a game could react favorably towards states like\nrelaxation or concentration. Using Gamification, Neurofeedback can\nprovide a more engaging experience for children or adults, than other\ntechniques with similar goals, like mindfulness meditation, and the more\nimmediate feedback should enhance the effectiveness of mental training,\nthough that has not been investigated scientifically yet.\n\nNeurofeedback has been shown to be effective (albeit not recommended as\nsole treatment) in Patients with Attention Deficit Hyperactivity\nDisorder (ADHD), Epilepsy and Dementia. Some background about these\nconditions and applications of Neurofeedback to them will be given. The\nfirst use of Neurofeedback was done in Cats, during early experiments\nwith EEG electrodes in the 60ies. Cats where conditioned to exhibit\ncertain wave patterns, and later, due to a coincidence, the researchers\nnoticed that the conditioned cats where more resistant to\nepilepsy-inducing medications. The effect has since been reproduced in\nhumans, in cases where medications did not work sufficiently.\n\nAmple hints on not to treat any of this information as medical advice\nwill be provided.\n\nThe goal of this talk is to promote Neurofeedback as a useful mental\ntraining and to encourage development of applications around\nNeurofeedback and the analysis of EEG data, from the perspective of a\npython hacker.\n\nI gave a similar talk at PyConDe 2013 in Cologne. The new talk will be\nin English, show some improvements on the software, and more advanced\ndemonstrations.\n",
  "duration": null,
  "id": 3037,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-22",
  "slug": "brain-waves-for-hackers",
  "speakers": [
    "Andreas Klostermann"
  ],
  "summary": "Using the Neurosky Mindwave headset we can read brain waves via\nbluetooth. In this talk I will present ways to interface with this\ndevice and to analyze their data, mostly from the perspective of a\nPython hacker, and not so much from the perspective of academic research\nor the development of production-ready software.\n\nI will convey the basic scientific and technical background, keeping in\nmind the non-medical audience, and touch on several practical\napplications, especially Neurofeedback and its use for personal mental\ntraining and potential therapeutic uses.\n\nThe Audience can expect to walk away with a basic knowledge of EEG\nanalysis, Neurofeedback and how to start experimenting with these\ndevices on their own.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/6ewIEOyC5v0/hqdefault.jpg",
  "title": "Brain Waves for Hackers",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6ewIEOyC5v0"
    }
  ]
}
