{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2014", "speakers": ["Tarashish Mishra"], "title": "Building Realtime Web Applications with WebRTC and Python", "quality_notes": "", "video_flv_length": null, "recorded": "2014-07-25", "video_mp4_length": null, "description": "Introduction\r\n===========\r\nThis talk will first introduce the audience to WebRTC and then discuss about how to implement the server side logic of a WebRTC app using Python. \r\n\r\nWebRTC is a free, open project that enables web browsers with plugin-less Real-Time Communications (RTC) capabilities via simple JavaScript APIs. What makes WebRTC special is that the data travels from one client to another without going through the server. \r\n\r\nThe main functions of WebRTC can be broadly categorized into three types. \r\n\r\n- Access and acquire video and audio streams\r\n- Establish a connection between peers and stream audio/video.\r\n- Communicate arbitrary data.\r\n\r\nWebRTC uses three different JavaScript APIs to perform these three functions. These APIs are:\r\n\r\n- MediaStream (aka getUserMedia)\r\n- RTCPeerConnection\r\n- RTCDataChannel\r\n\r\nMediaStream API performs the task of accessing the webcam and/or microphone of the device and acquire the video and/or audio stream from them. RTCPeerConnection API establishes connection between peers and streams audio and video data. This API also does all the encoding and decoding of audio/video data. The third API, RTCDataChannel helps to communicate arbitrary data from one client to the other.\r\n\r\nThere will be short demos to demonstrate the functionalities of these APIs.\r\n\r\nSignaling and Session Control\r\n========================\r\n\r\nWebRTC uses RTCPeerConnection to communicate streaming data between browsers, but some sort of mechanism is needed to coordinate this communication and to send control messages. This process is known as signaling.\r\n\r\nSignaling is used to exchange three types of information.\r\n\r\n- Session control messages: to initialize or close communication and report errors.\r\n- Network configuration: to the outside world, what's my computer's IP address and port?\r\n- Media capabilities: what codecs and resolutions can be handled by my browser and the browser it wants to communicate with?\r\n\r\nThis can be implemented using any appropriate two way communication channel.\r\n\r\nImplementing signaling in Python\r\n==========================\r\n\r\nNext, we will have a look at how to implement this signaling mechanism in Python. ( Demonstration with annotated code and live application.)\r\n\r\n### Google AppEngine and the Channel API ###\r\nGoogle AppEngine has a channel API which offers persistent connections between your application and Google servers, allowing your application to send messages to JavaScript clients in real time without the use of polling. We'll use this Channel API to build the signaling system of our WebRTC app on top of webapp2 and flask framework. \r\n\r\n### Flask and gevent ###\r\nWe'll implement the same signaling system again, this time on top of Flask using gevent for the persistent connection between the browser and our application. \r\n\r\nOutline of the talk\r\n===============\r\n### Intro (5 min) ###\r\n- Who are we?\r\n- What is WebRTC?\r\n- Functions of WebRTC.\r\n\r\n### WebRTC APIs and Demos (3 min) ###\r\n- MediaStream (getUserMedia) API\r\n- RTCPeerConnection API\r\n- RTCDataChannel API\r\n\r\n### Signaling in WebRTC Applications (3 min) ###\r\n- What is signaling?\r\n- Why is it needed?\r\n- How to implement it?\r\n\r\n### Implementation of signaling (16 min) ###\r\n- Implementation using Google AppEngine and Channel API\r\n- Implementation using Flask and gevent\r\n\r\n### Questions (3 min) ###\r\n", "video_mp4_url": "", "tags": [], "copyright_text": "http://creativecommons.org/licenses/by/3.0/", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=uBV_KKGzNqQ", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "WebRTC makes building peer to peer real time web applications easier. First, we'll discuss in short what WebRTC is, how it works. Then we will explore ways to build the signalling system of a WebRTC app using Python.", "thumbnail_url": "http://i.ytimg.com/vi/uBV_KKGzNqQ/hqdefault.jpg", "video_flv_url": ""}