{
  "alias": "video/2950/combining-the-powerful-worlds-of-python-and-r",
  "category": "EuroPython 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "pyRserve is a small open source project originally developed to fulfill\nthe needs of a German biotech company to do statistical analysis in a\nlarge Python-based Lab Information Management System (LIMS). In contrast\nto other R-related libraries like RPy where Python and R run on the same\nhost, pyRserve allows the distribution of complex operations and\ncalculations over multiple R servers across the network.\n\nThe aim of this talk is to show how easily Python can be connected to R,\nand to present a number of selected (simple) code examples which\ndemonstrate the power of this setup.\n",
  "duration": null,
  "id": 2950,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-25",
  "related_urls": [
    "http://www.r-project.org",
    "https://pypi.python.org/pypi/pyRserve/",
    "https://rforge.net/Rserve/"
  ],
  "slug": "combining-the-powerful-worlds-of-python-and-r",
  "speakers": [
    "Ralph Heinkel"
  ],
  "summary": "Although maybe not very well known in the Python community there exists\na powerful statistical open-source ecosystem called R. Mostly used in\nscientific contexts it provides lots of functionality for doing\nstatistical analysis, generation of various kinds of plots and graphs,\nand much, much more.\n\nThe triplet `R <http://www.r-project.org>`__,\n`Rserve <https://rforge.net/Rserve/>`__, and\n`pyRserve <https://pypi.python.org/pypi/pyRserve/>`__ allows the\nbuilding up of a network bridge from Python to R: Now R-functions can be\ncalled from Python as if they were implemented in Python, and even\ncomplete R scripts can be executed through this connection.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ucJ2-5a2CAA/hqdefault.jpg",
  "title": "Combining the powerful worlds of Python and R",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ucJ2-5a2CAA"
    }
  ]
}
