{
  "alias": "video/2979/eve-rest-apis-for-humanstm",
  "category": "EuroPython 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "Nowadays everyone has data stored somewhere and needs to expose it\nthrough a Web API, possibly a RESTful one.\n`Eve <http://python-eve.org>`__ is the BSD-licensed, Flask-powered\nRESTful application and framework that allows to effortlessly build and\ndeploy highly customizable, fully freatured RESTful Web Services. Eve\nfeatures a robust, feature rich, REST-centered API implementation.\nMongoDB support comes out of the box and community-driven efforts to\ndeliver ElasticSearch and SQLAlchemy data layers are ongoing. Eve\napproach is such that you only need to configure your API settings and\nbehaviour, plug in your datasource, and you’re good to go. Features such\nas Pagination, Sorting, Conditional Requests, Concurrency Control,\nValidation, HATEOAS, JSON and XML rendering, Projections, Customisable\nEndpoints, Rate Limiting are all included. Advanced features such as\ncustom Authentication and Authorisation, Custom Validation, Embedded\nResource Serialisation are also easily available. In my talk I will\nintroduce the project and its community, recount why and how it's being\ndeveloped, show the source code, illustrate key concepts and show the\nroad ahead.\n",
  "duration": null,
  "id": 2979,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-24",
  "related_urls": [
    "http://python-eve.org"
  ],
  "slug": "eve-rest-apis-for-humanstm",
  "speakers": [
    "Nicola Iarocci"
  ],
  "summary": "Powered by Flask, Redis, MongoDB and good intentions the `Eve REST API\nframework <http://python-eve.org>`__ allows to effortlessly build and\ndeploy highly customizable, fully featured RESTful Web Services. The\ntalk will introduce the project and its community, recount why and how\nit's being developed, and show the road ahead.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/9sUsLvG72_o/hqdefault.jpg",
  "title": "Eve - REST APIs for Humans™",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9sUsLvG72_o"
    }
  ]
}
