{
  "alias": "video/2944/event-discrete-simulation-with-simpy",
  "category": "EuroPython 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "Simulation is important for the analysis of complex systems or the\nanalysis of the impact of certain actions on that systems. They are\nespecially useful if the actions are potentially harmful or expensive.\n\nSimulation is used in various natural scientific and economic areas,\ne.g., for the modeling and study of biological or physical systems, for\nresource scheduling and optimization or at the research for the\nintegration of renewable energies into the power grid (my personal\nbackground). The simulated time can thereby be seen as continuous or\ndiscrete (discrete time or discrete event).\n\nIn this talk, I want to show why Python is a good choice for\nimplementing simulation models and how SimPy can help here.\n\nStructure of the talk (20min talking + 5min discussion + 5min buffer):\n\n-  Why simulation? (5min)\n-  History of SimPy (3min)\n-  How does SimPy work? (9min)\n-  Conclusion (3min)\n\nIn the introduction, I’ll briefly explain what simulation is and\nmotivate, why it is a useful tool.\n\nThe main part will consist of an introduction and demonstration of\nSimPy. Since SimPy is now more then ten years old, I’ll first give a\nquick overview about its history and development. Afterwards, I’ll\nexplain SimPy’s concepts and features by means of simple examples.\n\nIn the conclusion, I’ll give a short outlook on the future development\nof SimPy.\n\nThe main goal of this talk is to create awareness that simulation is a\npowerful tool in a lot of domains and to give the audience enough\ninformation to ease their first steps.\n",
  "duration": null,
  "id": 2944,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-25",
  "slug": "event-discrete-simulation-with-simpy",
  "speakers": [
    "Stefan"
  ],
  "summary": "Often, experiments with real world systems are high-risk, accompanied by\nhigh costs or not even possible at all. That’s when simulations come\ninto play. This talk will give a brief introduction into the topic of\nsimulation. By means of simple examples, it will demonstrate how you can\nuse SimPy to implement event-discrete simulations and which features\nSimPy offers to help you doing that.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Bk91DoAEcjY/hqdefault.jpg",
  "title": "Event discrete simulation with SimPy",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Bk91DoAEcjY"
    }
  ]
}
