{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2014", "speakers": ["Alexey Malashkevich"], "title": "How Pony ORM translates Python generators to SQL queries", "quality_notes": "", "video_flv_length": null, "recorded": "2014-07-24", "video_mp4_length": null, "description": "[Pony ORM](http://ponyorm.com) is an object-relational mapper implemented in Python. It allows writing advanced queries to a database using plain Python in the form of a generator expression. This way queries look very concise.\r\n\r\nThe main feature of Pony is to provide a method to write declarative queries to databases in pure Python using generators. For this purpose Pony analyzes the abstract syntax tree of a generator and translates it to its SQL equivalent.\r\n\r\nFollowing is a sample of a query in Pony:\r\n\r\n    select(p for p in Product if \"iPad\" in p.name and p.price >= 500)\r\n\r\nThis query translates to SQL using a specific database dialect. Currently Pony works with SQLite, MySQL, PostgreSQL and Oracle databases.\r\n\r\nIn this talk one of Pony ORM authors will go through the process of the query translation and dig into the implementation details.\r\n\r\nAttendees are going to walk away with the understanding of: \r\n\r\n1. Principles of building a programming language translator\r\n2. Python to SQL translator implementation details \r\n3. Approaches for creating a pluggable translator architecture \r\n\r\nThe presentation outline:\r\n\r\n- Why Python generators are good for representing SQL queries\r\n- Main stages of Python to SQL translation overview\r\n- Decompiling Python bytecode into Python AST\r\n- Translating Python AST to database-independent SQL representation\r\n- Generating SQL for specific database\r\n- Pluggable translator architecture\r\n- Performance concerns: is such way of building SQL slower or faster then Django's and SQLAlchemy's?", "video_mp4_url": "", "tags": [], "copyright_text": "http://creativecommons.org/licenses/by/3.0/", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=xjikvIHjvHs", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "Pony ORM is an Object-Relational Mapper implemented in Python. It uses an unusual approach for writing database queries using Python generators. Pony analyzes the abstract syntax tree of a generator and translates it to its SQL equivalent. The translation process consists of several non-trivial stages. In this talk one of Pony ORM authors will reveal the internal details of this process.", "thumbnail_url": "http://i.ytimg.com/vi/xjikvIHjvHs/hqdefault.jpg", "video_flv_url": ""}