{
  "alias": "video/2959/non-sequitur-an-exploration-of-pythons-random-m",
  "category": "EuroPython 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "Audience\n========\n\nNon mathematical people who wants a better understanding of Python's\nrandom module.\n\nObjectives\n==========\n\nThe audience will understand pseudorandom number generators, the\nproperties of Python's Mersenne Twister and the differences and possible\nuse cases between the distributions provided by the ``random`` module.\n\nThe talk\n========\n\nI will start by talking about what randomness means and then about how\nwe try to achieve it in computing through pseudorandom number generators\n(5 min.)\n\nI will give a brief overview of pseudorandom number generation\ntechniques, show how their quality can be assessed and finally talk\nabout Python's Mersenne Twister and why it is a fairly good choice. (10\nmin.)\n\nFinally I will talk about how from randomness we can build generators\nwith interesting probability distributions. I'll compare through\nvisualizations thos provided in Python's ``random`` module and show\nexamples of when they can be useful in real-life. (10 min.)\n",
  "duration": null,
  "id": 2959,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-24",
  "slug": "non-sequitur-an-exploration-of-pythons-random-m",
  "speakers": [
    "Jair Trejo"
  ],
  "summary": "An exploration of Python's random module for the curious programmer,\nthis talk will give a little background in statistics and pseudorandom\nnumber generation, explain the properties of python's choice of\npseudorandom generator and explore through visualizations the different\ndistributions provided by the module.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/cQg4GC-TFG8/hqdefault.jpg",
  "title": "Non Sequitur: An exploration of Python's random module",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cQg4GC-TFG8"
    }
  ]
}
