{
  "alias": "video/2954/pioneering-the-future-of-computing-education",
  "category": "EuroPython 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "I'm Ben, from Raspberry Pi. I do development and outreach for the\nFoundation and I work with the rest of the education team to help make\nlearning through computer science, coding and hardware hacking more\naccessible to all.\n\nIn this talk I explain the Raspberry Pi story: its mission - the reason\nthe Pi exists; what happened before release - getting the board in to\nproduction; what happened in the first two years - the community birth\nand growth; and what's coming next - education focus, new hardware and\nimproved software.\n\nPython is the main language used (and advocated by us) in education with\nRaspberry Pi.\n\nWe're creating learning resources to match up with the new UK computing\ncurriculum, where we teach young people programming and computer science\nconcepts with Python on Pi, and help teachers deliver quality material\nin the classroom to work towards the objectives the curriculum sets out\nto achieve.\n\nWith Raspberry Pi we open up possibilities for connecting to the real\nworld in an accessible way using the powerful, high level and human\nread/write -able language of Python.\n\nWe work closely with the community: hobbyists organising Raspberry Jam\nevents; educators teaching with Raspberry Pi; the software communities\nand their contributions - and we welcome any interested parties to get\ninvolved with helping us provide for the wider community.\n",
  "duration": null,
  "id": 2954,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-24",
  "slug": "pioneering-the-future-of-computing-education",
  "speakers": [
    "Ben Nuttall"
  ],
  "summary": "How the Raspberry Pi Foundation are leading the way in the computing in\nschools revolution by providing affordable open and connectable hardware\nto people of all levels of experience.\n\nNow we have an education team, we're pushing forward with creating\nresources and training teachers to help deliver modern computing\neducation around the world.\n\nAll our learning resources are Creative Commons licensed and available\non GitHub. We write materials that match the UK computing curriculum.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/24eDPoJvmnI/hqdefault.jpg",
  "title": "Pioneering the Future of Computing Education",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=24eDPoJvmnI"
    }
  ]
}
