{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2014", "speakers": ["Ben Nuttall"], "title": "Pioneering the Future of Computing Education", "quality_notes": "", "video_flv_length": null, "recorded": "2014-07-24", "video_mp4_length": null, "description": "I'm Ben, from Raspberry Pi. I do development and outreach for the Foundation and I work with the rest of the education team to help make learning through computer science, coding and hardware hacking more accessible to all.\r\n\r\nIn this talk I explain the Raspberry Pi story: its mission - the reason the Pi exists; what happened before release - getting the board in to production; what happened in the first two years - the community birth and growth; and what's coming next - education focus, new hardware and improved software.\r\n\r\nPython is the main language used (and advocated by us) in education with Raspberry Pi.\r\n\r\nWe're creating learning resources to match up with the new UK computing curriculum, where we teach young people programming and computer science concepts with Python on Pi, and help teachers deliver quality material in the classroom to work towards the objectives the curriculum sets out to achieve.\r\n\r\nWith Raspberry Pi we open up possibilities for connecting to the real world in an accessible way using the powerful, high level and human read/write -able language of Python.\r\n\r\nWe work closely with the community: hobbyists organising Raspberry Jam events; educators teaching with Raspberry Pi; the software communities and their contributions - and we welcome any interested parties to get involved with helping us provide for the wider community.", "video_mp4_url": "", "tags": [], "copyright_text": "http://creativecommons.org/licenses/by/3.0/", "related_urls": [{"url": "https://github.com/raspberrypilearning", "description": "Learning Resources and Projects provided by the Raspberry Pi Foundation Education Team"}], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=24eDPoJvmnI", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "How the Raspberry Pi Foundation are leading the way in the computing in schools revolution by providing affordable open and connectable hardware to people of all levels of experience.\r\n\r\nNow we have an education team, we're pushing forward with creating resources and training teachers to help deliver modern computing education around the world.\r\n\r\nAll our learning resources are Creative Commons licensed and available on GitHub. We write materials that match the UK computing curriculum.", "thumbnail_url": "http://i.ytimg.com/vi/24eDPoJvmnI/hqdefault.jpg", "video_flv_url": ""}