{
  "alias": "video/2989/python-refactoring-with-rope-and-traad",
  "category": "EuroPython 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "Python is a modern, dynamic language which is growing in popularity, but\ntool support for it is sometime lacking or only available in specific\nenvironments. For refactoring and other common IDE functions, however,\nthe powerful open-source rope library provides a set of tools which are\ndesigned to be integrated into almost any programming environment. Rope\nsupports most common refactorings, such as renaming and method\nextraction, but also more Python-specific refactorings, such as import\norganization. Rope’s underlying code analysis engine also allows it to\ndo things like locating method definitions and generating\nauto-completion suggestions.\n\nWhile rope is designed to be used from many environments, it’s not\nalways easy or ideal to integrate rope directly into other programs.\nTraad (Norwegian for “thread”) is another open-source project that\naddresses this problem by wrapping rope into a simple client-server\nmodel so that client programs (IDEs, editors, etc.) can perform\nrefactorings without needing to embed rope directly. This simplifies\ndependencies, makes clients more robust in the face of errors, eases\ntraad client development, and even allows clients to do things like\nswitch between Python 2 and 3 refactoring in the same session.\n\nIn this session we’ll look at how rope operates, and we’ll see how traad\nwraps it to provide an easier integration interface. The audience will\nget enough information to start using rope themselves, either directly\nor via traad, and they’ll see how to use traad for integrating rope into\ntheir own environments. More generally, we’ll look at why client-server\nrefactoring tools might be preferable to the more standard approach of\ndirect embedding.\n",
  "duration": null,
  "id": 2989,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-23",
  "slug": "python-refactoring-with-rope-and-traad",
  "speakers": [
    "Austin Bingham"
  ],
  "summary": "Rope is a powerful Python refactoring library. Traad (Norwegian for\n\"thread\") is a tool which makes it simpler to integrate rope into IDEs\nvia a simple HTTP API. In this session we'll look at how traad and rope\nwork together and how traad integrates with at least one popular editor.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/NvV5OrVk24c/hqdefault.jpg",
  "title": "Python refactoring with Rope and Traad",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NvV5OrVk24c"
    }
  ]
}
