{
  "alias": "video/3004/scaling-with-ansible",
  "category": "EuroPython 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "Infrastructure/Scaling is a topic really close to me, I'd like to have\nthe chance to talk about how we set this up in the company I work for.\nOur infrastructure is around 10-15 servers, provisioned on different\ncloud providers, so a good size infrastructure.\n\nPresentation is going to be divided in 3 parts, first part is going to\nbe focused on comparing sysadmin and devops, then there will be an\nintroduction to the basic concepts of Ansible. I want to spend most on\nthe last part, which is going to give some tips based on our experience\nwith it.\n\nMany ideas will come from this presentation\nhttps://speakerdeck.com/fmarani/devops-with-ansible which i gave at\nDJUGL in London, with a longer session I will have more chances to delve\ninto more detail, especially on how we use it, from vagrant boxes setup\nto AWS and DigitalOcean boxes, network configuration, software\nconfigurations, etc...\n\nI want to offer as many real-life tips as possible, without going too\nmuch offtopic as far as Ansible is concerned\n",
  "duration": null,
  "id": 3004,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-23",
  "related_urls": [
    "https://speakerdeck.com/fmarani/devops-with-ansible"
  ],
  "slug": "scaling-with-ansible",
  "speakers": [
    "Federico Marani"
  ],
  "summary": "Ansible is a powerful DevOps swiss-army knife tool, very easy to\nconfigure and with many extensions built-in. This talk will quickly\nintroduce the basics of Ansible, then some real-life experience tips on\nhow to use this tool, from setting up dev VMs to multi-server setups.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ptc9E24YAcc/hqdefault.jpg",
  "title": "Scaling with Ansible",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ptc9E24YAcc"
    }
  ]
}
