{
  "alias": "video/2995/supercharge-your-development-environment-using-do",
  "category": "EuroPython 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "In this talk I am going to show how to utilize light weight lxc\ncontainers using docker, and make your development process much more\nstraightforward. How to share container images among your development\nteam and be sure that everyone is running the exact same stack. Do all\nthis without hogging too many resources, without the need for complex\nprovisioning scripts and management systems. And above all else, how to\ndo it fast!\n\nRough Guidelines:\n\n1. Describe what is LXC (Linux containers)\n2. Benefits of using containers instead of traditional VM's\n3. Explain where Docker comes in\n4. Show how to build simple containers using Dockefile syntax\n5. What are container images and how to share them\n6. How to share private container images\n7. Tips and tricks on how to automate\n\n",
  "duration": null,
  "id": 2995,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-23",
  "slug": "supercharge-your-development-environment-using-do",
  "speakers": [
    "Deni Bertovic"
  ],
  "summary": "These days applications are getting more and more complex. It's becoming\nquite difficult to keep track of all the different components an\napplication needs to function (a database, an AMQP, a web server, a\ndocument store...). It keeps getting harder and harder to setup new\ndevelopment environments and to bring new developers into the team.\nStuff works on one dev machine but doesn't on others? Code breaks often\nwhen deployed to production even though all tests were passing and it\nworked on the dev machine?\n\nThe idea of this talk is to convey how important it is that we have our\ndevelopment environment as close to production as possible. That means\nsetting up all those various services on your laptop/workstation.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/-l9xH1X_rvg/hqdefault.jpg",
  "title": "Supercharge your development environment using Docker",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-l9xH1X_rvg"
    }
  ]
}
