{
  "alias": "video/2978/the-shogun-machine-learning-toolbox",
  "category": "EuroPython 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "We present the Shogun Machine Learning Toolbox, a unified framework for\nMachine Learning algorithms. Machine Learning (ML) is the art of finding\nstructure in data in an automated way and has given rise to a wide range\nof applications such as recommendation systems, object recognition,\nbrain-computer interfaces, robotics, predicting stock prices, etc.\n\nOur toolbox offers extensive bindings with other software and computing\nlanguages, Python being the major target. The library was initiated in\n1999 and remained under heavy development henceforth. In addition to its\nmature core-framework, Shogun offers state-of-the-art techniques based\non latest ML research. This is partly made possible by the 21 Google\nSummer of Code projects (5+8+8 since 2011) that our students\nsuccessfully completed. Shogun's codebase has >20k commits made by >100\ncontributors representing >500k lines of code. While its core is written\nin C++, a unique of technique for generating interfaces allows usage\nfrom a wide range of target languages -- under the same syntax. This\nincludes in particular Python, but also Matlab/Octave, Java, C#, R,\nruby, and more. We believe that users should be able to choose their\nfavourite language rather than us dictating this choice. The same\napplies for supported OS (Linux, Mac, Win). Shogun is part of Debian\nLinux.\n\nFeatures of Shogun include most classical ML methods such as\nclassification, regression, dimensionality reduction, clustering, etc,\nmost of them in different flavours. All implemented algorithms in Shogun\nwork on a modular data representation, which allows to easily switch\nbetween different sorts of objects as for example strings or matrices.\nCommon ML-tasks and data IO can be carried under a unified interface.\nThis is also true for the various external open-source libraries that\nare embedded within Shogun.\n\nCode examples are provided for all implemented algorithms. The main and\nmost complete set of examples is in the Python language. In addition, in\norder to push usage of Shogun in education at universities, we recently\nstarted adding more illustrative IPython notebooks. A growing list of\nstatically rendered versions are readily available from our\n`website <http://www.shogun-toolbox.org/page/documentation/notebook>`__\nand implement a cross-over of tutorial-style explanations, code, and\nvisualization examples. We even took this up a notch and started\nbuilding our own IPython-notebook server with Shogun installed in the\ncloud at (try cloud button in notebook view) . This allows users to try\nShogun without installation via the IPython notebook web interface. All\nexample notebooks can be loaded, interactively modified, and executed.\nIn addition, using the Python Django framework, we built a collection of\ninteractive web-demos where users can play around with basic ML\nalgorithms,\n`demos <http://www.shogun-toolbox.org/page/documentation/demo>`__\n\nIn the proposed talk, we will give a gentle and general introduction to\nML and the core functionality of Shogun, with a focus on its Python\ninterface. This includes solving basic ML tasks such as classification\nand regression and some of the more recent features, such as last year's\nGSoC projects and their IPython notebook writeups. ML material will be\npresented with a focus on intuition and visualisation and no previous\nfamiliarity with ML methods is required.\n\nKey points in the talk\n----------------------\n\n-  What are the goals in ML?\n-  Example problems in ML (classification, regression, clustering)\n-  Some basic algorithm ideas\n-  Focus on Visualisation, not Maths\n\nIntended Audience\n-----------------\n\n-  All people dealing with data (data scientists, big-data hackers) who\n   are looking for tools to deal with it\n-  People with a general interest but no education in Machine Learning\n-  People interested in the technology behind Shogun (swig, cloud\n   notebook server, web-demos)\n-  People from the ML community (scipy-stack)\n-  ML scientists/Statisticians\n\nCode examples\n-------------\n\n-  `Classification <https://github.com/shogun-toolbox/shogun/blob/develop/examples/undocumented/python_modular/classifier_libsvm_modular.py>`__\n-  `Clustering <https://github.com/shogun-toolbox/shogun/blob/develop/examples/undocumented/python_modular/graphical/em_2d_gmm.py>`__\n-  `Source\n   seperation <https://github.com/shogun-toolbox/shogun/blob/develop/examples/undocumented/python_modular/graphical/converter_jade_bss.py>`__\n-  `IPython notebook\n   examples <http://www.shogun-toolbox.org/page/documentation/notebook>`__\n\nSlide examples\n~~~~~~~~~~~~~~\n\nSee our Europython 2010\n`slides <https://www.dropbox.com/sh/jvl4ra885usu4ii/WIoJccXA5r/talk.pdf>`__.\nAlthough we aim for more pictures and less formulas this year.\n",
  "duration": null,
  "id": 2978,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-24",
  "related_urls": [
    "http://www.shogun-toolbox.org/page/documentation/demo",
    "http://www.shogun-toolbox.org/page/documentation/notebook",
    "https://github.com/shogun-toolbox/shogun/blob/develop/examples/undocumented/python_modular/classifier_libsvm_modular.py",
    "https://github.com/shogun-toolbox/shogun/blob/develop/examples/undocumented/python_modular/graphical/converter_jade_bss.py",
    "https://github.com/shogun-toolbox/shogun/blob/develop/examples/undocumented/python_modular/graphical/em_2d_gmm.py",
    "https://www.dropbox.com/sh/jvl4ra885usu4ii/WIoJccXA5r/talk.pdf"
  ],
  "slug": "the-shogun-machine-learning-toolbox",
  "speakers": [
    "Heiko Strathmann"
  ],
  "summary": "We present the Shogun Machine Learning Toolbox, a framework for Machine\nLearning, which is the art of finding structure in data, with\napplications in object recognition, brain-computer interfaces, robotics,\nstock-prices prediction, etc. We give a gentle introduction to ML and\nShogun's Python interface, focussing on intuition and visualisation.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/5Zuq0sLFkBY/hqdefault.jpg",
  "title": "The Shogun Machine Learning Toolbox",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5Zuq0sLFkBY"
    }
  ]
}
