{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2014", "speakers": ["Stefan Behnel"], "title": "The Cython Compiler for Python", "quality_notes": "", "video_flv_length": null, "recorded": "2014-07-22", "video_mp4_length": null, "description": "The Cython compiler is the most widely used static compiler for Python. The code it generates is used in countless critical applications that process huge amounts of data world wide. Cython has two major use cases: to compile Python code into fast native extension modules, and to connect native code to the CPython runtime. The main goal of the Cython project is to make it easy for users to manually optimise their Python code to make it run at C speed. This talk by one of the core developers will give an intro to using the compiler and an overview of its major features.\r\n\r\nOutline will be more or less as follows:\r\n\r\n*   Cython: intro to the project and the compiler (4 min.)\r\n*   compiling Python code\r\n    -   how to do it and what you get (3 min.)\r\n    -   a tiny bit of distutils (2 min.)\r\n*   static typing and Cython extensions to the Python language\r\n    -   static typing in Cython language syntax (3 min.)\r\n    -   static typing in pure Python syntax (2 min.)\r\n    -   why Cython's type system is cool and what users need to know about it (8 min.)\r\n    -   Cython for optimising Python code (5 min.)\r\n*   quick intro: talking to native C/C++ code in Cython\r\n    -   using external C APIs (4 min.)\r\n    -   using external C++ APIs (3 min.)\r\n    -   how to build and link in distutils (2 min.)\r\n    -   notes on ways to wrap large C-APIs (1 min.)\r\n*   quick overview: special features for high-performance code\r\n    -   NumPy integration and memory views, fused types, parallel loops in all brevity (3 min.)\r\n", "video_mp4_url": "", "tags": [], "copyright_text": "http://creativecommons.org/licenses/by/3.0/", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=ZHpkLX2VFMU", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "The Cython compiler is the most widely used static compiler for Python. It is used to speed up Python code and to extend CPython with fast native extension modules that process huge amounts of data all around the world. This talk by one of the core developers gives an intro to using the compiler and an overview of its major features.", "thumbnail_url": "http://i.ytimg.com/vi/ZHpkLX2VFMU/hqdefault.jpg", "video_flv_url": ""}