{
  "alias": "video/3035/the-sorry-state-of-ssl-0",
  "category": "EuroPython 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "The rule of thumb for people without degrees in cryptography on securing\ndata on the Internet is “GPG for data at rest. TLS for data in motion”.\nAnd it’s actually a very good rule everyone should follow.\n\nThe only kicker though is that configuring (and using!) TLS properly is\nnot as simple as it sounds and if you’re not diligent as a user,\ndeveloper, and ops engineer, you can easily compromise your data’s\nsecurity despite best effort of everyone else.\n\nThis talk will be multifaceted; you will learn:\n\n-  how SSL and TLS roughly work and why their state is sorry,\n-  server- and client-side duties for best possible security,\n-  what alternatives you have for using TLS in Python,\n-  things to keep in mind when configuring servers,\n-  and what perils outside your control still can trip you up.\n\nIn other words, the leitmotif is to show you the most common traps you\nshould know about when using and deploying applications relying on TLS\nfor transport layer security and how to avoid them.\n",
  "duration": null,
  "id": 3035,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-22",
  "slug": "the-sorry-state-of-ssl-0",
  "speakers": [
    "Hynek Schlawack"
  ],
  "summary": "Those web pages with shiny lock icons boasting that your data is safe\nbecause of \"256 bit encryption\"? They are lying. In times of mass\nsurveillance and commercialized Internet crime you should know why\nthat's the case. This talk will give you an overview that will help you\nto assess your personal security more realistically and to make your\napplications as secure as possible against all odds.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/PJ5vUz9FJcw/hqdefault.jpg",
  "title": "The Sorry State of SSL",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PJ5vUz9FJcw"
    }
  ]
}
