{
  "alias": "video/2973/the-return-of-the-return-of-peer-to-peer-computi",
  "category": "EuroPython 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "This talk introduces, describes and demonstrates concepts and code\ncreated during sprints and via online collaboration by a distributed\ngroup of Pythonistas under the working title p4p2p (http://p4p2p.net).\n\nWe asked ourselves, as frameworks such as Zope/Plone, Django, Pyramid or\nFlask are to web development what would the equivalent sort of framework\nlook like for peer-to-peer application development?\n\nWe've tackled several different technical issues: remote execution of\ncode among peers, distributed hash tables as a mechanism for peer\ndiscovery and data storage, various cryptographic requirements and the\nnuts and bolts of punching holes in firewalls.\n\nWork is ongoing (we have another sprint at the end of March) and the\nfinal content of the talk will depend on progress made. However, we\nexpect to touch upon the following (subject to the caveat above):\n\n-  What is the problem we're trying to solve?\n-  Why P2P?\n-  The story of how we ended up asking the questions outlined in the\n   abstract.\n-  What we've done to address these questions.\n-  An exploration of the sorts of application that could be built using\n   P2P.\n-  A call for helpers and collaboration.\n\nHappy to answer any questions!\n",
  "duration": null,
  "id": 2973,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-24",
  "related_urls": [
    "http://p4p2p.net)."
  ],
  "slug": "the-return-of-the-return-of-peer-to-peer-computi",
  "speakers": [
    "Nicholas Tollervey"
  ],
  "summary": "At last year's Europython Holger Krekel gave a keynote called \"The\nReturn of Peer to Peer Computing\". He described how developers, in light\nof the Snowden surveillance revelations, ought to learn about and build\ndecentralized peer-to-peer systems with strong cryptography. This talk\nintroduces, describes and demonstrates ideas, concepts and code that a\ngroup of Pythonistas have been working on since Holger's keynote.\n\nWe asked ourselves two questions: what are the fundamental elements /\nabstractions of a peer-to-peer application and, given a reasonable\nanswer to the first question, what can we build? We will present work\ndone so far, discuss the sorts of application that might be written and\nexplore how peer-to-peer technology could be both attractive and viable\nfrom an economic point of view.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/xxSKmecZ09E/hqdefault.jpg",
  "title": "The Return of \"The Return of Peer to Peer Computing\".",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xxSKmecZ09E"
    }
  ]
}
