{
  "alias": "video/2945/twisted-names-dns-building-blocks-for-python-pro",
  "category": "EuroPython 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "Description\n===========\n\nMy talk will consist of four main sections. Given the 30 minute time\nconstraint, I may shorten or drop the two introductory parts in favour\nof the narrative and demonstration of interesting new APIs and code\nexamples in the final two parts. My experience of delivering a similar\ntalk at PyconUK 2013 is that those are the parts that will most interest\nthe audience and prompt most audience questions.\n\nHere are my proposed sections with rough time allocations and\ndescriptions:\n\nIntroducing Twisted Names (0-5)\n-------------------------------\n\nTwisted includes a comprehensive set of DNS components, collectively\nknown as Twisted Names.\n\n-  https://twistedmatrix.com/trac/wiki/TwistedNames\n\nI will begin the talk with a quick introduction to Twisted Names and its\ncapabilities, including one or two simple code examples.\n\nIntroducing My Project (0-5)\n----------------------------\n\nWith generous funding from The NLnet Foundation I am adding EDNS(0) and\nDNSSEC client support in Twisted Names, including full DNSSEC\nverification and DANE support.\n\nIn the talk I will quickly summarise the steps taken and lessons learned\nin securing that funding, and hope to encourage the audience to seek\nfunding to support there own pet OSS projects.\n\nWhat's New in Twisted Names / Project Progress Report (10)\n----------------------------------------------------------\n\nMy project plan is divided into the following broad milestones.\n\n1. EDNS(0)\n\n   1. OPT record\n\n   2. Extended Message object with additional EDNS(0) items\n\n   3. EDNS Client\n\n2. RRSET handling\n\n   1. Canonical Form and Order of Resource Records\n\n   2. Receiving RRSETs\n\n3. DNSSEC\n\n   1. New DNSSEC Records and Lookup Methods\n\n   2. Security-aware Non-validating Client\n\n   3. Validating Client\n\n4. DANE\n\n   1. A twistd dns authoritative server capable of loading and serving\n      TLSA records.\n\n   2. A Twisted web client Agent wrapper which performs TLSA lookup and\n      verification of a server certificate.\n\n   3. A HostnameClientEndpoint which performs TLSA lookup and\n      verification of a server certificate.\n\n   4. A command line tool for debugging TLSA records and for verifying a\n      certificate file against a domain name.\n\n   5. A TLSA Record class for encoding and decoding TLSA bytes.\n\n   6. A TLSA lookup method which accepts port, protocol and hostname and\n      constructs a suitable TLSA domain name.\n\nIn the talk I will quickly outline these goals, report on my progress so\nfar, and show running code examples to demonstrate the new APIs.\n\nFuture Developments (5)\n-----------------------\n\nThe aim of my project is to lay foundations that will eventually allow\nend-to-end DNSSEC verification in all the core Twisted networking\ncomponents, including Twisted Conch (SSH), Mail (SMTP, POP3),\nPerspective Broker (RPC), Web (HTTP, XML-RPC, SOAP), Words (XMPP, IRC).\n\nAdditionally I hope that this foundation work will encourage the\ndevelopment of end-to-end DNSSEC verification in many of the Open Source\nand commercial projects built on top of Twisted.\n\nI will end the talk by outlining these exciting possibilities, and\ndemonstrate some code examples that illustrate these possibilities.\n\nQ & A (5-10)\n------------\n\nI'm determined to leave at least five minutes at the end for audience\nquestions. At PyconUK 2013 I was frustrated because I ran out of time\nand ended up answering questions outside the lecture theatre; questions\nwhich would have been interesting to the whole audience.\n",
  "duration": null,
  "id": 2945,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-25",
  "related_urls": [
    "https://twistedmatrix.com/trac/wiki/TwistedNames"
  ],
  "slug": "twisted-names-dns-building-blocks-for-python-pro",
  "speakers": [
    "Richard Wall"
  ],
  "summary": "In this talk I will report on my efforts to update the DNS components of\nTwisted and discuss some of the things I've learned along the way. I'll\ndemonstrate the EDNS0, DNSSEC and DANE client support which I have been\nworking on and show how these new Twisted Names components can be glued\ntogether to build novel DNS servers and clients.\n\nTwisted is an event-driven networking engine written in Python and\nlicensed under the open source MIT license. It is a platform for\ndeveloping internet applications.\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/kuSXK4gNYqw/hqdefault.jpg",
  "title": "Twisted Names: DNS Building Blocks for Python Programmers",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kuSXK4gNYqw"
    }
  ]
}
