{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "A backbone of traditional epidemiology is the Susceptible-Infected-Recovered\n(SIR) model for infectious disease spread. SIR models allow for the\nmathematical depiction and interpretation of infection dynamics with three\ngeneral parameters of susceptible, infected, and recovered individuals for a\ngiven disease system. While SIR models are a unique and commonly used type\nof infectious disease modeling, uncertainty is almost always present in\ndetermining optimal control of pandemics. At the initial outbreak of a\ndisease, disease rates--including transmission rate, recovery rate, death\nrate, and host arrival rate--are often unknown, making it difficult for\nresearchers to understand the ideal end results. Consequently, then public\nhealth and medical officials are unable to make informed decisions on\ntreatment options and safety measures to put in place to ensure the health\nof the affected populations. There has been a push to predict ideal disease\nrates associated with a specific system, allowing researchers to devise\nproper public health protocols to achieve these rates and the highest\namounts of recovered individuals for an outbreak. With a clear indication of\nhow a disease is transmitted, how individuals in a population interact, and\nhow hosts recover/suffer from infection and proper modeling, interventions\ncan combat disease outbreaks, epidemics, and pandemics. As it is difficult\nto create SIR models with optimal disease transmission, recovery, death, and\nhost arrival rates, PandemicPriority is a generalized tool which\ncomputationally determines optimal values for each of these rates through\nrandomized search for the future development of infectious disease\ntreatments and interventions.\n\nThis talk will outline my journey as a student in Biology and Computer\nScience while I was struggling to combine my passions in both fields. How is\nit that Python can connect to traditional disease modeling? PandemicPriority\ngave me the opportunity to understand the complexities of Python programming\nfor optimizing disease models, paving the way towards my interest in\ncomputational epidemiology.",
  "duration": 600,
  "language": "eng",
  "recorded": "2021-10-01",
  "related_urls": [
    "https://2021.pygotham.tv/talks/prioritizing-pandemic-rates-with-python-connecting-generalized-disease-modeling-to-optimization-in-a-pandemic-world/"
  ],
  "speakers": [
    "Madelyn Kapfhammer"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/SzgrpIQsCIY/maxresdefault.jpg",
  "title": "Prioritizing Pandemic Rates with Python: Connecting generalized disease modeling to optimization in a pandemic world",
  "videos": [
    {
      "type": "youtube",
      "url": "https://youtu.be/SzgrpIQsCIY"
    }
  ]
}
