{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Unlike types of data that are more commonly dealt with in the industry these\ndays, such as numerical data, text or image data, audio signals need a\ndifferent approach while trying to extract information and building machine\nlearning models. This talk will highlight the challenges with Audio\nClassification problems starting with what an audio signal is and what its\nnumerical representation means, how it is widely different from other data\ntypes, what feature extraction from audio looks like, how to go about it,\nwhat it means and the open-source tools in Python that can be leveraged for\nthe same. Digital signal processing, that includes audio processing, is a\nwhole separate field to study and leveraging portions of learning from that\nin order to build successful models on audio data is an interesting and\nchallenging problem. In addition, Matlab is a popular language of choice\nwith great tools for audio signal processing. Python being a popular\nlanguage of choice for Machine Learning presents another set of challenges\nto build successful audio and speech classification solutions in Python\nalone. Focus will then upon how to build classification models from the\nfeatures representing the unseen information from audio and speech signals\nand doing it all leveraging different open-source tools available to Python\nusers. This will be followed by a few examples of different audio\nclassification and prediction problem statements, such as audio type\nclassification, music genre classification and spoke location name\nclassification, and a solution for attempting to solve them using Python\nusing the different features formation techniques and tools discussed\nearlier in the talk.",
  "duration": 1500,
  "language": "eng",
  "recorded": "2021-10-02",
  "related_urls": [
    "https://2021.pygotham.tv/talks/pyaudioprocessing-building-audio-classification-models-in-python/"
  ],
  "speakers": [
    "Jyotika Singh"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/M4KWTLwEt0o/maxresdefault.jpg",
  "title": "pyAudioProcessing: Building audio classification models in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://youtu.be/M4KWTLwEt0o"
    }
  ]
}
