{
  "description": "Daniel Stevens\nhttp://lanyrd.com/2016/writethedocs/sfbzwb/\nCome with me on a journey and learn how Atlassian went from the traditional &quot;Technical Writing&quot; team, to the Information Experience team. What began as a simple challenge to the Atlassian Technical Writing team, to make quality and success measurable and repeatable, grew into a journey to create a &quot;cradle to grave&quot; Information Experience. And we&#39;re just getting started. During the last two Write the Docs I&#39;ve given a lightning talk, Write Measure Repeat, which covers one very small part of the change we&#39;ve undergone. This year I&#39;d like to tell the rest of a story, which is some of the most exciting work I&#39;ve done in my career. I&#39;ll talk about the process of creating and growing a writing culture which is technically accurate, writes with a human voice, and connects to every other part of the information experience. While talking everyone through the journey I&#39;ll be sure to cover specific examples of using content strategy, user research, data analytics and a touch of team process. All this with a bit of humor and a passion which is obvious to anyone who&#39;s ever met me.\nMain points I&#39;ll touch on:\nHow we worked through resistance to change.\nWhat Information Experience means to us and why it&#39;s not just a fancy title.\nMoving from the Quality Assistance team to the Design team win&#39;s, frustrations, hopes.\nBuilding a better site with Confluence and considering/using other tools. Light on the tools part here, just covering the visual change and referencing how we did the actual tooling changes.\nWhat this means to me and what I hope we&#39;re beginning to see in the tech comm world.",
  "language": "eng",
  "recorded": "2016-05-22",
  "speakers": [
    "Daniel Stevens"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/kMSGYbWXxgE/hqdefault.jpg",
  "title": "Atlassian: My Information Experience Adventure",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kMSGYbWXxgE"
    }
  ]
}
