{
  "description": "Betsy Roseberg\nhttp://lanyrd.com/2016/writethedocs/sfbztq/\nAs a tech writer, you care about two things: knowing your audience and delivering the most concise information possible to that audience. But how do you do that when your audience is incredibly specialized? What if the information you’re presenting is rapidly changing? How can you be certain that your documentation is always relevant for that audience?\nTo answer all those questions, at New Relic we use CSAT (Customer Satisfaction) data. Our Docs team monitors CSAT comments and data for every single public-facing doc we own. We use that data to make dynamic decisions that affect our site and our docs work, influencing everything from quick doc fixes, giant rewrites, and our own site’s functionality.\nEvery pertinent comment receives attention from at least one tech writer. Part of our code example is out of date? Fixed. There’s a glitch on our site? We’ll look into it. We list a version of Mongo that’s outdated? Updated. By focusing on these comments, your audience is working with you to keep your documentation updated.\nWhat happens when a customer doesn’t leave a comment, and just says the document wasn’t helpful? We track that too. When docs have consistently negative feedback without constructive comments, we know that at least something in that doc needs work. When that happens, we work with SMEs to rewrite those docs and give them a little love. We polish ‘em up and publish them again, tracking their data afterwards to make sure that they’re indeed improved.\nAnd this doesn’t just benefit the Docs team. We’ve forwarded UI complaints to design, and disgruntled customer comments to Support. That’s part of the beauty of CSAT: it’s a direct line to all the customers looking for help with our products. With CSAT, our audience is helping us to curate the best possible information for all their needs.\nBut we’re not stopping there. Soon, we’ll be implementing OAuth for our CSAT data. Once that’s enabled, we’ll be able to see what specific products customers are using, what region they’re in, what type of user permissions they have, and a ton of other stuff. We’ll be positively swimming in audience connectedness from our CSAT, and with it, we’ll know that our audience is understanding our concise information in the best way possible.",
  "recorded": "2016-05-22",
  "speakers": [
    "Betsy Roseberg"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Nmx9_GZNZF8/hqdefault.jpg",
  "title": "CSAT - What’s That?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Nmx9_GZNZF8"
    }
  ]
}
