{
  "description": "You have just received great news. You are about to join a new exciting project. The client wants you to deliver a maintainable, reproducible and production-ready data science pipeline.\n\nHow do you best start? Because… It takes really long to put code in production and we have to rewrite and restructure large parts of it… I have to think about Sphinx, black, Cookiecutter Data Science, Docker, Python Logging, virtual environments, Pytest, and more… People on my team all have different levels of exposure to software engineering best-practice.\n\nIn this talk we demonstrate how we benefit from Kedro to tackle these hurdles of creating machine learning products. Kedro is an open-source Python framework for creating reproducible, maintainable and modular data science code – code that easily transitions into production. We will focus on the Kedro project structure, the decoupling between the data and code layers, nodes, pipelines, and the built-in visualizations.\n\nWe end the talk with sharing a recent project where we leveraged Kedro. Together with a Dutch horticulture company, we helped them optimize the energy cost mix in their greenhouses. We built and easily put into production an end-to-end Kedro optimization pipeline that demonstrates promising results of 10-15% energy cost reduction.\n\nThis presentation is aimed at data scientists, data engineers and machine-learning engineers alike that need to develop and deploy production-level data pipelines. No prior knowledge is required.",
  "duration": 1953,
  "language": "eng",
  "recorded": "2023-11-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20240930133013/http://pydata.org/eindhoven2023"
    }
  ],
  "speakers": [
    "Ionut Barbu",
    "Tim Brakenhoff"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/but_AZV0rhA/maxresdefault.jpg",
  "title": "How to build production-ready data science pipelines with Kedro",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=but_AZV0rhA"
    }
  ]
}
