{
  "copyright_text": "Standard YouTube License",
  "description": "Abstract\n--------\nPython's dictionaries are stunningly good. Over the years, many great ideas have combined together to produce the modern implementation in Python 3.6. This fun talk is given by Raymond Hettinger, the Python core developer responsible for the set implementation and who designed the compact-and-ordered dict implemented in CPython for Python 3.6 and in PyPy for Python 2.7. He will use pictures and little bits of pure python code to explain all of the key ideas and how they evolved over time. He will also include newer features such as key-sharing, compaction, and versioning. This talk is important because it is the only public discussion of the state of the art as of Python 3.6. Even experienced Python users are unlikely to know the most recent innovations.\nWho and Why (Audience)\n----------------------\nThis talk is for all Python programmers. It is designed to be fully understandable for a beginner (it starts from first principles) but to have new information even for Python experts (how key-sharing works, how the compact-ordered patch works, how dict versioning works). At the end of this talk, you can confidently say that you know how modern Python dictionaries work and what it means for your code.\n\nBio\n---\n\nRaymond Hettinger has also served as a director of the Python Software Foundation, and has mentored many people over the years on their contributions to the python-dev community. He is also well known for his contributions to the Python Cookbook, and shares many pieces of Python wisdom on Twitter. He is a frequent keynote speaker at Python Conferences around the world and has received the Distinguished Service Award at PyCon 2014 for his exceptional contributions to the python community.\n\nOther info\n----------\n\nThis talk is delivered at SF Python's 2nd Annual Holiday Party for Python Devs in SF Bay Area, CA. In you are in San Francisco area looking to meet other python devs, please check our schedule for meetups on http://sfpython.org",
  "duration": 4060,
  "language": "eng",
  "recorded": "2016-12-08",
  "related_urls": [
    "https://dl.dropboxusercontent.com/u/3967849/sfmu2/_build/html/index.html﻿"
  ],
  "slug": "modern-dictionaries",
  "speakers": [
    "Raymond Hettinger"
  ],
  "tags": [
    "coredev",
    "dict"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/p33CVV29OG8/hqdefault.jpg",
  "title": "Modern Dictionaries",
  "videos": [
    {
      "type": "youtube",
      "url": "https://youtu.be/p33CVV29OG8"
    }
  ]
}
