{
  "category": "",
  "slug": "matplotlib-up-and-running-christopher-roach",
  "title": "Matplotlib: up and running (Christopher Roach)",
  "summary": "PyCon Canada 2015: https://2015.pycon.ca/en/schedule/19/\n\nTalk Description:\nMatplotlib is the de facto standard for data visualization in Python, but getting started with it can be a little bit tough. Take a look at three different matplotlib tutorials, and chances are, you'll see at least two, if not three, different ways to interact with matplotlib! Understanding the correct way may not always be obvious.\n\nNow, fast forward past the basics. You've created a few visualizations with the aid of whatever tutorials you've found online, but you still don't feel like you have a good grip on how matplotlib works. You call the plot function several different ways and it seems to work just fine in the tutorials, but it doesn't seem to be doing what you want it to now. Oh, and not to mention, why do I need to call the show() function sometimes and not others? These are all the types of questions that I had when I was first learning matplotlib and it took a bit of work to find the answers to all of them.\n\nIn this talk I cover everything that I wish I knew when I was first learning matplotlib. I'll cover the three main interfaces to the library: pylab, pyplot, and the OO API, and you'll learn when and how to use each one. Then we'll go into a bit more detail on the architecture of matplotlib, and deep dive into the plot function to understand just how versatile it is and where its limits arise. Finally, we'll look at several new libraries built atop the venerable visualization library that have come about in the past few years to take matplotlib to the next level. During the course of the talk, you'll also see several tips and tricks to make matplotlib a little friendlier.\n\nIt's been my observation that getting started with matplotlib is easy due to the wealth of tutorials online. A problem does tend to arise, however, when a tutorial can't be found for the current task at hand. Many times I've seen individuals, who have used matplotlib in the past, at a loss when they need to do something they've never done before. The goal of this talk is to give the attendees the understanding they need to reason properly about the library and to make it possible for them to move away from copy-n-paste coding to actually writing up their own visualization scripts.",
  "description": "",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "",
  "thumbnail_url": "https://i.ytimg.com/vi/V-OWkPCYa0s/maxresdefault.jpg",
  "duration": 1744,
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=V-OWkPCYa0s",
      "length": 0
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=V-OWkPCYa0s",
  "tags": [],
  "speakers": [],
  "recorded": "2015-11-17"
}