{
  "id": 2372, 
  "category": "Kiwi PyCon 2013", 
  "slug": "encouraging-new-programmers-the-open-tech-schoo", 
  "title": "Encouraging new programmers - the Open Tech School model", 
  "summary": "As programmers we should encourage new people to take up our craft. Coding skills can benefit a lot of people who aren't inclined to call themselves programmers. In this talk I'll explain why I think this is important, introduce the free volunteer organisation Open Tech School, and describe some of the things we've found that work and why we've embraced Python for our beginner workshops.\r\n", 
  "description": "@ Kiwi PyCon 2013 - Sunday, 08 Sep 2013 - Track 1\r\n\r\n**Audience level**\r\n\r\nIntermediate\r\n\r\n**Abstract**\r\n\r\nThe Python community may be one of the most welcoming programming communities, but even the experience of learning Python can be daunting for an outsider.\r\n\r\nOpen Tech School (OTS) - http://www.opentechschool.org/ - is one of many organisations aiming to introduce people to programming. Our motto: \"We organize tech workshops. Hands-on, awesome, and free.\" All content is published online under open licenses, and OTS workshops are run by volunteers at no cost to participants.\r\n\r\nJust like arithmetic skills are useful for people with no interest in becoming professional accountants, coding skills can be useful for people with no interest in becoming professional programmers. Many people are faced with menial computer-based tasks in their daily lives. Most could be greatly eased with the help of some programming. Not to mention that programming can be fun!\r\n\r\nIn this talk I'll explain why I think introducing outsiders to programming skills is important, and why I think every professional programmer has a reason to benefit from this. I'll also go into some of the details of how OTS workshops function, and the reasons I think most OTS beginner workshops use Python. Finally I'll show how you could go about starting OTS in your local community.\r\n\r\n**Slides**\r\n\r\nhttps://speakerdeck.com/nzpug/angus-gratton-encouraging-new-programmers-the-open-tech-school-model", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "", 
  "thumbnail_url": "http://i1.ytimg.com/vi/MyYs1VGvF-E/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=MyYs1VGvF-E", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=MyYs1VGvF-E", 
  "tags": [], 
  "speakers": [
    "Angus Gratton"
  ], 
  "recorded": "2013-09-12"
}