{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "Kiwi PyCon 2013", "speakers": ["Hamish Campbell"], "title": "Polyominoes - An Exploration in Problem Solving with Python", "quality_notes": "", "video_flv_length": null, "recorded": "2013-09-12", "video_mp4_length": null, "description": "@ Kiwi PyCon 2013 - Saturday, 07 Sep 2013 - Track 2\r\n\r\n**Audience level**\r\n\r\nIntermediate\r\n\r\n**Abstract**\r\n\r\nA \"Polyomino\" is a geometric figure of adjacent squares. But just how many \"n\" polyominos are there?\r\n\r\nThis question has been one of our favourite interview questions. It's a deceptively simple problem with opportunities for innovative solutions and disastrous missteps. In this talk, we'll discuss the benefits of a number of approaches, demonstrate a few common pitfalls and challenge the audience to provide their own solutions, with prizes on offer at the end of the conference.\r\n\r\nThis is a talk for everyone: beginners will be introduced to a problem that can be solved using primitives, experts will see opportunities to deploy advanced optimizations.\r\n\r\n**Slides**\r\n\r\nhttps://speakerdeck.com/nzpug/hamish-campbell-polyominoes-an-exploration-in-problem-solving-with-python", "video_mp4_url": "", "tags": [], "copyright_text": "", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=HXQW3MCOECU", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "A \"Polyomino\" is a geometric figure of adjacent squares. But just how many \"n\" polyominos are there? Solving this question is one of our favourite interview questions and the techniques that can employed to solve it are instructive for a range of problems. In this talk, we discuss the potential solutions and offer prizes for the best solutions submitted by the end of the conference.\r\n", "thumbnail_url": "http://i1.ytimg.com/vi/HXQW3MCOECU/hqdefault.jpg", "video_flv_url": ""}