{
  "id": 2371, 
  "category": "Kiwi PyCon 2013", 
  "slug": "the-cylc-suite-engine", 
  "title": "The Cylc Suite Engine", 
  "summary": "The Cylc Suite Engine schedules complex distributed suites of cycling tasks. Developed for weather forecasting applications at NIWA, cylc has since been adopted by the UK Met Office and others, and was a finalist in the 2012 NZ Open Source Awards. Lead developer Hilary Oliver will talk about cylc and the many advantages that the Python programming language brought to the project.", 
  "description": "@ Kiwi PyCon 2013 - Sunday, 08 Sep 2013 - Track 2\r\n\r\n**Audience level**\r\n\r\nIntermediate\r\n\r\n**Abstract**\r\n\r\nThe Cylc Suite Engine is a metascheduler or workflow engine that makes it relatively easy to construct, monitor, and control large complex distributed suites of interdependent cycling tasks. Cylc was developed, entirely in Python, to automate modern environmental forecasting systems in an HPC environment at NIWA in New Zealand. Since its release as an Open Source project on GitHub in 2011 cylc has been adopted by the UK Met Office to control their large and varied forecasting systems; it is also used by groups at the Marine Meteorology Division of the Naval Research Laboratory in the US, the Max Planck Institute for Meteorology in Germany, and others; and it was a finalist in the 2012 NZ Open Source Awards. Lead developer Hilary Oliver will give an overview of what cylc does and how it works, and the particular advantages gained by our decision to use the Python programming language.\r\n\r\n**Slides**\r\n\r\nhttps://speakerdeck.com/nzpug/hilary-james-oliver-the-cylc-suite-engine", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "", 
  "thumbnail_url": "http://i1.ytimg.com/vi/Mv-hBTcncKM/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=Mv-hBTcncKM", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=Mv-hBTcncKM", 
  "tags": [], 
  "speakers": [
    "Hilary James Oliver"
  ], 
  "recorded": "2013-09-13"
}