{
  "copyright_text": null,
  "description": "***Overview:*** PDFs are one of the widely used digital media formats\nand are used to present and exchange information reliably, independent\nof the software, hardware and operating system. Extracting data from PDF\nfiles can be a tricky task. This is because of the complicated formats,\nfonts, and layouts that are stored in PDF files.\n\nText Extraction from PDFs is one of the most common problems that is\nprevalent in every industry. I shall be showing you how to extract data\ndirectly from n number of PDF files using just one Python Library -\nRegex. I encountered a similar problem while working with my company and\nutilized Regular Expressions to automate an otherwise strenuous task.\n\n***1. Who is this talk for?***\n\n-  Anyone who is dealing with the problem of extracting data from\n   unstructured data at their workplace/ university.\n\n-  Anyone who wants to learn Regular Expression in a fun and easy\n   manner.\n\n***2. What background knowledge or experience should the audience\nhave?***\n\n-  This will be a beginner’s talk. The basis of Regex will be built from\n   the ground up during the talk.\n\n***3. What will the audience learn after attending the talk?***\n\n-  The audience will get a crisp overview of Regular Expressions, that\n   can assist them in a wide spectrum of tasks, from wrangling data to\n   qualifying and categorizing it.\n\n-  I’ll be showing them a use-case/demo of a problem statement that I\n   encountered at my workplace, giving the attendees more clarity about\n   the extent of usage of Regex\n\n**Feedback form:** https://python.it/feedback-1632\n\nin \\_\\_on **Sunday 5 May** at 09:45 `**See\nschedule** </en/sprints/schedule/pycon10/>`__\n",
  "duration": 1383,
  "language": "eng",
  "recorded": "2019-05-05",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon10/"
    }
  ],
  "speakers": [
    "Aakriti Jain"
  ],
  "tags": [
    "textextraction",
    "datawrangling",
    "datamining"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Ouue8Doha9k/maxresdefault.jpg",
  "title": "Text Extraction from PDFs made Easy",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ouue8Doha9k"
    }
  ]
}
