{
  "copyright_text": null,
  "description": "Title: How to Become a Kickass Team Lead 101\n\nAudience Level: Beginner\n\nRequirements: None\n\nSUMMARY\n=======\n\nMost engineers who get promoted to the role of a team lead, tech lead or\nlead developer (regardless of the wording of the title) feel like they\nwere thrown in cold waters as they, most probably, lack prior training\nor education on the subject matter. Most of us that survive and actually\nget to like the new role and arrive at really good results, manage to\neducate themselves on the skills and habits required to become an\neffective team leader.\n\nIn this talk, I will cover the most important lessons about being an\neffective team lead without any previous knowledge about the subject.\nThis is a practical talk and the audience will walk away with a lot of\nmaterial and advice to upgrade their engineering leadership game, as\nwell as a recommended set of resources for further study. The talk is\nprimarily focused on developing leadership skills and is tailored\ntowards engineers and software teams.\n\nThe learning goals are: - How to develop practical leadership skills for\nyour day-to-day job - Understand the core components of leadership: ATM\n(Ability, Team, Mission) - How to build teamwork on a foundation of\ntrust - How to overcome the main dysfunctions to look in order to\ntighten up your team - Increase your awareness of the main anti-patterns\nthat team leads end up doing\n\n**Feedback form:** https://python.it/feedback-1668\n\nin \\_\\_on **Friday 3 May** at 11:15 `**See\nschedule** </en/sprints/schedule/pycon10/>`__\n",
  "duration": 2384,
  "language": "eng",
  "recorded": "2019-05-03",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon10/"
    },
    "https://www.pycon.it/media/conference/slides/what-football-captains-and-tribal-chieftans-can-teach-us-about-leading-geeks.pdf"
  ],
  "speakers": [
    "Ahmad Alhour"
  ],
  "tags": [
    "management",
    "community",
    "leadership",
    "teamwork",
    "tech-lead",
    "education"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/rentFl6mO5U/maxresdefault.jpg",
  "title": "How to Become a Kickass Team Lead 101",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rentFl6mO5U"
    }
  ]
}
