{
  "copyright_text": null,
  "description": "Deep neural networks are becoming irreplaceable for analyzing most kinds\nof data that humans supposed to exceed in - images, video, sounds,\ntexts. They can not only predict something based on some input but also\ngenerate new images or sounds. Meanwhile, we are forgetting about\nanother very important source of data - signals (or time series, which\nwill be interchangeably here), that gets less hype in public but\nbenefits a lot from applying deep learning comparing to classical\napproaches.\n\nIn this talk, we will review what are sources of time series and what\nbusiness goals are we solving while analyzing them, what are “old” tools\nfor analysis and how deep neural nets overcome them, we will learn the\nlatest trends and ruin some myths and, moreover, we will see how\ngenerative models can be applied to the signal processing as well.\n\nAfter this talk, you’ll be able to boost your current solutions in\nsignal processing or time series analysis with deep learning. It will be\nalso interesting for practitioners in other areas, like computer vision\nor NLP since we will discuss some concepts that are widely applicable.\nPrevious experience with time series is not required, but some\ntheoretical or practical experience with machine learning and/or neural\nnetworks is preferred.\n\n**Feedback form:** https://python.it/feedback-1716\n\nin \\_\\_on **Friday 3 May** at 18:00 `**See\nschedule** </en/sprints/schedule/pycon10/>`__\n",
  "duration": 2599,
  "language": "eng",
  "recorded": "2019-05-03",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon10/"
    }
  ],
  "speakers": [
    "Alexandr Honchar"
  ],
  "tags": [
    "machine-learning",
    "deep learning",
    "biomedical-data-science",
    "TimeSeries",
    "signal-processing",
    "neural network",
    "finance"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/9Jr4wC1xLDQ/maxresdefault.jpg",
  "title": "Deep learning: the final frontier for time series analysis and signal processing?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9Jr4wC1xLDQ"
    }
  ]
}
