{
  "copyright_text": null,
  "description": "In Machine Learning and Data Science in general, understanding the data\nis paramount. This understanding can come from many different sources\nand techniques: domain expertise, exploratory analysis, SMEs, some\nspecific Machine Learning techniques, and feature engineering. As a\nmatter of fact, most Machine Learning and Statistical analysis strongly\ndepends on how the data is prepared, thus making feature engineering\nvery important for any serious Machine Learning enterprise.\n\n“Feature engineering is the process of transforming raw data into\nfeatures that better represent the underlying problem to the predictive\nmodels, resulting in improved model accuracy on unseen data.”\n\nIn this talk we will discuss what feature engineering and feature\nselection are; how to select important features in a real-world dataset\nand how to develop a simple, but powerful ensemble to measure feature\nimportance and perform feature selection.\n\nFamiliarity with intermediate concepts of the Python programming\nlanguage is required to follow the implementation steps. General\nknowledge of the basic concepts of Machine Learning and data cleaning\nwill be useful, but not strictly necessary, to follow the discussion on\nfeature selection and feature engineering.\n\nFeedback form: https://python.it/feedback-1529\n\nin \\_\\_on **Friday 3 May** at 10:30 `**See\nschedule** </en/sprints/schedule/pycon10/>`__\n",
  "duration": 2034,
  "language": "eng",
  "recorded": "2019-05-03",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon10/"
    }
  ],
  "speakers": [
    "Pietro Mascolo"
  ],
  "tags": [
    "scikit-learn",
    "machine-learning",
    "pydata"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/2fr3ChKENTc/maxresdefault.jpg",
  "title": "Good features beat algorithms",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2fr3ChKENTc"
    }
  ]
}
