{
  "copyright_text": null,
  "description": "Happiness and our search for it is important but complicated. However,\nwe can learn much from each other. Being our authentic selves and\nallowing ourselves to grow, gains us skills to help others too. In this\ntalk, we’ll learn about helping ourselves and guiding others towards\nhappiness for all.\n\nHappiness and our own search for it have deep impacts on our entire\nlives. But important as it is, it’s also incredibly complicated. We each\ncarry our own baggage, and the things that make us happy are not\nconstants. However, we can learn so much from each other in a community,\nand can have a tremendous impact on each other’s happiness in how we\nshape our communities and interactions - though not always in the most\nobvious ways.\n\nMany of the barriers to our happiness are actually created by ourselves,\nand those can be the hardest the overcome. But by being our authentic\nselves and facing up to our fears, we can gain the confidence to do what\nis needed. And growing in this process ourselves, we gain so many skills\nin helping others in their journeys as well. Embracing those journeys\nand skills in our community will make it a happier and more inclusive\nspace for all, which fosters growth in ourselves and others.\n\nI recently put literally every aspect of my life upside down in my own\nsearch for happiness, and will share from my personal story and stories\nof others about the lessons learned, in a way that many of us will\nrecognise. We’ll also talk about how each of us in a community has\nopportunities to bring happiness to others, which in the end will\ncontribute to our own happiness too.\n\nPrevious responses to this talk included:\n\n-  “Took me a decade to understand what this speaker is presenting\n   gracefully and meaningfully in a handful of minutes.”\n\n-  “Been waiting for this talk for months and it has not disappointed.”\n\n-  “Such a strong, emotional and impactful opening keynote.”\n\n-  “This speaker is like the purest person ever!”\n\n-  “Thank you for being inspiring and honest.”\n\n-  “Hard truth. Touching chords.”\n\n-  “I should have worn waterproof makeup.”\n\n**Feedback form:** https://python.it/feedback-1799\n\nin \\_\\_on **Friday 3 May** at 14:15 `**See\nschedule** </en/sprints/schedule/pycon10/>`__\n",
  "duration": 2841,
  "language": "eng",
  "recorded": "2019-05-03",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon10/"
    }
  ],
  "speakers": [
    "Sasha Romijn"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/LZJBiSiZuqQ/maxresdefault.jpg",
  "title": "The Secret Society of Happiness",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LZJBiSiZuqQ"
    }
  ]
}
