{
  "id": 446, 
  "category": "PyCon US 2011", 
  "slug": "pycon-2011--state-of-pylons-turbogears-2-repoze-b", 
  "title": "State of Pylons/TurboGears 2/repoze.bfg", 
  "summary": "", 
  "description": "State of Pylons/TurboGears 2/repoze.bfg\n\nPresented by Chris McDonough, Ben Bangert, and Mark Ramm\n\nA three-for-one talk by the main developers of three popular Python web\nframeworks! We'll (very) briefly cover the state of each of our individual\nframeworks and communities, and then we'll describe the results of our efforts\nto work together and share code.\n\nAbstract\n\nPylons is a popular, lightweight Python web framework.\n\nTurboGears 2 is a full-stack framework built atop Pylons.\n\nrepoze.bfg is a moderately popular, lightweight Python web framework.\n\nThe main developers and community leaders of these frameworks have been\nworking together and sharing as much as possible over the course of roughly\nthe last year. We'll very briefly describe to the audience the states of our\nindividual efforts, then we'll discuss how we intend to move forward and share\nmore code and effort in the year to come. The talk will be more socially-\noriented than technical.\n\nIt's unusual for open source code and communities to bridge minor perceived\ndifferences in scope and style and to start sharing code and ideas openly. If\nyou're a user of any of these frameworks, you'll want to be present for this\ntalk.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011StateOfPylonsTurboGears2repozebfg818.png", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/446_state-of-pylons-turbogears-2-repoze-bfg.mp4", 
      "length": null, 
      "type": "mp4"
    }
  ], 
  "source_url": "", 
  "tags": [
    "pycon", 
    "pycon2011", 
    "pylons", 
    "pyramid", 
    "repoze.bfg", 
    "turbogears"
  ], 
  "speakers": [
    "Ben Bangert", 
    "Chris McDonough", 
    "Mark Ramm"
  ], 
  "recorded": "2011-03-11"
}