{
  "id": 428, 
  "category": "PyCon US 2011", 
  "slug": "pycon-2011--genetic-programming-in-python", 
  "title": "Genetic Programming in Python", 
  "summary": "", 
  "description": "Genetic Programming in Python\n\nPresented by Eric Floehr\n\nDid you know you can create and evolve programs that find solutions to\nproblems? This talk walks through how to use Genetic Algorithms and Genetic\nProgramming as tools to discover solutions to hard problems, when to use\nGA/GP, setting up the GA/GP environment, and interpreting the results. Using\n[pyevolve](http://pyevolve.sourceforge.net/), we'll walk through a real-world\nimplementation creating a GP that predicts the weather.\n\nAbstract\n\nGenetic Algorithms (GA) and Genetic Programming (GP) are methods used to\nsearch for and optimize solutions in large solution spaces. GA/GP use concepts\nborrowed from natural evolution, such as mutation, cross-over, selection,\npopulation, and fitness to generate solutions to problems. If done well, these\nsolutions will become better as the GA/GP runs.\n\nGA/GP has been used in problem domains as diverse as scheduling, database\nindex optimization, circuit board layout, mirror and lens design, game\nstrategies, and robotic walking and swimming. They can also be a lot of fun,\nand have been used to evolve aesthetically pleasing artwork, melodies, and\napproximating pictures or paintings using polygons.\n\nGA/GP is fun to play with because often-times an unexpected solution will be\ncreated that will give new insight or knowledge. It might also present a novel\nsolution to a problem, one that a human may never generate. Solutions may also\nbe inscrutable, and determining why a solution works is interesting in itself.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011GeneticProgrammingInPython350.png", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/428_genetic-programming-in-python.mp4", 
      "length": null, 
      "type": "mp4"
    }
  ], 
  "source_url": "", 
  "tags": [
    "ga", 
    "geneticalgorithms", 
    "geneticprogramming", 
    "gp", 
    "pycon", 
    "pycon2011", 
    "pyevolve"
  ], 
  "speakers": [
    "Eric Floehr"
  ], 
  "recorded": "2011-03-11"
}