{
  "id": 366, 
  "category": "PyCon US 2011", 
  "slug": "pycon-2011--api-design--lessons-learned", 
  "title": "API Design: Lessons Learned", 
  "summary": "API lessons learned from a decade of core Python development.\n\n", 
  "description": "Share the lessons learned from a decade of core Python development, what\nworked and what didn't. Look at the development process and thinking behind\nsome of Python's successful APIs and ones that leave something to be desired.\nLearn general principles for designing a good API for public consumption.\n\nHear the story and principles behind the design of Python's \"in\" operator, the\ndevelopment of deques, and the evolution of the set API.\n\nExamine the principles and story behind the development of the named tuple\nAPI. Learn about unforeseen use cases and a bug that made it to production.\n\nDiscuss the decimal module's API challenge -- adhering to a published\nstandard. Talk about the Queue module's framework style and how the API was\nrefactored.\n\nDiscuss what we've learned about naming functions and methods. Look at the\ni-naming convention in itertools, camelcase oddities, the proposed Italian\nname for enumerate, and vaguely named methods like assertItemsEqual.\n\nLearn about Guido's ideas on when to add flags to method signatures. Recap his\nthoughts on the problems with the percent formatting operator. Then hear\nRaymond's advice on packaging, hierarchies, and nested name spaces.\n\nSee how to use documentation to mitigate API problems using examples from\nregular expressions, decimal, tokenize, sorting.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011APIDesignLessonsLearned555.png", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/366_api-design-lessons-learned.mp4", 
      "length": null, 
      "type": "mp4"
    }
  ], 
  "source_url": "", 
  "tags": [
    "api", 
    "apidesign", 
    "cpython", 
    "pycon", 
    "pycon2011"
  ], 
  "speakers": [
    "Raymond Hettinger"
  ], 
  "recorded": "2011-03-11"
}