{
  "id": 415, 
  "category": "PyCon US 2011", 
  "slug": "pycon-2011--get-new-contributors--and-diversity--", 
  "title": "Get new contributors (and diversity) through outreach", 
  "summary": "", 
  "description": "Get new contributors (and diversity) through outreach\n\nPresented by Asheesh Laroia\n\nGroups like the Fedora Design Team, Dreamwidth, SF Ruby, and OpenHatch have\ndiscovered the power of outreach to bring in new contributors. In the past\nyear, SF Ruby grew in numbers as well as in diversity, moving from 3% women to\n18% women. Because most projects need ongoing help, this talk discusses\neffective strategies for bringing in contributors who stick around for the\nlong haul.\n\nAbstract\n\nThis talk is targeted at anyone involved in an open source project who wants\nto find more contributors.\n\nPrograms like Google Summer of Code often provide excited students who\ndisappear after a summer's work. Meanwhile, request for help emails on\ndevelopment lists are typically met with silence. Hackathons create a flurry\nof commits, but then we never hear from the participants again. Expanding your\nteam is possible, and it requires care in terms of outreach, expectation\nmanagement, and mentorship.\n\nWe will discuss three major forms of outreach:\n\n  * One-on-one check-ins with participants, \n  * Periodic drives to bring in new contributors, and \n  * In-person teaching events. \nEach one has \"do\"s and \"don't\"s associated with it. This talk digests the\nexperience of effective outreach into practical strategies that you can re-use\nwithin your project.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011GetNewContributorsAndDiversityThroughOutreach225.png", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/415_get-new-contributors-and-diversity-through-outreach.mp4", 
      "length": null, 
      "type": "mp4"
    }
  ], 
  "source_url": "", 
  "tags": [
    "diversity", 
    "openhatch", 
    "outreach", 
    "pycon", 
    "pycon2011"
  ], 
  "speakers": [
    "Asheesh Laroia"
  ], 
  "recorded": "2011-03-11"
}