{
  "id": 361, 
  "category": "PyCon US 2011", 
  "slug": "pycon-2011--montreal-python----lessons-learned-fr", 
  "title": "Montreal-Python -- Lessons Learned from Bootstraping a Python Community", 
  "summary": "Montréal-Python is a user-group formed in 2007. It has since then grown into a\nthriving community with code sprint and regular meetings attracting over 50\nattendees. This talk will present history of the group and will highlight the\nkey factors behind its success with the hope to inspire others to replicate\nthat accomplishment.\n\n", 
  "description": "The talk will first walk the audience through the factors inherent to Montréal\nitself and how it affected other user groups before Montréal-Python. These\ngroups inspired us to get a group of Python hackers started the presentation\nwill show how we were able to leverage on the success of other user groups to\nbring our young community forward.\n\nThe various stages of our growth will be presented along with insights on how\nwe managed to find speakers and venues at each point. The presentation will\nthen go through an overview of our current activities, sharing in the process\nhow effective they are in engaging the community. Our plans for the next few\nyears will be presented then a summary will provide advice to anyone who would\nlike to get started organizing a local Python user group.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011MontrealPythonLessonsLearnedFromBootstrapingAP942.png", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/361_montreal-python-lessons-learned-from-bootstraping-a-python-community.mp4", 
      "length": null, 
      "type": "mp4"
    }
  ], 
  "source_url": "", 
  "tags": [
    "community", 
    "growth", 
    "pycon", 
    "pycon2011", 
    "usergroups"
  ], 
  "speakers": [
    "Yannick Gingras"
  ], 
  "recorded": "2011-03-11"
}