{
  "id": 423, 
  "category": "PyCon US 2011", 
  "slug": "pycon-2011--through-the-side-channel--timing-and-", 
  "title": "Through the Side Channel: Timing and Implementation Attacks in Python", 
  "summary": "", 
  "description": "Through the Side Channel: Timing and Implementation Attacks in Python\n\nPresented by Geremy Condra\n\nPython's dynamic nature, large standard library, and concern for beauty over\nperformance make it an elegant and uniquely easy to use language, but they\nalso cause some unique problems. In this talk we'll explore how features\nranging from dictionaries to duck typing can become security risks,\ndemonstrate those attacks on real Python projects, and examine how you can\nprotect yourself and your code.\n\nAbstract\n\nOver the last decade, an increasing body of evidence has accumulated\nindicating that even when a system is hardened enough to provide strong\nguarantees about its high-level behavior, implementation details and\nespecially performance properties can still provide attackers with an easy way\nin. For Python, this is especially problematic: its generally high-level view\nand the emphasis placed on flexibility often mean that it can be difficult to\nstop attackers from gaining a foothold, while its comparatively low execution\nspeed increases the efficacy of wide variety of implementation and timing\nattacks.\n\nTo help Pythonistas understand and cope with these problems, we've divided\nthis talk into two parts: in the first, we demonstrate the attacks against a\nseries of widely-deployed Python projects with the goal of both improving\nawareness about the issue and demonstrating common weaknesses to be avoided.\nThe second demonstrates effective countermeasures and alternative\nconstructions with the goal of improving defenders' odds of spotting and\ncorrecting these flaws in their own code.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011ThroughTheSideChannelTimingAndImplementationAt601.png", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/423_through-the-side-channel-timing-and-implementation-attacks-in-python.mp4", 
      "length": null, 
      "type": "mp4"
    }
  ], 
  "source_url": "", 
  "tags": [
    "hacking", 
    "hardening", 
    "pycon", 
    "pycon2011", 
    "security"
  ], 
  "speakers": [
    "Geremy Condra"
  ], 
  "recorded": "2011-03-11"
}