{
  "id": 403, 
  "category": "PyCon US 2011", 
  "slug": "pycon-2011--writing-great-documentation", 
  "title": "Writing great documentation", 
  "summary": "", 
  "description": "Writing great documentation\n\nPresented by Jacob Kaplan-Moss\n\nDjango’s among the best documented open source projects; I'm intensely proud\nof that accomplishment. If any part of Django endures, I hope it’ll be a\n“documentation culture” — an ethos that values great, well-written\ndocumentation. To that end, this talk looks at the tools, tips, and techniques\nI’ve learned over the years. I hope it helps you write great documentation,\ntoo.\n\nAbstract\n\nThis talk looks at tips, tools, and techniques you can use to produce great\ntechnical documentation.\n\nIt's split roughly into two parts:\n\n  * Part 1: technique. We'll look at the structural elements that make documentation useful: tutorials, high-level overviews, topical guides, reference material, FAQs, and more. We'll cover some tips on how to get documentation done, and community processes for handling documentation in teams (open or not). We'll also talk about what I'm calling \"Documentation Driven Development\" - a technique riffing off Test Driven Development that calls for writing documentation before code. \n  * Part 2: tools. Over the last couple of years a few fantastic tools have sprung up that ease the technical aspects of writing documentation. We'll talk about which tools are suitable for which uses, and look at a handful of cool tools including [Sphinx](http://sphinx.pocoo.org/), [Epydoc](http://epydoc.sourceforge.net/), and [http://fitzgen.github.com/pycco/](http://fitzgen.github.com/pycco/). \n\nThis talk is mostly targeted towards those documenting libraries or frameworks\nintended for use by other developers, but much of it probably applies to any\nsort of technical documentation.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011WritingGreatDocumentation902.png", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/403_writing-great-documentation.mp4", 
      "length": null, 
      "type": "mp4"
    }
  ], 
  "source_url": "", 
  "tags": [
    "docs", 
    "documentation", 
    "epydoc", 
    "faqs", 
    "pycco", 
    "pycon", 
    "pycon2011", 
    "sphinx"
  ], 
  "speakers": [
    "Jacob Kaplan-Moss"
  ], 
  "recorded": "2011-03-11"
}