{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon US 2011", "speakers": ["Laurens Van Houtven"], "title": "Continuous deployment", "quality_notes": "", "video_flv_length": null, "recorded": "2011-03-11", "video_mp4_length": null, "description": "Continuous deployment\n\nPresented by Laurens Van Houtven\n\nThis talk is about continuous deployment practices and tools, lessons learned\nfrom implementing it, and putting them into perspective. The goal is to give\nother people tips and pointers for applying these ideas themselves.\n\nAbstract\n\nContinuous deployment is the practice of putting the latest revision of\nsoftware into production use all the time, as opposed to working towards\nlarger releases. The important difference is iteration time: whereas large\nsoftware packages produce new software in timeframes of years or months,\ncontinuous deployment teams typically put new code into production in\ntimeframes of hours or less.\n\nThe practice is slowly attracting a small but growing group of loyal\nfollowers, just like continuous integration over the past few years and test-\ndriven development did before that. They can be explained in terms of being\nnatural extensions of each other. Like TDD and CI, CD gets eyed somewhat\nsuspiciously (and rightfully so: skeptical analysis is great), but the\nundersigned believes there's a legitimate advantage for many applications.\n\nMany years ago, TTD and testing tools in general were mostly ad-hockery. Now,\nwith many different production-quality testing tools, this has become\nunthinkable. Similarly, continuous integration was something other people did\nfor a long time, but now we have tools such as Buildbot and Hudson. Continuous\ndeployment is still somewhat in the early stage in terms of ready-to-use\ntools, but it's likely that we'll see a similar evolution.\n\nHere's a rough outline of what I plan to cover:\n\n  * a short history of people developed software \n  * from the recent models to CD (sort of a working definition of CD here) \n  * when is it a good idea? pros/cons \n  * requirements & battle plan for applying CD in an existing development environment (and possibly code base) \n  * an overview of existing tools and how they work together \n  * caveat emptors, known pitfalls (deployment and recovery strategies go here, since most implementations figure out they need them after stuff blows up) \n  * questions! (hopefully lots of people who've tried or are thinking about implementing something similar -- like I said, there are a lot of people implementing it but not too many ideas being bounced around) \n\n", "video_mp4_url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/407_continuous-deployment.mp4", "tags": ["cd", "ci", "continuousdeployment", "deployment", "pycon", "pycon2011", "softwaredevelopment", "tdd", "workflow"], "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", "related_urls": [], "video_flv_download_only": false, "source_url": "", "video_webm_url": null, "video_ogv_length": 134193408, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011ContinuousDeployment817.png", "video_flv_url": null}