{
  "id": 452, 
  "category": "PyCon US 2011", 
  "slug": "pycon-2011--distributed-tasks-with-celery", 
  "title": "Distributed Tasks with Celery", 
  "summary": "", 
  "description": "Distributed Tasks with Celery\n\nPresented by Ryan Petrello\n\nCelery is an open source task queueing system based on distributed message\npassing, especially using the AMQP protocol. This talk will focus on the need\nfor task distribution, the tools celery provides to meet those needs, and an\nin-depth discussion of how we've used celery at ShootQ to improve the\nefficiency and reliability of our background processes.\n\nAbstract\n\nThe talk (including time for questions) will last approximately 30 minutes and\nwill focus on the following topics:\n\n  * The need for distributed tasks in real world systems, especially in a web application environment. This portion of the talk will describe examples where the traditional request-response model of the web can be improved with background processing. \n  * A brief overview of traditional distributed message passing models and the AMPQ protocol. \n  * An overview of Celery and the variety of tools it provides for task distribution, scheduling, and execution. This portion of the talk will also review production-oriented components of Celery, such as monitoring, error detection/reporting, and error recovery. \n  * Real world discussion of several problems we solved at ShootQ using Celery including before-and-after looks at our implementations. \n  * Common pitfalls and gotchas we encountered while working with Celery. \n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011DistributedTasksWithCelery711.png", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/452_distributed-tasks-with-celery.mp4", 
      "length": null, 
      "type": "mp4"
    }
  ], 
  "source_url": "", 
  "tags": [
    "amqp", 
    "celery", 
    "pycon", 
    "pycon2011", 
    "queueing"
  ], 
  "speakers": [
    "Ryan Petrello"
  ], 
  "recorded": "2011-03-11"
}