{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon US 2011", "speakers": ["Alex Martelli"], "title": "API Design anti-patterns", "quality_notes": "", "video_flv_length": null, "recorded": "2011-03-11", "video_mp4_length": null, "description": "API Design Anti-Patterns\n\nPresented by Alex Martelli\n\nDesigning interfaces so that other code can interact with ours (whether our\ncode is a library, framework, application, website...) is a very common and\nclearly crucial activity, but fraught with dangers -- stuff we all keep doing\nwrong time after time. This talks shows some common cases of API design errors\nencountered in the wild, with tips on how to avoid them when you design your\nnext API.\n\nAbstract\n\nWhenever we write code we should always be thinking about how other code\n(whether our own, or other people's) will interact with ours (an \"API\", in\ncommon parlance). Indeed, the most common and terrible mistake in API design\nis... not doing any! -- i.e., not providing any designed, architected way for\nother code to interact with ours. That's fortunately less common when \"our\ncode\" is a library or framework;-), but, alas!, sadly widespread when \"our\ncode\" is an application or website -- that's why questions about screen-\nscraping the web and simulating keystrokes and mouse gestures need be so\ntragically frequent all over the web.\n\nOnce past the obvious hurdle of not having any API at all, there's still\nplenty of ways we can go badly wrong in the process of designing one -- and\nmany of those ways fall into recognizable categories, i.e., patterns.\nSpecifically, since they're frequently observed categories of defective\ndesign, they're anti-patterns -- and that's what this talk is in fact about\n(as the smartest among you could tell from the title...).\n\nI'm eminently qualified to present on this subject, since, in a lifetime spent\nmostly stumbling into software (after actually qualifying to design hardware\nin college, but only doing that for a few years), I've been responsible for\nmore of my shares of API design fumbles (plus, of course, just like every\nother programmer, I've done my share of swearing at the design fumbles of\nother API designers). And, as novelist Richard Bach reminds us, \"You teach\nbest what you most need to learn\"!-)\n\n", "video_mp4_url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/445_api-design-anti-patterns.mp4", "tags": ["api", "pycon", "pycon2011"], "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", "related_urls": [], "video_flv_download_only": false, "source_url": "", "video_webm_url": null, "video_ogv_length": 222617966, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011APIDesignAntipatterns897.png", "video_flv_url": null}