{
  "id": 374, 
  "category": "PyCon US 2011", 
  "slug": "pycon-2011--diversity-in-tech--improving-our-tool", 
  "title": "Diversity in Tech: Improving our Toolset", 
  "summary": "", 
  "description": "Diversity in Tech: Improving our Toolset\n\nPresented by Jennifer Leech\n\nAs communities allow more diversity, they draw from a larger talent pool,\nchallenge each other more, and hit a higher bar in terms of ingenuity and\nwork-product. However questions surrounding diversity often seem under-\nexamined. What are the effects of diversity in the community, or lack thereof?\nI intend to approach this topic from an accessible and entertaining, yet\nanalytical perspective.\n\nAbstract\n\nLast year there was a photo of Kate Moss shown during a PyCon presentation\nwhich raised debate as to its appropriateness. This debate brought up some\ninteresting questions - but what I found most interesting was that while it\nelicited strong opinions, the issue seemed to be somewhat unexamined. This\nevent sparked a desire for deeper analysis on this topic in a more focussed\nsetting.\n\nIn this talk, I intend to address some of the core principles underlying this\ndebate. Discussion will include the following questions: Where does\nresponsibility lie in understanding these issues? What are the effects of\nfailing to do so? What are the effects of diversity in the community, or lack\nthereof? What do we lose by being more homogenous or more diverse? Gain?\n\nAs communities allow more diversity, they draw from a larger talent pool,\nchallenge each other more, and hit a higher bar in terms of ingenuity and\nwork-product. However, diversity requires awareness and tolerance on both the\npart of the dominant culture and on the part of the new arrivals to smooth the\ninevitable rough edges.\n\nI intend to approach this topic from an accessible, inclusive and\nentertaining, yet analytical perspective. The broader intent is to raise the\nlevel of understanding and community discourse on this topic. It is odd that\ndiversity can so dramatically affect our lives and communities and yet be\nunexamined, particularly in a community so highly intelligent and educated as\nthat which populates the tech industry.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011DiversityInTechImprovingOurToolset347.png", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/374_diversity-in-tech-improving-our-toolset.mp4", 
      "length": null, 
      "type": "mp4"
    }
  ], 
  "source_url": "", 
  "tags": [
    "diversity", 
    "pycon", 
    "pycon2011"
  ], 
  "speakers": [
    "Jennifer Leech"
  ], 
  "recorded": "2011-03-11"
}