{
  "copyright_text": "Standard YouTube License",
  "description": "Earthquakes are a natural phenomenon which occurs from the sudden release of energy in the Earth's lithosphere that creates seismic waves. Or put more simply, an earthquake is the shaking of the surface of the Earth!\n\nAs a mathematician I have always considered earth science to be an intriguing field though I was never given the opportunity to ‘dig’ around.\n\nIn July 2017, an earthquake hit my hometown on the island of Kos. The phenomenon was reported as a catastrophe due to the casualties and the damages the island took. But the event itself and my lack of information on it managed to spark my interest and as a researcher I decided to take a trip to earth science.\n\nAll a good traveller needs is a map and a companion. With open research being my map all that was left was to wisely choose a trustworthy companion. After my inner software developer made a very good argument I decided to chose the programming language Python!\n\nFor PyConUK I am proposing to tell the tale of how a life experience started a trip to learning about seismology. Moreover, how Python and how the active community (libraries) that come with it allow you to carry the weight of the travel. I will be showing how different libraries such as earthquakes and quakefeeds allow you to collect records from around the world collected from the United States Geological Survey. These records include properties of the earthquakes such as distance, gap, magnitude and depth. Moreover, I will be using the toolkit basemap to create maps and plot the geographical datasets that have been collected.\n\nMy proposal is to describe how Python allowed me to retrieve enough knowledge to understand, visualise and express an opinion on something that was unknown to me several months ago.",
  "duration": 1154,
  "language": "eng",
  "recorded": "2017-10-29T12:00:00+01:00",
  "related_urls": [
    {
      "label": "event schedule",
      "url": "http://2017.pyconuk.org/schedule/"
    },
    {
      "label": "talk slides",
      "url": "https://nikoleta-v3.github.io/talks/talks//2017-10-29-PyConUK/main.pdf"
    }
  ],
  "speakers": [
    "Nikoleta E. Glynatsi"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/T4Qn2jD3SVM/maxresdefault.jpg",
  "title": "A trip to earth science with python as a companion",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=T4Qn2jD3SVM"
    }
  ]
}
