{
  "copyright_text": "Standard YouTube License",
  "description": "This is a panel of four experts answering pre-submitted questions from the assembled audience under the guidance of a chairperson. Audience participation will be encouraged.\n\nFake news on social media, dragnet collection of personal data, being asked to write code for the benefit of your employers but that's not necessarily helpful for your users, using big data to analyse the behaviour of users, government control of the internet, violations of FLOSS licenced code. These subjects and more like them are ripe for discussion in this panel.\n\nThink \"Question Time\" on BBC1 at 10:30pm on a Thursday and you have a pretty good idea of what it will be like.\n\n**Carol Willing** (CHAIR)\n\nCarol Willing is a Python Software Foundation Fellow and former Director, a core developer for CPython and Project Jupyter, and a Research Software Engineer at Cal Poly San Luis Obispo.\n\nShe's also Geek-In-Residence at Fab Lab San Diego and co-organizes PyLadies San Diego and San Diego Python. Combining a love of nature, the arts, and math with a BSE in Electrical Engineering from Duke and an MS in Management from MIT, she's enjoyed creating and teaching others for over 20 years.\n\n**Anwesha Das**\n\nAnwesha Das, is an Advocate practicing law for 7 years. She is an active user of FOSS technologies. She is the Organizer of PyLadies Pune. She maintains her blog at https://anweshadas.in/. One of her major goals is to help FOSS developers with the legal aspects of the software industry. She currently also blogs for the Python Software Foundation.\n\n**Irina Bolychevsky**\n\nIrina is passionate about products and using technology to make things better. She spent many years working on open data at Open Knowledge (as one of the directors and ckan product owner), at web startups, and recently as a data consultant for W3C, Open Data Institute and the UK and Dubai governments. She co-founded redecentralize.org — a project to promote and bring together people working on and interested in decentralised digital technologies.\n\n**David Miller**\n\nAccording to the only known biography of David Miller he is, \"Human, frequently fascinated. Digital, Health with @ohcuk & friends.\" He also happens to have a background in philosophy and an interest in ethical and political matters arising in the digital world. He's a founder of the NHS Hackday and runs Open Healthcare.\n\n**Daniele Procida**\n\nDaniele works for Divio where he helps make Python/Django easier to deploy on the web. He is a member of the Django core team and the Django Software Foundation board, trying to contribute back to open source software and its communities.",
  "duration": 3161,
  "language": "eng",
  "recorded": "2017-10-28T12:00:00+01:00",
  "related_urls": [
    {
      "label": "event schedule",
      "url": "http://2017.pyconuk.org/schedule/"
    },
    {
      "label": "Anwesha Das blog",
      "url": "https://anweshadas.in/."
    }
  ],
  "speakers": [
    "Carol Willing",
    "Anwesha Das",
    "Irina Bolychevsky",
    "David Miller",
    "Daniele Procida"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/RERVMxLFpqA/hqdefault.jpg",
  "title": "Panel Discussion   The Ethics and Politics of Programming",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RERVMxLFpqA"
    }
  ]
}
