{
  "copyright_text": "Standard YouTube License",
  "description": "This is a panel of four experts answering pre-submitted questions from the assembled audience under the guidance of a chairperson. Audience participation will be encouraged.\n\nAre you a student learning Python? Do you teach using Python? Perhaps you support teachers or create educational resources? You may even be a parent with a perspective on how your own children are taught programming! Our panel of experts would love to hear from you!\n\nThink \"Question Time\" on BBC1 at 10:30pm on a Thursday and you have a pretty good idea of what it will be like.\n\n**Dan Pope (Chair)**\n\nDaniel is a hobbyist games programmer and two-time winner of the Pyweek games programming contest. He is author of Pygame Zero and adventurelib, both educational games frameworks for Python. He works for Two Sigma, a NYC hedge fund, from London.\n\n**Carrie Anne Philbin**\n\nCarrie Anne Philbin is an award winning Computing & ICT Teacher, Author and YouTuber. Currently working as Director of Education for the Raspberry Pi Foundation to put the power of computing and digital making into the hands of people all over the world. She also volunteers on the board for Computing At School and as a Fellow of the Python Software Foundation. Alongside her work in formal education in the UK, Carrie Anne also hosts a Computer Science series on popular educational YouTube channel Crash Course and creates technology tutorials on her own channel the Geek Gurl Diaries.\n\n**Cat Lamin**\n\nFormer UK primary school teacher and real-life geek girl, Cat is enthusiastic about getting teachers and children interested in coding and computing. She is a Raspberry Pi Certified Educator, CAS Master Teacher and Google Certified Educator; in her spare time, she performs in for an amateur theatre group, Q2 Players. Recent work has included work for the National STEM centre, travelling to Brazil to train elementary school teachers in basic computational thinking and computer science as well as working part-time for pi-top.\n\nCat also founded Coding Evening for teachers, a network of social events to encourage teachers and community members to get together and share best practice for computing teaching. She runs Raspberry Jam events in Wimbledon.\n\n**Kushal Das**\n\nKushal Das is a developer of SecureDrop at Freedom of the Press Foundation. He is a long time contributor to various upstream Free Software projects including the Fedora project. He is a core developer of CPython, and also a director of the Python Software Foundation. For the last 10 years he has been organizing online summer training to help people to become upstream contibutors, and wrote an online book to help in the same.\n\n**Tom Crick**\n\nTom Crick is Professor of Computer Science & Public Policy and Deputy Director of Innovation at Cardiff Metropolitan University. His interests sit at the research/policy interface, solving data-driven and computationally-intensive problems, as well as science/innovation policy, public service innovation, STEM education and skills/infrastructure for the digital economy. In 2013, he chaired the Welsh Government’s review of the ICT curriculum and chaired the development of a Digital Competence Framework for all schools in 2016. He was recently announced as the chair of the new National Network for Excellence in Science & Technology. He is Vice-President of BCS, The Chartered Institute for IT, Chair of CAS Wales and a non-executive director of Dŵr Cymru/Welsh Water. Twitter: @ProfTomCrick",
  "duration": 3417,
  "language": "eng",
  "recorded": "2017-10-27T16:30:00+01:00",
  "related_urls": [
    {
      "label": "event schedule",
      "url": "http://2017.pyconuk.org/schedule/"
    }
  ],
  "speakers": [
    "Daniel Pope",
    "Carrie Anne Philbin",
    "Cat Lamin",
    "Kushal Das",
    "Tom Crick"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/9kMLW5SzI08/hqdefault.jpg",
  "title": "Friday Education Panel",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9kMLW5SzI08"
    }
  ]
}
