{
  "copyright_text": "Standard YouTube License",
  "description": "This is a panel of four experts answering pre-submitted questions from the assembled audience under the guidance of a chairperson. Audience participation will be encouraged.\n\nDo you want to break into programming? Are you a junior developer wondering about the next steps in your career? Perhaps you're at a crossroads in your career and wonder what to do next? Is there a problematic issue about the workplace that you think should be discussed?\n\nSubmit your questions via this form.\n\nThink \"Question Time\" on BBC1 at 10:30pm on a Thursday and you have a pretty good idea of what it will be like.\n\n**Samathy Barratt** (Chair)\n\nSamathy is a magical code fairy passionate about diverse people and well documented code.\n\nCurrently finishing her BSC in Computer Science at Coventry University, she's always interested in learning new technologies and ideas. Despite being a student herself, she loves teaching what she's excited about to others.\n\nYou can usually find her getting involved with LGBT+ activism, going to conferences or drinking a good coffee.\n\n**Jessica Rose**\n\nJessica Rose is a self taught technologist and technical manager with FutureLearn. She's founded the Open Code meetup series, co-founded Trans*Code and hosts the Pursuit Podcast. She's a mentor and advisor for those looking to enter the tech industry.\n\n**Kristian Glass**\n\nKristian is the CTO at LaterPay, leading a team distributed across over a dozen countries. Prior to that he ran Moorhen Solutions where he helped growing tech companies scale their systems and infrastructure.\n\nHe was the treasurer for PyCon UK 2016, and co-founder of the PyCon UK Society Ltd and the UK Python Association.\n\n**Meri Williams**\n\nMeri is a geek, a manager, and a manager of geeks. She's a CTO, delighted to be leading the tech team at MOO, and also runs ChromeRose, a micro-consultancy which helps digital & technical teams be brilliant.\n\nShe has had a career spanning development, programme & product management and more recently engineering & operations leadership. She’s led teams ranging in size from 30 to 300, mostly with people spread across the world, in a range of organisations from Procter & Gamble, to startups, to the Government Digital Service.\n\nA published author and international speaker, she sponsors scholarships to help more girls start STEM careers in her hometown of Stellenbosch, South Africa. She's proud to be the host and co-curator of The Lead Dev conference for technical leads.\n\n**Michelle Coventry**\n\nMichelle is a talent advisor at Kindred Capital and Five AI. She has 16 years of experience sourcing and nurturing talent in high growth, investor backed tech companies.\n\nPreviously she was a founding partner at Maven Ventures - a leading headhunting firm recruiting for private equity and venture capital backed Tech and Digital companies across EMEA and the US. She also works with large organisations undergoing digital transformation (for example, Marks and Spencer) to help them recuit and nurture technical colleagues.",
  "duration": 3309,
  "language": "eng",
  "recorded": "2017-10-29T09:30:00+01:00",
  "related_urls": [
    {
      "label": "event schedule",
      "url": "http://2017.pyconuk.org/schedule/"
    }
  ],
  "speakers": [
    "Samathy Barratt",
    "Jessica Rose",
    "Kristian Glass",
    "Meri Williams",
    "Michelle Coventry"
  ],
  "tags": [
    "panel"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ByPbr57_5H4/hqdefault.jpg",
  "title": "Panel Discussion Developer - Career Progression",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ByPbr57_5H4"
    }
  ]
}
