{
  "copyright_text": "CC-BY-NC-SA 4.0",
  "description": "Yaakov Smith\n\nhttps://2020.pycon.org.au/program/URD9ER\n\nAs health authorities raced against the clock to restrict the spread of the Novel Coronavirus, bringing cities to a standstill, software developers too were racing to build a technological innovation. Their solution was ⁎✧˚₊ an app ༚⁎✧⁺  that would mystically allow you once again to go to the footy, hang out in pubs, return to work, and re-open the economy.\r\n\r\nWith the Australian Government running an unprecedented campaign to get as many people as possible to download their particular app, what this app actually does is still widely misunderstood. Furthermore, the app is somehow supposed to be safe and protect your privacy, whilst still being useful enough to track you and provide that information to medical contact tracers. How can that even work?\r\n\r\nIn this talk we will:\r\n‹ul›\r\n‹li›discover what contact-tracing is and why it is vital to curb the spread of the coronavirus‹/li›\r\n‹li›explore how technology can be used to assist in the contact-tracing process‹/li›\r\n‹li›analyze the COVIDSafe mobile apps for iOS and Android,‹/li›\r\n‹li›discuss why you should, or shouldn’t, install COVIDSafe, and how contact-tracing apps try to balance personal security and privacy with the health needs of the greater community‹/li›\r\n‹/ul›\r\n\r\nThose who attend this talk will learn about bluetooth-assisted contact tracing, exposure notification, and the shiny new new COVID-19 settings on their mobile phone\n\nProduced by NDV: https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1\n\nPython, PyCon, PyConAU, PyConline\n\nFri Sep  4 09:50:00 2020 at Python 2",
  "duration": 1419,
  "language": "eng",
  "recorded": "2020-09-05",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2020.pycon.org.au/program/"
    },
    {
      "label": "https://2020.pycon.org.au/program/URD9ER",
      "url": "https://2020.pycon.org.au/program/URD9ER"
    },
    {
      "label": "https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1",
      "url": "https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1"
    }
  ],
  "speakers": [
    "Yaakov Smith"
  ],
  "tags": [
    "PyCon",
    "PyConAU",
    "PyConline",
    "Python",
    "YaakovSmith",
    "pyconau",
    "pyconau_2020"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Dsvi44CnpPw/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLD1XuxP4ZalsxV6PhztdyFy7iS8kQ",
  "title": "Cracking open the COVIDSafe",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Dsvi44CnpPw"
    }
  ]
}