{
  "copyright_text": "CC-BY-NC-SA 4.0",
  "description": "Dr. Tania Allard\n\nhttps://2020.pycon.org.au/program/WMMVSQ\n\nDoes your work (either research, non-profit or industry-based) depend on Machine learning, Data Science or data-intensive analyses? Have you ever wished you could automate some of the boring stuff while adding extra robustness to your workflows so that you and your team can have greater confidence and work more efficiently?\r\n\r\nIn this talk, I will present the concept of MLOps (kind of DevOps for ML scenarios, also referred to as DataOps or AIOps) and how adopting these practices can improve your team's workflows. You will learn how to automate some tasks within the ML lifecycle: from data transformation to model training, testing and validation, and deployment — making your workflows not only more seamless but your entire work more reproducible, reliable, and robust.\r\nYou do not need to be a DevOps engineer to benefit from these practices, but you can indeed leverage existing open-source tools and platforms to improve your Data Science workflows.\r\nFor completeness, I'll show a live end to end example, integrating MLOps practices for Machine Learning - from data processing to model training, validation and deployment. I will highlight the essential tips and tricks for each of the involved stages. You will leave the talk with practical recommendations and examples to get you started on adopting MLOps practices.\n\nProduced by NDV: https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1\n\nPython, PyCon, PyConAU, PyConline\n\nFri Sep  4 16:35:00 2020 at Curlyboi",
  "duration": 1756,
  "language": "eng",
  "recorded": "2020-09-06",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2020.pycon.org.au/program/"
    },
    {
      "label": "https://2020.pycon.org.au/program/WMMVSQ",
      "url": "https://2020.pycon.org.au/program/WMMVSQ"
    },
    {
      "label": "https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1",
      "url": "https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1"
    }
  ],
  "speakers": [
    "Dr.Tania Allard"
  ],
  "tags": [
    "Dr.TaniaAllard",
    "PyCon",
    "PyConAU",
    "PyConline",
    "Python",
    "pyconau",
    "pyconau_2020"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/remaDHgimSE/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLBK-gkVYWdTNulp4rEVkJ6Z-Dnd9A",
  "title": "DevOps for Data Science? - automate the boring stuff and leverage the OSS ecosystem",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=remaDHgimSE"
    }
  ]
}