{
  "copyright_text": "CC-BY-NC-SA 4.0",
  "description": "Linda McIver\n\nhttps://2020.pycon.org.au/program/DD7SGY\n\nIn this talk, I want to show you how Data Science Education is key to nurturing a rationally sceptical, creative, ethical, problem solving population who can save the world.\r\nI’m going to do that by looking at the problems we have in the Data Science and Technology communities today, and how those communities are shaping our world - problems and all. \r\nWe’re then going to explore the issues with our current education system in more depth. There is no such thing as perfect data, yet we treat data with more reverence than it deserves. Our entire education system is built on the idea of being measurable, yet all too often “measurable” winds up being the opposite of “meaningful”. We’ll consider how we got here, and how we can create an education system that focuses on meaningful outcomes, and develops our students into rational, ethical heretics,\r\nAll of these goals require us to get comfortable with the idea of uncertainty. To be prepared to challenge the status quo, query accepted wisdom, and even to question our own findings. We're going to talk about why uncertainty is important, and how we can get comfortable with it, especially in education.\r\nWhy should you take my word for it? I'll show you how data science projects work, with case studies from my own teaching, and examples of units ADSEI has created right across the curriculum, from Humanities to STEM.\n\nProduced by NDV: https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1\n\nPython, PyCon, PyConAU, PyConline\n\nFri Sep  4 12:45:00 2020 at Floperator",
  "duration": 1520,
  "language": "eng",
  "recorded": "2020-09-05",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2020.pycon.org.au/program/"
    },
    {
      "label": "https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1",
      "url": "https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1"
    },
    {
      "label": "https://2020.pycon.org.au/program/DD7SGY",
      "url": "https://2020.pycon.org.au/program/DD7SGY"
    }
  ],
  "speakers": [
    "Linda McIver"
  ],
  "tags": [
    "LindaMcIver",
    "PyCon",
    "PyConAU",
    "PyConline",
    "Python",
    "pyconau",
    "pyconau_2020"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/FlWChxMtsAs/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLDAKfEAfj7tf9WAUs2R-O34b_twPA",
  "title": "Raising Heretics",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FlWChxMtsAs"
    }
  ]
}