{
  "copyright_text": "CC-BY-NC-SA 4.0",
  "description": "Lucie Krahulcova\n\nhttps://2020.pycon.org.au/program/XWQNFM\n\nTechnosolutionism proves that we need a multidisciplinary approach to tech design. In this session we will use the latest examples of the COVID19 apps to illustrate how a solution can be technically perfect while being perfectly inappropriate as a solution to a given problem. We will work backwards from the location/data sharing/API changes which were happily adopted for covid apps to illustrate how/when those sorts of opportunities can be seized by governments and malicious third parties. We will cover the ways in which every dataset aggregated and generated is likely to be appropriated and abused. Why does that happen? How can we prevent that at the design stages? I will lean on my extensive history in the field to pull together examples where policy and agencies have grabbed at opportunities like this to seize additional power, and use it to highlight the urgency of addressing this issue as we go through the everyday. We can change the chaotic technosolutionism that happens by being better informed and better prepared to do our jobs with a critical eye.\r\n\r\nThe session should leave the audience with a broader understanding of the challenges posed by one-stop-shop-technosolutionism and the essential questions that we as participants in the tech space have a responsibility for baking into our thinking and decision making.\n\nProduced by NDV: https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1\n\nPython, PyCon, PyConAU, PyConline\n\nFri Sep  4 09:15:00 2020 at Python 2",
  "duration": 1951,
  "language": "eng",
  "recorded": "2020-09-06",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2020.pycon.org.au/program/"
    },
    {
      "label": "https://2020.pycon.org.au/program/XWQNFM",
      "url": "https://2020.pycon.org.au/program/XWQNFM"
    },
    {
      "label": "https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1",
      "url": "https://youtube.com/channel/UCQ7dFBzZGlBvtU2hCecsBBg?sub_confirmation=1"
    }
  ],
  "speakers": [
    "Lucie Krahulcova"
  ],
  "tags": [
    "LucieKrahulcova",
    "PyCon",
    "PyConAU",
    "PyConline",
    "Python",
    "pyconau",
    "pyconau_2020"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/2PRSEOJlWVg/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLAeNYn0v0kwEZFWs0jm02Nl-GrP8w",
  "title": "Technosolutionism and human rights",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2PRSEOJlWVg"
    }
  ]
}