{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon APAC 2014", "speakers": ["Stephen McDonald"], "title": "Rapid Web Development with Mezzanine", "quality_notes": "", "video_flv_length": null, "recorded": "2014-08-07", "video_mp4_length": null, "description": "The modern world of Python web development is chock-full of choices today - do we use a micro or a monolithic framework? Do we use a CMS or roll our own? Mezzanine is one project that aims to simplify these questions with a compelling offering for developing Python powered websites.\r\n\r\nIn this talk, Stephen McDonald the creator of Mezzanine will walk through the history of Mezzanine, covering the constraints that have dictated its design, its approach to providing simple yet flexible, rapid web development, through to the software eco-system and community that have developed around it.\r\n\r\n\r\nAbout the speaker\r\n\r\nStephen McDonald is a software engineer who has worked in the web development space since the late 90s, when Netscape Gold and ICQ reigned supreme.\r\n\r\nCurrently Stephen works with several startups using Python and Django. By day he's the technical lead at Mathspace, applying machine learning techniques to transform maths education. By night he works on scaling the news reader Kouio, to handle hundreds of millions of news articles from around the world.\r\n\r\nSomewhere in between these, Stephen is also the creator and maintainer of Mezzanine, one of the most popular CMS projects for the Django framework.", "video_mp4_url": "", "tags": [], "copyright_text": "creativeCommon", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=LQehhjL_BvE", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/LQehhjL_BvE/hqdefault.jpg", "video_flv_url": ""}