{
  "id": 3252, 
  "category": "PyCon APAC 2014", 
  "slug": "real-time-visualization-with-python-and-d3js-py", 
  "title": "Real-time visualization with Python and d3.js", 
  "summary": "", 
  "description": "Pyhton has great power in scrapping and analyzing data, and D3.js is a great tool for building visual interface. In the first part of the talk, I will demonstrate how to set up D3.js as an interactive layer on top of Python. In the second part of the talk, I will show what it can achieve, by using the \"Taiwan Vegetable Auction\" dataset (past 10 years transaction data of 127 kinds of vegetable, 1GB).\r\n\r\nThe dataset is too large for human to see through, a machine learning algorithm will be able to fit a regression model on the dataset, but it can't make sense of it. For example, in the following graph: \r\n\r\nYou can see the average price of green onion in different markets for the past 20 years, the fluctuation between different markets are similar, yet since 2010, there is a perfectly horizontal blue line: while price in the other markets have changes, price in \"Taitung\" has remained exactly the same, suggesting a possible case of monopoly. One can then asks the system to detect other cases of monopoly. This process of exploratory data analysis can only be possible with both machine and human. \r\n\r\nFrom a technical perspective, this talk can benefit front-end developer/data scientist to set up such a system. Yet a more profound value of the talk will be to explore how machine and human can work together. \r\n\r\n\r\nAbout the speaker\r\n\r\nMuyueh Lee (李慕約) is a programmer focus on Data Visualization, for profit and for fun, he hosts \"Visualization Lighting Talk\", a gathering for programmers doing data visualization work in Taiwan, and has been teaching Visualization in the graduate school of Journalism at National Taiwan University, in the DataScience Program by CfT and SYSTEX, and held various workshop in Guangzhou and Hong Kong. A list of his work can be found at http://muyueh.com/1314/", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "creativeCommon", 
  "thumbnail_url": "https://i.ytimg.com/vi/Bzl-Rgmg7vQ/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=Bzl-Rgmg7vQ", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=Bzl-Rgmg7vQ", 
  "tags": [], 
  "speakers": [
    "Muyueh Lee"
  ], 
  "recorded": "2014-06-27"
}