{
  "id": 3258, 
  "category": "PyCon APAC 2014", 
  "slug": "vapoursynth-comes-does-it-indicate-that-avisynth", 
  "title": "VapourSynth comes, does it indicate that AviSynth will shutdown?", 
  "summary": "", 
  "description": "VapourSynth is a powerful tool for video post-production. In contrast to video editing tools with GUI interface, it parses expressions and statements from Python script, builds corresponding filter graph, and cheats output video as regular uncompressed RGB/YUV AVI stream file. Thus, everyone can view video editing result just by playing Python script as a regular AVI file.\r\n\r\nThe concept of VapourSynth is based on AviSynth, the most famous script based video editing tools. However, AviSynth is too old, inefficient, has disorder filter set, and there are many limitations in its specific script language (lack of for/while loop). That is why project holder introduces many advantages into VapourSynth, such as better resource usage, frame level concurrent processing, simplified filter set, and describes video processing flow with Python!\r\n\r\nWill VapourSynth be the future of script based video editing? Let's make some simple VapourSynth scripts and realize what VapourSynth can do!\r\n\r\n\r\nAbout the speaker\r\n\r\nSource:\r\nA little programmer from animation studio. He joins or hosts development of many utilities for animation staff in studio. He is very familiar with AviSynth, and has embedded it into production or exhibition application.\r\n\r\nFaith:\r\nLoves the style of functional programming language, but always uses imperative and object-oriented coding style for real life problem. Believes voxel based rendering is the future, but always works on rendering module with polygon based rendering. Asks friends to own a car with Hybrid Synergy Drive, but drives a car with 4-speed automatic transmission plus inefficient torque converter inside.\r\n\r\nIn another words, lip-service technology geek.", 
  "quality_notes": "", 
  "language": "Chinese", 
  "copyright_text": "youtube", 
  "thumbnail_url": "https://i.ytimg.com/vi/JAAxfAKQeEg/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=JAAxfAKQeEg", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=JAAxfAKQeEg", 
  "tags": [], 
  "speakers": [
    "Hsueh-Tsung Kuo"
  ], 
  "recorded": "2014-06-27"
}