{
    "description": "PyCon Taiwan 2023｜Talk 演講｜Day 1, R0 13:05–13:35\n\n🪄 說明 Description 🪄\nWith the release of Python 3.11 in October 2022, PEP 654 \"Exception Groups and except\" was accepted, and asyncio.TaskGroup() was added. This enhancement of exception and cancellation handling has allowed asyncio to evolve more flexibly, addressing the existing issues with asyncio APIs, such as insufficient cancellation and exception handling in asyncio.gather.\r\n\r\nIn this talk, I would like to discuss the problems of existing asyncio APIs and how the newly introduced asyncio.TaskGroup() solves these issues. Attendees will learn about the improved way of handling exceptions and cancellations using asyncio.TaskGroup(), enabling them to write more efficient and robust asynchronous code with Python 3.11.\n\n\n\n🚀 講者介紹 About Speaker - Junya Fukuda 🚀\nDevelops \"LOVOT\", a family-like robot that promotes the ability to love, at GROOVE X, Inc. He has spoken at PyCon JP, DjangoCongress JP, EuroPython, and other events. As a community activity, he participates in the management of GeekLab Nagano. Co-author of \"Python Practical Recipes (2022 Gijutsu Hyoron Co., Ltd.)\". Translation of \"Expert Python Programming - Fourth Edition\". Likes beer, camping, and asyncio.\n\n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://conf.python.tw/",
    "speakers": [
        "Junya Fukuda"
    ],
    "recorded": "2023-09-02",
    "title": "Asyncio Evolved: Enhanced Exception Handling with Python 3.11 TaskGroups｜Junya Fukuda｜PyCon TW 2023",
    "thumbnail_url": "https://i.ytimg.com/vi/h8VEyMq54po/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=h8VEyMq54po"
        }
    ]
}