{
    "description": "PyCon Taiwan 2023｜Talk 演講｜Day 2, R0 13:05–13:35\n\n🪄 說明 Description 🪄\nYou might already know about how Python can automate tasks using data stored in files or by making API calls, but what about more when the task is more complex? In this talk we'll explore the power of intuitive Python libraries for I/O, then use them to automatically beat an in-browser video game using the same strategies and inputs as a human. We’ll also discuss applying basic project management skills to take personal projects from ideas to successes. Whether you want to help robots take over the world or a good reminder of why you have to prove you’re human online, this talk is for you!\n\n🚀 講者介紹 About Speaker -  Jon Gaul🚀\nGraduating from Georgia Tech with a dual degree in Computer Science and Chemical Engineering, Jon has long held a passion for investigating how the world works and how theory transforms into practice. This sense of curiosity has led him to Tokyo, Japan, where he works as a software engineer at HENNGE. He is excited to share his knowledge and deepen his relationship with the Python community.\n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://conf.python.tw/",
    "speakers": [
        "Jon Gaul"
    ],
    "recorded": "2023-09-03",
    "title": "Automating Victory: Beating browser games with accessible Python｜Jon Gaul｜PyCon TW 2023",
    "thumbnail_url": "https://i.ytimg.com/vi/V6e8-BfwLUo/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=V6e8-BfwLUo"
        }
    ]
}