{
    "description": "PyCon Taiwan 2023｜Talk 演講｜Day 1, R2 11:35–12:05\n\n🪄 說明 Description 🪄\nData cleaning and transformation are critical steps in any data-related project, including data analysis, machine learning, and business intelligence. However, these tasks can be challenging due to the various methods available and the lack of standardization in the process. In this speech, I will discuss the specific challenges I faced while cleaning and transforming video metadata. I will also introduce some solutions that I have found helpful in my work, such as the use of systematic data cleaning processes like Data Build Tool(DBT) and data pipeline quality monitoring tools like PipeRider. By combining these tools and techniques, we can improve the efficiency and reliability of data transformation and enhance the overall data application process. The goal of this speech is to show how DBT and PipeRider can help create a more efficient, scalable, and error-free data transformation pipeline.\n\n🪧 投影片 Slides：https://docs.google.com/presentation/d/e/2PACX-1vSXyJm9M-BUzaZfAlfH6ZBwpr15Gw5OtlVTJFqBsW9-t0XN6Ns2A5xmS4a1d0c_IS5tOn2-uRTWkMBe/pub?start=false&loop=false&delayms=3000\n\n🚀 講者介紹 About Speaker - Iris Chen 🚀\nAs a fresh graduate stepping into the professional world, I am filled with enthusiasm for every aspect of data.\n\n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://conf.python.tw/",
    "speakers": [
        "Iris Chen"
    ],
    "recorded": "2023-09-02",
    "title": "Challenges in Data Cleaning and Transformation: Mistakes, Confusion, ...｜Iris Chen｜PyCon Taiwan 2023",
    "thumbnail_url": "https://i.ytimg.com/vi/_elz-bzrG4s/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=_elz-bzrG4s"
        }
    ]
}