{
    "description": "PyCon Taiwan 2023｜Talk 演講｜Day 2, R2 10:40–11:25\n\n🪄 說明 Description 🪄\nOpen source communities are amazing! They bring together people who share common altruistic goals, and the magic of collaboration and innovation flourishes. However, despite the abundance of positive outcomes, community stewards often face challenges such as burnout and succession planning. So the question remains: how do we make this good thing last?\r\n\r\nManaging a long-running organization is not easy but it can also be very fulfilling. By prioritizing leadership development and implementing measures to prevent burnout, we can ensure that our open source communities endure and continue to make an impact.\n\n\n\n🚀 講者介紹 About Speaker - Matt Lebrun 🚀\nMatt is a software engineer and the president of the Python Philippines community. He is also a Python Software Foundation Fellow.\r\n\r\nAs a community leader, he recognizes that burnout is a real and common problem among community members. He strives to create an environment where people can grow and develop themselves without experiencing burnout. He and the other leaders are working hard to achieve this goal, and things seem to be going well so far.\r\n\r\nMatt is also a coffee and peanut butter enthusiast.\n\n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://conf.python.tw/",
    "speakers": [
        "Matt Lebrun"
    ],
    "recorded": "2023-09-03",
    "title": "(PythonPH) One Does Not Simply Create a Lasting Tech Community｜Matt Lebrun｜PyCon TW 2023",
    "thumbnail_url": "https://i.ytimg.com/vi/FFmIaazm__I/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=FFmIaazm__I"
        }
    ]
}