{
    "description": "PyCon Taiwan 2023｜Talk 演講｜Day 2, R2 13:05–13:35\n\n🪄 說明 Description 🪄\nThe intersection of UX and Python programming is a powerful combination for building great products and enhancing user experience. Python is a versatile and popular programming language that is widely used for a variety of tasks, including web development, data analysis, and machine learning. UX, or user experience, is the process of designing products that provide a seamless and intuitive experience for users.\r\n\r\nLearn about this powerful intersection of UX design and Python programming by understanding how Python can be used to enhance the user experience and provide practical examples on how UX designers can automate tasks, gather and analyze data, develop personalized experiences, and continually improve their own skills and processes.\n\n\n\n🚀 講者介紹 About Speaker - Neeraj Pandey 🚀\nNeeraj is a polyglot and open-source contributor. Over the years, he has spoken at multiple international Python conferences and has worked on a variety of full-stack software and data science applications, as well as computational arts and quantitative finance projects. He enjoys the challenge of creating new tools and applications.\n\n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://conf.python.tw/",
    "speakers": [
        "Neeraj Pandey"
    ],
    "recorded": "2023-09-03",
    "title": "Python Meets UX: Enhancing User Experience with Code｜Neeraj Pandey｜PyCon Taiwan 2023",
    "thumbnail_url": "https://i.ytimg.com/vi/zOS5ciDrdqg/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=zOS5ciDrdqg"
        }
    ]
}