{
    "description": "PyCon Taiwan 2023｜Talk 演講｜Day 1, R2 13:05–13:35\n\n🪄 說明 Description 🪄\nPolars, the high-performance data manipulation library for Python and Rust, has been gaining traction as a promising alternative to Pandas for certain types of data analysis and manipulation tasks. With its optimized implementation of data structures and algorithms, Polars offers superior performance in joining, aggregating, and manipulating large datasets.\r\n\r\nIf you're looking to revolutionize your data workflow, Polars may just be the ultimate replacement for Pandas. Whether you're working with big data, complex operations, or demanding computational tasks, Polars can help you get the job done faster and more efficiently.\r\n\r\nIn this presentation, we'll take a closer look at the advantages of using Polars over Pandas, and explore some real-world examples of how Polars can improve your data workflow. We'll also discuss some of the key features and functionalities of Polars, including its support for multi-threading, columnar memory layout, and native integration with Rust.\n\n🪧 投影片 Slides：https://slides.com/d/dFhlMlI/live\n\n🚀 講者介紹 About Speaker - YVictor 🚀\nSpecializing in Event-Driven Architecture for trading, my focus is designing and implementing systems that empower businesses in the financial industry. With expertise in event-driven messaging patterns, microservices, and workflows, I create architectures that enhance trading systems' speed, reliability, and scalability. I help organizations achieve higher agility by embracing event-driven principles and gaining a competitive advantage in fast-paced markets.\n\n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://conf.python.tw/",
    "speakers": [
        "YVictor"
    ],
    "recorded": "2023-09-02",
    "title": "Revolutionize Your Data Workflow with Polars: The Ultimate Pandas Replacem｜YVictor｜PyCon Taiwan 2023",
    "thumbnail_url": "https://i.ytimg.com/vi/QyW23zd2FXk/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=QyW23zd2FXk"
        }
    ]
}