{
    "description": "PyCon Taiwan 2023｜Talk 演講｜Day 2, R2 13:45–14:15\n\n🪄 說明 Description 🪄\n[Streamlit](https://streamlit.io/) is a popular framework for interactive web-based data apps in Python. However, there are some cases where users want to run their apps offline or without sending sensitive data to remote servers. To address these concerns, we introduce '[stlite](https://github.com/whitphx/stlite)': a WebAssembly port of Streamlit. It provides offline capability, data privacy, scalability, and multi-platform portability including desktop app packaging, while preserving Streamlit's original features, such as Python productivity and its rich ecosystem.\r\n\r\nIn this talk, we will discuss the benefits of stlite and demonstrate how to build and deploy stlite applications in a variety of ways, using ML/CV examples.\r\nWe will also look at its internals from a technical point of view, which may inspire you with ideas on how to make use of Pyodide and how to transform Python frameworks for the Pyodide/Wasm runtime.\r\n\r\nYou can try out stlite online: https://edit.share.stlite.net/\n\n🪧 投影片 Slides：https://slides.com/whitphx/streamlit-meets-webassembly-stlite\n\n🚀 講者介紹 About Speaker - Yuichiro Tachibana 🚀\nYuichiro works as a professional software developer and also loves contributing to OSS projects.\r\nAs a Pythonista, he has participated in various projects including web development, multimedia streaming, data management, computer vision, and machine learning.\n\n\nFollow “PyCon Taiwan”\n⭐️ Official Website: https://tw.pycon.org\n⭐️ Facebook: https://www.facebook.com/pycontw\n⭐️ Instagram: https://www.instagram.com/pycontw\n⭐️ Twitter: https://twitter.com/PyConTW\n⭐️ LinkedIn: https://www.linkedin.com/company/pycontw\n⭐️ Blogger: https://conf.python.tw/",
    "speakers": [
        "Yuichiro Tachibana"
    ],
    "recorded": "2023-09-03",
    "title": "Streamlit meets WebAssembly - stlite｜Yuichiro Tachibana｜PyCon Taiwan 2023",
    "thumbnail_url": "https://i.ytimg.com/vi/fYB5hhM7P8k/hqdefault.jpg",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=fYB5hhM7P8k"
        }
    ]
}