{
  "description": "Brief Summary\nWhat happens when you run out of processing power on your laptop? You could scale up - get more efficient hardware, or scale out - add more machines. Whichever you choose, there are great tools for accomplishing scale within the Jupyter ecosystem. This talk presents Dask and RAPIDS for parallel and GPU computing, and how to launch and manage clusters all within JupyterLab.\n\nOutline\nWhat happens when you run out of processing power on your laptop? You could scale up - get more efficient hardware, or scale out - add more machines. Whichever you choose, there are great tools for accomplishing scale with the Python and Jupyter ecosystem. Dask is a parallel computing framework that scales from your laptop to a cluster of thousands of machines. RAPIDS is a GPU-computing framework that pushes traditional CPU workloads to the GPU. Dask and RAPIDS together allow you to scale both up and out! This talk will help you navigate this exciting new world, and show how easy it is to get your workloads running faster in Jupyter.\n\nOutline\n\nThe state of single-node CPU workloads: why do we need clusters and GPU computing?\n\nIntro to Dask (Python-native cluster computing)\n\nIntro to RAPIDS (Python-native GPU computing)\n\nCode examples:\n\nLaunch Dask cluster and monitor in JupyterLab with dask-labextension\n\nLarge-scale data processing across the cluster\n\nFast ML model training with RAPIDS\n\nPrerequisites: a working knowledge of data science with Python (pandas, numpy, scikit-learn, etc.). No cluster computing experience necessary - this is what you will learn from the talk!",
  "duration": 1670,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "Aaron Richter"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/dCk-uQIhmAQ/sddefault.jpg",
  "title": "High performance Jupyter: faster workloads with Dask and RAPIDS",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dCk-uQIhmAQ"
    }
  ]
}
