{
  "description": "Brief Summary\nThe Pulse Physiology Engine is a C++ based, open source, dynamic, faster than real time human physiology simulator that drives medical education, research, and training technologies. The engine enables accurate and consistent physiology simulation across the medical community. The engine can be used as a standalone application or integrated with simulators, sensors, and models of all fidelity.\n\nOutline\nIn this talk, we will present our Pulse Physiology Engine along with how we have integrated it with Jupyter Notebooks.\n\nThe Pulse Physiology engine’s role in scientific research is to simulate a patient’s physiological condition during disease, trauma, and treatment. We have paired our engine with multiple simulation modalities for training medical professionals and caregivers in appropriate trauma treatment. Combining our engine with Jupyter Notebooks will allow more users to easily interact with the models to explore the changes in physiology throughout disease and injury and how treatment and timing affect the patient’s recovery.\n\nOur notebooks are targeted to developers, researchers, and students to explore the many aspects of human physiology available in Pulse. Pulse provides a Python API for creating customized patients and exploring how various insults, injuries and underlying patient conditions change the underlying physiology and abilities of a patient.\n\nInteractivity is extremely important to using Pulse and we will discuss various user interface options we have explored to provide end users an intuitive and interactive experience in our Notebooks. Specifically, viewer widgets used to plot real-time data from Pulse in 2D graph views.",
  "duration": 739,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "Aaron Bray"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/jPh2NL_tZgc/sddefault.jpg",
  "title": "Pulse Physiology Engine",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jPh2NL_tZgc"
    }
  ]
}
