{
  "description": "Brief Summary\nThe transform/feedback mechanism of WebGL2 allows Javascript programs running in a browser to use the GPU to implement novel graphics processing stages and other computations. This talk outlines the transform/feedback processing model and describes how it can be embedded in a Jupyter context to generate iso-surfaces, clustering, graph layouts, and other highly parallel computations.\n\nOutline\nThe transform/feedback mechanism of WebGL2 allows Javascript programs running in a browser to use the graphics processor (GPU) to implement novel graphics processing stages and other computations. This talk outlines the transform/feedback processing model and describes a three dimensional isosurface generator implemented using transform/feedback as well as WebGL instanced rendering. The isosurface generator is integrated with the three.js graphics modelling library to create visualizations of scientific data for use in web pages or Jupyter notebooks. The talk also demonstrates some uses of isosurfaces for visualizing and exploring spatial genomics, quantum physics, astrophysical phenomena, and other mathematical structures. The talk will also explore other possible applications of transform/feedback to implement particle system simulations, matrix operations, classification algorithms, statistical clustering or other large scale highly parallel computations. This presentation discusses components of the feedWebGL2 github library which provides several abstraction layers built over the basic WebGL2 Javascript API and also exposes the transform feedback functionality to Jupyter notebooks using a widget interface.\n----\nJupyterCon brings together data scientists, business analysts, researchers, educators, developers, core Project contributors, and tool creators for in-depth training, insightful keynotes, networking, and practical talks exploring the Project Jupyter ecosystem.\n\nhttps://jupytercon.com/ \n\nJupyterCon is possible thanks to the generous support of our sponsors, and the labor of many volunteer organizers. \n\nhttps://jupytercon.com/sponsors/ \nhttps://jupytercon.com/about/#Organizing%20Committee (edited) \n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020",
  "duration": 1546,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/zJmZ2v_lIeg/sddefault.jpg",
  "title": "Aaron Watters - Using WebGL2 transform/feedback in Jupyter widgets | JupyterCon 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zJmZ2v_lIeg"
    }
  ]
}
