{
  "description": "Brief Summary\nNotebooks have been an unexpected innovation in how software is written. They have lowered the bar for writing scripts, unlocking huge amounts of scientific productivity.\n\nBut are they going to make it into 'production software'?\n\nI'm going to introduce Treebeard's notebook CI framework and how we built it with Papermill, Repo2Docker, and GitHub Actions.\n\nOutline\nIn this talk I will describe the evolution of notebook use-cases and the great potential of investing in adjacent tooling.\n\nGiven my perspective from working in devops on large websites, I'd like to impress that the Jupyter project has discovered not just a great product for exploratory data science, but for software engineering more generally.\n\nFinally I'd like to introduce the problem area we are working on -- continuous integration, in order to accelerate what we see as a beneficial progression in software.\n\nBackground required:\n\nIntermediate-level programming\nBasic infrastructure knowledge (awareness of Docker, CI)\n----\nJupyterCon brings together data scientists, business analysts, researchers, educators, developers, core Project contributors, and tool creators for in-depth training, insightful keynotes, networking, and practical talks exploring the Project Jupyter ecosystem.\n\nhttps://jupytercon.com/ \n\nJupyterCon is possible thanks to the generous support of our sponsors, and the labor of many volunteer organizers. \n\nhttps://jupytercon.com/sponsors/ \nhttps://jupytercon.com/about/#Organizing%20Committee (edited) \n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020",
  "duration": 700,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/_zy7iLZ7-ts/sddefault.jpg",
  "title": "Alex Remedios - Introducing a simple notebook continuous integration workflow | JupyterCon 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_zy7iLZ7-ts"
    }
  ]
}
