{
  "description": "Brief Summary\nThe proposal is about data science in educational institutes, . An educational institute, always deals with huge amount of students data. The data input starts from admission process and get enhanced year by year on the basis of courses, exams and events opted by a student. Here Data Science plays a bigger role. Jupyter Notebook is extremely helpful to perform data science activities properly.\n\nOutline\nThe Proposal is about an applications of Data Science (a case study), i.e. how data science plays a bigger role in educational institutes. The target audience is intermediate level that may have basic skills of data science and python language.\n\nThe proposal is briefly focuses on Student Registration Process and designing and framing course time table. 1. Student Registration Process:- In this section, our focus would be on following points, a. Total number of Registrations. b. Actual number of registrations. c. Course wise registrations. d. How many courses are there with zero registrations, minimum and maximum registrations. 2. Designing and Framing Course Time Table:- In this section, our focus would be on following points, a. Generation of course time table on the basis of faculty details. b. Finding details of an individual faculty and individual course on the basis of time table details.",
  "duration": 727,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "Anjali Mathur"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/qxy34nqTL3w/sddefault.jpg",
  "title": "Role of Jupyter Notebook in performing Data Science activities.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qxy34nqTL3w"
    }
  ]
}
