{
  "description": "Brief Summary\nIn this talk, we introduce GESIS Notebooks, a public JupyterHub deployment that enables users to persistently import projects using the mechanisms of MyBinder. The talk is relevant for researchers and lecturers that want to work persistently with one of the many existing binder-ready projects as well as for system administrators.\n\nOutline\nKenan Erdogan and Arnim Bleier offer an overview of GESIS Notebooks (notebooks.gesis.org), a JupyterHub deployment that enables users to import and update projects using the mechanisms of MyBinder. The platform drastically lowers the bar for researchers, lecturers, and students to start their own persistent cloud-based notebook server with an environment that is tailored to their needs or to build on one of the many existing binder-ready analysis pipelines. The cornerstone of our infrastructure, the Persistent BinderHub, enables us to support the heterogeneous computational needs of our community while reducing the costs of maintaining this infrastructure as compared to other alternatives.\n\nThe 30-minute talk begins with an overview of the computational needs in the Computational Social Science community. We then showcase the use and utility of the platform from a user perspective. Finally, we demonstrate how the open-source platform can be deployed from an administrator’s point of view.",
  "duration": 1549,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "Arnim Bleier"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/dwidVhPtQT4/sddefault.jpg",
  "title": "A Persistent BinderHub",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dwidVhPtQT4"
    }
  ]
}
