{
  "description": "Brief Summary\nThe talk highlights real examples of Jupyter notebooks converted to Voilà dashboards for policy support. Whether for monitoring the COVID-19 spread and its effect on NO2 emissions, the giant forest fires in Australia or the progression of deforestation in the Amazon, Voilà dashboard is the perfect tool for rendering heterogeneous data using widgets in view of discovering policy relevant insights\n\nOutline\nThe objective of this proposal is to demonstrate how important Voilà is in a policy-making context. A multifaceted Big Data infrastructure based on Jupyter notebooks for data science and analysis is a perfect playground to attract scientist and researchers, but to reach a wider audience and to influence top-level decisions, a simpler tool is needed. Voilà hides any unnecessary detail and makes users concentrate on the essence that emanates from intersecting complex datasets. Through the demonstrated dashboards, the attendees will have an idea of some real usage of Voilà and Jupyter in environmental monitoring applications that exploit the ample usage scopes of the satellite images acquired by the EU Copernicus Programme. Without requiring any previous knowledge on Remote Sensing, the demonstrated dashboards will highlight how satellite images can be of great importance in assessing the impact of natural phenomena.",
  "duration": 725,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "Davide De Marchi"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/FR_izZ6yHnQ/sddefault.jpg",
  "title": "Voilà dashboards for policy support",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FR_izZ6yHnQ"
    }
  ]
}
