{
  "description": "Brief Summary\nTraditional wet labs are embracing data science as a tool for high throughput data analysis. However, synthesizing experimentalists with an effective data science strategy can be a difficult task due to differences in expertise, terminology, and workflow habits. We utilize Jupyter Notebook to effectively collaborate with experimentalists and integrate experimental and data science.\n\nOutline\nObjective: Demonstrate the effectiveness of well-designed, experimental data informed Jupyter notebooks for collaboration between data scientists and experimantalists.\n\nCentral Thesis: Jupyter notebook is an approachable platform to support collaboration between trained data scientists with expert domain scientists in neuroimaging.\n\nOutline of Talk:\n\nIntroduction\n\na. Brain cell morphology from a wet lab experimentalist perspective\n\nb. Data science from the wet lab experimentalist perspective\n\nc. Brain cell morphology from a data science perspective\n\nThe Merger Between Data and Experimental Science\n\na. Introduction of our work on FIBER, a Framework for neuroImage Based Experimental Routines\n\nThe Creation of a Notebook\n\na. Applicable steps from FIBER to design a data science project alongside the domain scientists\n\nb. Initial Set-Up of a notebook with domain scientists in mind\n\nUtilization of a Jupyter Notebook to Produce Cell Morphology results\n\na. Demo and walk through as a Data Scientist\n\nb. Demo and walk through as a Experimentalist\n\nConclusion\n\na. Review of Jupyter Notebook as an avenue of merging data and experimental science\n\nb. Insight into additional and future possibilities\n\nKey Takeaways: 1. An approach to discussing data science analysis with experimental scientists 2. A framework for creating Jupyter Notebooks that allow both sides to understand and utilize the analysis pipeline\n\nBackground Knowledge Expected from Attendees: None",
  "duration": 717,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "Hawley Helmbrecht"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/uTi2Rs9vt0w/sddefault.jpg",
  "title": "Jupyter Notebook as a Medium",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uTi2Rs9vt0w"
    }
  ]
}
