{
  "description": "Brief Summary\nJupyter + Spark is a powerful combination in your data science toolkit to handle big data. In this talk, we explore running Jupyter on a cluster of machines in the cloud. Using PySpark, we construct a pipeline for machine learning (LDA Topic Modeling) on 2.8 million news articles on COVID-19.\n\nOutline\nIn recent years, cloud providers (AWS, Azure, GCP) have simplified deploying and managing Jupyter Notebooks on Spark clusters. Giving notebooks with computational powers of Spark clusters unlocks data scientists to handle today’s explosion of big data. As an example of how to use Jupyter + Spark to tackle real-world big data problems, I will show you how I analyze and built machine learning models on all news articles available online relating to COVID-19.\n\nIn this talk, we will cover: 1) How to spin up a Spark cluster with Jupyter Notebook on Google Cloud; 2) Using 16-node cluster with 1TB+ RAM for LDA topic modeling; 3) Visualizing Spark results in Jupyter Notebook.\n\nThis talk is designed for intermediate users of Jupyter with novice users in mind. To get the most out of the talk, attendees should have a general knowledge of distributed computing and cloud computing.",
  "duration": 1552,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "Jason Yang"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/6EXduOkSgI4/sddefault.jpg",
  "title": "Distributed Computing using Jupyter Notebooks with Spark",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6EXduOkSgI4"
    }
  ]
}
