{
  "description": "Brief Summary\nJupyter is great for interactive computing, letting you test, experiment, and iterate easily. But what then? How do you turn the results of your journey into code that others can use, or into a publication?\n\nThis is where nbdev and fastdoc come in. nbdev turns your notebook into a complete packaged python library, and fastdoc turns it into a publication quality book.\n\nOutline\nNbdev is a system for something that we call exploratory programming. Exploratory programming is based on the observation that most of us spend most of our time as coders exploring and experimenting. We believe that the very process of exploration is valuable in itself, and that this process should be saved so that other programmers (including yourself in six months time) can see what happened and learn by example. Think of it as something like a scientist’s journal. You can use it to show the things that you tried, what worked and what didn’t, and what you did to develop your understanding of the system within which you are working. During this exploration, you will realize that some parts of this understanding are critical for the system to work. Therefore, the exploration should include the addition of tests and assertions to ensure this behavior.\n\nWith Nbdev and fastdoc, exploratory programming can be used to create complete books and software projects.",
  "duration": 3551,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "Jeremy Howard"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/HKt19-GsA1I/maxresdefault.webp",
  "title": "Creating delightful libraries and books with nbdev and fastdoc",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HKt19-GsA1I"
    }
  ]
}
