{
  "description": "Brief Summary\nJupyter Notebooks are awesome tools for research and development, but as soon as you're happy with the outcome the usual process is to throw a messy notebook to a developer and ask them to reproduce it but... not in Jupyter. In this talk, I will explain how we've managed to circumvent the re-implementation step and use the notebooks in production - and how you can do the same.\n\nOutline\nBackground required: not much!\n\nJupyter has a bunch of tooling which can help with productionisation, and this talk aims to go over some of the issues that I encountered and how I resolved them. Back in 2018, I created a webapp called Notebooker, open-sourced at https://github.com/man-group/notebooker, which aims to address these issues:\n\nreviewability - how can I review the code?\ntemplating - how can I re-use a notebook?\nparametrization - how to execute the exact same notebook for e.g. 100 different stocks?\ntestablity - how can we be sure it works?\nexecutable - how can we execute the notebook reliably i.e. on-demand or scheduled?\nbrowseable - how can we view or search for results?\nsecured - how can we prevent unauthorised access to sensitive results?\nusability - how can we make sure that non-technical users can deploy without getting stuck?\nI'll go over each point and discuss a) the open source tooling available to address each and b) how I chose to address it in Notebooker. As part of this talk I will heavily mention some key elements, namely jupytext and papermill, which are the foundations upon which Notebooker was built.\n\nIn the talk I'm mostly hoping to share my experience as a developer who has had notebooks thrown in his direction for productionisation in the past and spread the knowledge of helpful libraries to attendees who may be facing the same issue. I'd also love to invite contributors who like the Notebooker project to join in.\n----\nJupyterCon brings together data scientists, business analysts, researchers, educators, developers, core Project contributors, and tool creators for in-depth training, insightful keynotes, networking, and practical talks exploring the Project Jupyter ecosystem.\n\nhttps://jupytercon.com/ \n\nJupyterCon is possible thanks to the generous support of our sponsors, and the labor of many volunteer organizers. \n\nhttps://jupytercon.com/sponsors/ \nhttps://jupytercon.com/about/#Organizing%20Committee (edited) \n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020",
  "duration": 1427,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://github.com/man-group/notebooker,",
      "url": "https://github.com/man-group/notebooker,"
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/jjctkI6CRyg/sddefault.jpg",
  "title": "Jon Bannister - Notebooker: From research to production in a snap using Jupyter |JupyterCon 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jjctkI6CRyg"
    }
  ]
}
