{
  "description": "Brief Summary\nExplore a platform that uses Jupyter to enable system administrators and operators to interact with the system and use this infrastructure to manage and analyze large HPC systems through a simple yet powerful interface.\n\nOutline\nIn this talk we will explore the use of Jupyter as a platform for system administrators and operators to help manage, triage and gain insight into HPC systems. We will explains how the Jupyter framework lends itself to managing systems and makes notebooks a good choice for scheduling tasks and system analysis. We will share how HPE is proposing to use this infrastructure to manage its next generation of exascale systems.\n\nJupyter provides a unique environment to enable these use cases and workflows. It allows for interactive sessions as well as analysis, while allowing other users to review and collaborate on tasks. We will explore the new JupyterLab interface, which offers all the familiarity of the classic Jupyter Notebook with a next-generation UI, providing the flexibility, power, and extensibility needed to support the rich user experience for users’ workflows.\n----\nJupyterCon brings together data scientists, business analysts, researchers, educators, developers, core Project contributors, and tool creators for in-depth training, insightful keynotes, networking, and practical talks exploring the Project Jupyter ecosystem.\n\nhttps://jupytercon.com/ \n\nJupyterCon is possible thanks to the generous support of our sponsors, and the labor of many volunteer organizers. \n\nhttps://jupytercon.com/sponsors/ \nhttps://jupytercon.com/about/#Organizing%20Committee (edited) \n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020",
  "duration": 485,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/PwLikMAbPeU/sddefault.jpg",
  "title": "Jonathan Sparks - Exascale system management using Jupyter notebooks | JupyterCon 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PwLikMAbPeU"
    }
  ]
}
