{
  "description": "Brief Summary\nSince IBM put online the first cloud accessible quantum computer in 2016, there has been a surge of interest in accessing these systems. Among the different tools that IBM Quantum Experience provides to the quantum computing community, the cloud-based Jupyter Notebooks are a core part. This talk introduces how we enable ~240,000 users to use these notebooks via a JupyterHub deployed in Kubernetes.\n\nOutline\nHow can we enable a complete online experience for IBM’s Quantum Experience (https://quantum-computing.ibm.com/) users to access all of our quantum devices and software libraries effortlessly? That question fired a research and engineering process at the core of the IBM Quantum cloud software team to provision, and integrate with our software, a JupyterHub deployment on Kubernetes available for ~240000 enrolled users. In this talk, we discuss how we have integrated JupyterHub with our already existing IBM Quantum Experience platform and how we are leveraging the power of the JupyterHub to provide the best experience to the users. Among other aspects, during the presentation, we cover how we have solved, and we're still addressing issues related to custom authentication with our platform, performance, look & feel, permanent storage per user, user environment tailoring, provision of pre-installed software like Qiskit (https://qiskit.org/) and other quantum-related software and tutorials, automation of the selection of custom hardware resources for different users, how we deal with malicious users, or how we handle ~800 concurrent user servers during our last May 4th challenge (https://www.ibm.com/blogs/research/2020/05/quantum-challenge-results/). To conclude the presentation, we will share some final reflections of our experience and plans we have to continue developing our platform and contributing to the Jupyter ecosystem.\n----\nJupyterCon brings together data scientists, business analysts, researchers, educators, developers, core Project contributors, and tool creators for in-depth training, insightful keynotes, networking, and practical talks exploring the Project Jupyter ecosystem.\n\nhttps://jupytercon.com/ \n\nJupyterCon is possible thanks to the generous support of our sponsors, and the labor of many volunteer organizers. \n\nhttps://jupytercon.com/sponsors/ \nhttps://jupytercon.com/about/#Organizing%20Committee (edited) \n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020",
  "duration": 538,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://www.ibm.com/blogs/research/2020/05/quantum-challenge-results/",
      "url": "https://www.ibm.com/blogs/research/2020/05/quantum-challenge-results/"
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://qiskit.org/",
      "url": "https://qiskit.org/"
    },
    {
      "label": "https://quantum-computing.ibm.com/",
      "url": "https://quantum-computing.ibm.com/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/2-X8dSE4dLE/sddefault.jpg",
  "title": "Juan Cruz Benito - IBM Quantum Experience Notebook | JupyterCon 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2-X8dSE4dLE"
    }
  ]
}
