{
  "description": "Brief Summary\nAt J.P. Morgan, traders, researchers, and engineers use Jupyterlab and Perspective, a high-performance streaming data visualization library, for analytics across large, real-time datasets. Junyuan Tan demonstrates how Perspective and Apache Arrow can be used to accumulate, dissect, and visualize streaming data—all within a Jupyter Notebook.\n\nOutline\nMany data visualization libraries are built with static data in mind, where everything is known before the visualization is created. Analyzing data streams in real-time, however, is a crucial part of many industries. Combining JupyterLab’s ease-of-use and flexibility with Perspective, a high-performance streaming data visualization library, users can rapidly prototype, analyze, and visualize results from a multitude of data sources both live and static.\n\nUsing real-time stock quotes from the IEX Cloud API, Junyuan Tan demonstrates how Perspective can be used to visualize streaming data, combine real-time information with analysis and data points from various sources, and export data snapshots using Apache Arrow, without leaving the Jupyter Notebook.\n\nAttendees will learn:\n\nHow to accumulate data from a streaming datasource in a Perspective table\nVisualizing, charting and analyzing data in real-time using PerspectiveWidget\nChaining multiple Perspective tables to create your own augmented, streaming data sources\nStreaming, exporting, and storing data in the Apache Arrow format, and reintegrating that data back into Perspective\nA working knowledge of Python is recommended but not required.\n\nLinks:\n\nNotebooks/Presentation Materials: https://github.com/sc1f/streaming-perspective-jupytercon-2020\n\nPerspective: https://perspective.finos.org/\n\nApache Arrow: https://arrow.apache.org/\n----\nJupyterCon brings together data scientists, business analysts, researchers, educators, developers, core Project contributors, and tool creators for in-depth training, insightful keynotes, networking, and practical talks exploring the Project Jupyter ecosystem.\n\nhttps://jupytercon.com/ \n\nJupyterCon is possible thanks to the generous support of our sponsors, and the labor of many volunteer organizers. \n\nhttps://jupytercon.com/sponsors/ \nhttps://jupytercon.com/about/#Organizing%20Committee (edited) \n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020",
  "duration": 1576,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://github.com/sc1f/streaming-perspective-jupytercon-2020",
      "url": "https://github.com/sc1f/streaming-perspective-jupytercon-2020"
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://arrow.apache.org/",
      "url": "https://arrow.apache.org/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    },
    {
      "label": "https://perspective.finos.org/",
      "url": "https://perspective.finos.org/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/IO-HJsGdleE/sddefault.jpg",
  "title": "Junyuan Tan - Streaming, cross-sectional data visualization in Jupyterlab | JupyterCon 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IO-HJsGdleE"
    }
  ]
}
