{
  "description": "Brief Summary\nData visualization is a huge field. Now some of the key things to take away from this field without going, becoming an expert in data visualization are, it's a delicate skill, so you have to be careful not to exaggerate, even though you have so many tools at your disposal sometimes using less is more. In this talk we're going to look at some more advanced ways to visualize our data.\n\nOutline\nAdvanced Data Visualization gives a new meaning on how pictures can simplify information needed to comprehend complex questions. Advanced Data Visualization displays data through interactive data visualization, multiple dimension views, animation, and auto focus. The road map of talk structure goes like this. First we're going to give an introduction to information dense visualizations, a way of basically showing multiple layers of data and different data within a single plot. Then we're going to look at how to visualize correlation, the similarity or Association of different variables. Following that we're going to show technique called linear regression to build a simple linear model describing the real-world behavior of our data. Lastly, when we expand our exploration of multiple variables, showing even more types of data, we're going to use a technique called correlation matrix, the quickly showed the correlation between all the different combinations of variables.\n----\nJupyterCon brings together data scientists, business analysts, researchers, educators, developers, core Project contributors, and tool creators for in-depth training, insightful keynotes, networking, and practical talks exploring the Project Jupyter ecosystem.\n\nhttps://jupytercon.com/ \n\nJupyterCon is possible thanks to the generous support of our sponsors, and the labor of many volunteer organizers. \n\nhttps://jupytercon.com/sponsors/ \nhttps://jupytercon.com/about/#Organizing%20Committee (edited) \n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020",
  "duration": 750,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/T2I2B5dQ-_w/sddefault.jpg",
  "title": "Kalyan Akkapantula - Advanced Visualization in Jupyter Notebooks | JupyterCon 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=T2I2B5dQ-_w"
    }
  ]
}
