{
  "description": "Brief Summary\nData should serve communities and not just corporate polluters. The goal of this project is to use the power of Jupyter Notebooks to visualize publicly available data in a way that encourages folks to hold the government and industries accountable.\n\nOutline\nOur team created a series of Jupyter Notebooks that allow for customizable reports on emissions, inspections, compliance, and enforcement data stored in the US Environmental Protection Agency (EPA)’s Enforcement and Compliance History Online (ECHO) database. ECHO includes compliance data on air, water, and hazardous waste laws for all facilities. Data should serve communities and not just corporate polluters. Communities should be able to have more resources for collecting and analysing environmental data while retaining the power to decide what they can do with their data. We wrote code using GeoPandas, NumPy, MatPlotLib, and Seaborn libraries to generate reports based on the data. Users simply run the notebook to generate a report for their area of interest. We have Notebooks set up to generate several different types of reports: analyzing inspections, violations, enforcement actions, and greenhouse gas emissions by zip-code, congressional district, or watershed; or investigating a company, location, or facility of concern across regulatory statutes. The data visualizations also explore environmental racism -- the disproportionate impact of environmental hazards on people of color. By making environmental compliance data more accessible and pliable through our Jupyter Notebooks, and supplementing the numbers with storytelling, data visualization, and socio-political contextualization, we highlight the chronic issue of industrial violations, the state enforcement activities in areas of interest to our partners, unaddressed inadequacies of legal emissions standards in protecting public health, and levers of political action and collaboration available to address these issues. The goal of this project is to use the power of Jupyter Notebooks to visualize publicly available data in a way that encourages folks to hold the government and industries accountable.\n\nAttendees will learn how to use Jupyter Notebooks and other Python tools to engage the public to create meaningful outcomes and positive social change. The Notebooks we’ve created serve to empower interested members of the public in participatory learning about industry-related pollution that is meaningful to them and their networks, as well as creating strategic, compelling, and informative reports of environmental injustices in order to inform community action. Our goal is to create a future in which justice and equity are at the center of environmental, climate, and data governance.\n\nNo environmental justice knowledge required to attend.\n----\nJupyterCon brings together data scientists, business analysts, researchers, educators, developers, core Project contributors, and tool creators for in-depth training, insightful keynotes, networking, and practical talks exploring the Project Jupyter ecosystem.\n\nhttps://jupytercon.com/ \n\nJupyterCon is possible thanks to the generous support of our sponsors, and the labor of many volunteer organizers. \n\nhttps://jupytercon.com/sponsors/ \nhttps://jupytercon.com/about/#Organizing%20Committee (edited) \n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020",
  "duration": 824,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/PbeC1OYbVwk/sddefault.jpg",
  "title": "Maalvika Bhat - Empowering the Public with Environmental Data | JupyterCon 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PbeC1OYbVwk"
    }
  ]
}
