{
  "description": "Brief Summary\nESASky allows scientists to explore large collections of astronomical data with the click of a button. At the same time, JupyterLab provides the framework for quick and effective manipulation, visualization and analysis of datasets. In this talk I will present the Jupyter Widget for ESASky, an extension library for JupyterLab that gives the user full control of ESASky from a notebook.\n\nOutline\nThe goal of this proposal is to present pyesasky, the JupyterLab widget for ESASky. ESASky is a free web-based application developed by the ESAC Science Data Centre from the European Space Agency that allows both scientists and the general public to explore a wide variety of astronomical data sets across the whole electromagnetic spectrum in a simple and intuitive way. The JupyterLab widget can be easily installed with PIP and gives the user full control of the application, showing the available data from ground-based and space observatories, selecting background observations, overlaying catalogues of astronomical objects and projecting the footprints of astronomical instrumentation on the sky, for example the instruments from the James Webb Space Telescope to be launched in 2021. ESASky can be accessed in sky.esa.int, the ESASky help pages and videos can be found in https://www.cosmos.esa.int/web/esdc/esasky-help, and the JupyterLab widget and example notebooks can be checked out in GitHub in https://github.com/esdc-esac-esa-int/pyesasky.",
  "duration": 729,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://github.com/esdc-esac-esa-int/pyesasky.",
      "url": "https://github.com/esdc-esac-esa-int/pyesasky."
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://www.cosmos.esa.int/web/esdc/esasky-help,",
      "url": "https://www.cosmos.esa.int/web/esdc/esasky-help,"
    }
  ],
  "speakers": [
    "Marcos Lopez Caniego"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/JvliVi2RuXE/sddefault.jpg",
  "title": "ESASky's JupyterLab widget",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JvliVi2RuXE"
    }
  ]
}
