{
  "description": "Brief Summary\nMany studies have also proven that growing indoor house plants, as long as being a trend, improves health, despite the difficulty to keep them alive. In this talk, you will learn how to set up a basic plant monitoring system and implement a real-world machine learning project with plants at home.\n\nOutline\nMany studies have also proven that growing indoor house plants, as long as being a trend, improves health, despite the difficulty to keep them alive. The fact is that when we grow plants inside our homes, they depend 100% on us and sometimes it is difficult to know what they need.\n\nIn this talk, we will explore how to improve your plants' lives by setting up a basic plant monitoring system. This might sound complicated, but it is indeed very simple and useful: thanks to using python and jupyter notebooks. Moreover, you are going to create a machine learning pipeline from going through the steps of data labelling, selecting the framework, the model, and you will learn how to deal with the challenges that one can have in these processes.\n\nFinally, you will see how this project is an excellent way to learn how to deal with data science challenges, at the same time that you will learn plant biology and how to implement a real-world machine learning project, and at the same time help your plant to be happier.\n\nOutline\n\nIntroduction\n\nMain motivation to create this project\nIntroduction to the setting up system\nVideos\nHow create your own dataset (methodology and criteria)\n\nExperiments for data collection\nData labelling\nHow to select the framework\n\nHow to establish the model (methodology and criteria)\n\nData analysis and data visualization\n\nImpact of this implementation at home\n\nNext steps\n\n(1) This talk is beginner friendly. The main idea of this talk is to show with a practical example how we can implement machine learning at home, at the same time, how we can store and work with our own data for analysis.\n\n(2) The background knowledge should be basic python knowledge.\n\nThis proposal of talk is complementary to a previous personal project called \"PLANTARIS\" , where the main goal was to implement a simple but functional watering system at home.",
  "duration": 1631,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "Maria Contreras"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/S9LbxLDW7ig/sddefault.jpg",
  "title": "Help your plants to stay healthier with Machine Learning at home",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=S9LbxLDW7ig"
    }
  ]
}
