{
  "description": "Brief Summary\nElyra’s metadata service arose out of the need to manage disparate pieces of information to address desired functionality. Our backend service uses a schema-driven approach to validate, store and retrieve this information via a simple REST API. To enhance the user experience, the backend service is accompanied by a frontend metadata editor extension to manage the metadata's lifecycle.\n\nOutline\nThis talk is targeted toward an early intermediate audience - we'll assume basic knowledge of JSON schema and REST. \nElyra’s metadata service provides an organized and flexible way of storing metadata for any JupyterLab extension. In our presentation, we’ll explain our implementation and use-cases for the metadata service. \nWe’ll discuss the details of our schema-driven backend, how it is organized, and the next steps for extending this service. In addition, we’ll discuss the API associated with our service. \nFurther, our presentation will exhibit a frontend JupyterLab editor extension that takes advantage of the metadata API. We’ll show one use-case that has already been implemented, and explain how it could be used with other metadata as well. \nSource code can be found at https://github.com/elyra-ai/elyra\n----\nJupyterCon brings together data scientists, business analysts, researchers, educators, developers, core Project contributors, and tool creators for in-depth training, insightful keynotes, networking, and practical talks exploring the Project Jupyter ecosystem.\n\nhttps://jupytercon.com/ \n\nJupyterCon is possible thanks to the generous support of our sponsors, and the labor of many volunteer organizers. \n\nhttps://jupytercon.com/sponsors/ \nhttps://jupytercon.com/about/#Organizing%20Committee (edited) \n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020",
  "duration": 514,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://github.com/elyra-ai/elyra",
      "url": "https://github.com/elyra-ai/elyra"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/nZxXNfikCxA/sddefault.jpg",
  "title": "Martha Cryan  - A Generic Metadata-Store for JupyterLab extensions | JupyterCon 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nZxXNfikCxA"
    }
  ]
}
