{
  "description": "Brief Summary\nThe Dark Energy Spectroscopic Instrument will revolutionize our understanding of Dark Energy, gravity and the origins of our Universe by measuring the 3D position of 30 million galaxies. Our collaboration is committed to inspiring & teaching the next generation using this unique dataset. We present the science, our forays with Jupyter and discuss how we might better unite to achieve this goal.\n\nOutline\nPrior knowledge: Reading of ubiquitous popular science references on Dark Energy, Dark Matter and Cosmology would be helpful.\n\nObjectives: Coordinate and advertise this introduction to bleeding-edge Cosmology, computing and world-renowned researchers in a manner that scales to an underprivileged audience; Enable an active, national program of informed high-school researchers utilising Jupyter & DESI data; Develop the Jupyter ecosystem to better reflect the wonder of the Cosmos and unique DESI data.\n\nTimings: The Dark Energy Spectroscopic Experiment, (10 mins); Jupyter & DESI, from high school introductions to state-of-the-art research, (10 mins); Challenges faced and available opportunities, (10 mins). For a total of 30 mins and can scale accordingly.\n\nKey Takeaways:\n\nThe five year DESI experiment will imminently start observing 30 million galaxies to understand the nature of Dark Energy, see https://www.youtube.com/watch?v=kPXx9tqyzYg&t=3s and https://www.desi.lbl.gov;\n\nProving the existence of Dark Energy was monumental to science (https://www.nobelprize.org/prizes/physics/2011/press-release/).\nDetermining its precise nature would generate an even greater paradigm shift within physics (https://science.nasa.gov/astrophysics/focus-areas/what-is-dark-energy).\n\nOur collaboration believes it is imperative to inspire and teach the next generation of (data) scientists, which is best done by providing access to unique data and this compelling science.\n\nThis opportunity is enabled by Jupyter & Binder and should be showcased & developed as such.\n\nLike our data, this work is just starting (e.g. https://github.com/michaelJwilson/DESI-HighSchool) but we have big ambitions for outreach and this spotlight would help us to achieve them.\n\nThe wealth of DESI use cases and intention that Jupyter is our primary means to support access of our ~200 member worldwide collaboration to pre-installed specialized libraries, petabytes of data and high performance computing at NERSC, together with integration testing. A dedicated group of ~30 experienced professionals support this effort, ably led by team lead Stephen Bailey.",
  "duration": 677,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://github.com/michaelJwilson/DESI-HighSchool",
      "url": "https://github.com/michaelJwilson/DESI-HighSchool"
    },
    {
      "label": "https://www.nobelprize.org/prizes/physics/2011/press-release/",
      "url": "https://www.nobelprize.org/prizes/physics/2011/press-release/"
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://science.nasa.gov/astrophysics/focus-areas/what-is-dark-energy",
      "url": "https://science.nasa.gov/astrophysics/focus-areas/what-is-dark-energy"
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://www.desi.lbl.gov;",
      "url": "https://www.desi.lbl.gov;"
    },
    {
      "label": "https://www.youtube.com/watch?v=kPXx9tqyzYg&t=3s",
      "url": "https://www.youtube.com/watch?v=kPXx9tqyzYg&t=3s"
    }
  ],
  "speakers": [
    "Michael Wilson"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/3lOfNkQO2Sg/sddefault.jpg",
  "title": "Teaching teenagers to understand Dark Energy",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3lOfNkQO2Sg"
    }
  ]
}
