{
  "description": "Brief Summary\nWe are developing a modern open-source Fortran compiler called LFortran (https://lfortran.org/). This compiler can compile Fortran source code to binaries as well as enable the interactive execution of code in environments like Jupyter. This will allow exploratory work (much like Python, MATLAB or Julia) which is currently not feasible with Fortran.\n\nOutline\nAbstract\nWe are developing a modern open-source Fortran compiler called LFortran (https://lfortran.org/). This front-end compiler will enable the interactive execution of code in environments like Jupyter. This will allow exploratory work (much like Python, MATLAB or Julia) which is currently not feasible. The interactivity of our compiler does not impede compilation of binaries with the goal to run user's code on modern architectures such as multi-core CPUs and GPUs, which is an essential requirement for wider Fortran adoption that current Fortran compilers do not address well. A Live demo of the compiler with a Jupyter notebook will be shown. The compiler itself is written in C++ for robustness and speed with optional Python wrappers to improve inter-operability. It parses Fortran code to an Abstract Syntax Tree (AST) and transforms it to an Abstract Semantic Representation (ASR). LFortran has several backends that transform the ASR to machine code via LLVM, or to C++, or to provide automatic Python wrappers. More backends are planned. The compiler has been designed to be modular so that data can be extracted/inserted between the different stages, which is an important feature that would support an ecosystem of tools that otherwise would be hard with a monolithic compiler.\n----\nJupyterCon brings together data scientists, business analysts, researchers, educators, developers, core Project contributors, and tool creators for in-depth training, insightful keynotes, networking, and practical talks exploring the Project Jupyter ecosystem.\n\nhttps://jupytercon.com/ \n\nJupyterCon is possible thanks to the generous support of our sponsors, and the labor of many volunteer organizers. \n\nhttps://jupytercon.com/sponsors/ \nhttps://jupytercon.com/about/#Organizing%20Committee (edited) \n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020",
  "duration": 1572,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://lfortran.org/",
      "url": "https://lfortran.org/"
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/-MKZjeRozPI/sddefault.jpg",
  "title": "Ondřej Čertík - LFortran | JupyterCon 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-MKZjeRozPI"
    }
  ]
}
