{
  "description": "Brief Summary\nWhat is JupyterHub? What is Jupyter? These seem like simple questions, but in my two deployments of Jupyter, it somehow seems that almost no one can understand the spirit of what Jupyter(Hub) actually does. My vision is that JupyterHub is not a service, but a way to access resources which you already have. I will demonstrate this by the example of my JupyterHub deployments.\n\nOutline\nI'm in a constant struggle to explain what JupyterHub is. Many people understand the surface functions, but not the greater role it can serve. JupyterHub is not some standalone service to compete with your existing resources. Instead, if you want, it serves as an interface to your resources to make them more accessible and usable. I'll do this via a tour of two diverse JupyterHub deployments representing two specific use cases, which are no means exhaustive of the potential deployment configurations. They are:\n\nOn a HPC system with batchspawner. This seamlessly accesses all the existing computing resources, storage, and available software. This both complements traditional ssh access, but also makes command line access easier, since a terminal is built into Jupyter{notebook,lab}.\nOn a Kubernetes cluster, where compute is provided, but authentication and data storage is integrated into the rest of the university's systems. Data - and work - then become seamless across the hub and other existing IT systems.\nMy vision is that JupyterHub is not a service, but a way to access resources which you already have and make more accessible. Anywhere you have an ssh server, you could have a JupyterHub. Anywhere that traditional interfaces are a bit old-fashioned, JupyterHub can complement them and increase your user base. You should come out of this talk inspired to deploy JupyterHub intelligently as part of a greater ecosystem, and without too much difficulty, and (hopefully) able to convince your colleagues that this is a good idea.\n\nThis talk is targeted to people new to JupyterHub, and no particular background knowledge is needed. Details of Jupyter{notebook,lab} won't be covered and are not strictly necessary.",
  "duration": 1389,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "Richard Darst"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/JxyKBNJnfVM/sddefault.jpg",
  "title": "JupyterHub ≠ x, for all x: A tale of two JupyterHubs",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JxyKBNJnfVM"
    }
  ]
}
