{
  "description": "Brief Summary\nThe MariaDB kernel allows to run MariaDB directly in your Jupyter notebook. You can display the results of you favourite SELECTs in matplotlib graphics or export them to a DataFrame in another Python Notebook through database specific %magic commands. You'll get to know how the kernel works, how to install and use it and its most important features.\n\nOutline\nWe were lucky to find out how powerful the Jupyter ecosystem is when we decided to run some analytics on how well we were doing on handling community contributions.\n\nSome months after, after running a little experiment changing the Jupyter Echo kernel code with minor effort we were amazed by how almost magically were able to run regular SQL statements in a Jupyter Notebook. We recorded a short video with our little breakthrough and ideas started flowing. This is when we decided to implement a kernel properly.\n\nThis talk covers the current state of the MariaDB kernel, the existing features, how to install and use it and how we imagine it should look like in terms of functionalities in the upcoming months.\n\nIt will also explain the inner structure of the kernel, how to pass it different configuration options and demo some common use cases.\n\nThere is no background knowledge expected to understand the content of this talk, if you've ever used a Jupyter notebook, a SQL database or both or you'd just love to hear about these technologies, you're more than welcome to attend.\n----\nJupyterCon brings together data scientists, business analysts, researchers, educators, developers, core Project contributors, and tool creators for in-depth training, insightful keynotes, networking, and practical talks exploring the Project Jupyter ecosystem.\n\nhttps://jupytercon.com/ \n\nJupyterCon is possible thanks to the generous support of our sponsors, and the labor of many volunteer organizers. \n\nhttps://jupytercon.com/sponsors/ \nhttps://jupytercon.com/about/#Organizing%20Committee (edited) \n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020",
  "duration": 707,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/8oMcUWqBSx0/sddefault.jpg",
  "title": "Robert Bindar - The MariaDB Jupyter kernel | JupyterCon 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8oMcUWqBSx0"
    }
  ]
}
