{
  "description": "Brief Summary\nVoilà turns Jupyter notebooks into standalone web applications. By leveraging the Jupyter widgets ecosystem, it makes it simple to design dashboards written e.g. in pure Python. In this talk, we present the latest developments of the Voilà stack, the improved templating system and the fully asynchronous execution of notebooks. Then we lay out a roadmap for future development.\n\nOutline\nWe start this presention with a walk-through of Voilà's features. We also demonstrate the integration of Voilà with JupyterLab and JupyterHub.\n\nThen we dive into how users can customize their dashboards with the template system, which can be used to create richer application layouts and themes. We feature the voila-reveal and voila-gridstack templates, which transform notebooks into slideshows and complex dashboards.\n\nIn the next section, we dive into some of Voilà internals, and how a lot of the logic was pushed in upstream projects such as nbconvert and nbclient (for the asynchronous execution of notebooks).\n\nFinally, we lay out the roadmap for future development.\n----\nJupyterCon brings together data scientists, business analysts, researchers, educators, developers, core Project contributors, and tool creators for in-depth training, insightful keynotes, networking, and practical talks exploring the Project Jupyter ecosystem.\n\nhttps://jupytercon.com/ \n\nJupyterCon is possible thanks to the generous support of our sponsors, and the labor of many volunteer organizers. \n\nhttps://jupytercon.com/sponsors/ \nhttps://jupytercon.com/about/#Organizing%20Committee (edited) \n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020\n\n￼\njupytercon.com\nJupyterCon2020\nJupyterCon 2020",
  "duration": 1042,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/5DYH1TY7M8s/sddefault.jpg",
  "title": "Sylvain Corlay -And Voilà! Turning notebooks into standalone web applications | JupyterCon 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5DYH1TY7M8s"
    }
  ]
}
