{
  "description": "Brief Summary\nThis talk covers how multiple notebooks can be orchestrated as a pipeline and executed in distributed way in Kubernetes. With the integration of airflow, a notebook is no longer a standalone piece of development process, but an integral component serves different purpose in a complex pipeline. Furthermore, notebook kernels are developed as docker images with all dependencies inbuilt.\n\nOutline\nAt PayPal, notebooks is used by all data analyst, data science, data engineers and machine learning engineers. There are thousands of notebooks and tens of thousands of jobs run each day through notebooks at PayPal. The traditional way of scheduling notebooks has lot of complexities, some of them are\n\nTime consuming and not maintainable\n\nHaving dependencies between the notebooks is even more complex\n\nDifficult to use different environments for different notebooks\n\nWe needed a simplified and robust solution to address some of these challenges. Weijun and Praveen will explain how the above challenges were addressed by using airflow scheduler on Kubernetes with notebooks integration.\n\nTopics include:\n\nAirflow on Kubernetes – for scheduling notebooks\n\nHow scheduler API can be used for orchestrating notebooks jobs run as pipelines\n\nHow different computation resources (ex: cpu, gpu) can be coordinated in a pipeline to run a complex ML job\n\nHow docker image can be used as notebooks kernel\n\nBackground knowledge for attendees:\n\nBasic understanding of notebooks and python\n\nBasic understanding of papermil, dockers and Kubernetes (useful but not required)\n\nBasic understanding of any scheduler (useful but not required)",
  "duration": 727,
  "language": "eng",
  "recorded": "2020-10-05",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20201030085456/https://jupytercon.github.io/jupytercon2020-website/"
    },
    {
      "label": "https://jupytercon.com/about/#Organizing%20Committee ",
      "url": "https://jupytercon.com/about/#Organizing%20Committee "
    },
    {
      "label": "https://jupytercon.com/sponsors/ ",
      "url": "https://jupytercon.com/sponsors/ "
    },
    {
      "label": "https://jupytercon.com/ ",
      "url": "https://jupytercon.com/ "
    }
  ],
  "speakers": [
    "Weijun Qian"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Y21brBw0LxU/sddefault.jpg",
  "title": "Building distributed pipelines with Jupyter Notebooks",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Y21brBw0LxU"
    }
  ]
}
