{
  "id": 38, 
  "category": "DjangoCon 2010", 
  "slug": "djangocon-2010--multi-database-patterns", 
  "title": "Multi-database patterns", 
  "summary": "", 
  "description": "Multi-database patterns\n\nPresented by Malcolm Tredinnick\n\nA tour through four common \"multiple database\" usage patterns and how they can\nbe implemented and utilised with Django. We'll talk about the strengths and\nweaknesses of each pattern and why you might not need any of them.\n\nAbstract\n\nThere are a few good reasons a system might want to interact regularly with\nmultiple databases. “Because it’s what cool people do” is not one of those\nreasons. Most multi-database usages fall into one of four main classes:\n\n  * Separation by function. All data of one type in one database, all data of another type in some other database. \n  * Separation by sharding. Data of a particular type (e.g. user records) is split across multiple databases, each database holding a shard of the whole data. \n  * Data replication (separation by access). Some pieces of data are synchronized to multiple machines. Writes might go into one or more masters and reads normally come from the slaves. \n  * Data augmentation/shadowing. Data in one database is added to or entirely replaced by data from another database. Can happen during development when reading from a production snapshot whilst trying out changes to some tables or data only against a local database. \n\nObviously, combinations of these classes are possible, such as replicated\nsharded data in a huge site. There are tricks and traps to the way a developer\ntalks to each of these sorts of setups. I'll spend a few minutes showing\ncredible examples of the usage of each as well as when you might be over-\nengineering by going that way. All four access patterns are possible in Django\n1.2, with varying degrees of ease of use and I'll show the type of code\nrequired in each case.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/Robertlofthouse-MultidatabasePatterns241.png", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/djangocon-2010/38_multi-database-patterns.flv", 
      "length": null, 
      "type": "flv"
    }
  ], 
  "source_url": "", 
  "tags": [
    "database", 
    "djangocon", 
    "djangocon2010", 
    "multipledatabases"
  ], 
  "speakers": [
    "Malcolm Tredinnick"
  ], 
  "recorded": null
}