{
  "id": 61, 
  "category": "DjangoCon 2010", 
  "slug": "djangocon-2010--breaking-down-the-process-of-buil", 
  "title": "Breaking down the process of building a custom CMS", 
  "summary": "", 
  "description": "Breaking down the process of building a custom CMS\n\nPresented by Yann Malet, Brian Luft\n\nThe purpose of this talk is to share some of the important insights gained\nover a couple years of working on custom CMS-type projects serving large\norganizations. Acknowledging that approx. 30 minutes is a short time to cover\na broad subject, the focus of the talk would be on outlining a basic strategy\nfor managing large projects.\n\nAbstract\n\nOver the past couple of years, Brian and Yann's team have built and worked on\nseveral large Django projects for large organizations. They will discuss how\nto start and manage large CMS projects, with an emphasis on pointing people to\nthe best reference information and breaking down the common operations.\n\nThe primary discussion topics would cover:\n\n  * Breaking Down the Job: Over the course of the project you'll end up accounting for thousands of details; here's how to figure out the first few Centering Around a Prototype: Hedging your bets for the inevitable \"give me a ballpark figure\" \n  * Dealing With Legacy Data Stores: Migrate legacy information early and often. \n  * Selecting 3rd Party Components: Reuse exiting app, fork it early or Trailblaze \n  * Bad News: Django Ain't Perfect - where it has weaknesses and how to compensate \n\nAt the end of this talk the audience will be able to:\n\n    * Break down this type of project into meaningful phases \n    * Migrate large dataset to populate the django models that are still under development. \n    * Have a rational and objective approach to select django reusable component and understand how to refine them during the different stages of the project lifecycle. \n    * Find and evaluate quality information about the tradeoffs Django presents in these types of projects \n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/Robertlofthouse-BreakingDownTheProcessOfBuildingACustomCMS112-442.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/djangocon-2010/61_breaking-down-the-process-of-building-a-custom-cms.flv", 
      "length": null, 
      "type": "flv"
    }
  ], 
  "source_url": "", 
  "tags": [
    "development", 
    "djangocon", 
    "djangocon2010", 
    "projectmanagement"
  ], 
  "speakers": [
    "Brian Luft", 
    "Yann Malet"
  ], 
  "recorded": null
}