{
  "description": "Our project began as a python based implementation of computer vision, with the purpose of increasing our own understanding. When we began to think of fun and interesting ways to apply this newfound knowledge, an automated sentry gun was the most exciting option. The turret was to recognize people, and calculate their distance with parallax between two cameras. The turret is composed of a micro-controller, controlled via serial ports by a python program, a Nerf gun, and motors.Using all it is equipped with, the turret is purposed to deliver a Nerf dart  to each person in it’s range.Thus the benefit to the “Target” audience is a free Nerf dart. Using python Open CV libraries, the initial implementation was simple, and as we strove to have a better understanding, we tried to write as much of the code ourselves as possible. Because of this, Python delivered a much slower learning curve, which allowed us to make progress as we learnt. As a result of creating this project we have learned about programming in python, and using it to control electronics. We have a greater appreciation of the ever growing number of embedded systems in the world around us, and want to contribute and create more myself. This project has shown us a new side to programming and computer science, and we have really enjoyed exploring it. As opposed to other school projects, the open ended nature of this project has allowed me to explore our own  interests and learn in a way that suits us best. Not only has it taught us about computer science, it has also taught us valuable lessons in time and project management, and problem solving. Python’s simple nature has provided an optimal environment for this project. The completion of the project has opened up opportunities, most notably, the opportunity to potentially participate in Pycon!",
  "duration": 1626,
  "language": "eng",
  "recorded": "2017-08-05",
  "speakers": [
    "Isaac McClure",
    "Hail Kim"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/TnaiiAye7J8/hqdefault.jpg",
  "title": "Automated Python Powered Turret",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TnaiiAye7J8"
    }
  ]
}
