{
  "description": "Facebook, Google, Uber, LinkedIn, and friends are the rarefied heights of software engineering. They encounter and solve problems at scales shared by few others, and as a result, their priorities in production engineering and architecture are just a bit different from the rest of us down here in the other 99% of services. Even as a lead engineer for Twilio, I rarely deal with the same uncharted territories of scale explored by these truly massive systems. Through deconstructing a few blog posts from these giants, we’ll evaluate just what is it that they’re thinking about when they build systems, why they make the choices they do, and whether any of those choices are relevant to those of us operating at high scale yet still something less than millions of requests per second.\n\nThis talk will go into depth on how to evaluate, choose, and deploy technology to meet your customers’ requirements without requiring a small army of engineers to answer 2 AM pages. We’ll go through what you should think about when picking open-source systems (as well as hosted PaaS/IaaS/SaaS providers) to meet your needs: maintainership, extensibility, security, stability, and more. \n\nWe’ll also talk about how to pick realistic goals for your project and business: what are the implications of claiming five nines for the person carrying the pager? How will you communicate with your customers when you’re throwing errors and breaking SLAs? What does disaster recovery mean for your systems, and how much effort will it require to implement and test your DR plan (ahead of time!)?\n\nWith these guidelines in mind, you should be better equipped to say no (or yes!) the next time your team’s software hipster proposes moving everything to the Next Big Thing.",
  "duration": 1745,
  "language": "eng",
  "recorded": "2017-08-04",
  "speakers": [
    "Sam Kitajima-Kimbrel"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/1bApndiHBBw/hqdefault.jpg",
  "title": "Bowerbirds of Technology: Architecture and Operations at Less-Than-Facebook Scale",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1bApndiHBBw"
    }
  ]
}
