{
  "description": "Whether you're developing public-facing web apps or deploying behind\nthe corporate firewall, the days of identity silos are over.  Social\nauth (*log in with FooBookHub*) and federated identity (*SAML*,\n*OpenID Connect* and friends) are the new normal.  The advantages\nare clear: developers and operators have less security-sensitive\ncode to write and deploy, while users experience less password/account fatigue, and\nenjoy improved productivity through *single sign-on*.\n\nBut there's no such thing as a free lunch; like most things in technology there are\ntrade-offs.  Federated authentication protocols are inherently more\nelaborate than plain old passwords; more moving parts means more\ncomplex deployment and more points of failure.  Fortunately there are\ntools to ease the burden and smooth the process of securing your applications.\n\nIn this extended session for web developers and\nadministrators/operations folks, attendees will learn and experience\nhow to deploy and use federated auth, end-to-end from the identity\nprovider to the app.  The session will cover:\n\n- The basics of federated authentication including **protocol\n  overviews** and comparisons.\n\n- How to use **social auth** providers for public-facing\n  applications, allowing users to log in with an account they\n  already have.\n\n- How to leverage accounts in centralised identity management\n  systems (*FreeIPA*, *Active Directory*, *LDAP*, etc) for **single\n  sign-on** in an organisation.\n\n- How **identity brokers** like *Keycloak* make it easy to use a\n  variety of external authentication providers, and provide a\n  consistent user experience across multiple applications.\n\n- How to use external identities in your applications with the help\n  of your web server, focusing in particlar on popular **Python web\n  frameworks** and Apache (though the principles are more widely\n  applicable).\n\n- **Security** characteristics, and discussion of some challenging\n  scenarios including testing, account merging and single sign-out.\n\n",
  "duration": 4335,
  "language": "eng",
  "recorded": "2017-08-05",
  "speakers": [
    "Fraser Tweedale"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/2Rzlk9l43VI/hqdefault.jpg",
  "title": "Identity 2.0: the what, why and how of social and federated login",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2Rzlk9l43VI"
    }
  ]
}
