{
  "description": "We hear a lot of hype around the Internet of Things - how that myriad of interconnected smart devices monitoring and actuating our everyday activities will transform our lives toward a blissful state of automation.  But when IoT rules the world, do you want to have to rely on third parties to provide all of these devices and to define all of the features available within your connected life? Being able to develop your own IoT devices as well as customize existing devices and applications is becoming a critical skill.\n\nMicroPython is a Free, Open Source implementation of Python 3.x that is designed to run on microcontrollers - the tiny embedded computers at the heart of many IoT devices. MicroPython is a valuable tool for rapidly prototyping device functionality and is a great way to get started with developing for the Internet of Things.\n\nIn this session, we'll walk through the steps you'll need to follow to take your IoT ideas and make them into reality using MicroPython, including:\n\n• selecting hardware and developing circuits to connect sensors and actuators, \n• getting your microcontroller set up with MicroPython on-board, \n• developing MicroPython programs to read from sensors and control actuators, \n• connecting your device and getting it talking with other devices and services over MQTT, and\n•  how to integrate your device within a wider IoT context, for example, integrating with popular IoT frameworks. \n\nThe examples covered in the session are drawn from a healthy habits tracking companion example project developed by the speaker. This custom IoT device acts as a personal assistant that helps to track and transform personal habits like keeping fit.",
  "duration": 1885,
  "language": "eng",
  "recorded": "2017-08-04",
  "speakers": [
    "Anna Gerber"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/8Uw1UW0_nHE/hqdefault.jpg",
  "title": "Program all the things - How to develop IoT devices using MicroPython",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8Uw1UW0_nHE"
    }
  ]
}
