{
  "description": "There are thousands of resources online teaching computing, technology and programming, - too many for teachers to filter. On the other hand, the curriculum is, at times, rather obtuse, and it's not always clear whether a resource actually covers an objective. On the other, resources online aren't always pitched at the right level for school students, or sometimes even correct. We've worked with the Digital Technologies Hub, Scootle and other content providers to map everything* on the internet in the big concepts that are covered by the curriculum, and provide them to teachers so they can see what's right for them in their classrooms. But what about the gaps in the available resources and teacher PD and how can teachers be supported to teach something that they may not be confident in?\n\nThe Australian Computing Academy (ACA), part of the University of Sydney, will provide resources, professional development, and a community to support educators delivering the Australian Curriculum: Digital Technologies. We'll facilitate the teaching of Python to every student in year 7 - roughly 300,000 per year - through free resources and teacher training. We'll be reaching down into Primary schools too, to make a progression that will lead them there. Every year 5 student will have access to resources teaching \"Foundational Pre-Python\" via Blockly to prep kids so they're ready to tackle what is a very challenging curriculum. \n\nWe're excited about the opportunities the DT curriculum provides. It’s a challenging curriculum but it also a fantastic way to engage students with hard problems and real solutions. Our intent is to use Python to show students and teachers that coding is awesome whether it’s finding patterns in DNA, solving your maths homework, or entertaining your friends with a generated poetry slam bot.",
  "duration": 2932,
  "language": "eng",
  "recorded": "2017-08-04",
  "speakers": [
    "Amanda Hogan"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/IKW5BwrJc78/hqdefault.jpg",
  "title": "Python to the (Little) People: teaching 300,000 students Python through the DT Curriculum",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IKW5BwrJc78"
    }
  ]
}
