{
  "category": "PyCon APAC 2015",
  "copyright_text": "Standard YouTube Licence",
  "description": "Speaker: Melvin Foo, Hannie Ching, Tan Le Xuan\n\nWith the advent of low cost 3D printers, there is an increasing demand for 3D technology in many diverse fields. However, 3D printing requires a 3D model as input, usually modeled in a computer. But why should we tediously create a model from scratch, when we can simply scan the objects and modify them? In this project, we present RPyScan, an effective and low cost DIY 3D scanner which makes use of photogrammetry to infer depth information from photos. With enough points, this will create a 3D model of the scanned object. This is in contrast to most 3D scanners on the market, which makes use of RGBD (Depth) and lasers.\n\n\nAbout the speaker\n\nAbout Melvin, Le Xuan and Hannie\nWe are students from Dunman High School, Singapore. We have learnt Python for the past few months to one plus year since we studied Computing as an A-level subject. We learnt about the theoretical and algorithmic aspects of computer science (e.g. data structures and searching) and applied this knowledge to practical (Google App Engine) Python projects.\n\nMelvin is really enthusiastic and passionate about everything related to technology. He loves software and hardware equally. He is currently the chairperson of his school's Infocomm Club and has attained many national and international accolades such as Singapore Management University's InnovateIT and Information Technology Standards Committee's CodeXtremeApps hackathon school category, where he dabbled in home automation and created Internet-connected chairs and cookers prototypes. He also represented Singapore in the APICTA (Asia Pacific ICT Alliance) Awards and was pivotal in encouraging his school mates to contribute towards open source projects where Dunman High was recognized as the top participating school in Google Code-in 2014. He was also the youngest high school presenter at PyCon SG 2014. When he is not studying, you can find him in his home 'lab' working on his IoT projects. In his free time, he plays video games and fantasizes about owning an Occulus Rift, and also coaches badminton to young kids.  You can learn more about him on his website www.melvinfoo.com.\n\n\nLe Xuan is a budding Computing student who is ever excited to learn more about technology. Though he is relatively new in this area, his huge fascination with gadgets and devices motivates him to consistently find out more about how they work. He frequently creates various kinds of programs as part of this hobby, and can sometimes be found tinkering with pieces of machinery, thinking about how they might be improved. As part of his school curriculum, he has created a web application in celebration of Singapore’s 50th birthday (SG50) using Google App Engine and Python, took part in Google Code-in 2014 and the 2015 IDA National JC Coding Championship, and attended a number of related seminars and talks. He is interested in delving deeper into the areas of virtual reality and artificial intelligence. Besides Computing, he plays the piano and the French horn, enjoys playing video games for leisure, and recently picked up sports to be more active.\n\nHannie shows a strong interest in both hardware and software. She has a strong determination to learn new things and is not afraid of hard work. In the short few months since she started learning Computing, she created a web application using Python for SG50 and has participated in events such as Google Code-in 2014 and the 2015 National JC and HS Coding Championships. She actively engages herself in infocomm programmes such as an SMU Panel Discussion on “Creating the Future through Computing” and “The Science Behind Thoughts” conducted by A Star Research Institute of High Performance Computing (IHPC). In the foreseeable future, she hopes to explore emerging technologies such as projected keyboards. Besides Computer Science, she has a passion for classical music and plays the Piano, Violin and Viola. She also enjoys sports such as Volleyball and Archery. \n\n個人網頁連結 http://www.melvinfoo.com/\nTwitter @MEOWEENFUU\n組織/公司 Dunman High School\n頭銜 Student\n\nhttps://tw.pycon.org/2015apac/zh/program/56",
  "duration": 1933,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-08-24",
  "slug": "r0-day1-05-rpyscan-melvin-foo-hannie-ching-tan-le",
  "source_url": "https://www.youtube.com/watch?v=bJ8OIIP4x4k",
  "speakers": [
    "Melvin Foo",
    "Hannie Ching",
    "Tan Le Xuan"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/bJ8OIIP4x4k/sddefault.jpg",
  "title": "R0 DAY1-05 RPyScan - Melvin Foo, Hannie Ching, Tan Le Xuan (PyCon APAC 2015)",
  "videos": [
    {
      "length": 1933,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bJ8OIIP4x4k"
    }
  ]
}