{
  "category": "PyCon APAC 2015",
  "copyright_text": "Standard YouTube Licence",
  "description": "Speaker: Kenneth Reitz\n\nKenneth Reitz is a versatile talent computer genius. Kenneth has a well-understood on Photography and has released many masterpieces on famous photo sharing platforms such as flickr and 500px. But most important, Kenneth is a grand Open Source software contributors who invents and leads many popular github projects. The most widely used one is Requests, a revolutionary package that allows tens of thousands Python Web Developers to develop Web services with human-friendly syntax instead of using the tedious , trivial urllib which Python standard library provides.\n\nDespite Kenneth has a groundbreaking stride in Python Web Development, he is always a kind Python mentor for novice and expert Python developers. Under Kenneth's lead, the Github project \"python-guide\" has abundant resources helping many beginners to break the programming ice. On the other side, for the experts, Kenneth has established many great practices for writing good code, including project structuring, coding style, documentation and so on.\n\nKenneth embraces the elegant Architectures and APIs. Hence, Kenneth founded KennethReitz.com to provide Architecture solutions for numerous enterprises. In 2011, Kenneth joined the Heroku team for developing the best Python offering and playing a Heroku's voice in Python Community. Also, Kenneth is one of the fellows in Python Software Foundation.\n\nhttps://tw.pycon.org/2015apac/zh/program/keynote-speaker/",
  "duration": 2279,
  "id": 4972,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-08-24",
  "related_urls": [
    "https://tw.pycon.org/2015apac/zh/program/keynote-speaker/"
  ],
  "slug": "r0-day1-k2-kenneth-reitz-pycon-apac-2015",
  "speakers": [
    "Kenneth Reitz"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/hDGRRnv89Ls/sddefault.jpg",
  "title": "R0 DAY1-K2 Kenneth Reitz (PyCon APAC 2015)",
  "videos": [
    {
      "length": 2279,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hDGRRnv89Ls"
    }
  ]
}