{
  "copyright_text": null,
  "description": "In this talk we will present how python is used to develop a machine learning based 3D medical imaging processing pipeline in axial3D. We will provide a demo taking relevant scientific packages and develop a simple algorithm to detect bony anatomy. A 3D printable model will be produced at the end of the demo. We will also show how we use existing 3D mesh python packages to adjust properties of the object for visualisation in screen and mixed reality platforms. The healthcare sector produces vast quantities of three dimensional images for the diagnosis and treatment of a large variety of medical conditions. Traditionally, the 3D images are reviewed by a highly qualified healthcare professional such as a radiologist or surgeon. As a result, the diagnosis and treatment of patient is time consuming, expensive and not scalable; moreover, this approach has limited efficacy as the medical doctor may not be able to obtain a general understanding of the anatomic three dimensional structure (e.g the shape and size of a tumor, the position of each bony fragment in a complex fracture, the location of an aneurysm together with surrounding vasculature, etc). The talk will focus on the advanced image processing techniques and Deep Learning approaches that are in active development developed both within academia and the private sector. These approaches aim to achieve a faster and better understanding of medical scans. They allow healthcare systems to provide a cheaper, faster and more effective medical service to patients. The results of the image analysis can then be rendered to the medical staff using a Virtual Reality, or an Augmented Reality system. 3D prints can also be employed to convey a very tangible experience as well as allow the medical staff to prepare for the operation by setting up a mock procedure on the 3D prints.",
  "duration": 2117,
  "language": "eng",
  "recorded": "2018-11-10",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://schedule.pycon18.python.ie/"
    }
  ],
  "speakers": [
    "Lorenzo Trojan"
  ],
  "tags": [
    "machine learning"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/nSsEOpjirtQ/maxresdefault.jpg",
  "title": "Patient Data Made Real",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nSsEOpjirtQ"
    }
  ]
}
