{
  "id": 3051,
  "category": "PyData Berlin 2014",
  "slug": "pandas-thumb-unexpected-evolutionary-use-of-a-p",
  "title": "Pandas' Thumb: unexpected evolutionary use of a Python library.",
  "summary": "This talk is a description of how - against a backdrop of data-drunk tax\nauthorities, legal pressures on businesses to have appropriate\ncompliance systems in place, and the constant pressure on their law\nfirms to commoditise compliance services, Pandas may be about to make a\nforay from its venerable financial origins into a brave new fiscal world\n- and can revolutionise an industry by doing so. A case study covering\nthe author's development of a Pandas-based stamp duty land tax engine\n(\"ORVILLE\") is discussed, and the inherent usefulness of Pandas in the\nworld of tax analysis is explored.\n",
  "description": "Lawyers are not famed for their mathematical ability. On the contary -\nthe law almost self-selects as a career choice for the\nnumerically-challenged. So when the one UK tax that property lawyers\ngenerally felt comfortable dealing with (lease duty) was replaced with a\nnew tax (stamp duty land tax) that was both arithmetically demanding and\nconceptually complex, it was inevitable that significant frustrations\nwould arise. Suddenly, lawyers had to deal with concepts such as net\npresent valuations, aggregation of several streams of fluctuating\nfigures, and constant integration of a complex suite of credits and\ndisregards. This talk is a description of how - against a backdrop of\ndata-drunk tax authorities, legal pressures on businesses to have\nappropriate compliance systems in place, and the constant pressure on\ntheir law firms to commoditise compliance services, Pandas may be about\nto make a foray from its venerable financial origins into a brave new\nfiscal world - and can revolutionise an industry by doing so. A case\nstudy covering the author's development of a Pandas-based stamp duty\nland tax engine (\"ORVILLE\") is discussed, and the inherent usefulness of\nPandas in the world of tax analysis is explored.\n",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "thumbnail_url": "http://i.ytimg.com/vi/CNQ_Ib4yxgQ/hqdefault.jpg",
  "duration": null,
  "videos": [
    {
      "url": "http://video.ep14.c3voc.de/20240.mp4",
      "type": "mp4",
      "length": null
    },
    {
      "url": "http://www.youtube.com/watch?v=CNQ_Ib4yxgQ",
      "type": "youtube",
      "length": 0
    }
  ],
  "source_url": "http://www.youtube.com/watch?v=CNQ_Ib4yxgQ",
  "tags": [],
  "speakers": [
    "Chris Nyland"
  ],
  "recorded": "2014-07-27"
}