{
  "id": 3051, 
  "category": "PyData Berlin 2014", 
  "slug": "pandas-thumb-unexpected-evolutionary-use-of-a-p", 
  "title": "Pandas' Thumb: unexpected evolutionary use of a Python library.", 
  "summary": "This talk is a description of how - against a backdrop of data-drunk tax authorities, legal pressures on businesses to have appropriate compliance systems in place, and the constant pressure on their law firms to commoditise compliance services, Pandas may be about to make a foray from its venerable financial origins into a brave new fiscal world - and can revolutionise an industry by doing so. A case study covering the author's development of a Pandas-based stamp duty land tax engine (\"ORVILLE\") is discussed, and the inherent usefulness of Pandas in the world of tax analysis is explored.", 
  "description": "Lawyers are not famed for their mathematical ability. On the contary - the law almost self-selects as a career choice for the numerically-challenged. So when the one UK tax that property lawyers generally felt comfortable dealing with (lease duty) was replaced with a new tax (stamp duty land tax) that was both arithmetically demanding and conceptually complex, it was inevitable that significant frustrations would arise. Suddenly, lawyers had to deal with concepts such as net present valuations, aggregation of several streams of fluctuating figures, and constant integration of a complex suite of credits and disregards. This talk is a description of how - against a backdrop of data-drunk tax authorities, legal pressures on businesses to have appropriate compliance systems in place, and the constant pressure on their law firms to commoditise compliance services, Pandas may be about to make a foray from its venerable financial origins into a brave new fiscal world - and can revolutionise an industry by doing so. A case study covering the author's development of a Pandas-based stamp duty land tax engine (\"ORVILLE\") is discussed, and the inherent usefulness of Pandas in the world of tax analysis is explored.", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/", 
  "thumbnail_url": "http://i.ytimg.com/vi/CNQ_Ib4yxgQ/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://video.ep14.c3voc.de/20240.mp4", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "http://www.youtube.com/watch?v=CNQ_Ib4yxgQ", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=CNQ_Ib4yxgQ", 
  "tags": [], 
  "speakers": [
    "Chris Nyland"
  ], 
  "recorded": "2014-07-27"
}