{
  "alias": "video/3154/3-hours-to-docker-fundamentals-jumpstart-your-do",
  "category": "PyTexas 2014",
  "copyright_text": "CC-BY",
  "description": "Docker, the new trending containerization technique, is gaining interest\nfrom organizations of all sizes with its lightweight, portable, “build\nonce, configure once and run anywhere” functionalities. Docker skills\nare expected to be in high-demand because of its ability to streamline\nworkflow and reduce the need for hardware investment.\n\nThis tutorial focuses on providing an in-depth understanding of Docker\nand how to containerize Python web applications. Docker provides a\nmechanism for low overhead virtualization and can be a key aspect of a\nDevOps architecture. Docker allows isolated environments to be created\nin a single machine without imposing a performance overhead. This leads\nto new possibilities for optimizing the developer flows and creating\nmulti-tenant applications, saving time coding and improving quality.\n\nThis tutorial will highlight a list of best practices, pitfalls, and dos\nand dont’s from real-world case studies. We’ll walk through:\n\n-  Basic concepts and Docker terminology\n-  Docker Commands\n-  Must Know Docker Features\n-  Docker in the real world using examples of projects implemented at\n   Flux7\n\n",
  "duration": 10800,
  "id": 3154,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-10-03",
  "slug": "3-hours-to-docker-fundamentals-jumpstart-your-do",
  "speakers": [
    "Aater Suleman"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_3154___3_hours_to_Docker_fundamentals_Jumpstart_your_Dock",
  "title": "3 hours to Docker fundamentals: Jumpstart your Docker knowledge",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_3154___3_hours_to_Docker_fundamentals_Jumpstart_your_Dock"
    },
    {
      "length": null,
      "type": "mp4",
      "url": "http://64966d3674e0a64d8f4a-47c94b14ef8e1f83d5390cdb0629c6ed.r53.cf2.rackcdn.com/pytexas-2014/3154_3_hours_to_Docker_fundamentals_Jumpstart_your_Dock.mp4"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtu.be/ddhU3NMrhX4"
    }
  ]
}
