{
  "alias": "video/3197/snakes-in-sheets",
  "category": "PyTexas 2014",
  "copyright_text": "CC-BY",
  "description": "Microsoft Excel continues to be popular across many industries where\ndata analysis is fundamental to success. It marries powerful\norganization and presentation functionality to sift through large\ndatasets. However, the default scripting language for Excel, VBA, is\noften cumbersome to use. Python is maturing as a quantitative scripting\nlanguage with a growing scientific community around it, so it makes\ngreat sense to marry Excel’s user interface with Python’s extensive data\nacquisition and analysis libraries.\n\nThis talk introduces you to Pyinex, an open source project to embed a\nPython interpreter within an Excel addin. It directly exposes Python\nuser defined functions as Excel worksheet functions, allows users to\ncall arbitrary Python code from within Excel, and provides an\ninteractive Python session all from within the same process space.\nPyinex brings to Excel all the goodies of Python—data analysis using\nSciPy, NumPy, Pandas and more; integration with databases, web services,\nand other network resources; rapid function prototyping; extensive\nlibrary support; and so much more.\n\nThis talk will demonstrate the capabilities of Pyinex and give an\noverview of how it works internally. The aim is to present the tool for\nboth end-users and developers to inspire the audience thinking of new\nuse cases and spark conversation on how to further improve the project.\n",
  "duration": 3000,
  "id": 3197,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-10-05",
  "slug": "snakes-in-sheets",
  "speakers": [
    "Abhipray Sahoo"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_3197___Snakes_in_Sheets",
  "title": "Snakes in Sheets",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_3197___Snakes_in_Sheets"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=X3ImPHjAmUQ"
    }
  ]
}
