{
  "description": "[EuroPython 2023 — South Hall 2A on 2023-07-21]\n\rhttps://ep2023.europython.eu/session/a-brief-history-of-data-storage\n\nFor millennia, humans have known things. Pretty quickly, we started writing them down; our brains aren't very good at storing all the things we know reliably, and we needed something more durable.\n\n\rA long time ago, this meant clay tablets with cuneiform on them, and things have only got more complicated from there. Nowadays, we try to store data so that computers can understand it too, and that's given us a bewildering array of options - portable hard drives, magnetic tape storage and so much more.\n\n\rIn this talk, we'll take a look at the history of data storage, and discuss why some methods have worked better than others. We'll talk about why writing things down for humans is different than doing it for computers, and why it's difficult to do both at the same time (this is what code is). Finally, we'll look at today's state-of-the-art for keeping data safe, and discuss what the future might hold.\n\n\rThis talk has no prerequisites, although a fondness for weird facts will help!\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2466,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/a-brief-history-of-data-storage",
      "url": "https://ep2023.europython.eu/session/a-brief-history-of-data-storage"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Eli Holderness"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/QEKLcaynvnc/maxresdefault.jpg",
  "title": "A Brief History of Data Storage",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QEKLcaynvnc"
    }
  ]
}
