{
  "description": "[EuroPython 2023 — North Hall on 2023-07-19]\n\rhttps://ep2023.europython.eu/session/apache-arrow-and-substrait-the-secret-foundations-of-data-engineering\n\nApache Arrow, and its Python library PyArrow are becoming the standard de facto for transfering data and interoperability between libraries and languages. As more compute engines, storages and databases start to speak arrow, you might be relying on it without even knowing.\n\rThe same transformation is happening with Substrait, that is on track to be the standard representation of query plans themselves. Allowing queries to be routed to different engines as far as they speak substrait, or even decomposed and forwarded to different engines.\n\rThis talk we will provide a quick introduction to the Arrow ecosystem, showing to Python developers how libraries like Pandas, Polars and PyArrow itself leverage Arrow and how compute engines like Velox, Datafusion and Acero are embracing Arrow and Substrait.\n\rThe talk will also show how a basic database system based on Arrow and Substrait can be built with a minimum amount of code thanks to all the foundations they provide.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2628,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/apache-arrow-and-substrait-the-secret-foundations-of-data-engineering",
      "url": "https://ep2023.europython.eu/session/apache-arrow-and-substrait-the-secret-foundations-of-data-engineering"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Alessandro Molina"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/5_EF4KC8XO4/maxresdefault.jpg",
  "title": "Apache Arrow and Substrait, the secret foundations of Data Engineering",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5_EF4KC8XO4"
    }
  ]
}
