{
  "description": "[EuroPython 2023 — Terrace 2B on 2023-07-21]\n\rhttps://ep2023.europython.eu/session/building-and-deploying-fair-and-unbiased-ml-systems-an-art-not-science\n\nThere has been a renaissance around Artificial Intelligence systems in recent years. However, despite the hype, only a small percentage, i.e. 13% of Machine Learning models see the light of day!\n\rWell, effectively building and deploying machine learning models is more of an art than science! ML models are indeed inherently complex, have fuzzy boundaries, and rely heavily on data distribution. But what if they are trained on biased data? Then they’ll generate highly biased decisions! As the famous saying goes by,  “Garbage in, garbage out,” so if the model is trained on skewed and unfair data distribution, they are bound to produce fuzzy output!\n\rSo, join me in this talk as I will share my learnings in developing effective practices to build and deploy ethical, fair and unbiased machine learning models into production.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1795,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/building-and-deploying-fair-and-unbiased-ml-systems-an-art-not-science",
      "url": "https://ep2023.europython.eu/session/building-and-deploying-fair-and-unbiased-ml-systems-an-art-not-science"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Rashmi Nagpal"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/2gikG7XQSBc/maxresdefault.jpg",
  "title": "Building and Deploying Fair and Unbiased ML Systems: An Art, Not Science",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2gikG7XQSBc"
    }
  ]
}
