{
  "description": "[EuroPython 2023 — Terrace 2B on 2023-07-20]\n\rhttps://ep2023.europython.eu/session/career-building-through-open-source-community-participation\n\nOpen source has widely grown to allow different tech career paths to enhance projects with their skills & provide jobs for those interested in working with open source. Open source contribution programs provide & build interested persons' capacity to become professionals.\n\n\rActive community participation helps enhance career growth. \n\n\rOutreachy is a paid and remote internship OS program that empowers, grows talents, and prepares them for career growth. Outreachy provides internships to people subject to systemic bias and impacted by underrepresentation in the technical industry where they are living. \n\r \n\rAt the end of this session, beginners and persons on the intermediate level will have enough knowledge of how they can build a career in open source; experts will also get more insights on how they can contribute to the advancement of open source contribution by giving back to the community as a mentor helping new contributors understand the open source ecosystem and contribution.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 997,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/career-building-through-open-source-community-participation",
      "url": "https://ep2023.europython.eu/session/career-building-through-open-source-community-participation"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Omotola Eunice Omotayo"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/423gqlGBT0Y/maxresdefault.jpg",
  "title": "Career Building Through Open Source & Community Participation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=423gqlGBT0Y"
    }
  ]
}
