{
  "description": "[EuroPython 2023 — South Hall 2B on 2023-07-19]\n\rhttps://ep2023.europython.eu/session/continue-thinking-small-next-level-machine-learning-with-tinyml\n\nThe Internet of Things has been flourishing for many years, and Python has been playing an important role on the “easy to automate” topic for many devices. One of the challenges for the next generation ML is to think small, you read that right “thinking small”. It’s time to start being able to have mechanisms with super well-trained ML models in small-devices: ML on Microcontrollers. We are going to dive into TinyML and evaluate different setups to interact with sensors on microcontrollers. We will discuss the different hardware options and frameworks to start with, while checking different use cases that TinyML can solve, like: agriculture, conservation, health issues detection, ecology monitoring etc. In this talk, you will learn about Tiny Machine Learning (TinyML), which is an approach that explores machine learning to be deployed in embedded systems that enable run ML on microcontrollers. Lastly, we will discuss real use-cases and a practical case that could be implemented at home\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1684,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/continue-thinking-small-next-level-machine-learning-with-tinyml",
      "url": "https://ep2023.europython.eu/session/continue-thinking-small-next-level-machine-learning-with-tinyml"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/RiCzaCWSyVA/maxresdefault.jpg",
  "title": "Continue Thinking Small: Next level machine learning with TinyML — Maria Jose Molina Contreras",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RiCzaCWSyVA"
    }
  ]
}
