{
  "description": "[EuroPython 2023 — Forum Hall on 2023-07-19]\n\rhttps://ep2023.europython.eu/session/fyeah-how-we-are-supercharging-f-strings-in-python-312\n\nEverybody loves f-strings in Python. But what if they could be even better? Thanks to PEP 701, Python 3.12 will ship with an improved version of f-strings that will once and for all fix the little remaining problems that f-strings have had, while also supercharging them with new cool powers.  In this talk, you will discover the dark little secrets of how f-strings were being processed before Python 3.12 and the many things that didn't work and you didn't know about. You will learn how we changed thousands of lines of manually written C code without anybody noticing, how we changed the oldest part of CPython so quotes behave like parentheses, and how we taught the PEG parser to understand f-strings. Plus, you'll gain an understanding of how these new and improved capabilities will provide several advantages for both end-users and library developers, while also reducing the maintenance cost of the CPython implementation.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1856,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2023.europython.eu/session/fyeah-how-we-are-supercharging-f-strings-in-python-312",
      "url": "https://ep2023.europython.eu/session/fyeah-how-we-are-supercharging-f-strings-in-python-312"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/JAG9oIFklA8/maxresdefault.jpg",
  "title": "f\"yeah!\" - How we are supercharging f-strings in Python 3.12 — Pablo Galindo Salgado, Marta Gomez",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JAG9oIFklA8"
    }
  ]
}
