{
  "description": "[EuroPython 2023 — South Hall 2A on 2023-07-20]\n\rhttps://ep2023.europython.eu/session/high-volume-pdf-text-extraction-using-python-open-source-tools\n\nAll major companies have huge amounts of (mostly PDF) documents that contain important - even critically important - information, that does no longer exist anywhere else in their data stores.\n\n\rReports, once generated for shareholders and legal or financial authorities, may still be useful for developing longterm forecasts or triggering company management decisions.\n\n\rBy definition, documents are intended for human perception, and as such contain unstructured data from an information technology perspective.\n\n\rTherefore, tools to extract PDF text content (mostly, but not only text) from millions of pages have become important vehicles to recreate structured information.\n\n\rThis presentation talks about extraction \"need for speed\" in this Big Data scenario, the need for integration with OCR capabilities and presents an open-source toolset which combines both, top-of-the-class performance and maximum extraction detail.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1836,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2023.europython.eu/session/high-volume-pdf-text-extraction-using-python-open-source-tools",
      "url": "https://ep2023.europython.eu/session/high-volume-pdf-text-extraction-using-python-open-source-tools"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/hjswZbbglbw/maxresdefault.jpg",
  "title": "High Volume PDF Text Extraction using Python Open-Source Tools — Harald Lieder",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hjswZbbglbw"
    }
  ]
}
