{
  "description": "[EuroPython 2023 — Terrace 2B on 2023-07-20]\n\rhttps://ep2023.europython.eu/session/how-well-do-we-understand-our-universe-lets-python-it-out\n\nAs our understanding of the Universe is expanding, the desire to model the physics that govern cosmic evolution is more evident than ever, driving the emergence of cosmological simulations that model the Universe from the beginning of time till present day. In combination with Machine Learning, they allow for an unprecedented capability; one can train AI models on simulations, where the evolution history of galaxies is available, that can in turn be applied on real galaxies. In this work, we propose the use of Python as a ML tool, through the popular library Tensorflow, to quantify the impact of different cosmological models on the derivation of the history of galaxies. Python accompanies us at every step of the way, from creating the datasets and training the probabilistic neural networks to the visualization of the results, as we attempt to shed light on the cosmic past of galaxies, surpassing the unshakeable reality that we can only observe them at a specific moment in time.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1761,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/how-well-do-we-understand-our-universe-lets-python-it-out",
      "url": "https://ep2023.europython.eu/session/how-well-do-we-understand-our-universe-lets-python-it-out"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Eirini Angeloudi",
    "Regina Sarmiento"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/iwbgH7X6fAM/maxresdefault.jpg",
  "title": "How well do we understand our Universe? Let’s Python it out!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iwbgH7X6fAM"
    }
  ]
}
