{
  "description": "[EuroPython 2023 — South Hall 2A on 2023-07-20]\n\rhttps://ep2023.europython.eu/session/poisoned-pickles-make-you-ill\n\nDon’t you love pickles? In the data science space, the pickle module has become one of the most popular ways to serialise and distribute machine learning models - yet, pickles introduce a wide range of problems. For starters, it is incredibly easy to poison a pickle. Once this happens, a poisoned pickle can be used by an attacker to inject any arbitrary code into your ML pipelines. And what’s even worse: it’s incredibly hard to detect if a pickle has been poisoned!\n\n\rGood news? Help is on the way! You now have access to an increasing number of tools to help you generate higher-quality pickles. And when those are not enough, you can always draw inspiration from the DevOps movement and their trust-or-discard processes.\n\n\rThis talk will show you how widespread pickles are and how easy it is to poison models serialised with pickle, but also how easy it is to start protecting them from attacks.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1676,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/poisoned-pickles-make-you-ill",
      "url": "https://ep2023.europython.eu/session/poisoned-pickles-make-you-ill"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/c2c9lqKb39I/maxresdefault.jpg",
  "title": "Poisoned pickles make you ill — Adrian Gonzalez-Martin",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=c2c9lqKb39I"
    }
  ]
}
