{
  "description": "[EuroPython 2023 — Terrace 2A on 2023-07-20]\n\rhttps://ep2023.europython.eu/session/private-data-anonymization-with-python-fundamentals\n\nHow to bring large legal document repositories into the public domain without releasing private data? The fundamental concepts behind document anonymization are entity recognition, masking type, and pseudoanonymization. Using python language and a collection of libraries such as spacy, pytorch, and others we can achieve good scores of anonymization. How is this applied within a flow containing AI models for NER? Once anonymized how to improve the result by doing more text mining with python based apps and human in the loop. Although it was approved in 2016, the application of the GDPR at the European level remains a challenge in banking, legal, and other contexts. This talk covers the process of transforming pdf and docx documents into xml, processing them using regexp and spacy/torch models, and how to parse these results using AntConc and Textacy. All the ideas will be supported with the real experience of the MAPA project a European project for anonymization finished in 2022.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1246,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/private-data-anonymization-with-python-fundamentals",
      "url": "https://ep2023.europython.eu/session/private-data-anonymization-with-python-fundamentals"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Abel Meneses Abad",
    "Oscar L. Garcell"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/DKOum9v6WB0/maxresdefault.jpg",
  "title": "Private Data Anonymization with Python, Fundamentals",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DKOum9v6WB0"
    }
  ]
}
