{
  "description": "[EuroPython 2023 — Forum Hall on 2023-07-21]\n\rhttps://ep2023.europython.eu/session/python-organizers-panel-exploring-community-driven-python-conferences\n\nPanel Discussion with Alexander CS Hendorf, Alessia Marcolini, Jimena Bermúdez, Bára Drbohlavová, Honza Javorek, Tim (文昌) Hsu, David Vaz\n\n\rDid you know that Python conferences are primarily organized by the community? Go backstage and join us at the Python \n\n\rJoin us for an engaging and insightful discussion as we bring together a group of passionate Python conference organizers from the community. Discover the vibrant ecosystem behind Python conferences and gain valuable insights into their experiences, motivations, and learnings. \n\n\rWhether you are an aspiring organizer, a Python enthusiast, or simply curious about the inner workings of community-driven events, this panel promises to provide a wealth of knowledge and inspiration. Don't miss the opportunity to hear firsthand from the dedicated individuals who make Python conferences an incredible experience for all!\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 3731,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/python-organizers-panel-exploring-community-driven-python-conferences",
      "url": "https://ep2023.europython.eu/session/python-organizers-panel-exploring-community-driven-python-conferences"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/zuPefZ94zQs/maxresdefault.jpg",
  "title": "Python Organizers' Panel: Exploring Community-Driven Python Conferences",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zuPefZ94zQs"
    }
  ]
}
