{
  "description": "[EuroPython 2023 — Terrace 2A on 2023-07-19]\n\rhttps://ep2023.europython.eu/session/spiral-python\n\nMost introductory Python books and online resources like w3schools.com try to be complete when a new concept is explained. This does not always work well for beginners. E.g. if you have just grasped how a while-loop  works, it may cause too much cognitive load to also understand the break and continue options, let alone the else clause.\n\n\rThe learning psychologist Jerome Bruner introduced the term \"spiral learning\". The idea is that you don't teach all aspects of a new concept, but just enough to use it. At a later stage a teacher can revisit the subject and explain more details, when a student needs this to take the next step.\n\n\rSpiral Python is a road map of subjects that can be found in any introductory book or online resource about Python, but absolutely original in the sense that it takes into account how people learn in a natural way. You do not need to know the whole language before you can use it. Spiral Python also contains exercises (to practice) and challenges (to motivate).\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1948,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/spiral-python",
      "url": "https://ep2023.europython.eu/session/spiral-python"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Jan Kroon"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/_YdCQmUl1qA/maxresdefault.jpg",
  "title": "Spiral Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_YdCQmUl1qA"
    }
  ]
}
