{
  "description": "[EuroPython 2023 — Terrace 2A on 2023-07-19]\n\rhttps://ep2023.europython.eu/session/the-python-package-repository-accelerating-software-development-at-cern\n\nPython’s expressive syntax, ease of use, and powerful ecosystem of third-party packages are all major contributing factors to its thriving use for accelerator controls at CERN. Providing access to this rich ecosystem in a protected environment, whilst also allowing developers to augment this with internally developed packages is a key enabling service. Existing open-source solutions didn’t meet our needs, and the evolving Package index standardisation, as well as exposure to dependency confusion attacks, left us searching for a more modular and flexible approach.  \n\n\n\rIn this presentation we will demonstrate the Python package upload, index, and browsing services developed at CERN. We will discuss the gradual transition from our existing repository service (based on Nexus), and demonstrate - with the help of recent packaging PEPs - the flexibility that modularising the services has brought, helping us to meet our needs for local specialisation and enhanced security measures.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1817,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/the-python-package-repository-accelerating-software-development-at-cern",
      "url": "https://ep2023.europython.eu/session/the-python-package-repository-accelerating-software-development-at-cern"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Phil Elson",
    "Ivan Sinkarenko"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/CyE7E80y9jM/maxresdefault.jpg",
  "title": "The Python package repository accelerating software development @ CERN",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CyE7E80y9jM"
    }
  ]
}
