{
  "description": "[EuroPython 2023 — Terrace 2B on 2023-07-21]\n\rhttps://ep2023.europython.eu/session/time-made-easy-simplify-date-and-time-handling-with-pythons-pendulum\n\nPendulum is a Python package for working with dates, times, and timezones. It offers a simple and intuitive API for common date/time operations and provides advanced functionality for dealing with more complex scenarios. Some of the interesting points of Pendulum include support for leap years, time zones, and daylight saving time, as well as a fluent API for creating and modifying dates and times.\n\n\rOne of the standout features of Pendulum is its support for time zones. The library comes with a comprehensive list of time zones, and it can automatically adjust dates and times to the local time zone of a given location. Additionally, Pendulum can handle time zone conversions with ease, making it easy to work with date/time data across different time zones.\n\n\rPendulum also provides a powerful API for creating and modifying dates and times. With its fluent interface, developers can create and manipulate dates and times using a natural, human-readable syntax.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1645,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/time-made-easy-simplify-date-and-time-handling-with-pythons-pendulum",
      "url": "https://ep2023.europython.eu/session/time-made-easy-simplify-date-and-time-handling-with-pythons-pendulum"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/12tDwMIAsQs/maxresdefault.jpg",
  "title": "Time Made Easy: Simplify Date and Time Handling with Python's Pendulum — Abhinand C, Jothir Adithyan",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=12tDwMIAsQs"
    }
  ]
}
