{
  "description": "[EuroPython 2023 — South Hall 2B on 2023-07-20]\n\rhttps://ep2023.europython.eu/session/understanding-neural-network-architectures-with-attention-and-diffusion\n\nNeural networks have revolutionized AI, enabling machines to learn from data and make intelligent decisions. In this talk, we'll explore two popular architectures: Attention models and Diffusion models.\n\n\rFirst up, we'll discuss Attention models and how they've contributed to the success of large language models like ChatGPT. We'll explore how the Attention mechanism helps GPT focus on specific parts of a text sequence and how this mechanism has been applied to different tasks in natural language processing.\n\n\rNext, we'll dive into Diffusion models, a class of generative models that have shown remarkable performance in image synthesis. We'll explain how they work and their potential applications in the creative industry.\n\n\rThis is a good talk for visual learners. I prepared schematic diagrams, which present main features of the nerual network architectures. By necessity, the diagrams are oversimplified, but I believe they will allow you to gain some insight into Transformers and Latent Diffusion models.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2295,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/understanding-neural-network-architectures-with-attention-and-diffusion",
      "url": "https://ep2023.europython.eu/session/understanding-neural-network-architectures-with-attention-and-diffusion"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Clh0nJRMvNs/maxresdefault.jpg",
  "title": "Understanding Neural Network Architectures with Attention and Diffusion — Michal Karzynski",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Clh0nJRMvNs"
    }
  ]
}
