{
  "description": "[EuroPython 2023 — Terrace 2A on 2023-07-19]\n\rhttps://ep2023.europython.eu/session/using-nlp-to-detect-knots-in-protein-structures\n\nProteins are essential components of our bodies, with their function often dependent on their 3D structure. However, uncovering the 3D structure has for a long time been redeemed by months of hard work in the lab. Recent advances in Machine learning and Natural language processing have made it possible to build models (eg. AlphaFold) capable of predicting the protein's 3D structure with the same precision as experimental methods.\n\n\rIn this talk, I will explore an even more specific application of language models for proteins - the detection of a knot in a protein's 3D structure solely from the protein amino acid sequence. Knotting in proteins is a phenomenon that can affect their function and stability. Thanks to NLP and interpretation techniques we can try to uncover why and how proteins tie themself into a knot. In this research, we rely on many Python-based tools starting from Biopython to Pymol and Hugging Face transformer library.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1524,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/using-nlp-to-detect-knots-in-protein-structures",
      "url": "https://ep2023.europython.eu/session/using-nlp-to-detect-knots-in-protein-structures"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "Eva Klimentová"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Kah5QOWnLrM/maxresdefault.jpg",
  "title": "Using NLP to Detect Knots in Protein Structures",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Kah5QOWnLrM"
    }
  ]
}
