{
  "description": "[EuroPython 2023 — Forum Hall on 2023-07-20]\n\rhttps://ep2023.europython.eu/session/welcome-to-your-world\n\nIn 2018 the author, journalist and broadcaster Andrew Smith realized that although computer code now mediated almost everything he did, he understood next to nothing about it. The only way to participate in the growing debates around what our code should and should not do, he reasoned, would be to enter the world of the people writing it, by learning to code himself. Nice idea! In a near thirty year writing career, Smith had flown to the edge of space, slept under Spearfish torpedoes aboard a nuclear hunter-killer submarine, roamed the vast Victorian sewer system under London, spent six months on the road with Bianca Jagger, toured with artists including Radiohead and The Prodigy, and been perhaps the only person ever to shake Fidel Castro's hand by accident. None of which prepared him for the challenge of learning to code. After a miserable false start with JavaScript, a kindly C++ programmer pointed him in the direction of Python and he fell in love not just with the language, but with the remarkable community behind it. In this unusual keynote, Andrew, with help from his great friend and Python stalwart Nicholas Tollervey, will describe what he found—explaining the joys, frustrations and surprises, while touching on his experiences in Silicon Valley and the intriguing historical discoveries he made during his research. Smith's meditation on code's relationship to the wider world, Devil in the Stack: Searching for the Soul of the New Machine, will be published next March. This is his chance to share a preview of his reflections with the community that did so much to make them possible, of which he is grateful to consider himself a part.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 2619,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2023.europython.eu/session/welcome-to-your-world",
      "url": "https://ep2023.europython.eu/session/welcome-to-your-world"
    }
  ],
  "speakers": [
    "Andrew Smith"
  ],
  "tags": [
    "Keynote"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/JuiGZcslwl0/maxresdefault.jpg",
  "title": "Welcome to Your World",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JuiGZcslwl0"
    }
  ]
}
