{
  "description": "[EuroPython 2023 — North Hall on 2023-07-21]\n\rhttps://ep2023.europython.eu/session/working-in-units-how-to-decouple-the-database-and-domain-layers-in-python\n\nA crucial element of architecting a software application for scale is the collaboration of domain experts and developers. For that to happen, the application must separate the domain layer— where elements that represent the real world reside—from the infrastructure layer—where these elements are translated into precise software processes.\n\n\rWithin the Fintech team at Kiwi.com, we are rearchitecting a critical service to accept more payment providers. As part of this refactor, we are adopting the Unit of Work pattern to disentangle domain entities from the database processes that represent them. This way, domain experts can share their knowledge with developers more easily, and developers can find opportunities for optimization without the involvement of domain experts in the process.\n\n\rAttendees will gain a solid understanding of how to implement the UoW pattern in their Python applications, how it fits into the broader context of DDD, and how to prepare their code for future growth.\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "duration": 1824,
  "language": "eng",
  "recorded": "2023-07-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2023.europython.eu/"
    },
    {
      "label": "https://ep2023.europython.eu/session/working-in-units-how-to-decouple-the-database-and-domain-layers-in-python",
      "url": "https://ep2023.europython.eu/session/working-in-units-how-to-decouple-the-database-and-domain-layers-in-python"
    },
    {
      "label": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "http://creativecommons.org/licenses/by-nc-sa/4.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/nLQoxqENbgg/maxresdefault.jpg",
  "title": "Working in Units: How to Decouple the Database and Domain Layers in Python — Alvaro Duran",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nLQoxqENbgg"
    }
  ]
}
