{
  "description": "Título: Análisis geográfico en Jupyterlab para sistemas de agua potable rural en la región de los Ríos\n\nLos sistemas de agua potable rural (APR), son sistemas que abastecen de agua potable a localidades rurales concentradas y semi-concentradas mediante una infraestructura que puede ser un pozo, filtro o almacenaje de agua; los que son administrados, operados y mantenidos por los comités o cooperativas de la zona. Estos sistemas surgieron principalmente para mejorar las condiciones de salud de la población de esas localidades debido a que, al utilizar agua no potable, se presentaba un alto nivel de mortalidad y enfermades por la ingesta del agua.\n\nEn este contexto proponemos un análisis geográfico en Jupyterlab para identificar de forma dinámica las ubicaciones de estos puntos y las brechas existentes en la región de los ríos. Además, realizar una propuesta de zonas con mayores déficits de sistemas APR, mediante una comparación de las personas beneficiadas con el total de población rural de la región según los registros demográficos del último censo.\n\nPonentes: Juan Venegas Gutiérrez y Nataly Osses Morales\n\nContacto:\nhttps://www.linkedin.com/in/jfvenegas/\nhttps://jfvenegasg.github.io/\n\n----------------------------------------------------------------------------------------------------------------------------------------------------\n\n\nPyCon Chile 2022 - https://pycon.cl/\n\n\nPyCon Chile es un evento gratuito organizado por la comunidad Python Chile, para promover la divulgación y enseñanza de Python. Esta conferencia busca reunir a todos los entusiastas de Python, desde principiantes hasta usuarios avanzados, para compartir distintas temáticas relacionadas al lenguaje.\n\n\nSi te interesa utilizar Python en áreas tan variadas como ciencia de datos, inteligencia artificial, astronomía, geología, optimización matemática o ciencias sociales, entre otras, ¡este evento te encantará!\n\n\n★ ¡Únete a la comunidad! ★\n\n\n• Twitter: https://twitter.com/pythonchiledev\n• Facebook: https://www.facebook.com/groups/pytho...\n• Telegram: https://t.me/pythonchile\n• Discord: https://discord.gg/dTHMfJvauS",
  "duration": 1990,
  "language": "spa",
  "recorded": "2022-12-02",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pycon.cl/2022/"
    },
    {
      "label": "https://twitter.com/pythonchiledev",
      "url": "https://twitter.com/pythonchiledev"
    },
    {
      "label": "https://www.linkedin.com/in/jfvenegas/",
      "url": "https://www.linkedin.com/in/jfvenegas/"
    },
    {
      "label": "https://www.facebook.com/groups/pytho...",
      "url": "https://www.facebook.com/groups/pytho..."
    },
    {
      "label": "https://jfvenegasg.github.io/",
      "url": "https://jfvenegasg.github.io/"
    },
    {
      "label": "https://pycon.cl/",
      "url": "https://pycon.cl/"
    },
    {
      "label": "https://t.me/pythonchile",
      "url": "https://t.me/pythonchile"
    },
    {
      "label": "https://discord.gg/dTHMfJvauS",
      "url": "https://discord.gg/dTHMfJvauS"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "APR",
    "Agua",
    "Análisis geográfico",
    "Chile",
    "Geografía",
    "Jupyterlab",
    "Machine Learning",
    "Pycon2022",
    "Python",
    "agua potable"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/SUGd2KsaJ48/maxresdefault.webp",
  "title": "PyCon Chile 2022 - Juan y Nataly - Análisis geográfico en Jupyterlab para sistemas de agua potable.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SUGd2KsaJ48"
    }
  ]
}
