{
  "description": "Título: Construyendo aplicaciones de visión computacional de alto rendimiento\n\n​​En esta sesión mostraremos cómo construir (de forma simple) aplicaciones de visión computacional optimizadas para el funcionamiento en tiempo real.\n​​\n​​Revisaremos un ejemplo simple utilizando OpenCV, para evidenciar algunas de las principales limitaciones que podemos encontrar al poner estos modelos en producción: rendmimiento, complejidad y velocidad de programación.\n​​\n​​A continuación, introduciremos Nvidia Deepstream, un SDK basado en Gstreamer para procesamiento de video y visión computacional de alto rendimiento. Introduciremos los conceptos básicos para el desarrollo de una aplicación con Deepstream y de qué manera se trabaja con los metadatos generados por distintos modelos de deep learning: clasificación, detección, segmentación o seguimiento de objetos en flujos de video en tiempo real.\n​​\n​​Luego, presentamos una librería que permite obtener lo mejor de ambos mundos: el performance de deepstream y la facilidad de programación. Para ello, mostraremos cómo, utilizando pocas líneas de código, es posible construir desde prototipos hasta aplicaciones robustas de procesamiento de video.\n​​\n​​Finalizaremos con una breve implementación que permitirá ilustrar las ventajas que ofrece este SDK en el desarrollo de los casos de uso mencionados anteriormente.\n\nPonente: Pablo Woolvett\n\nContacto:\nhttps://www.linkedin.com/in/pablowoolvett\nhttps://rmccorporate.com/\n\n----------------------------------------------------------------------------------------------------------------------------------------------------\n\n\nPyCon Chile 2022 - https://pycon.cl/\n\n\nPyCon Chile es un evento gratuito organizado por la comunidad Python Chile, para promover la divulgación y enseñanza de Python. Esta conferencia busca reunir a todos los entusiastas de Python, desde principiantes hasta usuarios avanzados, para compartir distintas temáticas relacionadas al lenguaje.\n\n\nSi te interesa utilizar Python en áreas tan variadas como ciencia de datos, inteligencia artificial, astronomía, geología, optimización matemática o ciencias sociales, entre otras, ¡este evento te encantará!\n\n\n★ ¡Únete a la comunidad! ★\n\n\n• Twitter: https://twitter.com/pythonchiledev\n• Facebook: https://www.facebook.com/groups/pytho...\n• Telegram: https://t.me/pythonchile\n• Discord: https://discord.gg/dTHMfJvauS",
  "duration": 2214,
  "language": "spa",
  "recorded": "2022-12-02",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pycon.cl/2022/"
    },
    {
      "label": "https://www.linkedin.com/in/pablowoolvett",
      "url": "https://www.linkedin.com/in/pablowoolvett"
    },
    {
      "label": "https://twitter.com/pythonchiledev",
      "url": "https://twitter.com/pythonchiledev"
    },
    {
      "label": "https://www.facebook.com/groups/pytho...",
      "url": "https://www.facebook.com/groups/pytho..."
    },
    {
      "label": "https://pycon.cl/",
      "url": "https://pycon.cl/"
    },
    {
      "label": "https://rmccorporate.com/",
      "url": "https://rmccorporate.com/"
    },
    {
      "label": "https://t.me/pythonchile",
      "url": "https://t.me/pythonchile"
    },
    {
      "label": "https://discord.gg/dTHMfJvauS",
      "url": "https://discord.gg/dTHMfJvauS"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Chile",
    "Machine learning",
    "Nvidia",
    "OpenCV",
    "Pycon2022",
    "Pythia",
    "Python",
    "Santiago",
    "Visión Computacional",
    "tiempo real"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/4kFANji4Lq4/maxresdefault.webp",
  "title": "PyCon Chile 2022 - Santiago - Pablo Woolvett - Construyendo aplicaciones de visión computacional",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4kFANji4Lq4"
    }
  ]
}
