{
  "description": "At any given time, 1 in 5 adults are living with a mental illness, such as depression, bipolar disorder, generalized anxiety disorder, substance use disorder, burnout, or ADHD. Statistically, all of us working for an organization with 5 or more employees have at least one colleague who is affected. At the same time, the tech industry is often characterized by high stress, long hours, workplace pressure to be available by phone and e-mail after-hours or sometimes even while on vacation, social pressure to constantly network and attend conferences and make a name for yourself, and the precarious balance between trying to do good by contributing to open-source and maintaining some semblance of free time that doesn't involve coding. Given how this demanding environment increasingly blurs the line between our professional and personal lives, how can we ensure that the most vulnerable among us aren't being left behind?\n\nAs a community, the single most damaging thing we can do is continue to treat mental health as a personal shortcoming that can't be talked about openly. We shouldn't think of it as \"somebody else's problem\"; the 4 in 5 of us who don't currently have mental health disorders must do our part to help end the stigma. This talk will begin with an overview of key statistics about mental illness, followed by the efforts of the non-profit organization Open Sourcing Mental Illness to gather more data about mental health in the tech industry, and finally conclude with ideas and strategies for making our tech workplaces more accommodating and inclusive.",
  "duration": 1919,
  "language": "eng",
  "recorded": "2017-11-19",
  "related_urls": [
    {
      "label": "Event schedule",
      "url": "https://2017.pycon.ca/schedule/"
    },
    {
      "label": "Talk schedule",
      "url": "https://2017.pycon.ca/schedule/45/"
    }
  ],
  "speakers": [
    "Nara Kasbergen"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/6o_qNqAxDuI/hqdefault.jpg",
  "title": "Empathy as a service: supporting mental health in the tech workplace",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6o_qNqAxDuI"
    }
  ]
}
