{
  "description": "Using gmplot, geopy, and Python data science tools we’ll discover realtor farms, and assess the characteristics of sales vs listing price. Real estate transactions tend to be geographically sparse and temporally rare. There is often both a listing and a selling agent in the representing a given property. The sales price is determined by a number of factor. While there has been considerable interest in building pricing models relying on physical parameters, there has been little work done in assessing the contribution of the realtor. The discovery of a ‘farm’ uses cluster identification methods. These farms can then be analyzed for imputed listing prices and the sales price, both of which are negotiated.\n\nThe problem: Most real estate analytics deal only with property description and location. Markets can swing quickly from buyer’s to seller’s advantage, so timing and days on market is important. Agent effects are not well understood and can be a significant factor in determining the actual price. Data source are examined . Python Modules utilized. Application of data science, e.g. modules pycluster, pyclustering, scikit-learn. (the talk is primarily application, not theory)\n\nExamples of geographic and hidden affinity Analysis of listing price to appraisal and listing agent effect Analysis of over/under-performance of sales price to listing price Determination of listing agent vs selling agent negotiation skills. Effect of dual agency on pricing. Effect of listing agent Farms on neighborhood pricing.\n\nConsideration as a Machine Learning project using Theano or TensorFlow , Keras, Sonnet tflearn\n\nConclusions and future directions Questions\n\ndata, code, notebooks, and graphics will be included\n\nThe methodology presented is likely applicable to other low-volume high-value facilitated transactions.",
  "duration": 1830,
  "language": "eng",
  "recorded": "2017-11-18",
  "related_urls": [
    {
      "label": "Event schedule",
      "url": "https://2017.pycon.ca/schedule/"
    },
    {
      "label": "Talk schedule",
      "url": "https://2017.pycon.ca/schedule/65/"
    }
  ],
  "speakers": [
    "en zyme"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/FXR4_2dULw8/hqdefault.jpg",
  "title": "Find the farm -- data science insights into real estate pricing",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FXR4_2dULw8"
    }
  ]
}
