{
  "description": "Outline\n\n* The Promise versus Reality: Healthcare, Medical Imaging, and A.I.\n* The State of Deep Learning in Radiology and Medical Imaging Research\n* Understanding Radiology Workflow: What Problems Are Yet To Be Solved\n* The Top 5 Problems and Mitigations to Bringing Your AI Solution to Clinical Application\n* Call to Action: Datasets and Python Toolset Resources for Approaching Medical Imaging\n\nDescription\n\nThis talk will discuss the state of deep learning from a uniquely clinical perspective and offer the audience member an opportunity to understand the challenges facing the clinical medical imaging community and outline opportunities for the Python community to engage with clinicians. It will examine the disconnect between what has been promised versus what’s been delivered between radiology and artificial intelligence. A brief review of the most exciting and recent research and methodologies as applied to medical imaging will be performed. We will discuss how machine learning could be applied to the full spectrum of radiology workflow beyond simply computer assisted detection and characterization. There will be a broadly applicable discussion of the Top 5 problems and mitigations necessary for individuals and organizations bringing their A.I. solutions to a clinical setting. Finally, there will be a summary of datasets and Python resources that will assist interested developers in contributing to the growing medical imaging A.I. community. This material has not been presented previously elsewhere.",
  "duration": 1932,
  "language": "eng",
  "recorded": "2017-11-19",
  "related_urls": [
    {
      "label": "Event schedule",
      "url": "https://2017.pycon.ca/schedule/"
    },
    {
      "label": "Talk schedule",
      "url": "https://2017.pycon.ca/schedule/13/"
    }
  ],
  "speakers": [
    "Jaron Chong"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/f1_Q0qGAKS8/hqdefault.jpg",
  "title": "How I learned to stop worrying and love deep learning: a radiologist's perspective",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=f1_Q0qGAKS8"
    }
  ]
}
