{
  "description": "Le succès de ses dernières années des outils de chat en ligne professionnels comme Slack ou Hipchat montrent que la collaboration des équipes de dévelopement et d'administration systèmes a changée. Elle est devenue temps réel. ChatOps, qui s'inscrit dans cette tendance, est l'idée de mettre vos outils devops au coeur de la conversation. Pour citer quelques opérations implémentées avec chatops, nous avons: deploiements, provisioning, monitoring, graphs, suivi de developpement tracking...\n\nErrbot est devenu au fil des années le chatbot de référence pour Python. Il permets non seulement aux developpeurs Python d'écrire de façon très naturelle des fonctionnalitées chatops en quelques lignes mais aussi, vous pourrez le voir dans cette présentation, permets à vos equipes de développement de personnaliser leur expérience de discussion en ligne avec des additions amusantes.\n\nLe but de cette présentation est de vous montrer comme il est facile de démarrer avec chatops avec Errbot, avec une série d'exemples concrets en Python et des conseils pratiques à propos de l'installation, la sécurité, etc. mais aussi quelques conseils pour assurer son succès dans les équipes.",
  "duration": 1217,
  "language": "fra",
  "recorded": "2017-11-19",
  "related_urls": [
    {
      "label": "Event schedule",
      "url": "https://2017.pycon.ca/schedule/"
    },
    {
      "label": "Talk schedule",
      "url": "https://2017.pycon.ca/schedule/52/"
    },
    {
      "label": "Errbot",
      "url": "http://errbot.io/"
    }
  ],
  "speakers": [
    "Guillaume Binet"
  ],
  "tags": [
    "errbot",
    "chatops"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Y9lTeJ1lnc8/hqdefault.jpg",
  "title": "Introduction à Chatops en Python avec Errbot",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Y9lTeJ1lnc8"
    }
  ]
}
