{
  "alias": "video/2928/atdd-und-robot-framework-in-ambitionierten-heter",
  "category": "PyCon DE 2011",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Beim Acceptance Test Driven Development erarbeiten die Entwickler\nzusammen mit den anderen am Softwareentwicklungsprozess beteiligten\nInteressensvertretern gemeinsam (zum Beispiel während der\nSprint-Planung) ausführbare Tests auf Akzeptanz-Level, also solche die\nin fast natürlichsprachlicher und für alle Beteiligten verständlichen\nWeise dokumentieren wann der zu entwickelnde Teil Software fertig ist.\nSo erhält man ein stetig wachsendes und ausführbares\nAnforderungsdokument.\n\nRobot Framework (http://code.google.com/p/robotframework/) ist ein in\nPython geschriebenes Testautomatisierungsframework das zunächst intern\nbei Nokia Siemens Networks entwickelt wurde, aber vor gut zwei Jahren\nunter Apache-2.0-Lizenz veröffentlicht wurde. RF liest einfache\ntabellarische Test-Skripte (die z.B. aus Excel exportiert werden, falls\ndas die Kollaborations-Schnittstelle zum \"Produktmenschenen\" sein\nsollte) ein und führt diese dann aus. Dabei lassen sich wiederholende\nAnweisungen in übergeordnete Keywords abstrahieren und so\nwiederverwenden, insbesondere aber lässt sich damit Komplexität\nverstecken.\n\nDie vielen Plugins, Ein- und Ausgabemöglichkeiten, Erweiterungs- und\nIntegrationsmöglichkeiten mit anderer Software, etc. machen Robot\nFramework zu einem herausragenden Werkzeug. Größtes Problem der Software\nist wohl die weitgehende Unbekanntheit, aber das kann man ja ändern.\n\nDer Vortrag soll die Vorgehensweise ATDD unter Verwendung vieler\nCode-Beispiele und Workflow-Vorschläge vorstellen und den ein oder\nanderen für ATDD begeistern.\n",
  "duration": null,
  "id": 2928,
  "language": "deu",
  "quality_notes": "",
  "recorded": "2011-10-05",
  "related_urls": [
    "http://code.google.com/p/robotframework/)"
  ],
  "slug": "atdd-und-robot-framework-in-ambitionierten-heter",
  "speakers": [
    "Filip Noetzel"
  ],
  "summary": "Robot Framework ist ein generisches Testautomatisierungs-Framework und\neignet sich besonders gut für heterogene Umgebungen in denen viel\nunterschiedlichste Software zusammenspielen muss. Der Vortrag klärt\nkurz, was Acceptance Test Driven Development ist, warum es eine gute\nIdee ist und wie man das mit Robot Framework in den eigenen\nSoftwareprozess integriert.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/vfRysNuPSq4/hqdefault.jpg",
  "title": "ATDD und Robot Framework in ambitionierten, heterogenen Umgebungen",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vfRysNuPSq4"
    }
  ]
}
