{
  "alias": "video/2910/keynote-informatik-fur-die-welt-von-morgen",
  "category": "PyCon DE 2011",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "",
  "duration": null,
  "id": 2910,
  "language": "deu",
  "quality_notes": "",
  "recorded": "2011-10-07",
  "slug": "keynote-informatik-fur-die-welt-von-morgen",
  "speakers": [
    "Andreas Schreiber"
  ],
  "summary": "In ingenieurwissenschaftlichen Forschungseinrichtungen werden in vielen\nBereichen Technologien für unsere Welt von Morgen entwickelt.\nBeispielsweise im DLR für Mobilität auf der Erde, in der Luft und im\nWeltraum und für den Erhalt unserer Umwelt. Informatik spielt dabei eine\nwichtige Rolle. Dabei ist wichtig, dass Informatik und spezielle\nSoftwaretechnologie die Arbeit der Ingenieure effektiv unterstützen und\nvoranbringen, ohne sie in ihrer wissenschaftlichen Freiheit und\nKreativität zu behindern. Dies erreicht man durch benutzbare, einfach\nzugängliche und nahtlos in die existierende Arbeitsumgebung\nintegrierbare Softwaretechnologien. Beispielsweise problem-spezifische\nBenutzeroberflächen, leicht zu erlernende Programmiersprachen oder\nübersichtliche High-Level-APIs für Anwendungen und Bibliotheken. Als\neine Standardsprache im wissenschaftlichen Bereich findet insbesondere\nPython immer größere Verbreitung. Zusammen mit leistungsfähigen\nBibliotheken wie NumPy, wird Python zunehmend ein Ersatz für etablierte\ningenieurwissenschaftliche Standardtools wie MATLAB. Damit kann man\nbereits viele Aufgaben bewältigen. Im Vortrag werden dazu Beispiele für\neinen erfolgreichen Einsatz von Python gezeigt, zum Beispiel\nHigh-Perfomance-Computing-Anwendugen. Zusätzlich aber auch die\nexistierenden Lücken und Schwächen angesprochen.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/EtDb3A14BJM/hqdefault.jpg",
  "title": "Keynote - Informatik für die Welt von Morgen",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EtDb3A14BJM"
    }
  ]
}
