{
  "alias": "video/2929/pyhasse-eine-toolbox-fur-ranking-probleme",
  "category": "PyCon DE 2011",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "Ranking, d.h. das Auffinden einer Ordnung für bestimmte Objekte, ist von\nzunehmender Bedeutung. Beispielsweise werden Städte nach ihrer\nWohnqualität, Nationen nach ihrer Kinderfreundlichkeit, Chemikalien nach\nihrer Umweltgefährlichkeit geordnet. Steht ein Ranking-Index zur\nVerfügung, so ist die Erstellung einer Ordnung anhand der Zahlenwerte\ndieses Index' kein Problem. Oft aber steht ein solcher Ranking-Index\nnicht zur Verfügung; man muss die Objekte, die gerankt werden sollen,\nanhand von mehreren Indikatoren simultan beschreiben. In einem solchen\nFall ist die Erstellung eines Rankings nicht mehr so einfach, weil die\nIndikatoren nicht notwendig korreliert sein müssen. Derartige\nMulti-Indikatorensysteme führen demnach nicht zu einer (kompletten)\nOrdnung, sondern zu einer partiellen. PyHasse, mit zur Zeit mehr als 60\nModulen dient zur ordinalen Analyse solcher Multi-Indikatorensysteme.\nNeben der Erstellung der partiellen Ordnung und ihrer Visualisierung\ndurch sog. Hassediagramme gehören beispielsweise Sensitivitätsanalyse,\nAbleitung einer schwachen Ordnung (nach verschiedenen Verfahren), und\nÄhnlichkeitsanalysen zum Aufgaben-gebiet von PyHasse. Die\nBenutzeroberflächen der Module von PyHasse sind weitestgehend analog\naufgebaut (Tkinter), zwei selbst erstellte Bibliotheken, rmod2 und\nraioop2, entlasten die Module von Routine - Aufgaben. Darüberhinaus\nstehen mit pstat und stats aus dem Internet einfache statistische\nProzeduren zur Verfügung. PyHasse (auf der Basis von Python 2.6) wird\nbereits weltweit genutzt und wird \"theorie-nahe\" weiterentwickelt.\nPyHasse soll die Lücke zwischen meist hochaktuellen \"Laborprogrammen\"\nund professionell erstellter Software (die oft der theoretischen\nEntwicklung nachhinkt) schließen. PyHasse ist unter den Betriebssystemen\nWindows XP und aufwärts, sowie Linux getestet. Für andere\nBetriebssysteme stehen Erfahrungsberichte noch aus.\n",
  "duration": null,
  "id": 2929,
  "language": "deu",
  "quality_notes": "",
  "recorded": "2011-10-05",
  "slug": "pyhasse-eine-toolbox-fur-ranking-probleme",
  "speakers": [
    "Rainer Bruggemann"
  ],
  "summary": "Ranking, d.h. das Auffinden einer Ordnung für bestimmte Objekte, ist von\nzunehmender Bedeutung. Beispielsweise werden Städte nach ihrer\nWohnqualität, geordnet. Oft erhält man aber nur eine eine partielle\nOrdnung und ein Ranking muss in einem zweiten Schritt abgeleitet werden.\nPyHasse, entwickelt vom Verfasser, erstellt die partiellen Ordnungen und\nanalysiert diese.\n",
  "tags": [],
  "thumbnail_url": "https://i1.ytimg.com/vi/lRx6I_g6KBU/hqdefault.jpg",
  "title": "\"PyHasse\", eine Toolbox für Ranking-Probleme",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lRx6I_g6KBU"
    }
  ]
}
