{
  "id": 114, 
  "category": "Kiwi PyCon 2009", 
  "slug": "brian-thorne---computer-vision", 
  "title": "Brian Thorne - Computer Vision", 
  "summary": "", 
  "description": "Computer Vision\n\nPresented by Brian Thorne\n\nAbstract\n\nAn introduction to computer vision in Python, from the general concept to its\nimplementation with some current open-source libraries (opencv, scipy,\npygame).\n\nOutline\n\nThe purpose of my presentation is an introduction to computer vision (CV) and\nimage processing in Python. I will aim to show what is possible with current\nlibraries, demonstrate their usability, explore their limitations, and cover\nelements of best coding practice. Firstly, I will briefly present the basics,\nsuch as video grabbing, image processing and computer vision algorithms. I\nwill illustrate my presentation with the Python bindings to the opencv library\nand show different examples such as displaying a video image, some filtering\nalgorithms (dilation, gaussian blur), and how to implement facial recognition.\nI will describe after how related tasks can be achieved with other Python\ntools such as scipy and pygame. I will show how these three libraries can be\nused in conjunction to perform video capturing, image processing and user\ninterfacing. Finally, I will introduce my basic Python computer vision\nframework, which is aimed at inexperienced users, and demonstrate it on the XO\nlaptop, the inexpensive low-powered sub-notebook distributed as part of the\nOne Laptop Per Child (OLPC) initiative.\n\n[VIDEO HAS ISSUES: Sound and video are poor. Slides are hard to read.]\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", 
  "thumbnail_url": "http://a.images.blip.tv/Kiwipycon-BrianThorneComputerVision172-560.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/kiwi-pycon-2009/114_brian-thorne-computer-vision.flv", 
      "length": null, 
      "type": "flv"
    }
  ], 
  "source_url": "", 
  "tags": [
    "kiwipycon", 
    "kiwipycon2009", 
    "olpc", 
    "pygame", 
    "scipy", 
    "vision"
  ], 
  "speakers": [
    "Brian Thorne"
  ], 
  "recorded": null
}