{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "Kiwi PyCon 2009", "speakers": ["Tim McNamara"], "title": "Tim McNamara - OLPC XO: Python bringing education to the world's poorest children", "quality_notes": "", "video_flv_length": null, "recorded": null, "video_mp4_length": null, "description": "OLPC XO: Python bringing education to the world's poorest children\n\nPresented by Tim McNamara\n\nAbstract\n\nThis topic will be divided into five different area of 10 minutes each, with\ntime for questions and discussion. We'll talk about the OLPC programme, the\nhardware, the software, the educational theory and how to get involved NZ.\n\nOutline\n\n  1. In defence of the OLPC XO This section will be a brief overview of the whole project hopefully with an eye to dispel some rumour and controversy surrounding the project. There has been several mixed messages, and I would like to \n  2. Overview of the hardware In this section, the talk to move into a discussion about the overview of the hardware itself. There will be several machines for the audience to have a look at, and we'll try and test some of the mesh networking, collaboration and sharing capabilities that are built into the machine. \n  3. Overview of the software The OLPC XO is run using a Python environment called Sugar ([http://sugarlabs.org.nz](http://sugarlabs.org.nz/)), which itself is a Fedora Remix. We will talk a little about how an Activity is built and how to start contributing to the Sugar system. \n  4. How to deploy into schools This segment will go over some of the theoretical underpinnings of the user interface and Sugar's approach to things like the directory structure. We'll also explore some of the tools that teachers and parents can use to progressively encourage their children to learn about computing and develop creative and critical thinking. \n  5. How to get involved There are small pockets of XOs around the country. Learn where they are and how to start improving them! \n\n[VIDEO HAS ISSUES: Sound and video are poor. Slides are hard to read.]\n\n", "video_mp4_url": null, "tags": ["kiwipycon", "kiwipycon2009", "olpc"], "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", "related_urls": [], "video_flv_download_only": false, "source_url": "", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://a.images.blip.tv/Kiwipycon-TimMcNamaraOLPCXOPythonBringingEducationToTheWorldsPo728-638.jpg", "video_flv_url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/kiwi-pycon-2009/116_tim-mcnamara-olpc-xo-python-bringing-education-to-the-world-s-poorest-children.flv"}