{
  "abstract": "In this presentation, we outline the utility of Python and Django as\nbackend components in a blockchain/cryptocurrency startup company. After\na brief explanation of blockchain systems in general, we provide an\noverview of and justification for the core components of our stack,\ndiscuss encountered problems, and highlight emerging trends in the\nPython/crypto space.\n\n*Tags:* Business & Start-Ups, Community, Django, Infrastructure, Python\n\nScheduled on `thursday 14:00 </schedule/#thu-14:00-lecture>`__ in room\nlecture\n",
  "copyright_text": null,
  "description": "While many cryptographic components of blockchain protocols can be\nextremely complex, blockchain systems themselves are relatively easy to\nunderstand when viewed from a distance. To take the example of Bitcoin,\nusers store digital currency in hardware or software wallets, and use\nprivate keys to sign and broadcast transactions. Broadcasted\ntransactions are grouped together into a block through a cryptographic\nprocess known as mining, with miners rewarded through the collection of\ntransaction fees and the issuance of new coins. The mined block of\ntransactions is appended to the existing chain, and verified by a global\nnetwork of nodes. This process repeats in perpetuity, with each newly\nadded block adding to the trustedness and security of data stored on the\nchain.\n\nIncreased interest in and demand for cryptocurrencies has brought about\na need for places where digital assets can easily be bought, sold or\ntraded. Our platform, Bitpanda, accomplishes this with a backend written\nin Python, and relying heavily on Django and MySQL databases. In our\npresentation, we begin by providing a brief overview of how blockchains\nwork. Following this, we describe the Python architecture that (e.g.)\ngenerates cryptocurrency wallets, builds, signs and sends transactions,\nand monitors blockchains for new, relevant data. Key challenges,\nsolutions and failures encountered during the development of the system,\nand growth of our team, are presented.\n\nThroughout our talk, we also highlight a number of broader social\nimplications of blockchains, and our work with them. More specifically,\nwe describe the need for open-innovation based approaches to blockchain\ndevelopment, the value of open-source within the blockchain community,\nand the current lack of critical discourse surrounding the potential\nuses of blockchains as mechanisms of surveillance and control.\n",
  "duration": 2428,
  "language": "eng",
  "recorded": "2018-10-25",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Danny McDonald",
    "Lorb"
  ],
  "tags": [
    "Business & Start-Ups",
    "Community",
    "Django",
    "Infrastructure",
    "Python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/6y75iiTzRPc/maxresdefault.jpg",
  "title": "Python on the blockchain: Triumphs and tribulations in a crypto startup",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6y75iiTzRPc"
    }
  ]
}
