{
  "abstract": "We give an overview about state-of-the-art land-use classification from\nsatellite data with CNNs (in Python) based on an open dataset.\n\n*Tags:* Artificial Intelligence, Computer Vision, Deep Learning &\nArtificial Intelligence, Data Science, Machine Learning, Science\n\nScheduled on `friday 11:55 </schedule/#fri-11:55-cubus>`__ in room cubus\n",
  "copyright_text": null,
  "description": "The largest earth observation programme Copernicus\n(http://copernicus.eu) makes it possible to perform terrestrial\nobservations providing data for all kinds of purposes. One important\nobjective is to monitor the land-use and land-cover changes with the\nSentinel-2 satellite mission. These satellites measure the sun\nreflectance on the earth surface with multispectral cameras (13 channels\nbetween 440 nm to 2190 nm). Machine learning techniques like\nconvolutional neural networks (CNN) are able to learn the link between\nthe satellite image (spectrum) and the ground truth (land use class). In\nthis talk, we give an overview about the state-of-the-art land-use\nclassification with CNNs based on an open dataset.\n\nThe EuroSAT benchmark dataset (http://madm.dfki.de/downloads) is freely\nprovided by German Research Center for Artificial Intelligence (DFKI).\nIt consists of 27.000 image patches for ten different land use/cover\nclasses, e.g. industrial and residential areas, different crop and\nvegetation types and forests. All samples have 64 by 64 pixel dimension\nand include either only the RGB images or all 13 bands.\n\nWe will use different out-of-box CNNs for the Keras deep learning\nlibrary (https://keras.io/). All networks are either included in Keras\nitself or are available from Github repositories. We will show the\nprocess of transfer learning for the RGB datasets. Furthermore, the\nminimal changes required to apply commonly used CNNs to multispectral\ndata are demonstrated. Thus, the interested audience will be able to\nperform their own classification of remote sensing data within a very\nshort time. Results of different network structures are visually\ncompared. Especially the differences of transfer learning and learning\nfrom scratch are demonstrated. This also includes the amount of\nnecessary training epochs, progress of training and validation error and\nvisual comparison of the results of the trained networks.\n\nFinally, we give a quick overview about the current research topics\nincluding recurrent neural networks for spatio-temporal land-use\nclassification and further applications of multi- and hyperspectral\ndata, e.g. for the estimation of water parameters and soil\ncharacteristics. Additionally, we provide links to the code and dataset\nused in this talk.\n",
  "duration": 1734,
  "language": "eng",
  "recorded": "2018-10-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Felix M. Riese",
    "Jens Leitloff"
  ],
  "tags": [
    "Artificial Intelligence",
    "Computer Vision",
    "Deep Learning & Artificial Intelligence",
    "Data Science",
    "Machine Learning",
    "Science"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/tKRoMcBeWjQ/maxresdefault.jpg",
  "title": "Satellite data is for everyone: insights into modern remote sensing research with open data and Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tKRoMcBeWjQ"
    }
  ]
}
