{
  "abstract": "PyTorch vs. TensorFlow? Why not PyTorch + TensorFlow? Lets's combine\ndeep learning frameworks and use their individual strengths for\nexplorative and production-oriented tasks along a data science project.\n\n*Tags:* Artificial Intelligence, Deep Learning & Artificial\nIntelligence, Data Science, Machine Learning\n\nScheduled on `friday 14:00 </schedule/#fri-14:00-cubus>`__ in room cubus\n",
  "copyright_text": null,
  "description": "Despite the many deep learning frameworks out in the wild few have\nachieved widespread adoption. Two of them are TensorFlow and PyTorch.\nWhere PyTorch relies on a dynamic computation graph TensorFlow goes for\na static graph. Where TensorFlow shows greater adoption and additional\nuseful extensions with TensorFlow Serving and TensorBoard, Pytorch\nproves useful trough its easy and more pythonic API.\n\nData scientists are confronted with explorative challenges, but also\nneed to be aware of model deployment and production. Do we need to\nsingle out frameworks until we end up with the only one or is there a\ncase for joint usage of two deep learning frameworks? Can we leverage\nthe strengths of the frameworks for different tasks along the path from\nexploration to production?\n\nIn my talk, I want to present a case combining the benefits of PyTorch\nand TensorFlow using the first for explorative and latter for deployment\ntasks. Therefore, I will choose a common deep learning challenge and\ndiscuss the strengths and weaknesses of both frameworks along a demo\nthat brings a model from development into production.\n",
  "duration": 2339,
  "language": "eng",
  "recorded": "2018-10-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Marcel Kurovski"
  ],
  "tags": [
    "Artificial Intelligence",
    "Deep Learning & Artificial Intelligence",
    "Data Science",
    "Machine Learning"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/vO3LB_-dQOM/maxresdefault.jpg",
  "title": "From exploration to deployment - combining PyTorch and TensorFlow for Deep Learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vO3LB_-dQOM"
    }
  ]
}
