{
  "abstract": "The confusion around terms such as like NoSQL, Big Data, Data Science,\nSQL, Spark, and Data Lakes often creates more fog than clarity. In my\npresentation, I will show that often at least three design dimensions\nare cluttered and confused in discussions when it comes to data\nmanagement and how understanding these dfimensions helps you making your\napplications several orders of magnitude faster.\n\n*Tags:* Algorithms, Big Data, Data Science, Infrastructure, Parallel\nProgramming, Programming, Python, Science\n\nScheduled on `thursday 10:30 </schedule/#thu-10:30-cubus>`__ in room\ncubus\n",
  "copyright_text": null,
  "description": "The confusion around terms such as like NoSQL, Big Data, Data Science,\nSpark, SQL, and Data Lakes often creates more fog than clarity. However,\nclarity about the underlying technologies is crucial to designing the\nbest technical solution in any field relying on huge amounts of data\nincluding data science, machine learning, but also more traditional\nanalytical systems such as data integration, data warehousing,\nreporting, and OLAP.\n\nIn my presentation, I will show that often at least three dimensions are\ncluttered and confused in discussions when it comes to data management:\nFirst, buzzwords (labels & terms like \"big data\", \"AI\", \"data lake\");\nsecond, data design patterns (principles & best practices like:\nselection push-down, materialization, indexing); and Third, software\nplatforms (concrete implementations & frameworks like: Python, DBMS,\nSpark, and NoSQL-systems).\n\nOnly by keeping these three dimensions apart, it is possible to create\ntechnically-sound architectures in the field of big data analytics.\n\nI will show concrete examples, which through a simple redesign and wise\nchoice of the right tools and technologies, run thereby up to 1000 times\nfaster. This in turn triggers tremendous savings in terms of development\ntime, hardware costs, and maintenance effort.\n",
  "duration": 2581,
  "language": "eng",
  "recorded": "2018-10-25",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Jens Dittrich"
  ],
  "tags": [
    "Algorithms",
    "Big Data",
    "Data Science",
    "Infrastructure",
    "Parallel Programming",
    "Programming",
    "Python",
    "Science"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/FLTC2N3xrug/maxresdefault.jpg",
  "title": "Big Data Systems Performance: The Little Shop of Horrors",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FLTC2N3xrug"
    }
  ]
}
