{
  "abstract": "Why should you work for free? This talk is about one of the best\ndecisions in my life... Starting to get into Open-Source. You will get a\ngentle introduction on what makes Open-Source so satisfying and the ways\nyou can use to get started with Open-Source. Whether you're already a\nfull grown developer or just starting out, this talk will probably give\nyou some ideas and the motivation to really become passionate. To close\nthis off, you will get a little impression on how important an\nOpen-Source portfolio is to your career and I'll give some neat hints to\nget your projects to the next level. So join me and start Your journey!\n\n*Tags:* Business & Start-Ups\n\nScheduled on `wednesday 17:10 </schedule/#wed-17:10-lecture>`__ in room\nlecture\n",
  "copyright_text": null,
  "description": "I will start of talking about why \"working for free\" became an important\npart of the developer culture all around the world and talk about why\ncompanies should try to share as many tools as possible. I'll give some\nexamples of tools that were open sourced and got immense traction\nleading to the projects growing with an intense speed. I'll try to take\naway the \"fear\" of open sourcing tools that cost ten of thousands of\ndollars to create. Then I'll describe how my journey with open source\nlooks like and start talking about how you can get your feet into\ncontributing to known projects. After that I will close off with some\nhints on doing and contributing to open source projects that worked out\ngreat for me. They will also get an impression on what opportunities\nwill show up if they put some of their time into doing OS.\n\nThe audience can be mixed, but it's way more interesting for people that\nare either new to programming or have never worked with open source.\n\nIn a perfect world, some of the listeners would leave the presentation\nwith the motivation and hard goal to start with OS as soon as possible.\n",
  "duration": 883,
  "language": "eng",
  "recorded": "2018-10-24",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Tim Großmann"
  ],
  "tags": [
    "Business & Start-Ups"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/A_UtST302Og/maxresdefault.jpg",
  "title": "About going Open-Source",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=A_UtST302Og"
    }
  ]
}
