{
  "abstract": "Nowadays, it's easy to build a model and play with data in a notebook,\nbut hard to bring the code to production. This talk will aim to answer:\n1. What does running an ML model in production involve? 2. How to\nimprove your development workflow to make the path to production easier?\n\n*Tags:* Artificial Intelligence, Data Science, Machine Learning\n\nScheduled on `wednesday 16:35 </schedule/#wed-16:35-lounge>`__ in room\nlounge\n",
  "copyright_text": null,
  "description": "Data science and Machine Learning are hot topics right now for Software\nEngineers and beyond. There are a lot of python tools that allow you to\nhack together a notebook to quickly get insight on your data, or train a\nmodel to predict or classify. Or you might have inherited some data\nwrangling and modeling {Jupyter/Zeppelin} notebook code from someone\nelse, like the resident data scientist.\n\nThe code works on test data, when you run the cells in the right order\n(skipping cell 22), and you believe that the insight gained from this\nwork would be a valuable game changer. But now how do you take this\nexperimental code into production, and keep it up-to-date with a regular\nretraining schedule? And what do you need to do after that, to ensure\nthat it remains reliable and brings value in the long term?\n\nThese will be the questions this talk will answer, focusing on 2 main\nthemes: What does running an ML model in production involve? How to\nimprove your development workflow to make the path to production easier?\n\nThis talk will draw examples from real projects at Yelp, like migrating\na pandas/sklearn classification project into production with pyspark,\nwhile aiming to give advice that is not dependent on specific\nframeworks, or tools, and is useful for listeners from all backgrounds.\n",
  "duration": 1896,
  "language": "eng",
  "recorded": "2018-10-24",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Lauris Jullien"
  ],
  "tags": [
    "Artificial Intelligence",
    "Data Science",
    "Machine Learning"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/M0A8GaT5qns/maxresdefault.jpg",
  "title": "Productionizing your ML code seamlessly",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=M0A8GaT5qns"
    }
  ]
}
