{
  "abstract": "The aim of this talk is to present a novel way of detecting topics that\nis especially suited for user generated content where topics are not as\nclearly separated as in the typical examples of Wikipedia or newsgroup\narticles. The basic idea is to compute a contextual similarity score\nthat defines a network from which we can identify clusters through\ncommunity detection.\n\n*Tags:* Artificial Intelligence, Deep Learning & Artificial\nIntelligence, Data Science, Networks, NLP, Machine Learning,\nVisualisation\n\nScheduled on `wednesday 12:20 </schedule/#wed-12:20-cubus>`__ in room\ncubus\n",
  "copyright_text": null,
  "description": "Identifying topic models for user generated content like hotel reviews\nturns out to be difficult with the standard approach of LDA (Latent\nDirichlet Allocation; Blei et al., 2003). Hotel review texts usually\ndon't differ as much in the topics that are covered as is typical with\nother genres such as Wikipedia or newsgroup articles where there is\ncommonly only a very small set of topics present in each document.\n\nTo this end, we developed our own approach to topic modeling that is\nespecially tailored to non-edited texts like hotel reviews. The approach\ncan be divided into three major steps. First, using the concept of\nsecond-order cooccurrences we define a contextual similarity score that\nenables us to identify words that are similar with respect to certain\ntopics. This score allows us to build up a topic network where nodes are\nwords and edges the contextual similarity between the words. With the\nhelp of algorithms from graph theory, like the Infomap algorithm\n(Rosvall and Bergstrom, 2008), we are able to detect clusters of highly\nconnected words that can be identified as topics in our review texts. In\na further step, we use these clusters and the respective words to get a\ntopic similarity score for each word in the network. In other words, we\ntransform a hard clustering of words into topics into a probability\nscore of how likely a certain word belongs to a given topic/cluster.\n\nThe presentation is structured as follows:\n\nReferences: David M. Blei, Andrew Y. Ng, Michael I. Jordan: Latent\ndirichlet allocation. In: Journal of Machine Learning Research, Jg. 3\n(2003), S. 993–1022, ISSN 1532-4435 M. Rosvall and C. T. Bergstrom, Maps\nof information flow reveal community structure in complex networks, PNAS\n105, 1118 (2008) http://dx.doi.org/10.1073/pnas.0706851105,\nhttp://arxiv.org/abs/0707.0609\n",
  "duration": 2025,
  "language": "eng",
  "recorded": "2018-10-24",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Thomas Mayer"
  ],
  "tags": [
    "Artificial Intelligence",
    "Deep Learning & Artificial Intelligence",
    "Data Science",
    "Networks",
    "NLP",
    "Machine Learning",
    "Visualisation"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/sI7VpFNiy_I/maxresdefault.jpg",
  "title": "Germany's next topic model",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sI7VpFNiy_I"
    }
  ]
}
