{
    "description": "A beginner friendly talk that goes from the manifestation of a bug in\nproduction, traces it all the way to its inception, and asks what other\nthan code needs to change to ship faster and NOT break things.\n\nWe open with the support rotation pager going off as customers of a low\nlatency realtime system report an outage. With every second of downtime\nresulting in revenue loss, it is all hands on deck for the site\nreliability team, Dev team, data team, product owners are peeling down\nthe stack. We will see the to the commit messages in polyglot systems\nthat caused the failure, the bug getting squashed, hotfix getting\nshipped and crisis is averted.\n\nCut to the blameless postmortem - the real life challenges of issue\nresolution that is more than changing lines in code, debugging\nworkflows, monitoring gaps, testing limitations, navigating change\nmanagement processes, team dynamics. for each of these pillars we will\nsee what allowed the teams to shift left, and shorten a bug's lifecycle.\n\n| What does the audience get out of it:\n| Modern software deployments are complex and dynamic ecosystems, an\n  ideal breeding ground for bugs. In a way, the lifecycle of a bug,\n  reveals the truth about the software development lifecycle of a\n  product.\n| This talk takes learnings from multiple real life outages and tries to\n  condense it as a shift-left journey by Continuous Questioning how can\n  we catch bugs in lower environments.\n",
    "language": "eng",
    "recorded": "2025-07-26",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://www.pyohio.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://www.pyohio.org/2025/program/talks/a-bug-s-life"
        }
    ],
    "speakers": [
        "Tathagata Dasgupta"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/D7FM7Js0GHg/maxresdefault.jpg",
    "title": "A Bug's Life",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=D7FM7Js0GHg"
        }
    ]
}