{
    "description": "Abstract\n--------\n\n| Stop wrestling with regular expressions (regex) and complex abstract\n  syntax tree\n| (AST)-based frameworks to analyze and lint your Python code! Chasten\n  offers an\n| elegant solution by leveraging XPath expressions to search Python's\n  abstract\n| syntax tree, making static code analysis both powerful and accessible.\n  In this\n| talk, you'll discover how to implement custom linting rules, enforce\n  coding\n| standards, and perform sophisticated pattern matching in your Python\n  projects\n| using a tool designed for both simplicity and flexibility. Whether\n  you're a\n| developer tired of writing fragile regex patterns, an instructor\n  validating\n| student code, or a project maintainer who wants to ensure code\n  quality, Chasten\n| provides the perfect balance of power and usability for your static\n  analysis\n| needs. More details about chasten are available at:\n| https://github.com/AstuteSource/chasten.\n\nKey Takeaways\n-------------\n\n-  Create custom linting rules through simple YAML configuration\n-  Practical examples of enforcing code standards on documentation and\n   code\n-  Ways to analyze results through interactive dashboards with Datasette\n-  How to integrate Chasten into development workflow and CI/CD\n   pipelines\n",
    "language": "eng",
    "recorded": "2025-07-26",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://www.pyohio.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://www.pyohio.org/2025/program/talks/chasten-your-python-program"
        }
    ],
    "speakers": [
        "Gregory M. Kapfhammer"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/DkbYq-N8AIA/maxresdefault.jpg",
    "title": "Chasten Your Python Program: Configurable Program Analysis and Linting with XPath",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=DkbYq-N8AIA"
        }
    ]
}