{
    "description": "Deploying code shouldn’t be stressful. But too often, the journey from\nlocal dev to production is fragile, manual, and hard to debug. This talk\nis about building peace of mind into your pipeline — with GitOps,\nKubernetes, and open source tools like Argo CD that make continuous\ndelivery predictable, repeatable, and scalable from the very first\nrelease to the 50th.\n\nWe’ll tackle the realities of “day two” DevOps — what happens after the\nfirst deploy. From managing rollbacks and coordinating releases to\nenforcing consistency across dev, staging, and production, you’ll learn\nhow to bring stability and scalability to your delivery pipeline.\n\nIn a live demo, we’ll deploy a full stack Django app from GitHub to\nproduction using Argo CD and GitHub Actions — with observability,\nrollback strategies, and environment parity built in from the start.\n\n| **You’ll learn how to:**\n| - Set up a GitOps-based CI/CD pipeline that works across all\n  environments\n| - Automate rollouts, rollbacks, and version control of infrastructure\n| - Understand why Kubernetes is a future-proof platform for Django\n  teams\n| - Gain confidence in releasing updates safely, consistently, and at\n  scale\n| - Leverage open source tools to eliminate manual deployment headaches\n\nWhether you're writing the code or leading the team, you'll leave with a\nclear, practical blueprint for shipping faster — and with fewer\nsurprises.\n",
    "language": "eng",
    "recorded": "2025-07-26",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://www.pyohio.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://www.pyohio.org/2025/program/talks/deploy-django"
        }
    ],
    "speakers": [
        "Calvin Hendryx-Parker"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/H7GMjMgue14/maxresdefault.jpg",
    "title": "Deploy Django: GitOps & Kubernetes Made Easy",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=H7GMjMgue14"
        }
    ]
}