{
    "description": "Our world is complex: one approach to understanding and learning more\nabout relationships within the data is to represent it as a network or a\ngraph - with entities as nodes and relations between them as edges.\nNetwork applications are abundant - Facebook, knowledge databases like\nWikipedia, traffic routes, molecular pathways, and the fun starts when\nwe start thinking of the physical world as graphs. Where there’s data,\nthere’s uncertainty and the need to predict the future to make it a\nlittle less uncertain, which is why we need machine learning.\n\n**This talk will be about modeling one such network using a Graph Neural\nNetwork (GNN) and making some predictions on it using Deep Graph\nLibrary, an efficient and scalable open source framework to train and\nserve GNNs. While GNNs can be used for any ML task, we’ll focus on\nbuilding a recommendation model.**\n\n**But the transition from traditional data structures to graph-based\nmodels is not straightforward. Unlike tabular data, graphs require\nadapting ML principles to accommodate their topological and relational\ncomplexities.**\n\n| This talk will help participants gain practical insights into modeling\n  their data as graphs and leveraging GNNs to build a recommendation\n  system. After the talk, the audience should have a good understanding\n  about:\n| - How to structure their data as graph components and prepare it for\n  modeling\n| - What a GNN is and how do we train, evaluate and serve models in DGL\n| - End-to-end ML tasks on graph data: best practices to avoid pitfalls\n",
    "language": "eng",
    "recorded": "2025-07-26",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://www.pyohio.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://www.pyohio.org/2025/program/talks/graph-machine-learning-in-all-its-glory"
        }
    ],
    "speakers": [
        "Shreya Khurana"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/RLB83WFCAmg/maxresdefault.jpg",
    "title": "Graph Machine Learning in All Its Glory!",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=RLB83WFCAmg"
        }
    ]
}