{
    "description": "Intended to be an entertaining overview of challenges faced and lessons\nlearned working on my first big maker project. Using code snippets,\npictures and short demos, I will discuss problems overcome while\ndeveloping new features and integrating new devices into my humble\nanimated sign, which includes lights along with rhythmic and melodic\ncomponents. I promise not to dance; no one wants to see that.\n\nThe intended audience is anyone interested in maker projects. I will\nalso be touching on introductory-level topics in type hinting; the\nstandard library modules abc, dataclasses, signal, and threading; and\nthe 3rd-party modules aiohttp, gpiozero, and requests.\n\n| ``Note on Photosensitivity:``\n| Based on `this epilepsy.com\n  article <https://www.epilepsy.com/stories/shedding-light-photosensitivity-one-epilepsys-most-complex-conditions>`__,\n  this presentation should be safe for any photosensitive audience\n  member. I will include this information in a slide at the beginning of\n  the presentation, and give anyone in the audience the chance to leave\n  or ask questions before proceeding.\n\n-  The sign project uses standard 60 watt incandescent bulbs, which are\n   not capable of producing a strobe effect.\n-  For further safety, during the presentation, bulbs will not cycle on\n   and off more than 3 times per second.\n-  Additionally, the room’s lighting will not be darkened more than\n   usual for a standard presentation.\n",
    "language": "eng",
    "recorded": "2025-07-26",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://www.pyohio.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://www.pyohio.org/2025/program/talks/lights-python-action"
        }
    ],
    "speakers": [
        "Mike McCaffrey"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/-3euk5EPddU/maxresdefault.jpg",
    "title": "Lights!  Python!  Action!",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=-3euk5EPddU"
        }
    ]
}