{
  "id": 1966, 
  "category": "SciPy 2013", 
  "slug": "a-rapidly-adaptable-imaging-measurement-platfor", 
  "title": "A Rapidly-Adaptable Imaging & Measurement Platform for Cancer Research; SciPy 2013 Presentation", 
  "summary": "A Rapidly-Adaptable Analytical Imaging & Measurement Standardization Platform for Cancer Diagnostics Research\n\nAuthors: Garsha, Karl, Ventana Medical Systems Inc.; Ventura, Franklin, Ventana Medical Systems Inc.;\n\nTrack: Medical Imaging\n\nThe focus of personalized medicine is to develop rationally-designed therapeutics targeting specific molecular mechanisms of diseases such as cancer. For targeted therapeutics to be of value in complex disease states, such as cancer, patient-specific mechanism(s) of disease must be identified by physicians such that the appropriate targeted therapeutic(s) may be identified and administered. The ability to evaluate phenotype and genotype for multiplexed biomarkers at the cellular level, in the context of preserved tissue, provides important information for advancing the science of personalized medicine.\n\nClassical cancer diagnostic methods are based on direct inspection of prepared slides. In the classical approach, measurement and measurement standardization are limited by the constraints of human perception, established tradition and training. Our research seeks to empower physicians with new tools that diminish these existing limitations. Through Python, we bring together sophisticated nano-reporter technology, advanced microscopies, computational analysis and databasing technologies to establish feasibility of analytical tissue assay technology. Advancement of this technology is hoped eventually to enable powerful new opportunities for treatment of cancer.\n\nOur work is greatly accelerated through the collective efforts of the Python community. The ability to leverage and combine rich scientific Open Source projects including SciPy, VTK, ITK, PIL, wxPython, Matplotlib, ÂµManager, and OMERO are central to enabling this ambitious effort. Python allows us the synergy of sophisticated high-level language interfaced with rich natively-compiled libraries. This capability allows us to maintain a remarkable level of plasticity necessary to adapt to fast-moving and diverse research problems, and scalability to visualize large and complex n-dimensional datasets. Rich GUI capabilities allow us to rapidly put powerful tools in the hands of medical researchers.\n\nChallenges include mechanisms to pass high-level data structures between native-compiled libraries, combining widgets from different GUI toolkits, memory limits, and the complexity of building self-contained installers/uninstallers for deployment to collaborator sites.", 
  "description": "", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/DDIW2rKxrbI/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=DDIW2rKxrbI", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=DDIW2rKxrbI", 
  "tags": [
    "Tech"
  ], 
  "speakers": [], 
  "recorded": "2013-07-02"
}