{
  "id": 2164, 
  "category": "SciPy 2013", 
  "slug": "cython-speed-up-python-and-numpy-pythonize-c-c-9", 
  "title": "Cython: Speed up Python and NumPy, Pythonize C, C++, and Fortran, SciPy2013 Tutorial, Part 3 of 4", 
  "summary": "Presenter: Kurt Smith\n\nDescription\nCython is a flexible and multi-faceted tool that brings down the barrier between Python and other languages. With cython, you can add type information to your Python code to yield dramatic performance improvements. Cython also allows you to wrap C, C++ and Fortran libraries to work with Python and NumPy. It is used extensively in research environments and in end-user applications.\n\nThis hands-on tutorial will cover Cython from the ground up, and will include the newest Cython features, including typed memoryviews.\n\nTarget audience:\n\nDevelopers, researchers, scientists, and engineers who use Python and NumPy and who routinely hit bottlenecks and need improved performance.\n\nC / C++ / Fortran users who would like their existing code to work with Python.\n\nExpected level of knowledge:\n\nIntermediate and / or regular user of Python and NumPy. Have used Python's decorators, exceptions, and classes. Knowledge of NumPy arrays, array views, fancy indexing, and NumPy dtypes. Have programmed in at least one of C, C++, or Fortran.\n\nSome familiarity with the Python or NumPy C-API a plus. Familiarity with memoryviews and buffers a plus. Familiarity with OpenMP a plus. Array-based inter-language programming between Python and C, C++, or Fortran a plus.\n\nRequired Packages\n\nAll necessary packages are available with an academic / full EPD installation, Anaconda, easy_install, or pip.\n\nUsers must have Cython v 0.16 or better for the course.\n\nThe tutorial material (slides, exercises & demos) will be available for download and on USB drives.\n\nDocumentation\n\nBasic slide content is based on Enthought's Cython training slides. These slides will be reworked significantly for this tutorial. In particular, the NumPy buffer declarations will be taken out and replaced with the typed memoryview content listed in the outline. Other content (an IPython notebook with the start of the capstone project) is available as well:\n\nhttp://public.enthought.com/~ksmith/scipy2013_cython/", 
  "description": "", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/6ukI-NlIzqY/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=6ukI-NlIzqY", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=6ukI-NlIzqY", 
  "tags": [
    "Tech"
  ], 
  "speakers": [], 
  "recorded": "2013-06-27"
}