{
  "id": 1965, 
  "category": "SciPy 2013", 
  "slug": "lmonade-a-platform-for-development-and-distribut", 
  "title": "lmonade: a platform for development and distribution of scientific software; SciPy 2013 Presentation", 
  "summary": "Authors: Erocal, Burcin, TU Kaiserslautern\n\nTrack: Reproducible Science\n\nMost results in experimental mathematics are accompanied by software implementations which often push the boundaries of what can be computed in terms of mathematical theory and efficiency. Since new algorithms are built on existing ones, just as theorems are derived from existing results, it would be natural to expect that the code produced for one project will be useful later on, to both the same researcher and others.\n\nWhile theorems blissfully stay intact over time, software deteriorates and ages. Implementations need to be updated with respect to changes in underlying libraries and hardware architectures. Even if up to date, software developed for a specific application area often needs to be adapted to new situations. Like proofs can be reused by taking some components intact and modifying certain parts, software needs similar adaptations to be reusable.\n\nIt is natural that researchers cannot commit any more time than absolutely necessary for distributing and maintaining their software. The lmonade project aims to provide infrastructure and tools to foster code sharing and openness in scientific software development by\n\nsimplifying the tasks of distributing software with its dependencies,\nensuring that it can be built on different platforms, and\nmaking sure the software is compatible across new releases of its dependencies.\nThis is achieved through\n\na light-weight meta distribution which can be installed by a user without administrative rights. Building on the Gentoo Linux distribution and the Gentoo Prefix project, lmonade creates a uniform environment for software development where latest versions of scientific libraries can be found easily.\naccess to a continuous integration infrastructure to detect compatibility problems between new versions of packages automatically and warn authors.\nBy simplifying code sharing and distribution, especially when complex dependencies are involved, this platform enables researchers to build on existing tools without fear of losing users to baffling installation instructions.", 
  "description": "", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/7RuSFfCv4Ak/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=7RuSFfCv4Ak", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=7RuSFfCv4Ak", 
  "tags": [
    "Tech"
  ], 
  "speakers": [], 
  "recorded": "2013-07-02"
}