{
  "id": 2129, 
  "category": "SciPy 2013", 
  "slug": "pythran-enabling-static-optimization-of-scientif-1", 
  "title": "Pythran: Enabling Static Optimization of Scientific Python Programs; SciPy 2013 Presentation", 
  "summary": "Authors: Guelton, Serge, ENS ; Brunet, Pierrick, Télécom Bretagne ; Raynaud, Alan, Télécom Bretagne; Adrien Merlini, Télécom Bretagne; Mehdi Amini, SILKAN\n\nTrack: General\n\nPythran is a young open source static compiler that turns Python modules into native ones. Based on the fact that scientific modules do not rely much on the dynamic features of the language, it trades them against powerful, eventually inter procedural, optimizations, such as:\n\nautomatic detection of pure functions;\ntemporary allocation removal;\nconstant folding;\nnumpy ufunc fusion and parallelisation;\nexplicit parallelism through OpenMP annotations;\nfalse variable polymorphism pruning;\nAVX/SSE vector instruction generation.\nIn addition to these compilation steps, Pythran provides a C++ runtime that leverages on the C++ STL for generic containers, and the Numeric Template Toolbox (nt2) for numpy support. It takes advantage of modern C++11 features such as variadic templates, type inference, move semantics and perfect forwarding, as well as classical ones such as expression templates.\n\nThe input code remains compatible with the Python interpreter, and output code is generally as efficient as the annotated Cython equivalent, if not more, without the backward compatibility loss. Numpy expressions runs as fast as if compiled with numexpr, without change on the original code.", 
  "description": "", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/KT5-uGEpnGw/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=KT5-uGEpnGw", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=KT5-uGEpnGw", 
  "tags": [
    "Tech"
  ], 
  "speakers": [], 
  "recorded": "2013-07-01"
}