{
  "id": 2019, 
  "category": "SciPy 2013", 
  "slug": "scikit-fuzzy-a-new-scipy-toolkit-for-fuzzy-logic", 
  "title": "Scikit-Fuzzy: A New SciPy Toolkit for Fuzzy Logic; SciPy 2013 Presentation", 
  "summary": "Authors: Warner, Joshua, Mayo Clinic Department of Biomedical Engineering; Ottesen, Hal H., Adjunct Professor\n\nTrack: General\n\nScikit-fuzzy is a robust set of foundational tools for problems involving fuzzy logic and fuzzy systems. This area has been a challenge for the scientific Python community, largely because the common first exposure to this topic is through the MATLAB® Fuzzy Logic Toolbox™. This talk officially introduces a general set of original fuzzy logic algorithms to the scientific Python community which predate the commercial toolbox, were released under the 3-clause BSD license, and were translated to Python by an author who never used the MathWorksÂ® Fuzzy Logic Toolbox™.\n\nThe current capabilities of scikit-fuzzy include: fuzzy membership function generation; fuzzy set operations; lambda-cuts; fuzzy mathematics including Zadeh's extension principle, the vertex method, and the DSW method; fuzzy implication given an IF THEN system of fuzzy rules (via Mamdani [min] or Larsen [product] implication); various defuzzification algorithms; fuzzy c-means clustering; and Fuzzy Inference Ruled by Else-action (FIRE) denoising of 1d or 2d signals.\n\nThe goals of scikit-fuzzy are to provide the community with a robust toolkit of independently developed and implemented fuzzy logic algorithms, filling a void in the capabilities of scientific and numerical Python, and to increase the attractiveness of scientific Python as a valid alternative to closed-source options. Scikit-fuzzy is structured similarly to scikit-learn and scikit-image, current source code is available on GitHub, and pull requests are welcome.", 
  "description": "", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/qUQf1JxnTnY/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=qUQf1JxnTnY", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=qUQf1JxnTnY", 
  "tags": [
    "Tech"
  ], 
  "speakers": [], 
  "recorded": "2013-07-02"
}