{
  "id": 2133, 
  "category": "SciPy 2013", 
  "slug": "symbolic-computing-with-sympy-scipy2013-tutorial-5", 
  "title": "Symbolic Computing with SymPy, SciPy2013 Tutorial, Part 5 of 6", 
  "summary": "Ondrej Certik, Mateusz Paprocki, Aaron Meurer\n\nDescription\n\nSymPy is a pure Python library for symbolic mathematics. It aims to become a full-featured computer algebra system (CAS) while keeping the code as simple as possible in order to be comprehensible and easily extensible. SymPy is written entirely in Python and does not require any external libraries.\n\nIn this tutorial we will introduce attendees to SymPy. We will start by showing how to install and configure this Python module. Then we will proceed to the basics of constructing and manipulating mathematical expressions in SymPy. We will also discuss the most common issues and differences from other computer algebra systems, and how to deal with them. In the last part of this tutorial we will show how to solve simple, yet illustrative, mathematical problems with SymPy.\n\nThis knowledge should be enough for attendees to start using SymPy for solving mathematical problems and hacking SymPy's internals (though hacking core modules may require additional expertise).\n\nWe expect attendees of this tutorial to have basic knowledge of Python and mathematics. However, any more advanced topics will be explained during presentation.\n\nOutline\n\ninstalling, configuring and running SymPy\nbasics of expressions in SymPy\ntraversal and manipulation of expressions\ncommon issues and differences from other CAS\nsetting up and using printers\nquerying expression properties\nnot only symbolics: numerical computing (mpmath)\nMathematical problem solving with SymPy\nRequired Packages\n\nPython 2.x or 3.x, SymPy (most recent version) Optional packages: IPython, matplotlib, NetworkX, GMPY, numpy, scipy\n\nDocumentation\n\nhttp://mattpap.github.com/scipy-2011-tutorial/html/index.html", 
  "description": "", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/PC1GPUteZs0/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=PC1GPUteZs0", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=PC1GPUteZs0", 
  "tags": [
    "Tech"
  ], 
  "speakers": [], 
  "recorded": "2013-06-27"
}