{
  "id": 2014, 
  "category": "SciPy 2013", 
  "slug": "the-open-science-framework-improving-by-opening", 
  "title": "The Open Science Framework: Improving, by Opening, Science; SciPy 2013 Presentation", 
  "summary": "Authors: Spies, Jeffrey, Center for Open Science; Nosek, Brian, Center for Open Science\n\nTrack: Reproducible Science\n\nThe Center for Open Science (COS) is using Python to develop the Open Science Framework (OSF)--an infrastructure for conducting science transparently and openly with a focus on incentives and workflows. The goal of the infrastructure is to help reduce the gap between scientific practices and scientific values. The vehicle for this framework is a website (http://openscienceframework.org) and set of accompanying tools that provide scientists with a shared infrastructure that makes it easy to collaborate as well as document, organize, and search the entire lifespan of a research project. The Reproducibility Project--another COS-supported initiative--is a large-scale, collaborative study examining the rate of reproducibility in the psychological sciences. The OSF is being used to host and pre-register replication materials and replication hypotheses.\n\nThis talk will review the reasons why the major focus of the OSF is on incentives and workflow, demonstrate current features of the OSF, discuss how projects like the Reproducibility Project are using the OSF, and discuss why the COS believes that Python and the Python community will lead the open science (r)evolution.", 
  "description": "", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/WRadGRdkAIQ/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=WRadGRdkAIQ", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=WRadGRdkAIQ", 
  "tags": [
    "Tech"
  ], 
  "speakers": [], 
  "recorded": "2013-07-02"
}