{
  "id": 2099, 
  "category": "SciPy 2013", 
  "slug": "viper-a-new-tool-to-work-with-ipython-notebooks-1", 
  "title": "vIPer, a new tool to work with IPython notebooks; SciPy 2013 Presentations", 
  "summary": "Authors: Avila, Damian, OQUANTA;\n\nTrack: Reproducible Science\n\nIn the last years, Python have gained a lot of interest in the scientific community because several useful tools, well-suited to do scientific computing research, have been developed. IPython [1], a comprehensive environment for interactive and exploratory computing, has arose as must-have application to run in the daily scientific work-flow because provide not only enhanced interactive Python shells (terminal and qt-based) but also an interactive browser-based notebook with rich media support [2]. Despite the fact that we can run the IPython notebook in any most-used web browsers, there is not one better-suited to do the daily scientific work-flow and with features to easily present their results. So, in this paper, we describe the vIPer [3], and pyqt-based web browser designed specifically to host an IPython notebook, and powered with multiple features to address the most common tasks performed by scientific researchers in the publication and spreading of their results, such as:\n\nSplitted notebook views.\nExporting notebook several formats including pdf documents and html archives.\nVideo and voice recording.\nSlide-show view (for oral presentation).\nShortcuts to most common task.\nTo conclude, we have developed a better visualization tool for the IPython notebook, suited not only for the daily interactive work-flow but also suited for an enhanced presentation of results in multiple formats.", 
  "description": "", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/NVf_giNcNro/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=NVf_giNcNro", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=NVf_giNcNro", 
  "tags": [
    "Tech"
  ], 
  "speakers": [], 
  "recorded": "2013-07-01"
}