{
  "id": 2117, 
  "category": "SciPy 2013", 
  "slug": "writing-reproducible-papers-with-dexy-scipy-2013-1", 
  "title": "Writing Reproducible Papers with Dexy; SciPy 2013 Presentation", 
  "summary": "Authors: Nelson, Ana\n\nTrack: Reproducible Science\n\nScientists are frequently admonished to create reproducible papers, but one reason so few do is the lack of good tools. Imagine you want to create a reproducible paper that any other researcher in your field can easily grab, look at, and run in order to verify your results. What would you use? A tool intended for generating API documentation? A literate programming tool? Maybe some hand coded scripts binding together a rickety project that nobody but you can run? The truth is, the tools available to scientists to create clean reproducible papers are too limited, not general purpose enough, and not portable enough for sharing with other scientists.\n\nThis talk will be a demonstration of generating a paper using Dexy, a tool that has been written from scratch for making it as painless as possible to write truly reproducible technical documents. The whole project workflow will be automated including gathering and cleaning input data, running analysis scripts, producing plots, and compiling output documents to PDF, HTML and ePub output formats. The example project will include software and scripts in Python as well as other programming languages. We will automate running the code, applying syntax highlighting, generating plots and other files as side effects from running the code, and incorporating all these elements into the various documents we wish to create.", 
  "description": "", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/u6_qtDJ6ciA/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=u6_qtDJ6ciA", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=u6_qtDJ6ciA", 
  "tags": [
    "Tech"
  ], 
  "speakers": [], 
  "recorded": "2013-07-01"
}