{
  "description": "MLOps is evolving into the common approach to ML lifecycle management. The core problem\naddressed is how data science groups can move their models into production robustly.\nBuilding out an MLOps system involves reproducible pipelines, monitoring, versioning models,\ndata versioning, and more. Do we need all of those things?\n\nTypical MLOps best practices are often discussed in the context of large corporations, trillions of requests, and petabytes of data. Most organizations are not at this scale yet can benefit from aspects of MLOps. We discuss using a subset of MLOps with a real-world example addressed with Kedro.\n\nBio:\nBrian heads up the machine learning group at Shift5. He is a data scientist and entrepreneur with more than 25 years of experience across a variety of fields from NLP and speech processing to large-scale anomaly detection. Previously, he co-founded RuleSpace and served as chief architect, which was acquired by Symantec Corp. Brian received his Ph.D. in Computer Science from the Oregon Health & Science University of Portland, Oregon, a Masters in Manufacturing Engineering from Ohio University, Ohio, and a BA in Applied Mathematics and Computer Science from Hiram College, Ohio.\n\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 4361,
  "language": "eng",
  "recorded": "2022-11-09",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/nyc2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/otFPAPbr_9w/maxresdefault.jpg",
  "title": "Brian Bush: Practical MLOps- Do we need all the things | PD NYC 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=otFPAPbr_9w"
    }
  ]
}
