{
  "description": "Have you ever heard of Numba? It is (mainly) a JIT (Just-In-Time) compiler to make your math-heavy Python code runs faster under certain conditions. Most people found all of it is like a mystery - It sounds like magic, but how does it work? Under what conditions does it work? And because of it, new users found it hard to start using it and it requires a steep learning curve to get the hang of it.\n\nThis workshop requires no prior experience. Through exercises, we will explore in what situation Numba works, when it does not and the reason why. We will also look at some cases where we can make Numba works by changing a few things in your code. Hopefully, by finishing the workshop, you will have a better understanding of how Numba works before you even start using it. This knowledge can save you some time on try and error, making your experience in using it better.\n\nFor whom is your Workshop:\nData scientists or developers who have math-heavy code that would like to speed up with the benefit of Numpy and Numba.\n\nWorkshop Agenda:\n-brief introduction (15 mins): To introduce what is Numba and how it works in general. Overview of what exercises we will cover at the hands-on session and what they should know about when they start.\n-hands-on exercise to be finished at own pace (60 mins): Through various exercises, we will get more understanding of how Numba actually works. This can explain some questions that new users may have about Numba. Participants are required to finish most of the exercises but not all of them, so they can finish them in pairs or at their own pace.\n-conclusion on what is taught in the exercises (15mins): At the end, we will go through some of the findings participants would have by the end of the exercises. This is to make sure everyone has got the right ideas in the end.\n\nWhat is required from attendees:\n-A computer with a stable internet connection (useful to look up information);\n-Python 3.8 or above;\n-Jupyter and Numba installed (detail about Python libraries required will be announced later);\n-An opened mind and ready to learn something new\n\nWhat Attendees will Learn\nBy the end of the workshop, you will have some understanding of what Numba is and how it speeds up your Python code. You will also have a better idea about the limitation of Numba and when it does not help. You may also know how to change your code to make it benefit from the speeding up of Numba. You will also learn some troubleshooting skills and where to look for help if got stuck in the future.\n\nBio:\nCheuk Ting Ho\nBefore working in Developer Relations, Cheuk has been a Data Scientist in various companies which demands high numerical and programmatical skills, especially in Python. To follow her passion for the tech community, now Cheuk is the Developer Advocate for Anaconda.\n\nBesides her work, Cheuk enjoys speaking at various conferences. Cheuk also organises events for developers. Cheuk has organised conferences including EuroPython (of which she is a board member), PyData Global and Pyjamas Conf. Believing in Tech Diversity and Inclusion, Cheuk constantly organizes workshops and mentored sprints for minority groups. In 2021, Cheuk has become a Python Software Foundation fellow.\n\nThis speaker also appears in: I hate writing tests, that's why I use Hypothesis\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2248,
  "language": "eng",
  "recorded": "2022-11-09",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/nyc2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/QPa98CNL0eA/maxresdefault.jpg",
  "title": "Cheuk Ting Ho: Using Numba Effectively Today | PDNYC 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QPa98CNL0eA"
    }
  ]
}
