{
  "description": "We love to use Python in our day jobs, but that enterprise database you have to run your ETL job against may have other ideas. SQL is powerful and ubiquitous, but wouldn’t it be nice if you had all the power of Python AND could also interact with some highly optimized database engines?\n\nIbis is a pure Python library that lets you write Python to build up expressions that can be executed on a wide array of backends (sqlite, duckdb, postgres, spark, clickhouse, bigquery, and more!). It offers a dataframe-like interface and is more concise and composable than SQLAlchemy when writing interactive analytics code. And it is NOT a templating library, so no injection shenanigans.\n\nIf you:\n- have had to translate a proof-of-concept from Pandas to PySpark to run on the “real data”\n- download a huge parquet file because the upstream data is the result of 500 lines of dense SQL and you’re afraid to mess with it\n- are a data-engineer, data-scientist, data-hobbyist, or data-anything\n\nthen come and join us for a tour of what Ibis can do for you!\n\nBios:\n\nGil Forsyth\nGil Forsyth is a software engineer at Voltron Data. He followed the common career path of Japanese language specialist to administrative assistant to mechanical engineer to computational fluid dynamicist to data scientist to software engineer to machine learning engineer to software engineer.\nGil contributes to several projects in the PyData ecosystem and is a core maintainer of xonsh and helps maintain Ibis. He served as the program chair for the Scientific Computing with Python (SciPy) conference from 2016 to 2020.\n\nCharles Cloud\n\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2655,
  "language": "eng",
  "recorded": "2022-11-09",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/nyc2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/XdZklxTbCEA/maxresdefault.jpg",
  "title": "Cloud + Forsyth- Ibis- Expressive analytics in Python at any scale | PyData NYC 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XdZklxTbCEA"
    }
  ]
}
