{
  "description": "It's been a few months since we first presented PyScript during PyCon 2022. It has driven a lot of enthusiasm in the community. PyScript can really change the way Data Science is delivered and democratized. By running Python directly in the browser, you can really get the experience of running Python anywhere, any time using the browser as a ubiquitous Virtual Machine.\n\nGiven the good support for the PyData stack, Data Science is the first and perhaps the most straightforward context in which PyScript can have its say. In fact, PyScript enables the creation of self-contained rich scientific apps, bringing the Scipy/PyData stack directly integrated with interactive data visualization frameworks, e.g. bokeh or panel. But there's more! PyScript also allows direct integration with Javascript, allowing the development of full-fledged applications that can now use the best tools of each other stack. But there's even more! The easy access and reduced application complexity now can really make a difference in bringing Python and Data Science to the masses.\n\nIn this talk, we're going to talk about PyScript, the latest developments and tools available; and go through many examples that highlight the possibilities of a future of Python in the browser.\n\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2529,
  "language": "eng",
  "recorded": "2022-11-09",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/nyc2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Wnpi2MuAtt8/maxresdefault.jpg",
  "title": "Fabio Pliger- PyScript & Data Science- PyData stack on the Browser | PyData NYC 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Wnpi2MuAtt8"
    }
  ]
}
