{
  "description": "It sounds so easy on paper: \"Let's make our data science processes reproducible!\" And while parts of the journey feel pretty good, we soon find ourselves confronting the hard problems that we initially pushed aside. Looking closely, these problems seem harder than the problem we started with, and so on, ad-infinitum.\n\nGetting to reproducibility feels like Zeno's paradox: to get to our finish line (reproducibility!), we must first go halfway (through the hard parts); before we can go halfway, we have to go a quarter of the way (through the REALLY hard parts), and so on, until we find ourselves confronting an infinitude of really, really hard problems.\n\nThis talk describes our journey towards reproducibility: the tools, techniques, workflows, and brutal hacks that have gotten us ever closer to the holy grail of reproducible data science. Along the way, we dig into some of the hard problems we have faced, and the even harder sub-problems that underlie them, and the compromises we have made to draw a line that is \"close enough\" to our finish line: reproducible data science for heterogeneous workgroups.\n\nBio:\nKjell Wooding\nKjell is a computer engineer and mathematician who splits his time between Big Data and Little Learners. By day he is the Supervisor of Data Science and Machine Learning research at the Tutte Institute for Mathematics and Computing. By night he's the co-founder of Learn Leap Fly, an educational software company using AI and Machine learning to help teach the world to learn.\n\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2375,
  "language": "eng",
  "recorded": "2022-11-09",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/nyc2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/-F7UVIdEl7Y/maxresdefault.jpg",
  "title": "Kjell Wooding- Zeno Does Data Science- The Paradoxical Quest for Reproducibility | PyData NYC 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-F7UVIdEl7Y"
    }
  ]
}
