{
  "description": "In this talk, we will discuss:\n1. How you can help the NumFOCUS community\n2. Why it is so important to do so\n3. Background knowledge on how all the moving parts fit together so you feel confident in making introductions where you see an opportunity for sponsoring or partnership\n\nBio:\nLauren Oldja\nLauren is a Principal Data Scientist at the social good software company Bonterra, working primarily on political and not-profit fundraising business lines.\n\nLauren is also a frequent NumFOCUS volunteer. She is the Inaugural Chair of the NumFOCUS Champions Circle, a volunteer-led committee focused on generating leads and informing fundraising strategy for NumFOCUS. This is also Lauren's time as Executive Conference Chair for PyData NYC, having also Chaired the previous two events in 2018 and 2019\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2249,
  "language": "eng",
  "recorded": "2022-11-09",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/nyc2022/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/AfrTTgLUzag/maxresdefault.jpg",
  "title": "Lauren Oldja- NumFOCUS Champions Circle presents- How to make friends and generate impact | PDNYC 22",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AfrTTgLUzag"
    }
  ]
}
