{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Heidi Baxter\nhttps://2016.pycon-au.org/schedule/57/view_talk\nThe objective is to showcase the power and flexibility of combining preexisting python modules and apply them to the field of facial detection and machine learning.\nCorrectly positioning a mustache on any given face in a straight forward and fun example of applying the technology in a 30 min presentation\n\nTo use an elementary task as a vehicle for explaining and demonstrating the complexities of shape recognition, object classifiers and machine learning.\n\nI will demonstrate the use of image pyramids for image scaling and blending.\nThe histogram of oriented gradients (HOG) is a feature descriptor used in computer vision and image processing for the purpose of object detection.\nFinding the location of different facial features (e.g. corners of the eyes, eyebrows, and the mouth, the tip of the nose etc.) accurately will be described.\nFacial landmarks are used to align facial images to a mean face shape. How this allows the blending of images will be described and demonstrated.\n\nIf you are a girl and want a mustache, you can’t just grow one, so you have to steal one.\nI developed this project on raspberry pi and python. I wanted to do something different on that platform. I felt there were too many people who used their Rpi to feed their dog, water their plants or play MP3. I knew the platform had more potential than that. Hopefully this talk will help people think differently about Rpi3.\nAttendees will learn tips on image processing, as well as training your own object classifier.\nShowcasing the power of python in a fun, lighthearted way. Hopefully, being informative and entertaining.",
  "duration": 1227,
  "language": "eng",
  "recorded": "2016-08-15",
  "related_urls": [
    "https://2016.pycon-au.org/schedule/57/view_talk"
  ],
  "speakers": [
    "Heidi Baxter"
  ],
  "tags": [
    "datascience"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/70JAm03IBFI/maxresdefault.jpg",
  "title": "A Girls Guide To Growing A Moustache with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=70JAm03IBFI"
    }
  ]
}