{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Henry Walshaw\nhttps://2016.pycon-au.org/schedule/136/view_talk\nSince the 2009 Victorian Bushfires there has been a major funding increase to allow fuel reduction burns in national parks in NSW. The first recommendation (Review of performance targets for bushfire fuel management on public land 2015) is that the government moves towards a risk reduction target rather than the current hectarue target. An evidentiary method of proposing burns based on ISO 31000 Risk management - principles and guidelines (2009) was built into a manual workflow using Esri's ArcGIS suite. The next step was to automate the process as much as possible. To do this we built a suite of tools using Python in ArcGIS and in Pandas. This meant that we could spend more time making sure our calculations were correct and we understood the data rather than spending time re-creating ways to read tables and perform calculations.\n\nIn this talk we'll cover the suite of tools we built and a workflow for a user, and what this means for environmental policy in the department and NSW. We'll talk about ways we step between automation and using tools like Excel which our Environmental managers are very familiar with, but which don't always lend themselves to consistent input. And we'll talk about how building this suite not only does the calculations for us, but also records the metadata at every step along the trail, so we can provide evidence of how we made our decisions.",
  "duration": 1862,
  "language": "eng",
  "recorded": "2016-08-15",
  "related_urls": [
    "https://2016.pycon-au.org/schedule/136/view_talk"
  ],
  "speakers": [
    "Henry Walshaw"
  ],
  "tags": [
    "ArcGIS",
    "Pandas"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/3wLk9jHB7to/maxresdefault.jpg",
  "title": "A proof of concept Python toolkit for effective landscape fuel hazard management",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3wLk9jHB7to"
    }
  ]
}
