{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Tim Stephens\nhttps://2016.pycon-au.org/schedule/95/view_talk\nThe development of the Digital Technologies curriculum and the shift from ICT to DT has dramatically changed the teaching of computing in schools. This change has challenged teachers to find new solutions and software to assist them in their teaching of the curriculum. Some schools have employed Python as a way of meeting these challenges and requirements outlined in the curriculum documents.\nThe band description 8.6 states that  by the end of Grade Eight students should be using a general purpose language to code solutions. At Terrace we decided to use Python to achieve this outcome because of Python’s ease of deployment, cost and syntax light approach. Students in Grade Eight use the turtle and functions to write their name and create shapes. In Grades Nine and Ten the band description states:Students develop modular solutions to complex problems using an object-oriented programming language where appropriate, and evaluate their solutions and existing information systems based on a broad set of criteria including connections to existing policies and their enterprise potential. To achieve this we get students to program classes and databases. Students create a piece of software that creates customers for a bank or a character creator for an RPG. Students design, implement and evaluate the software that they create. In this presentation I will share the successes and failures over the past five years and provide people with software options, programs of work and ideas for Grades Eight to Ten when using Python.",
  "duration": 1833,
  "language": "eng",
  "recorded": "2016-08-15",
  "related_urls": [
    "https://2016.pycon-au.org/schedule/95/view_talk"
  ],
  "speakers": [
    "Tim Stephens"
  ],
  "tags": [
    "education"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/NrR-glfMrcM/maxresdefault.jpg",
  "title": "Python at Terrace",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NrR-glfMrcM"
    }
  ]
}
