{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Daehyok Shin\nhttps://2016.pycon-au.org/schedule/142/view_talk\nSince 2008, the Bureau of Meteorology has developed several modelling systems to support its streamflow forecasting services. These systems include MSDM (Modified Statistical Downscaling Method) and WAFARi (Water Availability Forecasts of Australian Rivers) for the Seasonal Streamflow Forecasting service (http://www.bom.gov.au/water/ssf), STAR (Streamflow Toolkit for Australian Rivers) for the 7-Day Streamflow Forecasting service (http://www.bom.gov.au/water/7daystreamflow) and HRS toolkit for the Historical Reference Stations (http://www.bom.gov.au/water/hrs). These systems routinely ingest recent observation data, fetch climate forecasts, run rainfall-runoff models and provide updated forecasts through publicly available websites. We chose Python as the primary programming language to build the main components of these systems, and used open source packages for scientific computing including NumPy, Pandas, Matplotlib, PyTables and IPython. Python was used as the glue to integrate different system components, and as a bridge to connect scientists and IT programmers. This approach resulted in a highly productive collaboration with CSIRO and university partners. It also fostered effective communication between hydrologists and system developers. In this presentation, we will describe how these modelling systems were built up and currently operate within the Bureau, and also explain how the use of Python was a key factor for successful development and operation of these forecasting systems.",
  "duration": 1966,
  "language": "eng",
  "recorded": "2016-08-15",
  "related_urls": [
    "http://www.bom.gov.au/water/ssf",
    "http://www.bom.gov.au/water/7daystreamflow",
    "http://www.bom.gov.au/water/hrs",
    "https://2016.pycon-au.org/schedule/142/view_talk"
  ],
  "speakers": [
    "Daehyok Shin"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Vl_xfRUXk7k/maxresdefault.jpg",
  "title": "Python for Water Forecasting Services",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Vl_xfRUXk7k"
    }
  ]
}