{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Sam Hames\nhttps://2016.pycon-au.org/schedule/133/view_talk\nMachine learning is a hot topic, with lots of hype about what it can and might do. Given the broad landscape of machine learning, and the continuing proliferation of new tools and techniques it can be difficult to get a pragmatic view of how machine learning can be used, or even where to start.\n\nThis tutorial will provide a high level introduction to machine learning: what it is, what kind of problems we can solve with it, and how can we apply it. In doing so this tutorial will also introduce the scikit-learn library and show you why this library is a central part of the machine learning ecosystem in Python.\n\nWe will start from scratch with a small example dataset, and walk through the process of building and carefully validating a classifier with scikit-learn. The practical focus during the tutorial will be on hands on implementation and experimentation. The technical focus will be on machine learning algorithms as black boxes for making decisions.\n\nAssumed background: This tutorial only assumes that you are comfortable with Python the language. We will *not* assume that you have any maths background, or that you are familiar with numerical computing: discussion of maths and algorithms will be strictly limited to hand waving.\n\n\nAbout Jack\n\nJack Simpson is a PhD candidate at the Australian National University working on image processing and behavioural analysis. He received his Software Carpentry Instructor training over a year ago and since then has organised and taught multiple workshops university.\n\nAbout Alistair\n\nAlistair Walsh is a cognitive neuroscientist currently working at The University of Melbourne, Research Platforms department as a Community Manager. He teaches Python, machine learning and text and image processing to researchers who aren't from a computer science background but need to use programming tools in their research. Alistair is also an instructor trainer for Software Carpentry and has run Software Carpentry programming workshops in Melbourne, Sydney and Adelaide.",
  "duration": 5009,
  "language": "eng",
  "recorded": "2016-08-15",
  "related_urls": [
    "https://2016.pycon-au.org/schedule/133/view_talk"
  ],
  "speakers": [
    "Sam Hames"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/3cWUqd6rGaM/maxresdefault.jpg",
  "title": "Tutorial: A Practical Introduction To Machine Learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3cWUqd6rGaM"
    }
  ]
}