{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Ioanna Ioannou\nhttps://2016.pycon-au.org/schedule/143/view_talk\nPresented with Maoyuan Liu from the Bureau of Meteorology.\n\nJupyter notebooks have become a very popular tool for scientific data analysis and exploration. Often notebook users may produce a data analysis within a notebook and decide they wish to share it with a wider audience. While notebooks offer excellent facilities for data visualisation, they are less than ideal as a medium for sharing these visualisations more broadly. Interacting with data in a notebook requires knowledge of programming. Notebooks with static data displays are more accessible to non-technical audiences, but static displays severely limit the breadth and depth of data that can be explored within one notebook. So the question arises: How can we provide our audience with the ability to explore our data?\n\nDeveloping interactive data displays for the web typically requires knowledge of web technologies that notebook users may not possess. To bridge this gap, a flurry of recent activity has focussed on the development of tools that facilitate interactivity within notebooks. Such tools include interactive plotting tools that enable actions such as zooming and selecting of data within plots, user interface elements (eg. drop-down menus, sliders) that can be incorporated into notebooks, and tools that facilitate the arrangement of plots and information into dashboard-like displays.\n\nMy team at the Australian Bureau of Meteorology has used these tools to build shareable interactive data displays comparing weather forecasts against observations across Australia. In this talk we will review currently available tools that facilitate interactivity within notebooks, share our experience in using them, and the practices we have developed around their use. A simple step-by-step example will demonstrate how we can put together an interactive data display allowing selective plotting of data through UI controls and interaction with the plots.",
  "duration": 1725,
  "language": "eng",
  "recorded": "2016-08-15",
  "related_urls": [
    "https://2016.pycon-au.org/schedule/143/view_talk"
  ],
  "speakers": [
    "Ioanna Ioannou"
  ],
  "tags": [
    "datascience"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/aXR2d9k9-h4/maxresdefault.jpg",
  "title": "Using Jupyter notebooks to develop and share interactive data displays",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aXR2d9k9-h4"
    }
  ]
}