{
  "copyright_text": null,
  "description": "Programming (SW education) has become mandatory in elementary and middle schools. So what does learning programming look like in school education? Students who enjoy and excel at it easily understand and quickly solve given tasks. In contrast, struggling students find it difficult to complete the same assignments. This disparity appears greater than in other subjects. So which students should teachers focus on during class? This was the concern I had while teaching programming at school and majoring in computer education.\n\nTo address this issue, I made choices regarding programming language selection and learning tool development. First, considering the growing social importance of programming and the needs of advanced students, I decided to teach Python. Next, I developed a Colab-based automatic program evaluation system and problems so that both advanced and struggling students could learn at their own pace. This allowed advanced students to minimize teacher feedback and learn according to the automatic evaluation system. Struggling students learned through both the feedback provided by the automatic evaluation system and focused feedback from the teacher.\n\nThis presentation demonstrates the process of developing and refining the automatic program evaluation system in Colab.",
  "duration": 1083,
  "language": "kor",
  "recorded": "2024-10-26",
  "related_urls": [
    {
      "label": "I am an elementary school teacher teaching Python",
      "url": "https://2024.pycon.kr/session/8MW8NT#%EC%A0%80%EB%8A%94-%ED%8C%8C%EC%9D%B4%EC%8D%AC%EC%9D%84-%EA%B0%80%EB%A5%B4%EC%B9%98%EB%8A%94-%EC%B4%88%EB%93%B1%EA%B5%90%EC%82%AC%EC%9E%85%EB%8B%88%EB%8B%A4_"
    }
  ],
  "speakers": ["Ko Hak-neung"],
  "tags": ["education"],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/kKebMNF_o8s/maxresdefault.webp",
  "title": "I am an elementary school teacher teaching Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kKebMNF_o8s"
    }
  ]
}
