{
  "abstract": "You have an idea for the next great technical book. Maybe you're excited\nabout a new technology that nobody's written about yet. Maybe you're\nunimpressed with the books that are out there on your favorite topic.\nMaybe writing a book is on your bucket list. This session will help your\nidea reach its potential as a published book. Technical publishing is an\nopaque process with a lot of moving parts, which can be confusing for\noutsiders to navigate. This session will guide you through the steps you\nshould take to turn an idea into a proposal that a publisher will\naccept, and what to expect from the publishing experience.\n\nCreating a great technical book takes more than a good idea. It also\nrequires a knowledge of the market, to determine whether there's an\naudience willing to buy, or whether the space is too crowded to accept\nnew entries. Publishers vary in their approach and target markets, so\nyou need to determine which one will provide the best chance of success.\nSelf-publishing is an option, but carries its own risks and benefits.\nDoing the setup work that you may not have thought about yet will help\nyou create a proposal that will appeal to publishers, and will also make\nthe writing process easier.\n\nOnce you have a contract with a publisher, or have decided to\nself-publish, it's more than just a matter of putting the words in\norder. Finding the right environment, setting a schedule, and\ncommunicating with your editor are all critical to success. This session\nwill explain how the process works, highlight the parts you may not\nknow, and give you advice on how not to get overwhelmed by your project.\n",
  "copyright_text": null,
  "description": "",
  "duration": 1596,
  "language": "eng",
  "recorded": "2018-05-06",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://www.writethedocs.org/conf/portland/2018/schedule/"
    }
  ],
  "speakers": [
    "Brian MacDonald"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/MKSXXKIe05o/maxresdefault.jpg",
  "title": "Writing the Next Great Tech Book",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MKSXXKIe05o"
    }
  ]
}
