{
  "alias": "video/114/brian-thorne---computer-vision",
  "category": "Kiwi PyCon 2009",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Computer Vision\n\nPresented by Brian Thorne\n\nAbstract\n\nAn introduction to computer vision in Python, from the general concept\nto its implementation with some current open-source libraries (opencv,\nscipy, pygame).\n\nOutline\n\nThe purpose of my presentation is an introduction to computer vision\n(CV) and image processing in Python. I will aim to show what is possible\nwith current libraries, demonstrate their usability, explore their\nlimitations, and cover elements of best coding practice. Firstly, I will\nbriefly present the basics, such as video grabbing, image processing and\ncomputer vision algorithms. I will illustrate my presentation with the\nPython bindings to the opencv library and show different examples such\nas displaying a video image, some filtering algorithms (dilation,\ngaussian blur), and how to implement facial recognition. I will describe\nafter how related tasks can be achieved with other Python tools such as\nscipy and pygame. I will show how these three libraries can be used in\nconjunction to perform video capturing, image processing and user\ninterfacing. Finally, I will introduce my basic Python computer vision\nframework, which is aimed at inexperienced users, and demonstrate it on\nthe XO laptop, the inexpensive low-powered sub-notebook distributed as\npart of the One Laptop Per Child (OLPC) initiative.\n\n[VIDEO HAS ISSUES: Sound and video are poor. Slides are hard to read.]\n",
  "duration": null,
  "id": 114,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2009-11-07",
  "slug": "brian-thorne---computer-vision",
  "speakers": [
    "Brian Thorne"
  ],
  "summary": "",
  "tags": [
    "kiwipycon",
    "kiwipycon2009",
    "olpc",
    "pygame",
    "scipy",
    "vision"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_114___brian-thorne-computer-vision",
  "title": "Brian Thorne - Computer Vision",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_114___brian-thorne-computer-vision"
    }
  ]
}
