{
  "copyright_text": "Standard YouTube License",
  "description": "Palestrante: Francisco Palm\n\nResumo:\n\nEl autor desarrolló entre los años 2000 y 2003 una extensión para Idrisi32 que permitía resolver problemas de localización óptima de instalaciones. Esta extensión, Localiza, fue utilizada en investigaciones en España y diversos países de América Latina, lo que sirvió de base para la publicación del libro [Sistemas de Información Geográfica y Localización Óptima de Instalaciones y Equipamientos](http://www.ra-ma.es/libros/SISTEMAS-DE-INFORMACION-GEOGRAFICA-Y-LOCALIZACION-OPTIMA-DE-INSTALACIONES-Y-EQUIPAMIENTOSINCLUYE-CD/127/978-84-7897-611-9). Con las nuevas versiones de Idrisi, Localiza quedó obsoleta.\n\nIdrisi (ahora llamado TerrSet) era un Sistema de Información Geográfica con importantes capacidades para el análisis ráster, lo que permitió la incorporación del cálculo de matrices de distancia basados en algoritmos de rutas de menor costo que permiten un análisis mucho mas flexible y rico que el análisis de distancias exclusivamente vectorial. Por otra parte, la ubicación de la oferta y la demanda se representa de una forma mucho mas conveniente mediante imágenes vectoriales. Por esta razón, en la implantación de la nueva versión de Localiza es fundamental contar con herramientas que permitan aplicar según sea necesario, capacidades de manipulación tanto ráster como vectorial.\n\nEn la actualidad, las capacidades para la resolución de problemas de localización-asignación siguen siendo muy limitadas para los software SIG (libres y no libres) mas difundidos, por lo cual resulta necesario contar con una herramienta que atienda estos requerimientos. Afortunadamente, se dispone para Python bibliotecas como [rasterio](https://github.com/mapbox/rasterio) para el análisis datos ráster y [fiona](http://toblerity.github.com/fiona/) para el análisis vectorial, los cuáles son a su vez envoltorios *pitónicos* de la biblioteca universal para manejo de información geográfica GDAL/OGR que permiten la manipulación de varias decenas de distintos formatos de datos geográficos. Localiza intenta seguir los estándares de diseño, organización y codificación de otras bibliotecas de Python para el análisis de datos tales como [PySAL](http://pysal.org/) y [QuantEcon](http://quant-econ.net/py/).\n\nLas principales ventajas de Localiza son fundamentalmente dos: 1) Es un conjunto de utilidades que carecen por completo de dependencias de software privativo, y 2) Su desarrollo como biblioteca permite el uso de las capacidades desde la línea de comandos, y para el desarrollo de aplicaciones web o de escritorio, o incluso en forma de un complemento de QGIS o similar. Localiza se encuentra en sus primeras etapas de desarrollo por lo que se espera presentar algunos resultados preliminares.",
  "duration": 1913,
  "language": "por",
  "recorded": "2016-06-24",
  "related_urls": [
    "https://github.com/mapbox/rasterio",
    "http://quant-econ.net/py/",
    "http://www.ra-ma.es/libros/SISTEMAS-DE-INFORMACION-GEOGRAFICA-Y-LOCALIZACION-OPTIMA-DE-INSTALACIONES-Y-EQUIPAMIENTOSINCLUYE-CD/127/978-84-7897-611-9",
    "http://pysal.org/",
    "http://toblerity.github.com/fiona/"
  ],
  "speakers": [
    "Francisco Palm"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/NBDrSm5mqfE/maxresdefault.jpg",
  "title": "Localiza, una biblioteca para la localización óptima de equipamientos sociales",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NBDrSm5mqfE"
    }
  ]
}