{
  "copyright_text": "Standard YouTube License",
  "description": "Palestrante: Bryan Van de Ven\n\nResumo:\n\nWith support from the DARPA XDATA Initiative, commercial engagements, and contributions from over 150 community members, the Bokeh visualization library (http://bokeh.pydata.org) has grown into a large, successful open source project with heavy interest and following on GitHub (https://github.com/bokeh/bokeh). The principal goals of Bokeh are to provide capability to developers and domain experts: easily create and share interactive, versatile, and powerful visualizations that extract insight from data sets that may be remote, large, or streaming. Bokeh provides a compelling open-source visualization platform for scientists who want to create interactive data applications in the browser for themselves, their colleagues, or for a wider audience, recently evidenced by the first instances of interactive Bokeh visualizations appearing in published journal articles.\n\nThis talk will give a quick overview of recent developments, and demonstrate some of the newest capabilities of Bokeh including:\n\n* Bokeh applications and the second generation Bokeh server (that is more performant, better documented, and much simpler to use and deploy)\n\n* APIs for streaming data (both in the notebook and Bokeh applications)\n\n* The ability to extend Bokeh with your own custom functionality (for example to create 3D plots or network graphs)\n\n* Recent GIS features such as support for GeoJSON and tiled map data sources\n\nFinally the session will conclude with a brief demonstration using the new Datashader library can be used together with Bokeh to visualize billions of data points.",
  "duration": 2505,
  "language": "eng",
  "recorded": "2016-06-24",
  "related_urls": [
    "http://bokeh.pydata.org",
    "https://github.com/bokeh/bokeh"
  ],
  "speakers": [
    "Bryan Van de Ven"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/WIE49wG_s6s/maxresdefault.jpg",
  "title": "Interactive Data Visualization in the Browser with Bokeh",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WIE49wG_s6s"
    }
  ]
}