{
  "description": "Talk \nThe coding quality must be improved in Data Science and AI. Though code in notebooks may provide some working solutions, too often it’s hard to maintain, reuse or even to read for an outsider - apart from being inefficient. In this talk I will share a decade of Python experience and provide background, good practices and guidelines that enable everyone to write proper code for Data & AI.\n\nSpeaker \nAlexander’ professional career was always about digitalization: starting from vinyl records in the nineties to advanced data analytics nowadays.\n\nHe’s a PyData organiser (Frankfurt and Südwest), a Python Software Foundation fellow, emeritus program chair of EuroPython, PyConDE & PyData Berlin 2019/20 and the scientific Python conference EuroSciPy. He’s one of the 25 mongoDB masters and a regular contributor to the tech community. As regular speaker at international conferences in he love to talk about, discuss and train tech. Being a partner at Königsweg (https://koenisgweg.com) - a boutique Data Science and AI consultancy based in Mannheim, Germany - he’s advising and training industry clients in AI, data science, data literacy and big data matters.\n\nwww.pydata.org\r\n\r\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\r\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2429,
  "language": "eng",
  "recorded": "2020-11-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydataglobal.github.io/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://koenisgweg.com",
      "url": "https://koenisgweg.com"
    }
  ],
  "speakers": [
    "Alexander Hendorf"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/68L00cvYXXQ/maxresdefault.webp",
  "title": "Better Code for Data Science",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=68L00cvYXXQ"
    }
  ]
}
