{
  "description": "Talk \nPython is the goto language for computational research, but often we are hit by the performance bottleneck of this language. In this talk, we will delve into 3 real-world computational exercises to introduce the core concepts, ease & effectiveness of using Numba, a JIT compiler that translates Python & NumPy code into fast machine code. Let’s supercharge our scientific computing research today!\n\nSpeaker\nA die hard Pythonista, Ankit is an open source contributor and a former Google Summer of Code scholar under Python Software Foundation. Currently, he is working in the domain of scientific computing and Machine Learning in IoT devices.\n\nAnkit has 6 years of industrial experience (Associate - JP Morgan, Data Scientist & Product Manager - Fuzzy Logix, USA) in machine learning, quantitative modelling, data analytics and visualization. Over the years, he has developed an expertise in handling the entire data analytics pipeline comprising – ingestion, exploration, transformation, modeling and deployment. He is a polyglot programmer with an extensive knowledge of algorithms, statistics and parallel programming. He has shipped multiple releases of DB Lytix, a comprehensive library of over 800 mathematical and statistical functions used widely in data mining, machine learning and analytics applications, including “big data analytics”.\n\nAn IIT Kanpur alumnus, Ankit is also an active researcher with publications on scientific computing in international journal and conferences. He is actively working in the domain of Analytics and has presented his work in:\n\nPyCon India 2019 (Talk)\n5th International Conference on Data Science and Engineering 2019\nData Science Congress 2018\n5th IIMA International Conference on Advanced Data Analysis, Business Analytics and Intelligence 2017\nSciPy India 2017 (Talk) \nHe is also an active contributor to the Indian Python Community and has conducted 5 workshops in PyCon India 2017 & 2019 and Scipy India 2017, 2018 & 2019.\nPublications - Link \nLinkedIn - Link \nAcclaim Badges - Link\n\nwww.pydata.org\r\n\r\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\r\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1291,
  "language": "eng",
  "recorded": "2020-11-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydataglobal.github.io/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Ankit Mahato"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/mDsTkg_IpUk/maxresdefault.webp",
  "title": "Supercharge Scientific Computing in Python with Numba",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mDsTkg_IpUk"
    }
  ]
}
