{
  "description": "Talk \nIn this talk I present the fundamental design concepts behind DataFrames.jl to help potential users get started with using it. I show how an exemplary pandas data processing pipeline can be transferred to DataFrames.jl. Finally I discuss how DataFrames.jl integrates with the whole data science ecosystem available in the Julia language.\n\nSpeaker \nI am a researcher in the fields of operations research and computational social science. During the last several years I have significantly contributed to the data science packages for the Julia language. In particular, I am one of the core developers of the DataFrames.jl package.\n\nwww.pydata.org\r\n\r\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\r\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. \n\n00:00 Welcome!\n00:15 Why use DataFrames.jl\n4:19 - Hands-on working with DataFrames in Julia\n8:05 - Reading a DataFrame\n10:29 - Simple operations on a DataFrame (Julia vs Pandas)\n21:37 - Aggregation functions\n25:35 - Piping\n27:17 - Noteworthy packages in the Julia Ecosystem\n\nS/o to https://github.com/stobinaator for the video timestamps!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1810,
  "language": "eng",
  "recorded": "2020-11-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydataglobal.github.io/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/stobinaator",
      "url": "https://github.com/stobinaator"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/K2J8pwSyUMw/maxresdefault.webp",
  "title": "Bogumił Kamiński - An introduction to DataFrames for pandas users| PyData GLobal 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=K2J8pwSyUMw"
    }
  ]
}
