{
  "description": "Talk \nWhile Python libraries like SciPy commonly use C and Fortran code under the hood, could Julia be used in the same way? In this talk we’ll introduce diffeqpy, a Julia-accelerated Python library for solving differential equations orders of magnitude faster than JIT-accelerated SciPy. We will discuss how it was built and how the unique tools like ModelingToolkit.jl help Python scientists.\n\nSpeaker \nChris Rackauckas is an Applied Mathematics Instructor at MIT, a Senior Research Analyst in the University of Maryland, Baltimore School of Pharmacy, and Director of Scientific Research at Pumas-AI. He is the lead developer of the SciML open source scientific machine learning organization which develops widely used software for scientific modeling and inference such as DifferentialEquations.jl for which he won the inaugural Julia Community Prize. Chris’ work on high performance differential equation solving is the centerpiece accelerating many applications from the MIT-CalTech CLiMA climate modeling initiative to the SIAM Dynamical Systems award winning DynamicalSystems.jl toolbox. Chris is the lead developer of Pumas, the FDA-compliant foundational software of Pumas-AI for nonlinear mixed effects modeling in clinical pharmacology which has had notable partnerships with leading pharmaceutical companies such as Pfizer. These efforts on Pumas led to the International Society of Pharmacology’s (ISoP) Mathematical and Computational Special Interest Group Award at the American Conference of Pharmacology (ACoP) 2019. His PhD research at UC Irvine focused on the control of intrinsic stochasticity in biological and pharmacological systems for which his thesis won the Kovalesvsky Outstanding Thesis Award and he was a recipient of the Mathematical and Computational Biology institutional fellowship, the Graduate Dean’s Fellowship, the National Science Foundation’s Graduate Research Fellowship, the NIH T32 Predoctural Training Grant, and the Data Science Initiative Summer Fellowship.\n\nwww.pydata.org\r\n\r\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\r\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2178,
  "language": "eng",
  "recorded": "2020-11-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydataglobal.github.io/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "download",
    "learn",
    "python 3",
    "software",
    "syntax"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/Jf2VUGaPL4k/maxresdefault.webp",
  "title": "Christopher Rackauckas - Accelerating Differential Equations In R and Python| PyData GLobal 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Jf2VUGaPL4k"
    }
  ]
}
