{
  "description": "Talk \nIn 2016 I wrote a blog post called Fizz Buzz in Tensorflow, which went modestly viral. In the years since I have invented and/or collected other stupid and/or clever ways of solving Fizz Buzz, the ten most interesting of which I expounded on in “Ten Essays on Fizz Buzz.” In this talk I’ll quickly take you through these ten Python solutions, most of which are delightfully surprising.\n\nSpeaker\nJoel Grus is Principal Engineer at Capital Group, where he leads a small team focused on the design and development of machine learning and data products. He’s the author of the quirky “Ten Essays on Fizz Buzz”, the beloved “Data Science from Scratch”, and the polarizing JupyterCon presentation “I Don’t Like Notebooks.”\n\n\n\nwww.pydata.org\r\n\r\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\r\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. \n\n00:00 Welcome!\n00:10 Fizz Buzz overview\n1:55 - 100 print statements\n2:16 - if/elif/elif/else\n2:34 - the cycle of 15\n2:58 - Euclid's Solution\n3:28 - Trigonometry\n3:56 - A big number\n4:21 - Infinite Iterables\n4:51 - Random Guessing\n5:29 - Matrix Multiplication\n5:55 - Fizz Buzz in Tensorflow\n\nS/o to https://github.com/stobinaator for the video timestamps!\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 500,
  "language": "eng",
  "recorded": "2020-11-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydataglobal.github.io/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/stobinaator",
      "url": "https://github.com/stobinaator"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "download",
    "learn",
    "python 3",
    "software",
    "syntax"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/E7JAIF9FOnM/maxresdefault.webp",
  "title": "Joel Grus- Ten Ways To Fizz Buzz| PyData Global 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=E7JAIF9FOnM"
    }
  ]
}
