{
  "description": "Talk \nIn the world of Pokemon, there is a running gag in the inability of protagonist Ash Ketchum, at recognizing the series antagonist, Team Rocket. This fact got me thinking: is a neural network better than Ash? To answer this, I’m using TensorFlow, TensorFlow.js, and Google AutoML to visualize a network’s activation maps to interpret why it says this is Team Rocket.\n\nSpeaker \nJuan is a Data Engineer at LOVOO, a dating, and social platform. As part of the LVPD team, he’s responsible for developing methods to detect and combat the fraudsters and spammers encountered in the platform.\n\nIn his free time—when he’s not dealing with fraud—you will surely find him experimenting with personal data to learn curious details about himself or having fun with object detection models. You can find more about his work at https://juandes.com.\n\nJuan holds a BSc in Computer Science from the University of Puerto Rico - Rio Piedras Campus and an MSc in Computer Science from Uppsala University in Sweden.\n\nwww.pydata.org\r\n\r\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\r\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1674,
  "language": "eng",
  "recorded": "2020-11-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydataglobal.github.io/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://juandes.com.",
      "url": "https://juandes.com."
    }
  ],
  "speakers": [
    "Juan De Dios Santos"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/xLPriI2X_NM/maxresdefault.webp",
  "title": "Is Neural Network Better Than Ash at Detecting Team Rocket",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xLPriI2X_NM"
    }
  ]
}
