{
  "description": "Talk\nAsyncio compatibility has been added recently to some fsspec-based file system implementations: http, s3 and gcs. Not only can you now call (some of) the API from async/await-style code, but bulk operations can be carried out massively concurrently, with potentially great speed-ups for file upload/download, copy and delete.\n\nSpeaker\nA former astrophysicist, Martin has worked in multiple academic positions, including medical imaging research. After this, Martin became a data scientist, and has since been working for Anaconda for five years. In open source, he is a member of the Dask, Intake, Streamz and Zarr maintenance teams, with specialisms in data access, remote filesystems and data formats.\n\nwww.pydata.org\r\n\r\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\r\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 451,
  "language": "eng",
  "recorded": "2020-11-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydataglobal.github.io/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Martin Durant"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/7XDBM3pW2ls/maxresdefault.webp",
  "title": "Asynchronous fsspec file operations",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7XDBM3pW2ls"
    }
  ]
}
