{
  "description": "Talk \nTimeSeries Forecasting using differenct tool non-ML and ML, different algorithms like moving average, SVM(support vector machine), LSTM,( Long-Short Term Memory) and Prophet. We will also compare the accuracy using RMSE. Dataset has been taken from Covid19 kaggle. Since we have seen what a huge impact coronavirus had on our daily lives, also we will understand about exponential growth.\n\nSpeaker \nSpeaker is very passionate about data science and machine learning. She has been working in this field since past 3 years and have worked on understanding mathematics behind Machine Learning algorithms.\n\nShe is also a tech speaker, she has delivered talks on the Machine learning and Data Science at PyCon India 2019 and PyData BBSR 2020 PyCon India: “Solving Industrial Problems with Machine Learning” in which she presented how she used SVM for detecting corrosion in pipeline images. PyData BBSR : “Supervised and Unsupervised Machine Learning Algorithms” In which she presented various Algorithms of both and their applications.\n\nShe has worked on level 4 autonomous vehicle and was also appointed as an Adjunct Professor for robotics and computer vision. Currently she is working in an IIT Madras incubated company as Lead Software Engineer. She is an unique blender of technology with entrepreneurship and she looks forward for PyData Global.\n\nwww.pydata.org\r\n\r\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\r\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1518,
  "language": "eng",
  "recorded": "2020-11-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydataglobal.github.io/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Sonam Pankaj"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/BxN2RcTwv7M/maxresdefault.webp",
  "title": "TimeSeries Forecasting with ML Algorithms and their comparisons",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BxN2RcTwv7M"
    }
  ]
}
