{
  "abstract": "Databases can be very useful and a real powerhouse for data science\nprojects. Databases have been around for decades and were highly\noptimised for data aggregations during that time.\n\nThere are hundreds of database to chose from nowadays, each of them more\nor less specialised for own use cases. Big Data has changed the\nlandscape of databases massively in the past years - we nowadays can\nfind many Open Source projects among the most popular DBs around.\n\nThis presentation will provide a crash course about the major\ndifferences of the various database systems as relational, NoSQL and\ngraph databases. We will discuss which databases are worth looking into\nfor data science projects and their straights and weaknesses. In\nparticular we will cover popular databases as PostgreSQL, MongoDB,\nCassandra or Neo4J and discuss differences to Hadoop, Spark or other\npokemony-big data frameworks.\n\nThis presentation will provide answers for: - Where can adding a\ndatabase to your workflow help you in your projects? - What should you\nknow before working with your company's database? - There is a database\njungle out there! What's the right choice for you? - What do you need to\nknow to run a database - is it complicated or a piece of cake?\n",
  "copyright_text": null,
  "description": "Databases can be very useful and a real powerhouse for data science\nprojects. Databases have been around for decades and were highly\noptimised for data aggregations during that time.\n\nThis presentation will provide a crash course about the major\ndifferences of the various database systems as relational, NoSQL and\ngraph databases.\n",
  "duration": 2691,
  "language": "eng",
  "recorded": "2018-04-29",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/london2018/schedule/"
    }
  ],
  "speakers": [
    "Alex Hendorf"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/4rT0xjmWCCo/maxresdefault.jpg",
  "title": "Databases for Data Science",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4rT0xjmWCCo"
    }
  ]
}
