{
  "abstract": "The new data protection laws provide European residents with a host of\nrights that help protect their data. A professional software developer\nor data scientist needs to be aware of these rights, because we are the\nonly ones who are in a position to adequately defend them. Or, if that's\nnot sufficiently persuasive: because we may wish to avoid the hefty\npenalties that the regulation threatens.\n\nThis talk will briefly summarise the rules, their terms, and their\nscope. I will quickly outline some of the new rights, especially the\nright to erasure, algorithm/decision-making transparency, and\nnon-discrimination. Putting these rules into context, we can identify\nwhen the laws apply and when they don't. Finally, I'll mention some\nadditional things that we ought to be aware of (breach notification,\ndata erasure, sensitive personal data).\n\nThree issues in particular deserve a technical discussion for a PyData\naudience: bias, transparency, pseudonymisation/erasure. The issue of\nbias is not a new one, and there are a number of existing approaches to\nidentifying and removing bias that we should know about. I'll summarise\nthese and point to where you can find more information. Transparency is\na little less clear, because what exactly the law will (eventually)\nrequire of e.g. a machine learning programmer. Finally, I'll look at\nwhat we may be required to do to comply with pseudonymisation and\nerasure.\n",
  "copyright_text": null,
  "description": "The General Data Protection Regulation comes into force very soon and\nwill ask many questions of those who work with data. In this talk, I'll\ngive a quick overview of the parts of the regulation that everyone here\nshould probably know, and then take a look at the challenges of\ncomplying when working with (machine learning) algorithms.\n",
  "duration": 2397,
  "language": "eng",
  "recorded": "2018-04-29",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/london2018/schedule/"
    }
  ],
  "speakers": [
    "Will Hardy"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/PwlNjmC5J70/maxresdefault.jpg",
  "title": "How will the new EU data protection laws affect your work?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PwlNjmC5J70"
    }
  ]
}
