{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "The ZODB is a mature graph database written in Python and optimized in\nC. Just subclass off of class Persistent Object, and Persistent\nContainer, and your objects, graphs and applications become persistent.\n\nThe market for Graph Databases has recently exploded, as evidenced by\nover $200Million invested in graph database companies. Most of the graph\ndatabases are written in Java.\n\nIf you are a Python developer, you will find much greater productivity\nusing a graph database written in Python, than one written in statically\nbound Java. The major Java databases constrain you to one of several\npersistent data types. Persistent Python, supported by the ZODB allows\nyou to make any Python data structure persistent.\n\nThe new ZODB Demo makes it very easy to start building your own\napplications on top of the ZODB. You can start by customizing the\nTreeLeaf, TreeBranch and TreeRoot classes and their templates. You get\nCRUD for free.\n\nThe demo includes traditional relational CRUD, Create, Read, Update, and\nDelete. But it also includes the extended graph CRUD. Rename a Leaf or\nBranch. Cut and paste leaves or branches, copy and paste leaves or\nbranches. The talk also demonstrates the soon-to-be released view\nhistoric versions and restore a previous version.\n\n| You can watch the talk video here:\n| PythonLinks.info/zodb\n\n| And see the slides here:\n| https://pythonlinks.info/presentations/zodbtalk.pdf\n",
  "duration": 1914,
  "language": "eng",
  "recorded": "2018-03-09",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2018.pycon.sk/en/schedule.html"
    }
  ],
  "speakers": [
    "Christopher Lozinski"
  ],
  "tags": [
    "PyCon SK",
    "Python",
    "ZODB: The Graph database"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/fdTdcHRJmr4/maxresdefault.jpg",
  "title": "ZODB: The Graph database for Python Developers.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fdTdcHRJmr4"
    }
  ]
}
