{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "A lot of open source maintainers suffer from having to maintain the flood of incoming issues/tikets on their project. We've scraped more than 10000 GitHub projects and interviewed more than 100 software developers and project managers of companies like GitLab. As a result, we have identified a few simple steps that can help managing the load of issues.\n\nThis talk sums up the steps and approaches needed to deal with this as well as automate it.\n\nFor a full summary, check out [our blog post with GitLab][1].\n\n[1]: https://about.gitlab.com/2017/10/26/triage-issues-gitmate/\n\n# Who and Why\n\n(1) The talk is for project managers and open source maintainers or software developers that deal with issues every day. This includes specifically people working in teams with more than 30 issues a month opened.\n\n(2) There's no background knowledge needed. The talk will be best for people who have triaged issues before at least in a small scale and recognize the problem, they will be able to pick up the approaches better and faster.\n\n(3) On an emotional level, I expect the audience to get to know the \"attitude\" needed to get rid of noise when triaging issues. After the talk, they should have a few concrete steps in mind that they can try using in the first days and eventually deduct their own process from it.",
  "duration": 1341,
  "language": "eng",
  "recorded": "2018-03-09",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2018.pycon.sk/en/schedule.html"
    },
    {
      "label": "https://about.gitlab.com/2017/10/26/triage-issues-gitmate/",
      "url": "https://about.gitlab.com/2017/10/26/triage-issues-gitmate/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "GitHub",
    "GitLab",
    "PyCon SK",
    "Python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/qaR5X2VuFX0/maxresdefault.jpg",
  "title": "Lasse Schuirmann - 7 Steps to a Clean Issue Tracker",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qaR5X2VuFX0"
    }
  ]
}
