{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "A lot of open source maintainers suffer from having to maintain the\nflood of incoming issues/tikets on their project. We've scraped more\nthan 10000 GitHub projects and interviewed more than 100 software\ndevelopers and project managers of companies like GitLab. As a result,\nwe have identified a few simple steps that can help managing the load of\nissues.\n\nThis talk sums up the steps and approaches needed to deal with this as\nwell as automate it.\n\nFor a full summary, check out `our blog post with\nGitLab <https://about.gitlab.com/2017/10/26/triage-issues-gitmate/>`__.\n\nWho and Why\n===========\n\n(1) The talk is for project managers and open source maintainers or\n    software developers that deal with issues every day. This includes\n    specifically people working in teams with more than 30 issues a\n    month opened.\n\n(2) There's no background knowledge needed. The talk will be best for\n    people who have triaged issues before at least in a small scale and\n    recognize the problem, they will be able to pick up the approaches\n    better and faster.\n\n(3) On an emotional level, I expect the audience to get to know the\n    \"attitude\" needed to get rid of noise when triaging issues. After\n    the talk, they should have a few concrete steps in mind that they\n    can try using in the first days and eventually deduct their own\n    process from it.\n",
  "duration": 1341,
  "language": "eng",
  "recorded": "2018-03-10",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2018.pycon.sk/en/schedule.html"
    },
    {
      "label": "https://about.gitlab.com/2017/10/26/triage-issues-gitmate/",
      "url": "https://about.gitlab.com/2017/10/26/triage-issues-gitmate/"
    }
  ],
  "speakers": [
    "Lasse Schuirmann"
  ],
  "tags": [
    "GitHub",
    "GitLab",
    "PyCon SK",
    "Python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/qaR5X2VuFX0/maxresdefault.jpg",
  "title": "7 Steps to a Clean Issue Tracker",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qaR5X2VuFX0"
    }
  ]
}
