{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "V júni 2017 sa na SPŠ Martin a na Gymnáziu V.P.T. Martin uskutočnila\ndvojdňová konferencia o jazyku Python, na ktorej sa zúčastnilo cca 80\nžiakov z 8 stredných škôl okresu Martin i Dolného Kubína. Prednášajúcimi\na vedúcimi workshopov boli odborníci z praxe a učitelia z vysokých škôl.\nOdzneli zaujímavé prednášky, robilo sa veľa workshopov. Na konferencii\nsme nadviazali spoluprácu s prednášajúcimi i lepšiu spoluprácu medzi\nškolami. Taktiež sa nám podarilo konferenciu a programovací jazyk Python\nspopularizovať v regionálnych médiách.\n\n| Následne sme na SPŠ Martin i na Gymnáziu V.P.T. v Martine začali v šk.\n  roku 2017/2018 učiť programovanie v jazyku Python, robiť v tomto\n  jazyku ročníkové projekty, súťažiť v Zenite a celkovo tento jazyk\n  podporovať. Sami žiaci prinášajú nové nápady a zlepšenia, napríklad\n  pripraviť mini Python Day pre žiakov základných škôl, ktorí by sa\n  chceli venovať štúdiu programovania na SŠ a pod.\n| Taktiež by sme chceli na PyCone SK 2018 so žiakmi našej školy\n  predstaviť práce - maturitné zadania, ktoré robia v jazyku Python\n  alebo iné programy, ktoré robia na hodinách, prípadne vo voľnom čase.\n",
  "duration": 2463,
  "language": "slk",
  "recorded": "2018-03-09",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2018.pycon.sk/en/schedule.html"
    }
  ],
  "speakers": [
    "Lenka Huňorová"
  ],
  "tags": [
    "PyCon SK",
    "Python",
    "Python Days"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/sUtQhrsKb8Q/maxresdefault.jpg",
  "title": "Python Days in Martin and follow-up activities",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sUtQhrsKb8Q"
    }
  ]
}
