{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Podľa môjho názoru vývojové prostredia (IDE) zanedbávaju runtime aspekt\nprogramov, ktoré v nich píšeme. Historicky sa tieto prostredia asi\nvyvinuli z textových editorov a postupne dostávaju viac a viac funkcií a\numožňujú viacero pohľadov na zdrojový kód a jeho všakovaké aspekty.\nVývojové prostredia dokážu zázraky so zdrojovými súbormi, ktoré nám\nležia na disku.\n\nAvšak zdrojáky nepíšeme aby ležali na disku ale kvôli tomu aby nám\nbežali ako programy. Pri behu môže vznikať kopec zaujímavých informácií\nspätne využiteľných pri programovaní. Dôraz vývojových prostredí na\nstatické zdrojové kódy škodí najmä dynamickým programovacím jazykom ako\nje Python. Chcel by som odprezentovať a získať spätnú väzbu na 3-5\nnápadov ktoré majú za cieľ práve preniesť rôzne informácie z behu Python\nprogramu naspäť do prostredia v ktorom sa píše zdrojový kód. V ideálnom\nprípade presne na riadok alebo dokonca na výraz, ktorý programátor práve\npíše alebo sa s ním dokonca trápi.\n\nPríklady týchto nápadov:\n\n- prezentácia stack trace informácie v IDE, na konkrétnych riadkoch kde\n  tento stack trace vznikol, intuitívna navigácia po framoch stacktrace,\n  hint na hodnoty lokálnych premenných jednotlivých framov\n\n- prenos a výpis log hlášok v IDE na konkrétmych riadkoch, ktoré tento\n  výpis vygenerovali\n\n- coverage informácia na riadku, ale vrátane informácie Who Tests What\n  (ktorý, test vykonal tento riadok, pozri napr.\n  https://bitbucket.org/ned/coveragepy/issues/170/show-who-tests-what )\n\n- použiteľnejšia reprezentácia spustených/úspešných/zlyhaných testov ako\n  momentálne používaný rozbaľovací strom. Doklikať sa ku konkrétnemu\n  výsledku testu v Pycharm test runneri často trvá minútu a po každom\n  spustení testov sa táto manuálna práca zahodí a treba začať klikať\n  odznova. Navrhnem intuitívnejší spôsob prezentácie.\n\n- meta nápad: implementovať prezentované nápady bude stáť nezanedbateľné\n  úsilie. Kedže vývojových prostredí je veľké množstvo, a každé ma\n  rozdielne API ideálne je navrhnúť všeobecný protokol, ktorý by oddeľoval\n  IDE a zdroje runtime informácií podobne ako to robí Language Server\n  Protocol (https://microsoft.github.io/language-server-protocol/)",
  "duration": 1665,
  "language": "slk",
  "recorded": "2018-03-11",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2018.pycon.sk/en/schedule.html"
    },
    {
      "label": "https://bitbucket.org/ned/coveragepy/issues/170/show-who-tests-what",
      "url": "https://bitbucket.org/ned/coveragepy/issues/170/show-who-tests-what"
    },
    {
      "label": "https://microsoft.github.io/language-server-protocol/",
      "url": "https://microsoft.github.io/language-server-protocol/"
    }
  ],
  "speakers": [
    "Tibor Arpáš"
  ],
  "tags": [
    "PyCon SK",
    "Python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/r4xL2dWfeYY/maxresdefault.jpg",
  "title": "“Secret” information about the code we write",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=r4xL2dWfeYY"
    }
  ]
}
