{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "The very small 2-person DevOps team within Red Hat Performance/Scale\nEngineering has developed a set of Open Source Python-based systems and\nnetwork automation provisioning tools designed to end-to-end automate\nthe provisioning of large-scale systems and network switches using tools\nlike Foreman, Ansible, and other Open Source bits.\n\nQUADS – or “quick and dirty scheduler” allows a normally overburdened\nDevOps warrior to fully automate large swaths of systems and network\ndevices based on a schedule, even set systems provisioning to fire off\nin the future so they can focus on important things like Netflix and\npopcorn or not reading your emails while your datacenter burns in an\ninferno of rapid, automated skynet provisioning. QUADS will also\nauto-generate up-to-date infrastructure documentation, track scheduling,\nsystems assignments and more.\n\nIn this talk we’ll show you how we’re using QUADS (backed by Foreman) to\nempower rapid, meaningful performance and scale testing of Red Hat\nproducts and technologies. While QUADS is a new project and under\nconstant development, the design approach to handling large-scale\nsystems provisioning as well as the current codebase is consumable for\nothers interested in improving the efficiency and level of automation\nwithin their infrastructure.\n\nWe'll also dive into purposeful development design choices, how some of\nthese choices might not scale for the future (but work well at present)\nand provide a future roadmap of a new redesign based on Flask, Celery,\nSqlite and friends.\n",
  "duration": 2161,
  "language": "eng",
  "recorded": "2018-03-10",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2018.pycon.sk/en/schedule.html"
    }
  ],
  "speakers": [
    "Will Foster"
  ],
  "tags": [
    "DevOps",
    "PyConSK",
    "Python",
    "Quads"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/7xADFDj3K6c/maxresdefault.jpg",
  "title": "Skynet your Infrastructure with QUADS",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7xADFDj3K6c"
    }
  ]
}
