{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "The very small 2-person DevOps team within Red Hat Performance/Scale Engineering has developed a set of Open Source Python-based systems and network automation provisioning tools designed to end-to-end automate the provisioning of large-scale systems and network switches using tools like Foreman, Ansible, and other Open Source bits.\n\nQUADS – or “quick and dirty scheduler” allows a normally overburdened DevOps warrior to fully automate large swaths of systems and network devices based on a schedule, even set systems provisioning to fire off in the future so they can focus on important things like Netflix and popcorn or not reading your emails while your datacenter burns in an inferno of rapid, automated skynet provisioning. QUADS will also auto-generate up-to-date infrastructure documentation, track scheduling, systems assignments and more.\n\nIn this talk we’ll show you how we’re using QUADS (backed by Foreman) to empower rapid, meaningful performance and scale testing of Red Hat products and technologies. While QUADS is a new project and under constant development, the design approach to handling large-scale systems provisioning as well as the current codebase is consumable for others interested in improving the efficiency and level of automation within their infrastructure.\n\nWe'll also dive into purposeful development design choices, how some of these choices might not scale for the future (but work well at present) and provide a future roadmap of a new redesign based on Flask, Celery, Sqlite and friends.",
  "duration": 2161,
  "language": "eng",
  "recorded": "2018-03-09",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2018.pycon.sk/en/schedule.html"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "DevOps",
    "PyConSK",
    "Python",
    "Quads"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/7xADFDj3K6c/maxresdefault.jpg",
  "title": "Will Foster - Skynet your Infrastructure with QUADS",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7xADFDj3K6c"
    }
  ]
}
