{
  "description": "Python is a very high-level programming language. I've been using it for very low-level programming. We'll meet an unusual computer.\n\nWe're all guilty of rolling our own implementation of existing code, but how far have you taken it? Ever reimplemented multiplication? Did you use CPU instructions that had literally never been used before?\n\nThe development of microprocessors like the Zilog Z80 and MOS 6502 in the 1970s eventually gave rise to the 8-bit home computers that many remember fondly. When Marcel van Kervinck and Walter Belgers designed the Gigatron, a quirky but surprisingly capable computer made from 74xx series logic ICs, they showed that a different course of history was possible - we could have had microcomputers without microprocessors, perhaps much earlier. They also created a world of unclimbed mountains: on the Gigatron you can be the first person to implement your favourite game or algorithm.\n\nA few years ago I built a Gigatron, and I'm having great fun with it. I started off trying to implement a Forth interpreter, but while I've programmed for many years, I'd never written low-level code before. I really thought it would be easy! In this talk I'll show what I've achieved with the Gigatron, how working within the challenging architecture has broadened my perspective on programming, and how Python was at the heart of it all.\n\nThe talk will explore technical details, but won't require specialist knowledge. It's likely to touch on:\n* Python as an assembly language\n* Test Driven Development\n* CFFI\n* Hypothesis\n* Data analysis with Matplotlib and other parts of the scientific stack.\n* System Architecture\n* Hard real-time programming\n* Programming language implementation.",
  "language": "eng",
  "recorded": "2022-09-18",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2022.pyconuk.org/"
    }
  ],
  "speakers": [
    "Peter Russell"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/1gIX_-ABHs8/hqdefault.jpg",
  "title": "Alternative History Retrocomputing",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1gIX_-ABHs8"
    }
  ]
}
