{
    "description": "Apps such as Obsidian.md have revolutionised note-taking for the digital age, through connected markdown files. I discuss how I developed a Python package that enabled me to become more effective at learning at university and built a knowledge graph of 500+ notes.\n\nSoftware has emerged in the last few years, such as Roam Research and Obsidian.md, for writing notes in a highly-connected format.  These apps can display notes in an extensive knowledge graph and have enabled a new wave of personal knowledge management (PKM) for the digital age.  This talk provides an introduction to personal knowledge management and shows how I used Python to improve my learning through my Obsidiantools package.\n\nDuring my MPhil programme in Health Data Science at the University of Cambridge in 2021-22, I wrote all my notes as markdown files through Obsidian.md.  I developed the Obsidiantools package for analysing Obsidian.md vaults, in order to improve my Obsidian workflows and analyse my notes via the Python data science stack, NLP packages and NetworkX.  Within 3 months, I had written over 65k words in 250+ notes and used network analysis through the Python data stack to improve my strategy for studying.\n\nConnected notes even go back hundreds of years in an analogue format, through the use of index cards and Zettelkasten systems.  In a more modern form, digital note vaults are at the intersection of NLP and network analysis, so there are data science challenges to tackle in those domains (Roam Research even offers a $150k prize for one of those challenges, in case you are tempted).\n\nTalk structure:\n- Introduction to personal knowledge management (PKM)\n- My MPhil notes as connected notes\n- The Obsidiantools package\n- Data science challenges and wrap-up",
    "language": "eng",
    "recorded": "2022-09-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2022.pyconuk.org/"
        }
    ],
    "speakers": [
        "Mark Farragher"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/rom7BzoxD8c/hqdefault.jpg",
    "title": "Connecting those thoughts: Personal knowledge management with Python",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=rom7BzoxD8c"
        }
    ]
}