{
    "description": "According to the WHO over 1 billion people live with some form of disability; almost everyone is likely to experience some form of disability at some point. This talk discusses the importance of web accessibility and how I used python to develop a tool that ensembles multiple accessibility evaluation tools.\n\nThe web was designed to be accessible to all people regardless of their ability, use of hardware, software, language, and location. Web accessibility means designing websites, tools, and technology to be inclusive to people with disabilities so that they can perceive, understand, navigate, and interact with the web and contribute to it. Web accessibility evaluation means verifying that this is the case.\n \nThe process of automatic accessibility evaluation is of interest to accessibility practitioners and researchers given that manual evaluation requires a lot of time and effort. My research has shown that most accessibility evaluations are conducted using a single evaluation tool.\nThis talk discusses how using the python ecosystem has allowed the development of a prototype to ensemble the results from multiple automated accessibility evaluation tools. The prototype generated a HTML report which aggregated results from the different evaluation tools removing the reliance of the results from a single tool.\n \nPython’s rich set of libraries such as wxPython, matplotlib, numpy and pandas made this project possible within a short timeframe.\n \nThe results from developing this prototype tool was included in research published at HCI International 2022 - https://link.springer.com/chapter/10.1007/978-3-031-06417-3_71\nThis talk hopes to inspire others to use python to conduct research and improve web accessibility.",
    "language": "eng",
    "recorded": "2022-09-17",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2022.pyconuk.org/"
        }
    ],
    "speakers": [
        "Peter Johnson"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/9l7H9s1VRrg/hqdefault.jpg",
    "title": "Using python to create a prototype for web accessibility research",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=9l7H9s1VRrg"
        }
    ]
}