{
  "copyright_text": null,
  "description": "The General Data Protection Regulation, better known as GDPR, is a\nregulation on data protection and privacy for all individuals within the\nEuropean Union. GDPR went into effect on May 25, 2018 and was the cause\nof the “Great Privacy Policy Update” that occurred in the weeks prior.\n\nThis talk will cover what GDPR is and why you should care about it, but\nwe won’t stop there. This is not going to be another talk on data\nprotection policy. No.\n\nIn this talk, we’re going to jump right into discussing HOW to implement\ndata patterns that comply with regulations like GDPR by examining a\npattern known as pseudonymization.\n\nPseudonymization is a data de-identification procedure where fields of\npersonally identifiable information (PII) within a data record are\nreplaced by one or more artificial identifiers. These artificial\nidentifiers are also called pseudonyms. Pseudonyms make a data record\nless identifiable without sacrificing data analysis and processing. GDPR\nrequires that PII undergo either pseudonymization or complete data\nanonymization.\n\nFor the hands-on portion of this talk, we’ll construct a Django User\nModel where we apply pseudonyms to the data attributes which qualify as\nPII. We’ll explore a couple strategies for implementing a compliant\npseudonymization pattern, examining their individual approaches and\nperformance, and we’ll discuss limitations of pseudonymizing certain\nattributes and how to achieve compliance through consent.\n\nGDPR sets a precedent for responsible data management. Whether your\napplication serves citizens of the EU or not, the regulations serve as\nan encouragement for protecting your user’s identities. This talk is\ngreat for everyone from beginners to expert Django developers… and fans\nof Phil Collins :)\n",
  "duration": 1780,
  "language": "eng",
  "recorded": "2018-10-17",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.djangocon.us/schedule/"
    }
  ],
  "speakers": [
    "Frank Valcarcel"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/wRro4xv8n6k/maxresdefault.jpg",
  "title": "Pseu, Pseu, Pseudio. Pseudonymization in Django.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wRro4xv8n6k"
    }
  ]
}
