{
  "copyright_text": null,
  "description": "This talk will detail my experience building an Augmentative Alternative\nCommunication (AAC) device for my son who has autism. I had to perform\nsome troubleshooting to get Django to harmonize with the Raspbian OS and\ntouchscreen drivers, but the result is easily replicable using the\ninstructions I will cover from my project documentation on the Hackaday\nwebsite bit.ly/TalkerHackaday\n\nI want to give this talk to inspire other developers to try their hand\nat building bespoke assistive devices. Commercially available medical\nassistive devices are expensive partly because they try to be everything\nto everybody. What if instead, we made products that do one thing for\none specific user very well?\n\nThis outline shows what I will cover in my talk:\n\n-  Find a need and fill it\n-  Django on Linux\n-  Interface prototyping\n-  Gesture recognition for touchscreen\n-  Custom enclosures with NO 3D printing\n-  Everyone needs to become an inventor\n\nThis talk is for people who are curious about running Django in an\nembedded system (development server as the production environment).\nPeople who are interested in Debian Linux will also find this talk\ninteresting. I would love to reach the autism community and people who\nwant to build assistive technology. To get the most out of this talk,\nattendees should have a basic knowledge of how to perform a command line\nDjango installation and what a raspberry pi is.\n",
  "duration": 1525,
  "language": "eng",
  "recorded": "2018-10-17",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.djangocon.us/schedule/"
    }
  ],
  "speakers": [
    "Muriel Green"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/PYgEEH_J4l4/maxresdefault.jpg",
  "title": "Bespoke communication devices for kids with autism built with Django and Raspberry Pi",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PYgEEH_J4l4"
    }
  ]
}
