{
  "copyright_text": null,
  "description": "As teams and projects grow, code review becomes increasingly important\nto support the maintainability of complex codebases. In this talk, I’ll\ncover guidelines for writing consistent python code beyond pep8, how to\nlook out for common python gotchas, and what python tools are available\nto automate various parts of the review process. Most importantly, I’ll\ncover the human aspect of code reviews - how we can be better at\napproaching reviews with empathy and understanding from the perspective\nof both a reviewer and a submitter. Following these successful code\nreview practices will lead to happier teams and healthier code bases.\n\nThis talk is useful for python developers with any amount of experience.\nNo prerequisite knowledge is necessary.\n\n-  For those who are just starting out, it will be a great general\n   overview.\n-  Intermediate developers may not know about the wide variety of\n   tooling that’s available.\n-  Advanced developers will learn techniques for performing code reviews\n   with empathy.\n\nThis talk will enable you to have better code reviews on your teams at\nwork, and a better approach to code reviews in open source projects.\nYou’ll leave with 3 main takeaways:\n\n1. Code Reviews are most effective when conducted with empathy. If you\n   do reviews with growth and learning in mind, they become tools for\n   sharing knowledge instead of an opportunity to bruise egos or show\n   off esoteric knowledge.\n2. Python has powerful tooling available for code reviews such as pep8\n   as a style guide, pylint as a linter, coverage.py to identify test\n   coverage, and vulture to identify dead code.\n3. That python style guides beyond pep8 have clear benefits in terms of\n   producing more consistent code that’s easier to review and easier to\n   maintain.\n",
  "duration": 2389,
  "language": "eng",
  "recorded": "2018-10-15",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.djangocon.us/schedule/"
    },
    {
      "label": "slides",
      "url": "https://speakerdeck.com/nnja/code-review-skills-for-pythonistas-djangocon-2018"
    }
  ],
  "speakers": [
    "Nina Zakharenko"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ZsT7nSRQ8S4/maxresdefault.jpg",
  "title": "Code Review Skills for Pythonistas",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZsT7nSRQ8S4"
    }
  ]
}
