{
  "copyright_text": null,
  "description": "If you’ve never used it before, Docker can be a little overwhelming.\nThere is new vocabulary to learn, new commands to memorize, and new\nfiles to add to each project. Most resources fall into one of two camps:\nthey teach you the bare bones of Docker but still leave you with too\nmany questions to comfortably try it on your own, or they throw you into\nthe deep end by assuming you’re more familiar with Docker than you are.\n\nIn this talk, you will find that middle ground: a talk that doesn’t\nassume you’re familiar with Docker and so keeps everything simple, but\nleaves you with enough information that you can get started as soon as\nyou leave the room. Together, we will step through the parts of a\nDockerfile and learn what they do. Then, I’ll introduce you to Docker\nCompose and explain why using it to run multiple containers is helpful.\nFinally, you will learn to run commands and execute scripts from the\ncommand line using Docker, how to enter a container and why you might\nneed to, and what to do before you go home for the day.\n\nAudience: Djangonauts who are curious about Docker, need to learn to use\nit for work or personal projects, or who seek a better understanding of\ncontainers in general. Audience members might be beginners to\nPython/Django or not, but they are definitely beginners to\ncontainerizing all the things.\n\nThe audience should be familiar with basic Python concepts such as\nvariables and running things from the command line. Some basic\nfamiliarity with Django would be helpful, but beginner Djangonauts will\nbe able to follow along.\n",
  "duration": 1402,
  "language": "eng",
  "recorded": "2018-10-15",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.djangocon.us/schedule/"
    },
    {
      "label": "slides",
      "url": "https://speakerdeck.com/williln/an-intro-to-docker-for-djangonauts"
    }
  ],
  "speakers": [
    "Lacey Williams Henschel"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/qsEfVSTZO9Q/maxresdefault.jpg",
  "title": "An Intro to Docker for Djangonauts",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qsEfVSTZO9Q"
    }
  ]
}
