{
  "copyright_text": null,
  "description": "A hot topic in recent years is running applications in containers. Tools\nsuch as ``docker`` and ``rkt`` have made deployment of applications\nusing Linux containers easier, but they do not alone provide everything\nthat is needed to easily manage many applications, or run containers at\nscale across a cluster of machines.\n\nIn this talk you will learn about the fundamental concepts and\nterminology of Kubernetes and why it is emerging as the de-facto\nstandard for container orchestration and scheduling.\n\nThe talk will step through how to deploy to Kubernetes a Python web\napplication, implemented using Django, as a way of seeing what happens\nunder the covers when you do so.\n\nTopics which will be covered to illustrate how Kubernetes works will\ninclude:\n\n-  What are containers and pods.\n-  Accessing pods for an application via a service.\n-  Scaling up applications to many instances.\n-  Automatic recovery from application failure.\n-  Exposing a web application to the public.\n-  Building images targeting Kubernetes.\n-  Application lifecycle management.\n-  Monitoring health of an application.\n-  Security and controlling access.\n\nKubernetes is a tool for IT operations. It implements what is regarded\nas a Container as a Service (CaaS). You can use it to host an\napplication packaged up in a pre-existing application image, but does\nnot help you with building that image. In some respects Kubernetes can\nbe viewed as like the Linux kernel, you wouldn’t try and deploy it\nyourself from scratch, instead you would use a packaged distribution.\n\nThis talk will also touch on different Kubernetes distributions such as\nvendor distributions from Heptio, and OpenShift from Red Hat, as well as\nKubernetes services such as Google Kubernetes Engine (GKE), Amazon\nElastic Container Service (EKS) and Azure Kubernetes Service (AKS).\nExamples of how these distributions and service offerings around\nKubernetes bundle in additional functionality, including integrated\nrouting, metrics, logging and Platform as a Service (PaaS)\nfunctionality, in order to provide a better developer centric experience\nwill also be discussed.\n",
  "duration": 2933,
  "language": "eng",
  "recorded": "2018-10-16",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.djangocon.us/schedule/"
    }
  ],
  "speakers": [
    "Graham Dumpleton"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/kbarwyun-c4/maxresdefault.jpg",
  "title": "Fundamentals of Kubernetes for Django developers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kbarwyun-c4"
    }
  ]
}
