{
  "copyright_text": null,
  "description": "Drawing upon decades of simulation and higher education experience, the\nAlfred West Jr. Learning Lab at the Wharton School set out to create\nit’s own in- house developed simulation platform to accelerate our\nsimulation delivery capabilities. However, what began as a white\nboarding session two years ago, morphed into the first of its kind open\nsource simulation platform. Simpl will not only fuel the next generation\nof simulations written at the Wharton School, but it is our hope it will\nserve the foundation for countless other simulations at other schools\naround the world. Our open source platform puts tools in the hands of\nany developer who has the curiosity to create a simulation, tools that\nwere previously unobtainable due to cost. The Learning Lab partnered\nwith RevSys, and relying upon Python/Django and a slew of other open\nsource tools, we were able to deliver our first simulation written in\nSimpl in November of 2017.\n\nSimpl‘s server side is built on Python/Django and open source WAMP\ntechnologies. On the front end, Simpl uses JavaScript frameworks\nincluding React, Redux, and Autobahn. Combined, these constitute a\nframework for developing single and multiplayer simulations.\n\nIn this talk you will learn about simulations in the higher education\nspace, how we developed and implemented Simpl, a demo of our first Simpl\nsimulation, and why we think this Python/Django fueled simulation\nplatform will have a seismic impact on the burgeoning edtech field.\n\nTentative outline of talk:\n\n-  About the Learning Lab and simulations\n-  The barrier to develop simulations\n-  Why we chose to develop Simpl and make it open source\n-  Simpl design process\n-  Experience writing first Simpl simulation\n-  Technical deep dive\n-  Demo of first Simpl sim\n-  Where we are, next steps\n",
  "duration": 2453,
  "language": "eng",
  "recorded": "2018-10-16",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.djangocon.us/schedule/"
    }
  ],
  "speakers": [
    "Joseph Lee",
    "Jane Eisenstein"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/0GhCvBGfYfA/maxresdefault.jpg",
  "title": "Simpl framework, big impact!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0GhCvBGfYfA"
    }
  ]
}
