{
  "copyright_text": null,
  "description": "Tech industry giants are acknowledging that diversity in employee\nbackgrounds is valuable for their organizations’ bottom lines. However,\nit’s still tough for job seekers to land a tech job without prior\nexperience closely aligned with the job they’re applying for. This talk\nwill focus on helping people who are looking for their next tech role:\n(1) understand themes of what hiring committees look for, (2) identify\ntransferable skills from nontraditional experience they already have,\n(3) communicate the power of their unique set of past experiences, and\n(4) learn tools to demonstrate these skills in their resume and job\ninterviews.\n\nAttendees who are looking for their next role will leave with actionable\nideas for improving job application materials, conveying transferable\nskills from non-technology-related jobs in interviews, and generally\nrocking any job interview with basic tips that many people miss.\n\nThe presenters, both of whom came to tech without a traditional CS\nbackground, will give a short introduction of their experience and\nexpertise. They will discuss the aspects of their experience that they\nexpected to be valuable from the start, and those (sometimes\nsurprising!) skills whose value became apparent only after they got to\ntechnical positions. Both presenters have participated in hiring panels,\none as a hiring manager.\n\nThey will share tips and tricks based on industry best practices and\ntheir experience reviewing resumes, cover letters, speaking with\nreferences, and interviewing job candidates. They will highlight common\nmistakes and things to consider when applying for, and then interviewing\nfor, attendees’ next tech job.\n",
  "duration": 2435,
  "language": "eng",
  "recorded": "2018-10-15",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.djangocon.us/schedule/"
    },
    {
      "label": "slides",
      "url": "https://speakerdeck.com/rebekahpost/transfer-those-skills"
    }
  ],
  "speakers": [
    "Caroline Taylor",
    "Rebekah Post"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/KlJE8pAk290/maxresdefault.jpg",
  "title": "Transfer those Skills! How to Identify, Communicate, and Sell your Transferable Skills when Switching Careers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KlJE8pAk290"
    }
  ]
}
