{
  "description": "PyData is excited to announce PyData Global, November 11th - 15th! Tickets are now available: https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases\nPart of an underrepresented group in tech? PyData Global is offering Diversity Scholarships. Applications close September 30th: https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform\n\nAndrew Therriault - Designing for Impact in Civic Data Science | PyData Fest Amsterdam 2020 \n\nOpen source developers create tools that are used by millions, often in ways that their creators never imagined. Open data programs share data for the same purpose, enabling others to discover insights and build applications to help understand and improve their communities. And yet while open source and open data have both grown rapidly over the past decades, successful data science projects combining the two are surprisingly hard to find.\n\nThis presentation, from the City of Boston’s former Chief Data Officer, will dig into the question of why data science projects built on open data so often fall short of their potential, and give lessons for how to design projects that succeed. Participants will learn how open data programs work, see examples of innovative projects using open data, and hear about the unique challenges facing projects that seek to promote positive social change. We’ll also discuss how technologists can better collaborate with the public sector, to match their work to the needs of governments and nonprofits and ensure that their efforts are put into practice.\n\nAndrew Therriault is a data scientist and educator based in Boston. He previously served as the City of Boston’s Chief Data Officer and the Democratic Party’s Director of Data Science, and currently teaches data science at Northeastern and Harvard. Therriault also serves as a data science and strategy consultant for clients ranging from government agencies and advocacy groups to research firms and technology startups, and holds a doctorate in political science from New York University.\n\n===\nwww.pydata.org\r\n\r\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\r\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2075,
  "language": "eng",
  "recorded": "2020-06-15",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://datasciencedistrict.nl/pydata-festival-amsterda/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform",
      "url": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform"
    },
    {
      "label": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases",
      "url": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/1ODnn5fs6Nw/maxresdefault.webp",
  "title": "Andrew Therriault - Designing for Impact in Civic Data Science | PyData Fest Amsterdam 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1ODnn5fs6Nw"
    }
  ]
}
