{
  "description": "PyData is excited to announce PyData Global, November 11th - 15th! Tickets are now available: https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases\nPart of an underrepresented group in tech? PyData Global is offering Diversity Scholarships. Applications close September 30th: https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform\nBertjan Broeksema & Huib Keemink - Exploring Railway Oriented Programming in Python | PyData Fest Amsterdam 2020\n\nAn ongoing question when developing software is: how to build reliable and correct software systems? Python applications are no exception to this question. We explore a different way of dealing with errors in your Python code. Instead of using try-except, we present the Railway Oriented Programming approach.\n\nThis approaches programming as a way of combining railway segments. In combination with type annotation, this leads to interesting possibilities for developing correct and testable applications in python. But: it also puts constraints on what should and shouldn’t be done in those segments.\n\nWe have set ourselves the challenge to build the Railway pattern from scratch in Python. Follow us on this journey of implementing this pattern, and see where it leads us. Is it even uesful in Python? Does it solve any problems you might have?\n\nTo follow this talk, you do not need experience with functional programming. If you know your way around python functions, you will get an introduction to a common functional pattern without the lingo!\n\n===\nwww.pydata.org\r\n\r\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\r\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1754,
  "language": "eng",
  "recorded": "2020-06-15",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://datasciencedistrict.nl/pydata-festival-amsterda/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform",
      "url": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform"
    },
    {
      "label": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases",
      "url": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "download",
    "learn",
    "python 3",
    "software",
    "syntax"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/cKixdve3JGg/maxresdefault.webp",
  "title": "Bertjan Broeksema & Huib Keemink - Exploring Railway Oriented Programming in Python | PyData Fest",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cKixdve3JGg"
    }
  ]
}
