{
  "description": "PyData is excited to announce PyData Global, November 11th - 15th! Tickets are now available: https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases\nPart of an underrepresented group in tech? PyData Global is offering Diversity Scholarships. Applications close September 30th: https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform\n\nCheuk Ting Ho - Open-source in the eyes of a Minority Contributor | PyData Fest Amsterdam 2020\n\nIn the first part of this talk, I will talk about my personal experience in contributing to open-source. From learning how to make a Pull Request on GitHub to maintaining libraries. From attending my first meetup to co-organizing conferences. I will tell you what I observe as a self-identifying female. My opinion on certain events that happened. And what “help” do we, minorities in the community, need.\n\nIn the second part of the talk, I will change to a more subjective angle to look at the diversity issues in the open-source community, especially in Python and Data Science communities. I will try to address what effort has been made and what more we can do. In the end, I will try to convince you all the be our ally and to do the right thing to make our community more inclusive and diverse.\n\n\nwww.pydata.org\r\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1647,
  "language": "eng",
  "recorded": "2020-06-15",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://datasciencedistrict.nl/pydata-festival-amsterda/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform",
      "url": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform"
    },
    {
      "label": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases",
      "url": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/r3W-vcsQo80/maxresdefault.webp",
  "title": "Cheuk Ting Ho - Open-source in the eyes of a Minority Contributor | PyData Fest Amsterdam 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=r3W-vcsQo80"
    }
  ]
}
