{
  "description": "PyData is excited to announce PyData Global, November 11th - 15th! Tickets are now available: https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases\nPart of an underrepresented group in tech? PyData Global is offering Diversity Scholarships. Applications close September 30th: https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform\n\nJames Powell - Furious & Fast Python 7: Writing Fast Python Code | PyData Fest Amsterdam 2020\n\nYou’ve already seen the about six of these. They were kind of boring. You probably fell asleep halfway through number 5. Why is anyone still making this content? What new ground is there to cover?\n\nThis talk will cover fundamental conceptualizations and approaches to writing fast systems in Python, while critiquing how this topic has been covered in past. It will show limitations of measurement mechanisms, conceptual limitations of the “static view” of software development, and it will show problems with non-structural micro-optimizations. It will suggest intuitions and structural approaches that lead to high performance systems in practice, as well as intuitions that can guide this development from within a more cohesive and coherent framework of understanding of the software development process.\n\nSpeaker Bio: James Powell is a professional Python programmer and enthusiast. He started working with Python in the finance industry building reporting and analysis systems for prop trading front offices. He currently works as a consultant building data engineering and scientific computing platforms for a wide range of clients using cutting-edge open source tools like Python and React. He also currently serves as a Board Director, Co-Chair, and Vice President at NumFOCUS, the 501(c)3 non-profit that supports all the major tools in the Python data analysis ecosystem (incl. pandas, numpy, jupyter, matplotlib, and others). At NumFOCUS, he helps build global open source communities for data scientists, data engineers, and business analysts. He helps NumFOCUS run the PyData conference series and has sat on speaker selection and organizing committees for eighteen conferences. James is also a prolific speaker: since 2013, he has given over seventy conference talks at over fifty Python events worldwide.\n\n\nwww.pydata.org\r\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 4333,
  "language": "eng",
  "recorded": "2020-06-15",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://datasciencedistrict.nl/pydata-festival-amsterda/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform",
      "url": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform"
    },
    {
      "label": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases",
      "url": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/Ix04KpZiUA8/maxresdefault.webp",
  "title": "James Powell - Furious & Fast Python 7: Writing Fast Python Code | PyData Fest Amsterdam 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ix04KpZiUA8"
    }
  ]
}
