{
  "description": "PyData is excited to announce PyData Global, November 11th - 15th! Tickets are now available: https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases\nPart of an underrepresented group in tech? PyData Global is offering Diversity Scholarships. Applications close September 30th: https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform\n\nMadelon Hulsebos, Tomislav Suhina & Joost Boonzajer Flaes - Keep the Data Flowing | PyData Fest Amsterdam 2020\n\nData scientist and engineers waste too much time on data issues and do not get to focus on developing and productionizing models. Potential causes range from mistyped customer IDs in Excel to incomplete and duplicate data entries. What follows is an inefficient back-and-forth process where we explore the data, summarize data issues, and send it back to the data owner through multiple iterations. This process drains time, energy, drives costs, and increases the chances of projects failing completely.\n\nAll ML pipelines make assumptions on the structure of the data being used. Once those assumptions are violated, pipelines break or models produce incorrect output. In this workshop, you will learn how to deploy Great Expectations for automating data validation, facilitating hand-offs from data owner to data scientist/engineer, and how to integrate Great Expectations into ML pipelines.\n\nThe workshop consists of an introduction to the package, live demonstration, and hands-on session. During the hands-on session, you will solve a data puzzle for which they will receive a messy data file and a set of data expectations. When you solve the puzzle using Great Expectations, you will be rewarded with a good functioning pipeline.\n\n===\nwww.pydata.org\r\n\r\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\r\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 5645,
  "language": "eng",
  "recorded": "2020-06-15",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://datasciencedistrict.nl/pydata-festival-amsterda/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform",
      "url": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform"
    },
    {
      "label": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases",
      "url": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "download",
    "learn",
    "python 3",
    "software",
    "syntax"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/aRwZ1Lfq1CI/maxresdefault.webp",
  "title": "Madelon Hulsebos, Tomislav Suhina & Joost Boonzajer Flaes - Keep the Data Flowing | PyData Fest AMS",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aRwZ1Lfq1CI"
    }
  ]
}
