{
  "description": "PyData is excited to announce PyData Global, November 11th - 15th! Tickets are now available: https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases\nPart of an underrepresented group in tech? PyData Global is offering Diversity Scholarships. Applications close September 30th: https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform\n\nMarkus Loning - Introduction to Machine Learning with Time Series | PyData Fest Amsterdam 2020 \n\nTime series are ubiquitous in real-world applications, but often add considerable complications to data science workflows. What’s more, most available machine learning toolboxes (e.g. scikit-learn) are limited to the tabular setting, and cannot easily be applied to time series data.\n\nIn this tutorial, you’ll learn how to apply common machine learning techniques to time series and how to extend available toolkits. This is a beginner-friendly tutorial: we assume familiarity with scikit-learn, but no prior experience with time series.\n\nTo start, you’ll learn how to distinguish between different kinds of temporal data and associated learning tasks, such as forecasting and time series classification. You’ll then learn how to solve these tasks with machine learning techniques specific to time series data, including:\n\nState-of-the-art algorithms for time series classification and regression, Reduction strategies, i.e. solving a complex learning tasks by decomposing it into simpler tasks, e.g. solving forecasting via regression, Composite strategies like ensembling and pipelining, as well as data transformations like detrending and feature extraction. We’ll work through all of them step by step and make use of interactive Jupyter notebooks and sktime, a new scikit-learn compatible toolbox for machine learning with time series (https://github.com/alan-turing-institute/sktime).\n\n\nwww.pydata.org\r\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 5234,
  "language": "eng",
  "recorded": "2020-06-15",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://datasciencedistrict.nl/pydata-festival-amsterda/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/alan-turing-institute/sktime",
      "url": "https://github.com/alan-turing-institute/sktime"
    },
    {
      "label": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform",
      "url": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform"
    },
    {
      "label": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases",
      "url": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases"
    }
  ],
  "speakers": [
    "Markus Loning"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/Wf2naBHRo8Q/maxresdefault.webp",
  "title": "Introduction to Machine Learning with Time Series",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Wf2naBHRo8Q"
    }
  ]
}
