{
  "description": "PyData is excited to announce PyData Global, November 11th - 15th! Tickets are now available: https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases\nPart of an underrepresented group in tech? PyData Global is offering Diversity Scholarships. Applications close September 30th: https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform\nMax Gendler - Supporting Business Ethics and Governance with Data | PyData Fest Amsterdam 2020\n\nInterviewed by Vincent Warmeerdam\n\nPrivacy, data governance, and ethics have all become essential topics in a modern data-driven company. But what even are they? And how do you get started with them?\n\nWe regularly get asked what data governance is. By definition, it’s a combination of three things: formalizing behaviors, holding people accountable, and supporting ethics at scale. But what does that really mean and how do you put it into practice? We like to think of it as the standardization of work, both the setting of standards and testing for them to ensure that they are applied, while simultaneously getting people to want to do the right thing. In a number of ways, governance is a giant design problem. How can we make the right thing easy?\n\nIn this talk I’ll go into more detail of how we’ve put this into practice at The Times, including challenges we faced along the way and key lessons learned. For example, how we worked together with our marketing and advertising teams to create rulebooks for safe, secure, and ethical data processing. I’ll also focus specifically on how data analytics supports our mission.\n\nMy hope is that this talk will provide more clarity on an area of work that very much tends to feel fuzzy and seemingly-overwhelming, and in turn encourage other companies to consider a data governance program of their own.\n\n===\nwww.pydata.org\r\n\r\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\r\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1851,
  "language": "eng",
  "recorded": "2020-06-15",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://datasciencedistrict.nl/pydata-festival-amsterda/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform",
      "url": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform"
    },
    {
      "label": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases",
      "url": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "download",
    "learn",
    "python 3",
    "software",
    "syntax"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/80k2yDRFhwI/maxresdefault.webp",
  "title": "Max Gendler - Supporting Business Ethics and Governance with Data | PyData Fest Amsterdam 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=80k2yDRFhwI"
    }
  ]
}
