{
  "description": "PyData is excited to announce PyData Global, November 11th - 15th! Tickets are now available: https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases\nPart of an underrepresented group in tech? PyData Global is offering Diversity Scholarships. Applications close September 30th: https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform\n\nNaomi Saphra (Keynote) - Accessible Means Hackable | PyData Fest Amsterdam 2020 \n\nIn 2015, after over a decade of programming, I lost the ability to type. Confronted with a programmer’s worst nightmare, I began the slow process of learning to dictate code. While customizing my environment and relying on configurations and scripts from a wider voice coding community, I simultaneously was confronted with paternalistic attitudes towards disabled people, attached to a framing of accessibility as “accommodation”. Often, accommodations and products for disabled people have a rigid model for their use – but the needs of blind people are just as diverse as the needs of those with sight, and disabled people are perfectly capable of improving on the use model that you offer to them. This is a story and a call for accessible systems that are open and adaptable, that allow people like me the agency to improve the tools they use.\n\n\nwww.pydata.org\r\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2790,
  "language": "eng",
  "recorded": "2020-06-15",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://datasciencedistrict.nl/pydata-festival-amsterda/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform",
      "url": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform"
    },
    {
      "label": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases",
      "url": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases"
    }
  ],
  "speakers": [
    "Naomi Saphra"
  ],
  "tags": [
    "Keynote"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/BKYWt8B9hgs/maxresdefault.webp",
  "title": "Accessible Means Hackable",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BKYWt8B9hgs"
    }
  ]
}
