{
  "description": "PyData is excited to announce PyData Global, November 11th - 15th! Tickets are now available: https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases\nPart of an underrepresented group in tech? PyData Global is offering Diversity Scholarships. Applications close September 30th: https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform\n\n\nRoelof Pieters - Watching Millions of Trees with Python: For Impact and Profit | PyData Fest AMS \n\nForests are essential to our future. More than 1.6 billion people depend on forests for food, water, fuel and medicines. They support 80% of non-human life on land and safeguard the climate by sequestering carbon. But forest fires, pests, diseases and especially deforestation lay waste to tens of millions of hectares a year. And under pressure of climate change this is only increasing.\n\nAt 20tree.ai we apply machine learning to high resolution satellite imagery, looking at trees and other vegetation all over the world constantly! In this talk I will dive into some of the work we do around monitoring both urban and rural green space. Secondly I will talk about how we bridge experimental R&D with applied ML work using nbdev, a framework made popular through the use of the second version of the popular fastai ML framework. And finally I will go over some of our continued challenges of dealing with large volumes of extremely noisy data, and reconciling this with the need to being cost-effective as a scrappy startup\n\nRoelof Pieters is CTO and co-founder of 20tree.ai, double Computer Science dropout (once as Bsc and more recently his Phd), has double degrees in Social/Development Anthropology and has the double distinction of running two earlier failed startups, most recently creative.ai. Roelof also heads up Sunshine Lab, a sustainable design studio, and only codes in python (of course)\n\n\nwww.pydata.org\r\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2138,
  "language": "eng",
  "recorded": "2020-06-15",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://datasciencedistrict.nl/pydata-festival-amsterda/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform",
      "url": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform"
    },
    {
      "label": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases",
      "url": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/C4epqE7KcM4/maxresdefault.webp",
  "title": "Roelof Pieters - Watching Millions of Trees with Python: For Impact and Profit | PyData Fest AMS",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=C4epqE7KcM4"
    }
  ]
}
