{
  "description": "PyData is excited to announce PyData Global, November 11th - 15th! Tickets are now available: https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases\nPart of an underrepresented group in tech? PyData Global is offering Diversity Scholarships. Applications close September 30th: https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform\nThijs Suijten - Making an Impact with Duct Tape | PyData Fest Amsterdam 2020\n\nAt Hack The Planet we are using our technical skills for the better. We have been working on many different challenges using various technologies like virtual reality to combat loneliness and autonomous flying drones to monitor forest fires. For our latest project we have developed a sensor that can detect mobile phones of poachers.\n\nThe system gathers data from the sensors. With analyses we can monitor and triangulate locations of suspicious activities. The data is really valuable for rangers on the ground and we are looking for ways to get more insights out of it. Think about detecting patterns and predicting poaching activity.\n\nI will share what we have so far and I’d love to hear your ideas on getting the most out of this system to help rangers on the ground to protect elephants and rhinos that are facing extinction.\n\n====\nwww.pydata.org\r\n\r\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \r\n\r\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases. 00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1550,
  "language": "eng",
  "recorded": "2020-06-15",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://datasciencedistrict.nl/pydata-festival-amsterda/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform",
      "url": "https://docs.google.com/forms/d/e/1FAIpQLSfcFaTqVFjMa6kWlLPeEynEcbp1WrCxyxMGyyh4BP33eAviaA/viewform"
    },
    {
      "label": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases",
      "url": "https://global.pydata.org/pages/tickets.html#pricing-and-ticket-purchases"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "download",
    "learn",
    "python 3",
    "software",
    "syntax"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/MBgadBMANpk/maxresdefault.webp",
  "title": "Thijs Suijten - Making an Impact with Duct Tape | PyData Fest Amsterdam 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MBgadBMANpk"
    }
  ]
}
