{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Interactive command-line (CLI) applications are extremely popular in the\nDevOps and Security communities as well as for internal tooling and\nautomation. Have you ever wanted to build an awesome CLI application\nusing Python but don't know where to get started? This talk will show\nyou how to use the cmd2 package to quickly and easily build feature-rich\nand user-friendly CLI apps in Python.\n\nInteractive command-line applications (CLIs) are used extensively in\nmany real-world scenarios, particularly in the DevOps and Security\ncommunities as well as for internal developer tooling and automation.\nI'm sure many of you have used the wonderful\n`ipython <https://ipython.org>`__ interactive Python shell which is a\ngood example of a CLI. Python has the built-in\n`cmd <https://docs.python.org/3/library/cmd.html>`__ library for\ncreating CLIs, but it is extremely bare-bones. The\n`cmd2 <https://github.com/python-%20cmd2/cmd2>`__ package is a\nbatteries-included extension of ``cmd`` which makes it much quicker and\neasier to create feature-rich and user-friendly CLIs.\n\nThe presentation will first explain how to install ``cmd2``. The talk\nwill next show how to create a basic ``cmd2`` application. Then the talk\nwill progressively add features to this application while demonstrating\nthe capabilities built into ``cmd2``. In the end, the presentation will\nshow how to build a basic but feature-rich and user-friendly CLI\napplication from scratch. This application will include many features\nwhich make it easy to use for customers, including:\n\n-  Built-in help\n-  Top-notch tab-completion\n-  Shell-like functionality including ability to run shell commands,\n   pipe to shell commands, and redirect output to files\n-  Built-in application scripting\n-  Built-in Python scripting\n-  Built-in history\n-  Command aliases and macros\n\nUltimately, people who attend this talk will learn how to use the Python\nprogramming language with the ``cmd2`` package to quickly and\nefficiently build their own interactive command-line applications.\n",
  "duration": 2771,
  "language": "eng",
  "recorded": "2019-07-27T14:00:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2019/events/schedule"
    }
  ],
  "speakers": [
    "Todd Leonhardt",
    "Kevin Van Brunt"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/pebeWrTqIIw/maxresdefault.jpg",
  "title": "A Hands-On Guide to Building Interactive Command-Line Apps with cmd2",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pebeWrTqIIw"
    }
  ]
}
