{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Project documentation is easy to neglect. Keep your docs inside your\nsource repo and learn how to automatically build and publish beautiful\ndocs on every commit. Viewers will leave with a new mindset on how to\nhandle documentation, tooling for this process, and an easy-to-implement\nmethod to achieve this.\n\nIt is common for developers to overlook the documentation of their\nworks. They are either on a time crunch, lack the proper tooling, or\nsimply just forget to create and update the documentation. Whatever the\ncause behind this, it is not a proper excuse for not keeping the\ndocumentation up to date. However, for all our development processes\nthere are few as neglected as the documentation process. Documentation\nshould be treated as important as the code that makes up the project. In\nthis talk we'll take a look at current documentation processes and\ndiscuss moving the documentation into the code. With modern\ndocumentation tools such as MkDocs and Sphinx, both of which are Python\npowered tools, and Continuous Integration tools we can now include docs\nin the commit. They can be reviewed in code reviews, built and versioned\nin a CI tool, and even tested for things such as correct code examples\nand broken links. This is the process that the developer knows,\nunderstands, and enjoys. I introduced a team to this exact workflow and\na working pipeline; all they had to do was keep the documentation up to\ndate. This team currently has some of the most up to date documentation\nin a company of near two thousand engineers, and they never complain\nabout writing/updating documentation. It’s just part of the workflow.\n",
  "duration": 1522,
  "language": "eng",
  "recorded": "2019-07-27T15:45:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2019/events/schedule"
    }
  ],
  "speakers": [
    "Mason Egger"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/sBmIicMLOWs/maxresdefault.jpg",
  "title": "Building Docs like Code: Continuous Integration for Documentation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sBmIicMLOWs"
    }
  ]
}
