{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "In this session, we are going to build a Convolution Neural Network to\nrecognize hand-written runes from the Younger Futhark. We'll be using\nKeras to write easy to understand Python code that creates and trains\nthe neural network to do this. We'll wire this up to a web application\nusing Flask and some client-side JavaScript so you can write some runes\nyourself and see if it recognizes them.\n\nThe Vikings came from the land of ice and snow, from the midnight sun,\nwhere the hot springs flow. In addition to longships and bad attitudes,\nthey had a system of writing that we, in modern times, have dubbed the\nYounger Futhark (or ᚠᚢᚦᚬᚱᚴ if you're a Viking). These sigils are more\ncommonly called runes and have been mimicked in fantasy literature and\nrole-playing games for decades.\n\nOf course, having an alphabet, runic or otherwise, solves lots of\nproblems. But, it also introduces others. The Vikings had the same\nproblem we do today. How were they to get their automated software\nsystems to recognize the hand- carved input of a typical boatman? Of\ncourse, they were never able to solve this problem and were instead\nforced into a life of burning and pillaging. Today, we have deep\nlearning and neural networks and can, fortunately, avoid such a fate.\n\nWhen we're done, you'll understand how Convolution Neural Networks work,\nhow to build your own using Python and Keras, and how to make it a part\nof an application using Flask. Maybe you'll even try seeing what it\nthinks of the Bluetooth logo?\n",
  "duration": 2634,
  "language": "eng",
  "recorded": "2019-07-28T15:15:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2019/events/schedule"
    }
  ],
  "speakers": [
    "Guy Royse"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/A89l8GwsUNY/maxresdefault.jpg",
  "title": "Deep Learning Like a Viking: Building Convolutional Neural Networks with Keras",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=A89l8GwsUNY"
    }
  ]
}
