{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "If you’ve ever joined a new team, you know that there are hidden rules\nfor how the team operates: what they value in their day-today work, what\nis important to them.\n\nBreaking news: teams are hard. We document our code... shouldn't we\ndocument our team's values and ideals?\n\n*Beautiful is better than ugly.* There is more to a team than just\nthrowing people together and telling them to ship code. The culture of\nthe team matters, Not company culture, but the culture and operating\nrules of the group of people that spend their days together. That\nculture can be amazing when it is mindfully considered. So how does that\nhappen?\n\n*Explicit is better than implicit.* A team charter is documentation\nwritten by a group of people to capture their purpose, their values,\ntheir working rules, and their general processes. Making the invisible\nvisible is the purpose of the team charter.\n\n*There should be one-- and preferably only one --obvious way to do it.*\nYour team charter will provide an anchor to keep your team true to their\nideals, even and **especially** during periods of great stress by\nproviding a written record of how they aspire to work together.\n\n*In the face of ambiguity, refuse the temptation to guess.* Whether it\nis establishing priorities or onboarding new team members, your team\ncharter will take the guesswork out of the non-code parts of working\ntogether.\n\nIn this talk, we'll explore what a team charter is, how to create one,\nand view examples of charters teams have created and used in their\nday-to-day work.\n",
  "duration": 1502,
  "language": "eng",
  "recorded": "2019-07-27T12:00:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2019/events/schedule"
    }
  ],
  "speakers": [
    "Christopher T. Miller"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/fEr3XwhFwPA/maxresdefault.jpg",
  "title": "Explicit is Better than Implicit: Making Culture Visible with Team Charters",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fEr3XwhFwPA"
    }
  ]
}
