{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Python provides a great set of built-in tools and third-party libraries\nfor data analysis. Modern personal devices like smart watches or phones\ngenerate streams of data about body metrics, location, movement, and\nmore. I describe Python-based methods for extracting and analyzing data\nfrom personal smart devices. I applied these methods to track and change\nhabits and behaviors to lose 25 pounds.\n\nYour smartwatch and smartphone provide reams of data about your body,\nmovement, behavior, health, and more. Python is an ideal language to use\nfor analyzing, transforming, and displaying this data. Furthermore,\nnumerous third-party packages such as NumPy, SciPy, pandas, and\nmatplotlib make this process easier, faster, more fun, and more\ninsightful than ever before.\n\nFurthermore, you can use these tools to get tangible results in your\nlife: for example, during the first few months of 2019, I used a set of\nPython scripts operating on a combination of personal data sources to\nmodify my habits and behaviors to lose 25 pounds!\n\nIn this talk we analyze several streams of data from Apple Watch and\niPhone to explore what we can learn from them, individually and in\ncombination. Data categories that we explore include:\n\n-  sleep\n-  fasting\n-  heart rate\n-  body weight\n\nWe use simple but powerful techniques from signal processing, including\nmoving averages and filtering, to extract insight from the data.\nAdditionally, we investigate correlations between the different data\nstreams.\n\nPutting this methodology in place is fun, informative, and personally\nrewarding. In particular, you can use it for habit tracking, to increase\nself- knowledge and motivate useful habit change.\n",
  "duration": 1832,
  "language": "eng",
  "recorded": "2019-07-28T13:45:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2019/events/schedule"
    }
  ],
  "speakers": [
    "Jack Bennett"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/FlYGVOZPWDw/maxresdefault.jpg",
  "title": "I Lost 25 Pounds Thanks to Python: Personal Data Analytics Using Pandas and Numpy",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FlYGVOZPWDw"
    }
  ]
}
