{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Computer Vision aims to teach computers to interact with the visual\nworld. It has applications navigation, automated inspection, assisting\nthe visually impaired, and so much more. In this talk, I will explain\nand demonstrate how you can use Computer Vision to locate and identify a\nplaying card in a live video feed.\n\n\"Pick a card, any card,\" the magician prompts you fanning out a deck of\ncards. You select a card, note its value, and hand it back to the\nmagician. They do some sleight of hand, make the card disappear into the\ndeck, and then make it reappear. You confirm that it is, indeed, your\noriginal card. The magician moves on and you get to go back to enjoying\nyour dinner.\n\nWhere is the real magic? Is it in the magician's ability to make a card\nreappear? Or, is it something that many of us take for granted each and\nevery day? In the very instant you glance at a card, you're able to take\nin details without even thinking about it.\n\nComputer Vision aims to teach computers to interact with the visual\nworld. It has applications in navigation, automated inspection, medical\nimage process, and so much more.\n\nIn this talk I will do the following:\n\n-  Introduce the field of Computer Vision.\n-  Demonstrate how to manipulate a webcam video feed and pre-process the\n   video to perform Canny Edge Detection.\n-  Use these edges to isolate a playing card image and, eventually,\n   identify which playing card is being shown.\n\nNo prior knowledge of Computer Vision or Machine Learning is necessary.\n",
  "duration": 1543,
  "language": "eng",
  "recorded": "2019-07-28T16:15:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2019/events/schedule"
    }
  ],
  "speakers": [
    "Steve Crow"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/bYBFF-N1Z98/maxresdefault.jpg",
  "title": "Is This Your Card? Computer Vision for Playing Card Recognition",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bYBFF-N1Z98"
    }
  ]
}
