{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Writing software with no defects is extremely difficult and expensive,\nbut the lessons learned from such ambitious projects can inform our\napproach for a more practical development technique. This talk looks at\nhow principles from zero-defect engineering, functional programming, and\nrefactoring come together to produce robust, readable, and reliable\ncode.\n\nYou know that feeling when you look at a piece of code you or someone\nhas written and it has a smell, it's inelegant, or its incomprehensibly\ncomplex. And then there's the other feeling, when you see a piece of\ncode that's comprehensible, elegant, and it is ready to adopt the\nbehavior you seek. It's this feeling we want to replicate and enhance.\nInstigated by a simple tweet, the speaker reaches back in time to\nexplore the foundational practices that lead to our best code.\n\nStarting with Refactoring, we'll reflect on the techniques of change\nthat retain stability while increasing sophistication or reducing\ncomplexity. We'll explore how code is a form of conversation and ways\nthat conversation can transpire in a code repository.\n\nNext we will explore how Python has supported the principles and\nprimitives of functional programming from early versions and how the\nconstraints of functional programming lead to robust logic. We'll\nexamine the functional nature of comprehensions and the powerful feature\nof functions as parameters.\n\nIn the main event, the speaker will draw on his early experiences with\nZero- Defect Software, where one writes software with literally no bugs,\nand how these techniques can influence the design and implementation\ntoward a more robust solution, starting with a rigorous but impractical\nideal and distilling from that a pragmatic approach that retains much of\nthe benefit of the technique. Integrating the lessons from refactoring\nand functional programming, a coding approach emerges that promises to\nenable and empower your development.\n",
  "duration": 1725,
  "language": "eng",
  "recorded": "2019-07-27T11:15:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2019/events/schedule"
    }
  ],
  "speakers": [
    "Jason R. Coombs"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/1p9nR4z7aZY/maxresdefault.jpg",
  "title": "Lessons from Zero-Defect Software",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1p9nR4z7aZY"
    }
  ]
}
