{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Large datasets are vital for the majority of analytic and machine\nlearning tasks. But what happens when the data you need isn't available\nin some convenient and easily obtainable form? This talk will go through\nthe process of data scraping to create a dataset that can be then used\nfor various analytical or machine learning tasks.\n\nIt is essential to have a very large and high-quality dataset in order\nto perform significant analytics or to use in various machine learning\ntasks. For some tasks, there exists simple APIs or repositories of data\nto collect from. But for many other tasks like tracking prices of\nproducts, predicting stock prices, and predicting outcomes of sports\ngames there isn't a convenient way to retrieve this information besides\na webpage. Because of these circumstances, learning to scrape data from\nwebpages and other sources allows us to create our own dataset.\nAdditionally, scraping grants us the ability to ask better questions\nabout data in the world.\n\nThis talk is geared towards beginner-to-intermediate Python developers\nthat want to be able to ask and answer better questions through data.\nThis talk will provide a guide for web scraping through two examples,\nand it will explain how to get the scraped data into a usable form.\nThroughout the talk, I will highlight some tips for improving scraper\nperformance, minimizing the risk that a web server will stop you, and\ndifferent ways to store the collected data. The first of the two\nexamples will examine a simple case of scraping data about the lottery\nand the second will explore a more challenging case of scraping course\ninformation from a University.\n",
  "duration": 2516,
  "language": "eng",
  "recorded": "2019-07-27T14:00:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2019/events/schedule"
    }
  ],
  "speakers": [
    "Alex Zharichenko"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Et4AqsIktHQ/maxresdefault.jpg",
  "title": "Scraping Your Way to a Dataset",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Et4AqsIktHQ"
    }
  ]
}
