{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Python is such a popular language for good reason: Its principles are\nstrong. However, if Python is “the second-best language for everything”…\nthat means the *first-best* is often chosen instead. Oh no! How can\nPythonistas survive a project or workplace without our favorite\nlanguage? Take a deep breath, because I’ll show you how to apply things\nthat make Python great to other software spaces.\n\nPython is not the only “fish in the sea” - there are several good\nlanguages and frameworks out there that are awesome in their own right.\nAnd as software people, whether we are web developers, data scientists,\nor some other role, we probably won’t spend 100% of our work using\nPython. It’s inevitable. Web dev relies on JavaScript. Data scientists\noften use R and Scala. Backends frequently use C# and Java. Success as a\nmodern software engineer requires inter-domain proficiency.\n\nPersonally, even though I love Python, I don’t use it daily at my full\ntime job. Nevertheless, Pythonic thinking guides my whole approach to\nsoftware. I will talk about how the things that make Python great can be\napplied to non- Python places in three primary ways:\n\n1. Principles from the Zen of Python\n2. Projects that partially use Python\n3. People who build strong, healthy community\n\nI will provide stories, statistics, examples, projects, side-by-side\ncode comparisons, and pictures to explain these points well. Python’s\nvalues can make the software world a better place!\n",
  "duration": 1587,
  "language": "eng",
  "recorded": "2019-07-28T12:45:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2019/events/schedule"
    }
  ],
  "speakers": [
    "Andrew Knight"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/kj2JhIg-hQQ/maxresdefault.jpg",
  "title": "Surviving Without Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kj2JhIg-hQQ"
    }
  ]
}
