{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Have you ever struggled with finding ways to present data visualizations\nand/or results to non-technical audiences in a coherent and engaging\nmanner? In this talk, I'll detail how I overcame such a challenge by\nusing Dash to build an interactive app for firefighters to use during\nperformance testing of their rescue equipment.\n\nAnalytical web applications can serve as a powerful means for scientists\nand engineers to interact with data and identify trends in a concise and\nstraightforward manner. Such tools can allow users to immediately see\nthe effects of modifying specific input parameters. Additionally,\ninteractive web apps can be utilized to present data visualizations and\nanalysis results in engaging ways.\n\nUnless you're a full-stack developer, creating these types of web\napplications may seem quite challenging. Dash, a Python framework\nwritten on top of Flask, Plotly.js, and React.js, handles many of the\ncomplexities associated with building custom interfaces and provides\nusers the ability to build powerful data visualizations strictly through\nPython.\n\nDespite being an intermediate Python user lacking full knowledge of the\ntechnologies and protocols required to build web-based applications, I\nwas able to create a UI using Dash. More specifically, I built an\ninteractive dashboard for firefighters to process and interact with\nsensor data collected during performance testing of their rescue\nequipment.\n\nDuring this talk, I will briefly detail the motivation behind this\nproject. Then, I'll describe how the project progressed to its current\nstate, while highlighting key points that can be applied to the general\ncase of developing interactive web apps for audiences from non-technical\nbackgrounds. To conclude my presentation, I will show a demo of the\ninteractive web app and summarize the key takeaways.\n",
  "duration": 1611,
  "language": "eng",
  "recorded": "2019-07-27T12:00:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2019/events/schedule"
    }
  ],
  "speakers": [
    "Joseph Willi"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/GiNF9diitAM/maxresdefault.jpg",
  "title": "Using Dash to Create Interactive Web Apps for Non-Technical Audiences",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GiNF9diitAM"
    }
  ]
}
