{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Honeybee colonies throughout North America have declined precipitously\ndue to parasites, pesticides, and poor nutrition over the past two\ndecades. Monitoring hive health autonomously assists beekeeper efforts.\nWe developed a model which automatically detects events in bee hive\nweight data assisting data collection efforts improving data quality for\nfuture machine learning models to be developed.\n\nPesticides, parasites, and poor nutrition, has led to the decline of\nhoneybee colonies throughout North America. A number of methods have\nbeen proposed to combat the problem, with one here at Grand Valley State\nUniversity (GVSU) focusing on collecting hive weight data identifying\npotential issues through data analytics. Currently, “citizen scientist”\nbeekeepers participate by collecting weight data from their hives\nthrough the Bee Informed Partnership (BIP). Using Python3, Bokeh, SciKit\nlearn and Pandas we were able to produce a model using linear regression\nthat could predict patterns in weight data. Our short term goal for the\nproject was to create a model that could predict events and windows of\ntime where events could have occured to improve the data quality and\nuser engagement. The ultimate long term goal of this project is to\npredict what kind of event occurred such as adding food to the hive,\nharvesting honey, swarming events, and even parasite infestation.\n",
  "duration": 1456,
  "language": "eng",
  "recorded": "2019-07-28T13:45:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2019/events/schedule"
    }
  ],
  "speakers": [
    "Allison Bolen"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/upmI8mg2NTo/maxresdefault.jpg",
  "title": "What's the Buzz with Machine Learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=upmI8mg2NTo"
    }
  ]
}
