{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "I love reading books, but I love lending them out even more! In order to\nkeep track of my personal library, a daunting task indeed, I’ve employed\nPython, a Raspberry Pi, and an RFID reader. Take a tour through what\nit’s like working with hardware, Python, and putting it all together\ninto a useful web application. This is a beginner friendly talk, so\ndon’t worry if you’ve never worked with hardware\n\nThe Internet of Things (IoT) is here to stay, but getting started can\nseem intimidating. Inspired by the magical checkout process at my local\nlibrary, I began the journey of building my own IoT book lending\napplication. Along the way, I discovered that Python was consistently\nable to make the impossible seem approachable!\n\nWe’ll start with a base installation of Raspbian on a Raspberry Pi and\nfind that Python is already there waiting to help. Then we’ll hook up an\nRFID reader to our Pi, and see that even though it has wires and pins,\nit’s nothing to be scared of. With the RFID reader and the fantastic\nMFRC522-python library, we’re able to read and write data to RFID\nstickers, neat!\n\nWe could stop here, but we’ve got Python, so let’s hook it up to a Flask\napp and end at a complete book lending application. I hope attendees\nwill gain an appreciation for the technology all around them, their\nlocal library, and how powerful Python is. I hope to demystify working\nwith hardware and dispel some perceived barriers to entry for IoT\napplications.\n",
  "duration": 1714,
  "language": "eng",
  "recorded": "2019-07-27T10:30:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2019/events/schedule"
    }
  ],
  "speakers": [
    "Daniel Lindeman"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/re6mt9d5Qw4/maxresdefault.jpg",
  "title": "“Who’d I Lend That Book To?” Hard Questions Answered with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=re6mt9d5Qw4"
    }
  ]
}
