{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Taking lessons from adult learning theory and from examples of hundreds\nof bootcamp students, this talk will walk through what I have learned\nabout accelerated adult learning and tell you the what and the why\naround techniques that you can use to more efficiently pick up your next\ntechnology in record time.\n\nWith the wealth of learning materials out there, why is it still not\neasy to pick up and learn new technologies? Why do we still have trouble\ngoing from learning to doing? With limited time to pick up the new\nthings that will advance our careers, what's the most efficient way to\nretain and implement the new skills that we need? Taking lessons from\nadult learning theory and from examples of hundreds of bootcamp\nstudents, this talk will walk through what I have learned about\naccelerated adult learning and tell you the what and the why around\ntechniques that you can use to more efficiently pick up your next\ntechnology in record time.\n\nThere has been substantial research done on how adults learn, but they\naren't widely known. Using the same learning tactics you used as a kid\ndoesn't always bring the best results or results that will stick. Adults\nshouldn't be aiming to memorize facts for a test, they should be looking\nto build long term skills that they can apply when needed.\n\nThis talk will pass on some of the most important and actionable\nfindings in adult learning research and will walk attendees through a\npath to learning a new skill that is efficient and effective.\n\nTopics include:\n\n-  The Dreyfus Model of Learning\n-  How learning shifts between the novice and the intermediate\n-  Understanding the levels of mastery\n-  The Effective Tech Bootcamp model of learning\n-  What learning techniques are effective and why\n-  Creating a learning plan that works for you\n",
  "duration": 1854,
  "language": "eng",
  "recorded": "2019-07-27T16:30:00",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pyohio.org/2019/events/schedule"
    }
  ],
  "speakers": [
    "Joe Erickson"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/RewDPZrgRls/maxresdefault.jpg",
  "title": "Your Own Personal Bootcamp: How to Efficiently Learn Your Next Technology",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RewDPZrgRls"
    }
  ]
}
