{
  "copyright_text": null,
  "description": "aka. How to Convince Your Boss that you need Machine Learning\n\nMichal Grochmal\n\nMonday 17th, 15:00 (Ferrier Hall)\nA talk (25 minutes)\nThis presentation comes from a recurring question I get from my students: \"OK, all this machine learning stuff is great but how do you use it in real life?\"\n\nThe students ask this because they come from what several of us would call old-fashioned programming jobs, where you actually program every step of what a computer does with the data. Sounds crazy, right? But that is still the reality in several companies. There are several reasons for dealing with data in that way: legacy applications, belief that hand-coded rules get 100% accuracy (yeah, right), or simply an attitude of don't fix what ain't broken - despite the fact that it is broken.\n\nI point such students towards *Anomaly Detection* (AD). Why? Because AD is an easy technique to plug into a non-ML system. Every company has some form of data aggregation - and data scrutiny - system: be it webserver logs, forex trades, or hotel bookings data. In that scrutiny system dirty data exist, or is fed in, and there are coded rules to prevent processing of this bad data.\nInstead of hand-coded rules, that is the place where ML techniques should be used, notably AD.\n\nAD is quite easy to explain without going into mathematics, which is a good thing if you need to convince your boss. AD can be used as a substitute for hand-coded rules, as a way of tuning (hyper-)parameters for rules, or even working alongside such rules. Moreover most AD techniques can be used on both: static datasets or running time series.\n\nWe will discuss a couple of examples of AD use. AD may appear as a rather specific field to a typical programmer but that's far from true. AD is just a clever (read: slightly different) way of using well known ML techniques.\n\nThe speaker suggested this session is suitable for new programmers.\nThe speaker suggested this session is suitable for data scientists.",
  "duration": 1532,
  "language": "eng",
  "recorded": "2018-09-17",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/nGv7HKz83m8/maxresdefault.jpg",
  "title": "Anomaly Detection",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nGv7HKz83m8"
    }
  ]
}
