{
  "copyright_text": null,
  "description": "Apache Spark is the standard tool for processing big data, capable of\nprocessing massive datasets often at speeds much faster than Apache\nHadoop, especially for iterative algorithms such as those of common\nmachine learning tasks.\n\nSpark is also relatively easy to get started with and use for\nexploratory data analysis, especially as it offers interactive Scala,\nPython and R shells in which a user can easily try out different ways of\nmanipulating their data, avoiding the slow write - compile - submit -\nwait - inspect output loops of other frameworks. Spark also provides a\nhigh level DataFrame API and scalable machine learning libraries, making\nit a compelling tool for data scientists.\n\n| In this talk I’ll introduce you to some tools for interacting with an\n  Apache Spark cluster from Python and Jupyter, including:\n| \\* Connecting to a Spark cluster from a Jupyter notebook using\n  sparkmagic\n| \\* Loading data into Spark from external sources\n| \\* Basics of data manipulation in Spark\n| \\* Getting data out of Spark and into Pandas DataFrames for plotting\n  or further modelling or analysis\n| \\* Introduction to Spark machine learning tools\n| \\* How to run Spark code from Python scripts, Plotly Dash web apps and\n  Flask web APIs using the pylivy client library\n\nI am an engineer at ASI, a data science consultancy and developers of\nthe SherlockML data science platform based in London. This talk comes\ndirectly from our experience helping our consultants and SherlockML\nusers to most effectively use Spark as part of an integrated data\nscience workflow.\n",
  "duration": 1553,
  "language": "eng",
  "recorded": "2018-09-17",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [
    "Andrew Crozier"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/iHg0NwEjbxk/maxresdefault.jpg",
  "title": "Big Data: Using Spark from Python and Jupyter",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iHg0NwEjbxk"
    }
  ]
}
