{
  "copyright_text": null,
  "description": "Networks are all around us. While Facebook and Twitter are the obvious\nexamples, every time we shake hands, drive from point A to B, push code\nto GitHub, check out a meetup or rate a show on IMDB, we’re\nparticipating in network activity. People, places, things and even ideas\nare inter-connected in innumerable networks, and these can have a great\n(yet sometimes inconspicuous) impact on our lives.\n\nThe purpose of this talk is to introduce members of the audience to\nnetwork analysis and its importance, and give them the basic building\nblocks for applied network analysis with Python (using the friendly\nNetworkX library). I hope this talk will encourage audience members to\nconsider network analysis approaches in their line of work/research and\nintrigue them to learn more.\n\nThe talk will weave theory and practice, discussing topics in graph\ntheory as we’re seeing them in practice during hands on analysis of a\nreal-life network. Topics covered include: types of graphs (undirected,\ndirected, multi and bipartite), structures in graphs (triangles,\ncliques, connected components), node importance (centrality measures,\nPageRank), graph topology and high-level graph descriptions. Practical\napplications of these topics will be emphasized.\n\nGiven the limited time compared to the breadth of the topic, the focus\nwould lean towards intuitive understanding of concepts and seeing them\nin practice, over deep theoretical formulations and hardcore\nmathematics.\n\nThe talk will be given from a data scientist’s perspective with touches\nof social sciences flavor.\n",
  "duration": 1517,
  "language": "eng",
  "recorded": "2018-09-15",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [
    "Alon Nir"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/h4KIHVnap20/maxresdefault.jpg",
  "title": "Getting an Edge with Network Analysis with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=h4KIHVnap20"
    }
  ]
}
