{
  "copyright_text": null,
  "description": "Alon Nir\n\nSaturday 15th, 11:30 (Ferrier Hall)\nA talk (25 minutes)\nNetworks are all around us. While Facebook and Twitter are the obvious examples, every time we shake hands, drive from point A to B, push code to GitHub, check out a meetup or rate a show on IMDB, we’re participating in network activity. People, places, things and even ideas are inter-connected in innumerable networks, and these can have a great (yet sometimes inconspicuous) impact on our lives.\n\nThe purpose of this talk is to introduce members of the audience to network analysis and its importance, and give them the basic building blocks for applied network analysis with Python (using the friendly NetworkX library). I hope this talk will encourage audience members to consider network analysis approaches in their line of work/research and intrigue them to learn more.\n\nThe talk will weave theory and practice, discussing topics in graph theory as we’re seeing them in practice during hands on analysis of a real-life network. Topics covered include: types of graphs (undirected, directed, multi and bipartite), structures in graphs (triangles, cliques, connected components), node importance (centrality measures, PageRank), graph topology and high-level graph descriptions. Practical applications of these topics will be emphasized.\n\nGiven the limited time compared to the breadth of the topic, the focus would lean towards intuitive understanding of concepts and seeing them in practice, over deep theoretical formulations and hardcore mathematics.\n\nThe talk will be given from a data scientist’s perspective with touches of social sciences flavor.\n\nThe speaker suggested this session is suitable for new programmers.\nThe speaker suggested this session is suitable for data scientists.",
  "duration": 1517,
  "language": "eng",
  "recorded": "2018-09-15",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/h4KIHVnap20/maxresdefault.jpg",
  "title": "Getting an Edge with Network Analysis with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=h4KIHVnap20"
    }
  ]
}
