{
  "copyright_text": null,
  "description": "Applying open source technology outside of the classroom and into everyday life\n\nMelanie Shimano, Zahire Beatty, Tim Moore\n\nSunday 16th, 15:00 (Room D)\nEducation Summit talk for educators (Sunday, 25 mins)\nMy session will focus on how I’ve used Python, Raspberry Pi, and other open source technology in classroom lessons in order to engage students in civic tech and community-based solutions for community challenges. Today, there are thousands of resources for hobbyists and educators to incorporate inexpensive, open source technology into classroom lessons, however, very few of these resources help students truly understand how they can continue to use this technology in their everyday lives or in developing solutions for everyday challenges. Over the past year and a half, I’ve developed and taught a program of over 150 students in four institutions in which students build and code open source “Food Computers” (Raspberry Pi-controlled, hydroponic, indoor personal farms designed at the MIT Media Lab) in order to learn how to design solutions to urban food deserts in their neighborhoods. Students have designed and begun to implement solutions surrounding nutrition, agriculture, and technology education to elementary-age students, mobile “Food Computer” grocery stores, monthly family cooking and nutrition classes at schools, and school-wide sustainability lessons to engage high school students with urban agriculture.\n\nI’ve seen how students transform and fully engage in computer science, plant and food science, agriculture, and human-centered design lessons over the course of each semester once they are able to personally relate and take ownership of their lessons, and I would love to share lessons learned and proposed curriculum guides for other educators to implement similar lessons into their classrooms as well. By integrating real-world challenges and solutions into classroom lesson plans, we can help students best understand how they can leverage Python and other open source tech to change the world.\n\nThe speaker suggested this session is suitable for new programmers.\nThe speaker suggested this session is suitable for teachers.",
  "duration": 1487,
  "language": "eng",
  "recorded": "2018-09-17",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Up97UphO-Ck/maxresdefault.jpg",
  "title": "How can Students Engage & Improve Communities with Python?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Up97UphO-Ck"
    }
  ]
}
