{
  "copyright_text": null,
  "description": "Applying open source technology outside of the classroom and into everyday life\n\nMy session will focus on how I’ve used Python, Raspberry Pi, and other\nopen source technology in classroom lessons in order to engage students\nin civic tech and community-based solutions for community challenges.\nToday, there are thousands of resources for hobbyists and educators to\nincorporate inexpensive, open source technology into classroom lessons,\nhowever, very few of these resources help students truly understand how\nthey can continue to use this technology in their everyday lives or in\ndeveloping solutions for everyday challenges. Over the past year and a\nhalf, I’ve developed and taught a program of over 150 students in four\ninstitutions in which students build and code open source “Food\nComputers” (Raspberry Pi-controlled, hydroponic, indoor personal farms\ndesigned at the MIT Media Lab) in order to learn how to design solutions\nto urban food deserts in their neighborhoods. Students have designed and\nbegun to implement solutions surrounding nutrition, agriculture, and\ntechnology education to elementary-age students, mobile “Food Computer”\ngrocery stores, monthly family cooking and nutrition classes at schools,\nand school-wide sustainability lessons to engage high school students\nwith urban agriculture.\n\nI’ve seen how students transform and fully engage in computer science,\nplant and food science, agriculture, and human-centered design lessons\nover the course of each semester once they are able to personally relate\nand take ownership of their lessons, and I would love to share lessons\nlearned and proposed curriculum guides for other educators to implement\nsimilar lessons into their classrooms as well. By integrating real-world\nchallenges and solutions into classroom lesson plans, we can help\nstudents best understand how they can leverage Python and other open\nsource tech to change the world.",
  "duration": 1487,
  "language": "eng",
  "recorded": "2018-09-16",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [
    "Melanie Shimano",
    "Zahire Beatty",
    "Tim Moore"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Up97UphO-Ck/maxresdefault.jpg",
  "title": "How can Students Engage & Improve Communities with Python?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Up97UphO-Ck"
    }
  ]
}
