{
  "copyright_text": null,
  "description": "Mark Smith\n\nSunday 16th, 11:30 (Ferrier Hall)\nA talk (25 minutes)\nAlways wanted to publish a package on PyPI, but didn't know where to start?\nThis talk is for you! Starting with nothing, we'll build a package and publish it on PyPI using current best practices.\n\nPublishing a package on PyPI used to be a cargo cult. (And often still is!) Instead of copying and pasting from other projects' `setup.py` without fully understanding what's happening, discover how to package your code for PyPI from scratch - then learn how to avoid doing any of this completely! (But now know you'll know what's going on).\n\n* _Why_ should you package your code for PyPI?\n* How to structure your project and your code, including why you need a `src` folder!\n* Discover what goes in your `Pipfile` and your `setup.py`, and why. Learn\nthe difference between installing your library to use it, and installing it to develop on it.\n* Write tests for your project, and run them using Tox.\n* Ensure your code will work in different on different platforms with\nContinuous Integration!\n* Document your code so people won't ask you loads of questions!\n* How to actually get your code on PyPI using Twine. Configure your machine\nfor PyPI and test your package release on the PyPI test server.\n* Finally, learn how avoid doing any of this yourself (or avoid doing it\ntwice) using CookieCutter templates.\n\nBy the end of this talk, you'll be so comfortable packaging projects you won't avoid writing `setup.py` files any more! Maybe you'll even start writing new code just so you can publish it on PyPI!\n\nThe speaker suggested this session is suitable for new programmers.",
  "duration": 1271,
  "language": "eng",
  "recorded": "2018-09-16",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Jg9OGuxrpxk/maxresdefault.jpg",
  "title": "How To Publish A Package On PyPI",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Jg9OGuxrpxk"
    }
  ]
}
