{
  "copyright_text": null,
  "description": "I am an engineer of all sorts. I tinker with electronics, fashion, programming and stem cells.\n\nRachel Rui Wong\n\nSunday 16th, 12:30 (Room A)\nA talk (25 minutes)\nI would like to share my knowledge and experiences in both wearable fashion technology (what it is, what we can do with it, why its relevant) that i have created with various programming languages including python as a creative hobby outlet, and in tissue engineering with stem cells which is my profession. The aim of my talk is really to make people aware that you can have multiple interests and it is highly encouraged for a fulfilling lifestyle and improved mental health. In adults, having work that you're passionate about can easily engulf your whole life easily ignoring other needs in life. It is so easy to go on without realising that if work was taken away from you, you haven't got anything else. There is a fear of trying something new due to not enjoying it or not being good at it. In teenagers and children, they are often blindsided by stereotypes. Young girls that I have spoken to feel there is a pressure to give up fashion and beauty in pursuing a STEM career or education. I set myself in this instance as a role model to show that people generally are multidirectional and cross-disciplinary interest is easy to get into, unique, beneficial and sought after.\n\nThe speaker suggested this session is suitable for new programmers.\nThe speaker suggested this session is suitable for teachers.\nThe speaker suggested this session is suitable for data scientists.",
  "duration": 1577,
  "language": "eng",
  "recorded": "2018-09-18",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/-sbOyZwCVHE/maxresdefault.jpg",
  "title": "I Make Fashion Tech and Human Organs for My Mental Health",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-sbOyZwCVHE"
    }
  ]
}
