{
  "copyright_text": null,
  "description": "And the tools we've developed to help them\n\nOver the past two years, the Department of Chemistry at the University\nof Bath has begun the process of introducing programming in Python to\nthe undergraduate curriculum. During this time, I have been a PhD\nstudent, first- year undergraduate tutor and laboratory demonstrator in\nthe Department and have been closely involved in the development of this\ncourse as well as its teaching.\n\nThis year I pioneered the use of Python programming and the Jupyter\nnotebook interface to enhance my tutorials. This has involved preparing\nthe answers to each tutorial question in a formatted notebook that is\nassessable to the students during and after the tutorial. Furthermore,\nusing the notebook in the tutorial, during teaching, enables immediate\nfeedback and helps students that do not typically interface with\nprogramming to see its utility directly to their work.\n\nAdditionally, I have developed pylj, a Python code written to facilitate\nstudent interaction with computational chemistry (an area important to\nchemical research but often underappreciated at the undergraduate\nlevel). This software operates in a Jupyter notebook interface and\nallows students to perform atomistic simulation to probe topics from\nphysical chemistry that are covered in their lecture material. The fact\nthat the students are now familiar with Python means that it is easy for\ninquisitive students to interact with and hack the underlying code.\n\nFor more information about this project please visit:\npythoninchemistry.org",
  "duration": 1418,
  "language": "eng",
  "recorded": "2018-09-16",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [
    "Andrew McCluskey"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/DcLzpfCJkBA/maxresdefault.jpg",
  "title": "Introducing programming to undergraduate chemists",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DcLzpfCJkBA"
    }
  ]
}
