{
  "copyright_text": null,
  "description": "Measuring Sea levels and tides using an ultra low cost Python driven logging system\n\nPaul Bell\n\nMonday 17th, 10:30 (Assembly Room)\nA talk (25 minutes)\nA recent Natural Environment Research Council funded proof of concept award to the UK's National Oceanography Centre successfully demonstrated that Global Navigation Satellite System (GNSS) signals reflected off the sea surface and received by very low cost (~£30) GPS receivers can be used to estimate the difference in height between the GPS receiver and the water. This represents a method of remotely sensing tidal elevations and, if averaged over time, mean sea level. These could be routinely and remotely measured at a cost that would allow unprecedented numbers of systems to be deployed around the world by research departments of all sizes and levels of funding. A second follow-on project is currently underway to develop the concept further and produce a working prototype system using a Raspberry Pi as the data logger and potentially also to conduct the real-time processing required to extract the sea level signals.\n\nThis talk will describe the background to this concept of using GPS signals for this purpose, and the early results from our test site in Sligo Bay in the Republic of Ireland.\n\nThe speaker suggested this session is suitable for new programmers.\nThe speaker suggested this session is suitable for teachers.\nThe speaker suggested this session is suitable for data scientists.",
  "duration": 1833,
  "language": "eng",
  "recorded": "2018-09-18",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/AeScwg-nZk4/maxresdefault.jpg",
  "title": "Low Cost GNSS Tide & Sea Level Measurements   LoCTIPS",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AeScwg-nZk4"
    }
  ]
}
