{
  "copyright_text": null,
  "description": "Learn how to scale Flask APIs and make sense of the data. You’ve got a\nFlask, Django, or other API. How are people using it? Is anything going\nwrong? How does it perform? These questions become increasingly hard to\nanswer once manually ``tail``\\ ing your log files becomes impractical.\n\nThis talk will describe how to effectively answer these questions\nthrough a mix of team process, tools, and logging techniques. I’ll\ndemonstrate a suite of tools we use to quickly visualize insights across\ndozens of API endpoints and billions of requests. I’ll show logging\ntechniques to more consistently store, organize, and process the right\ndata to make sense of it all. I’ll talk about the processes we’ve put in\nplace to routinely revisit these questions and quickly alert when things\ngo awry. Finally, despite all the pretty graphs I’ll show you, I’ll\ndiscuss how at the end of the day it is the team and cultural aspects\nthat keep any API in line and growing.\n\nThese stories, best practices, and advice come from my experience\nbuilding and scaling the Nylas APIs. Our APIs allow developers to GET,\nPOST and PUT email threads, calendar events, contacts, and any other\nitem you’d find in an Exchange, GSuite, or IMAP mailbox. Hundreds of\nthousands of mailboxes later, and over a hundred million requests a day,\nmaking sense of what’s going on in the system at any given time present\nchallenges I’m excited to share.\n",
  "duration": 1575,
  "language": "eng",
  "recorded": "2018-09-16",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [
    "Evan Morikawa"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/lMPXC2Fl1cw/maxresdefault.jpg",
  "title": "Making Sense of Flask APIs A Billion Requests at a Time",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lMPXC2Fl1cw"
    }
  ]
}
