{
  "copyright_text": null,
  "description": "Using Python to Takle Engineering Problems\n\nRayleigh waves are a type of surface wave that can be generated from a\nnumber of sources such as earthquakes, construction activities, and\ntransient train loading. When considering transient train loads,\nRayleigh Waves cause displacements of the track and the material below\nit when the train speed approaches the Rayleigh Wave Velocity of the\nsoil, resulting in excessive vibration. Therefore, a stiff layer under\nthe rail track needs to be constructed to accommodate the increased\nspeed. The shear velocity occurring from existing seismic tests is used\nas an input alongside the in-situ soil properties to calculate the\nRayleigh wave dispersion curve-Rayleigh wave velocity over frequency.\nThis data is used in strategic decision making to identify the thickness\nof the competent layer while maximising the speed and minimising the\nvolume of the imported competent material. This presentation aims to\nhighlight the data analysis challenges in geotechnical engineering,\nwhere python is not predominantly used for data analysis. The\nimplementation of numpy to tackle the equations for calculating the\nRayleigh wave dispersion curve followed by the implementation of pandas\nto create dataframes that are agile and easy to manipulate will be\ndiscussed initially. As we have to analyse data from many datapoints, it\nis essential that we create an agile form of database, or an\ninput-output procedure which remains constant. Data querying can then be\nconducted in a way such that engineers without programming knowledge can\nextract information-provided that the right question is asked. The\nimportance of the ‘right question’ in database querying will be\nhighlighted as there is a need to ensure clear communication between the\ndeveloper and other engineering disciplines. The use of jupyter to\ncreate a user interface for such data analysis will be demonstrated.\nFinally, the lessons learnt from communicating the querying/calculative\nlimitations to third parties will be presented.",
  "duration": 1420,
  "language": "eng",
  "recorded": "2018-09-16",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [
    "Dani Papamaximou"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/APSI_BDwJnQ/maxresdefault.jpg",
  "title": "Surface Wave Propagation Analysis",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=APSI_BDwJnQ"
    }
  ]
}
