{
  "copyright_text": null,
  "description": "A historical look at the Cambridge Structural Database – The World’s Repository of Organic Chemical Structures\n\n| Abstract:\n| Some notable points looking back along the timeline of database\n  technology:\n| - 1995 - The first version of MySQL released.\n| - 1987 - SQL became a standard of the International Organization for\n  Standardization (ISO).\n| - 1986 - SQL became a standard of the American National Standards\n  Institute (ANSI).\n| - 1983 - Andreas Reuter and Theo Härder coined the acronym ACID.\n| - 1974 - The first prototype version of the INGRES relational DBMS\n  released.\n| - 1971 - The first microprocessor launched - the Intel 4004.\n| - 1970 - The relational model of data was proposed by E.F. Codd.\n| - 1967 - Introduction of the DEC PDP-10 computer.\n| - 1965 - Compilation of the Cambridge Structural Database (CSD) began.\n\nThe Cambridge Structural Database (CSD) was initiated as response to an\n“information explosion” with aims including “the compilation of a\nnumerical database relating to organocarbon crystal structures”. Five\ndecades later, this database is still curated and widely distributed\nwithin the scientific community. The CSD is probably the oldest\nnumerical database actively maintained and used today.\n\nIn 1966, the database filled one volume of a printed book. In 1991, the\ndatabase used 196Mbytes. Today, a SQLite version of the database uses\n6.4Gbytes. Along the way, the CCDC has driven many computational and\nscientific advances. E.g., the first practical 3D chemical search system\nwas developed by the CCDC. Learn about past innovations and technical\nfoundations\n\nThat is all very interesting, but what does that have to do with Python?\nThe CSD Python API is a mechanism for accessing the data - alongside a\nwide range of molecular modelling and cheminformatic algorithms. This\nAPI is gaining rapid adoption in both academic and industrial chemistry\ncommunities. Learn how we can better serve our users thanks to Python.",
  "duration": 1578,
  "language": "eng",
  "recorded": "2018-09-17",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [
    "Stewart Adcock"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/R-6n-WGMOU8/maxresdefault.jpg",
  "title": "The story of a 52 year-old database",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=R-6n-WGMOU8"
    }
  ]
}
