{
  "copyright_text": null,
  "description": "A historical look at the Cambridge Structural Database – The World’s Repository of Organic Chemical Structures\n\nStewart Adcock\n\nMonday 17th, 11:30 (Room D)\nA talk (25 minutes)\nAbstract:\nSome notable points looking back along the timeline of database technology:\n- 1995 - The first version of MySQL released.\n- 1987 - SQL became a standard of the International Organization for Standardization (ISO).\n- 1986 - SQL became a standard of the American National Standards Institute (ANSI).\n- 1983 - Andreas Reuter and Theo Härder coined the acronym ACID.\n- 1974 - The first prototype version of the INGRES relational DBMS released.\n- 1971 - The first microprocessor launched - the Intel 4004.\n- 1970 - The relational model of data was proposed by E.F. Codd.\n- 1967 - Introduction of the DEC PDP-10 computer.\n- 1965 - Compilation of the Cambridge Structural Database (CSD) began.\n\nThe Cambridge Structural Database (CSD) was initiated as response to an “information explosion” with aims including “the compilation of a numerical database relating to organocarbon crystal structures”. Five decades later, this database is still curated and widely distributed within the scientific community. The CSD is probably the oldest numerical database actively maintained and used today.\n\nIn 1966, the database filled one volume of a printed book. In 1991, the database used 196Mbytes. Today, a SQLite version of the database uses 6.4Gbytes. Along the way, the CCDC has driven many computational and scientific advances. E.g., the first practical 3D chemical search system was developed by the CCDC. Learn about past innovations and technical foundations\n\nThat is all very interesting, but what does that have to do with Python? The CSD Python API is a mechanism for accessing the data - alongside a wide range of molecular modelling and cheminformatic algorithms. This API is gaining rapid adoption in both academic and industrial chemistry communities. Learn how we can better serve our users thanks to Python.\n\nThe speaker suggested this session is suitable for new programmers.\nThe speaker suggested this session is suitable for data scientists.",
  "duration": 1578,
  "language": "eng",
  "recorded": "2018-09-18",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/R-6n-WGMOU8/maxresdefault.jpg",
  "title": "The story of a 52 year old database",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=R-6n-WGMOU8"
    }
  ]
}
