{
  "copyright_text": null,
  "description": "Lightning Talks\n.. PyCon UK 2018\n  \nAssembly Room 2018-09-16 17:30-18:30\n  \nWhat are lightning talks?\n\nA lightning talk is a short talk on any subject that the speaker thinks will be of interest to the conference.\n\nWe run a session at the end of each day where the talks are at most five minutes long. After five minutes, the microphone is cut and the speaker has to leave the stage whether they've finished or not!\n\nThe sessions are chaired to ensure that everything runs to time – normally by asking the audience to begin clapping using two fingers from each hand when the speaker has 20 seconds remaining.\n\nLightning talks are often entertaining and, for many, the highlight of the conference. If this is your first PyCon UK, it's a great way to start your conference speaking career!\n\nSounds good. How do I give a lightning talk?\n\nAt the help desk each morning, you'll find two coloured buckets and some index cards. If you would like to give a lightning talk that day:\n\nTake an index card\nWrite on it your name and the title of your talk\nDrop it in the relevant bucket:\n\nGreen - if you've never spoken at a conference before\nYellow - everyone else\n\n    \n    \n\nThe buckets close at 13:30 and, shortly afterwards, we will select cards from each bucket, and post them on the flipchart at reception.\n\nYou may submit as many proposals as you like, but you may only give one lightning talk at the conference.\n\nThe buckets will be emptied each evening and start the day fresh and empty the following morning. If you want to re-submit a proposal, you will need to complete a new card and drop it in the bucket once again.\n\nGood luck!",
  "duration": 3713,
  "language": "eng",
  "recorded": "2018-09-18",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "http://2018.pyconuk.org/schedule/"
    }
  ],
  "speakers": [
    "Various Speakers"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/F5jSUJVymXk/maxresdefault.jpg",
  "title": "Tuesday Lightning Talks",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=F5jSUJVymXk"
    }
  ]
}
