{"whiteboard": "needs editing", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon AU 2015", "speakers": ["Tennessee Leeuwenburg"], "title": "Applied Data Science", "quality_notes": "", "video_flv_length": null, "recorded": "2015-08-04", "video_mp4_length": null, "description": "Ever tried to get into data science or machine learning, but struggled with getting your tech stack working, or found the maths off-putting? Curious about the limits of what your laptop or desktop really are when it comes to Big Data and predictive analytics? Ever wondered if these tools were really accessible to a general developer?\r\n\r\nNote: Attendees should consider visiting the project URL for instruction to get set up ahead of time. The will allow more time for coding, although setup assistance will also be available on the day.\r\n\r\nThis tutorial will provide attendees with a walkthrough on getting set up for this work, and an overview of a good tech stack / software ecosystem for beginning work. We'll cover some of the standard data sets in machine learning, and how to apply interesting algorithms. Random Forests and neural networks will be included, but with a minimum of fuss and jargon. There will be a focus on the application of technology, with only the most relevant theoretical aspects included. This is about actually getting things done.\r\n\r\nThis tutorial would be suitable for intermediate developers of any background, or experienced developers who would like an introduction to data science that gets to the point fast. Prerequisites: the ability to install Python modules on your laptop, the ability to set up a new virtual environment, and an interest in applying new techniques.\r\n\r\nThe tutorial will include clear walkthroughs, as well as allowing adequate time for discussion and individual learning. Please contact Tennessee via email ahead of time if you would like to get a head start on setting up your environment -- this may help you get more out of the tutorial. \n\n", "video_mp4_url": null, "tags": [], "copyright_text": "creativeCommon", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=LFy01OYCoEY", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/LFy01OYCoEY/hqdefault.jpg", "video_flv_url": null}