{
  "id": 3981,
  "category": "PyCon AU 2015",
  "slug": "are-they-ready-a-quick-review-of-graph-databases",
  "title": "Are they ready? A quick review of graph databases and Python",
  "alias": "video/3981/are-they-ready-a-quick-review-of-graph-databases",
  "summary": "",
  "description": "Graph databases store, retrieve and process data that takes the form of\na graph: a network of nodes and the relationships between them. As one\nof the fastest growing database models over the past two years, they\npromise a number of fantastic outcomes including increased performance,\nfaster development, and cleaner code. Vendors also boast of large\ncorporate deployments throughout the US and Europe.\n\nSo, are graph databases as good as they sound? How can we use them with\nPython?\n\nThis talk will review a couple of the most popular graph databases\nincluding Neo4J, Titan and OrientDB. The focus will be on interacting\nwith each database as Pythonically as possible – using Python APIs as\nmuch as possible. Along the way it will give an idea of ease of use,\nspeed, documentation quality and stability, as well as any other\nchallenges or tricks that found along the way. It isn’t a tutorial –\nthere’s not enough time, and those exist elsewhere – but instead more of\nan introduction to what is out there and what you can do with it.\n\nAt the end of the talk, you will have an idea of what it takes to get\nstarted with Graph Databases in Python, and also an idea of which\ntoolset you want to use. You’ll also have an idea of the sorts of\nproblems which map well to graph databases, and which ones may be better\nsuited to other storage and processing methods.\n\nYou won’t need to have a background in graphs or even a lot of Python\nexperience to get through this talk. However, it’s always good to have a\npotential application in mind.\n",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "creativeCommon",
  "thumbnail_url": "https://i.ytimg.com/vi/Wnj31Nejstc/hqdefault.jpg",
  "duration": null,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=Wnj31Nejstc",
      "type": "youtube",
      "length": 0
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=Wnj31Nejstc",
  "tags": [],
  "speakers": [
    "Nic Crouch"
  ],
  "recorded": "2015-08-29"
}