{
  "id": 3970, 
  "category": "PyCon AU 2015", 
  "slug": "fast-beautiful-and-easy-bayesian-modelling-can", 
  "title": "Fast, beautiful and easy Bayesian modelling: Can you have it all?", 
  "summary": "", 
  "description": "Bayesian models are often more useful than classical statistical models when dealing with data concerning rare events in small populations. For example, if you are looking at the number of cancer diagnoses in a local government area, Bayesian models allow you to combine the individual and population level data to produce more reliable estimates. \r\n\r\nFitting these models can be both complex and computationally expensive, so we need it to be fast. Some of the datasets we deal with are extremely big, and the need for both tweaking and regular update cycles means we need to re-run the models frequently.\r\n\r\nBut beauty is also crucial. We need the package to be easy to code and describe, so that the statisticians and scientists we work with can build, maintain and understand their own models without needing to refer to programmers. We don’t want a statistical black box. \r\n\r\nFinally, we need it to be easy. Easy to fit into our systems; technology-agnostic so we can change systems; and automatable so that the regular work of updating models with new data can happen ‘hands off’.  \r\n\r\nThere are a number of Bayesian modelling packages available, but how do you know which one to use? This talk will take you through the positives and negatives of the major packages, focusing on the specifics of my work in health statistics, as well as providing a general overview of what these packages can do. \r\n\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "creativeCommon", 
  "thumbnail_url": "https://i.ytimg.com/vi/N6kVJTKT6H8/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=N6kVJTKT6H8", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=N6kVJTKT6H8", 
  "tags": [], 
  "speakers": [
    "Rhydwyn McGuire"
  ], 
  "recorded": "2015-08-04"
}