{"whiteboard": "needs editing", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon AU 2015", "speakers": ["Joshua Hesketh"], "title": "Guarding the gate with Zuul", "quality_notes": "", "video_flv_length": null, "recorded": "2015-08-04", "video_mp4_length": null, "description": "Zuul is a program that is used to gate the source code repositories of a project so that changes are only merged if they pass tests.\r\n\r\nBy gating we mean a more proactive continuous integration suite whereby tests must pass in order to merge (rather than a traditional CI that just gives a nightly status of the master branch). This means every commit is tested both during review time and before it merges - in case the repositories have changed in the mean time.\r\n\r\nThe result of using a gating system like zuul is that it's much harder to break trunk and your nightly builds should nearly always work.\r\n\r\nZuul can be configured to react to events and run various jobs with success or failure results depending on the scenario. Currently Zuul is only integrated with the gerrit code review platform but there are discussions about extending it to github.\r\n\r\nOne unique and powerful feature in Zuul is its ability to run tests in a predictive manner across multiple programs. Zuul predicts what multiple repositories will look like by the time the present job is finished and arranges the tests to be performed in that order. This stops race conditions when merging code in one repository that depends on code in another repository.\r\n\r\nZuul can manage thousands of jobs across hundreds of projects as evident by being the gate keeper for OpenStack.\r\n\r\nIn this talk we will look at what Zuul is, how to configure it and the internals of how it works.\n\n", "video_mp4_url": null, "tags": [], "copyright_text": "creativeCommon", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=HlpJhqgGL34", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/HlpJhqgGL34/hqdefault.jpg", "video_flv_url": null}