{
  "id": 3998, 
  "category": "PyCon AU 2015", 
  "slug": "inviting-code", 
  "title": "Inviting Code", 
  "summary": "", 
  "description": "Projects tend to grow, expand and reshape as they progress, this can lead to; high code maintenance, legacy code and feature addition fatigue. Implementing a well-documented and malleable software architecture is a major step in addressing these associated time sinks. This talk will discuss viable software architecture approaches – while demonstrating core python modules, concepts and design patterns from a big data perspective.\r\n\r\nMany projects welcome code addition from third party developers, however a well thought out software architecture should not be modified without; review, testing, possible cascading code and documentation changes. To remove the additional complexity of reviewing and handling third party code, designing and offering secure plugin infrastructure can allow for outside additions without the overhead. \r\n\r\nA big data visualisation python project utilised by Oxford and Cambridge universities will be used in code demonstrations to show the direct use of a project built with architecture design in mind, and a multi-level dynamic plugin infrastructure. Attendees will be provided with a clear understanding of how function documentation techniques (PEP-3107 & PEP-0484) can be utilised for class clarity and how to (re)design a code base to allow for integration of third party code, while providing a concise framework for code inclusion. \r\n\r\nAreas covered in this talk include\r\n\r\n• Python 3.4 focused\r\n• Project architecture design\r\n• Abstract classes\r\n• Plugin frameworks\r\n• Documentation frameworks\r\n• Type hinting & Function annotations  \r\n• Class method decorators\r\n• Code validation\r\n• Image manipulation\r\n\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "creativeCommon", 
  "thumbnail_url": "https://i.ytimg.com/vi/mByG_51ZWiQ/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=mByG_51ZWiQ", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=mByG_51ZWiQ", 
  "tags": [], 
  "speakers": [
    "Capel Brunker"
  ], 
  "recorded": "2015-08-04"
}