{"whiteboard": "needs editing", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon AU 2015", "speakers": ["Rhys Elsmore"], "title": "Just Use Postgres.", "quality_notes": "", "video_flv_length": null, "recorded": "2015-08-04", "video_mp4_length": null, "description": "Making use of the latest database for your data is considered trendy and edgy, with vendors promising unrealistic expectations when it comes to capabilities of these systems. Furthermore, communities such as Hacker News enforce the idea that you must use the latest and coolest technology in order to be a ‘rockstar’ engineer.\r\n\r\nMarketing buzzwords like ‘real-time’, ‘distributed’, ‘high-availability’, and ‘schemaless’ impact our design decisions, and the expectation for applications to be ‘scalable’ often forces developers to prematurely introduce complexity and anti-patterns into their applications by making use of these untested and immature data stores.\r\n\r\nForget about adding the latest trendy data store into your stack; just use Postgres.\r\n\r\nThis talk will explore the capabilities of Postgres 9.4, and various use-cases where you can involve it as your primary datastore. I will cover some of the projects at Heroku where we have used Postgres, such as:\r\n\r\n- Quickly querying over 300M records to get a list of all users on a particular server at a particular point in time.\r\n- Providing almost real-time aggregations of all Heroku customer’s usage.\r\n- Joining 3 different tables on 3 different database servers without any external code.\r\n- Creating a ‘social graph’ of all of Heroku’s users based on commonly used IP addresses.\r\n- Ensuring that coupon codes are used only once, preventing attackers from exploiting ‘race condition’ bugs.\r\n\r\n In particular, I will focus on topics such as:\r\n\r\n- Storing, indexing, and querying schemaless data.\r\n- Materialized Views.\r\n- NOTIFY/LISTEN.\r\n- Storing and querying time-series data.\r\n- Updatable views.\r\n- Foreign tables.\r\n- Recursive views.\r\n- Stored functions.\r\n- Range Types\r\n- Partitioning and Sharding data.\r\n\r\nEach topic will include links to sample schemas and iPython notebooks so you can take these examples home with you.\n\n", "video_mp4_url": null, "tags": [], "copyright_text": "creativeCommon", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=UgcC_bY4rPg", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/UgcC_bY4rPg/hqdefault.jpg", "video_flv_url": null}