{
  "id": 4059,
  "category": "PyCon AU 2015",
  "slug": "keynote-designed-for-education-a-python-solutio",
  "title": "Keynote: Designed for education: a Python solution",
  "alias": "video/4059/keynote-designed-for-education-a-python-solutio",
  "summary": "",
  "description": "The problem of introducing children to programming and computer science\nhas seen growing attention in the past few years. Initiatives like\nRaspberry Pi, Code Club, code.org, (and many more) have been created to\nhelp solve this problem. With the introduction of a national computing\ncurriculum in the UK, teachers have been searching for a text based\nprogramming language to help teach computational thinking as a follow on\nfrom visual languages like Scratch.\n\nThe educational community has been served well by Python, benefiting\nfrom its straight-forward syntax, large selection of libraries, and\nsupportive community. Education-focused summits are now a major part of\nmost major Python Conferences. Assistance in terms of documentation and\ntraining is invaluable, but perhaps there are technical means of\nimproving the experience of those using Python in education. Clearly the\nneeds of teachers and their students are different to those of the\nseasoned programmer. Children are unlikely to come to their teachers\nwith frustrations about the Global Interpreter Lock! But issues such as\nusability of IDEs or comprehensibility of error messages are of utmost\nimportance.\n\nIn this keynote, Carrie Anne will discuss existing barriers to Python\nbecoming the premier language of choice for teaching computer science,\nand how learning Python could be helped immensely through tooling and\nfurther support from the Python developer community.\n",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "creativeCommon",
  "thumbnail_url": "https://i.ytimg.com/vi/gaFk0Sya_HI/hqdefault.jpg",
  "duration": null,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=gaFk0Sya_HI",
      "type": "youtube",
      "length": 0
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=gaFk0Sya_HI",
  "tags": [],
  "speakers": [
    "Carrie Anne Philbin"
  ],
  "recorded": "2015-08-03"
}