{
  "id": 3956, 
  "category": "PyCon AU 2015", 
  "slug": "mangle-you-a-python-interpreter-for-new-behaviou", 
  "title": "¡Mangle You A Python Interpreter for New Behaviour!", 
  "summary": "", 
  "description": "What happens when you feel some syntax or behaviour is missing from Python? You could fork the interpreter, but then nobody else could run your programs. Instead, you could implement the new behaviour as a Python module to be imported, and distribute it with your programs.\n\nFollowing hot on the tracks of previous Pycon-AU talks like \"Don't Do This\" (2013) and the \"ugly hacks\" bit of \"Here be dragons: some elegant and ugly hacks in CPython\" (2014), this presentation will grant some of the requests you never dared to make:\n\n- You'd like for PEP 336, Make None Callable to have succeeded? You can make your own None()! Easy in CPython with CTypes!\n\n- You'd like to have the \"?.\" operator available for safe attribute access? Just add the syntax to pypy, then use a source codec hack to rewrite it into a legal Python 2.7 function. Too easy!\n\n- Your reaction to all of this is “please make it stop”? The talk will finish by discussing why having extensible syntax as a standard Python feature might even be a good idea! It is in other languages!\n\nThis talk is for intermediate to advanced Python users, and for beginning Python implementors.\n\nSlides: http://hiperactivo.com/talks/pyconau15/mangling_python/\n\nRepos:\n\n  - quiet_None: https://bitbucket.org/candeira/quiet_none/\n\n  - question_dot: https://bitbucket.org/candeira/question_dot/\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "creativeCommon", 
  "thumbnail_url": "https://i.ytimg.com/vi/9_LnOTFDNUk/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=9_LnOTFDNUk", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=9_LnOTFDNUk", 
  "tags": [], 
  "speakers": [
    "Javier Candeira"
  ], 
  "recorded": "2015-08-16"
}