{
  "id": 3959, 
  "category": "PyCon AU 2015", 
  "slug": "spreadsheet-driven-meta-programming-for-python", 
  "title": "Spreadsheet-Driven Meta-Programming for Python", 
  "summary": "", 
  "description": "We've all had those very detail-oriented clients who are able to specify their needs very neatly, often by means of exhaustive spreadsheets. Wouldn't it be nice if we could turn these spreadsheets straight into Python code?\r\n\r\nIn this tutorial we'll use two sets of meta-programming techniques to derive Python code out of semi-formal descriptions: first, to build Django models requiring very detailed validation supplied by the client in a spreadsheet; second, to build a Python API for a hardware device, the description of which is maintained by the engineers in a spreadsheet.\r\n\r\nFor the Pycon attendance, this tutorial has both business value and technical value:\r\n\r\nBusiness value because spreadsheet-driven metaprogramming allows developers to:\r\n\r\n- respond to changes very fast by re-rendering their Python code from the modified spreadsheet descriptions.\r\n- avoid a certain class of human errors unavoidable when transcribing the requirements by hand.\r\n- save time which can be employed in other areas of the project, or with other clients.\r\n- clarify ambiguous specifications by making explicit all programmer's assumptions into the code generator.\r\n\r\nTechnical value because we'll be talking about:\r\n\r\n- api design,\r\n- Django modeling and validation,\r\n- consuming spreadsheets via csv dictreaders and elbow grease,\r\n- writing partially-applied functions via custom classes with a __call__ method,\r\n- implementing fluent apis with table-driven __getattr__ methods,\r\n- implementing iterators with __iter__ and __next__,\r\n- papering over some differences between Python 2 and Python 3 syntax,\r\n- and much, much more.\r\n\r\nWe'll be doing all of it in a hands-on manner, without getting distracted by abstract discussions of Python syntax. There will be some discussions of Python syntax, but they won't be abstract. We'll always have a goal in sight.\r\n\r\nLevel:\r\n\r\nIntermediate. You'll learn some advanced techniques, but all you need to really know in order to follow this tutorial is how lists, dictionaries, iteration and reading files work in Python. \r\n\r\nRequirements:\r\n\r\n- Attendees are expected to know basic Python (see above, under \"Level\").\r\n- A laptop and some knowledge of git will be useful for those wanting to follow along, but is not required. You can get a lot out of this tutorial just by watching and paying attention.\r\n\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "creativeCommon", 
  "thumbnail_url": "https://i.ytimg.com/vi/DmLHqOvbG9M/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=DmLHqOvbG9M", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=DmLHqOvbG9M", 
  "tags": [], 
  "speakers": [
    "Javier Candeira"
  ], 
  "recorded": "2015-08-04"
}