{
  "id": 3997, 
  "category": "PyCon AU 2015", 
  "slug": "writing-python-for-kids", 
  "title": "Writing Python For Kids", 
  "summary": "", 
  "description": "Thinking of writing a book? We are in the midst of a boom in interest in amateur programming, particularly among children. Brendan spent the most recent summer past using his blog python4kids.brendanscott.com as inspiration for a new project based instructional book, Python for Kids for Dummies (US release by Wiley this northern summer). This talk will provide an overview of the development cycle for the book both in respect of the book's content and the process involved in creating that content and shepherding it through the publisher's internal processes. \r\nTopics to be covered include engaging and negotiating with the publisher, the different functions provided by a publisher, project management of the writing, interacting with editorial and technical reviewers, integrating with an existing \"house style\", art requirements and cross platform issues. In relation to content, Brendan will discuss the thought that went into targeting the material to a kids audience and the challenges involved in structuring a narrative which wends its way through each of the concepts that need to be introduced and providing a motivation for each of them. This includes how the content was structured, what concepts were included and what were passed over, trying to balance material to maintain interest without overwhelming the readers, the tension between explanation and demonstration and how to remain mindful of the audience's limitations. The highs, the lows, the triumphs (getting it done!) and tragedies (whole chapters consigned to the pyre), it's all here. \r\n\r\nThe book on Amazon:\r\nhttp://www.amazon.com/Python-For-Kids-Dummies/dp/1119093104\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "creativeCommon", 
  "thumbnail_url": "https://i.ytimg.com/vi/lWyJ_HXGsm0/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=lWyJ_HXGsm0", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=lWyJ_HXGsm0", 
  "tags": [], 
  "speakers": [
    "Brendan Scott"
  ], 
  "recorded": "2015-08-04"
}