{
  "description": "Day 1, 13:50–15:20\n\nIn data visualization, static plots provide the audiences quick grasp on the data. While interactive plots can provide users more information on interested samples, while audiences have to touch the data for specific samples if only static plots are provided. At present, there are some interactive graphing library in Python, Among them, \"Plotly\" is most popular and strongly supported by community.\n\"Plotly\" company also release \"Dash\" package that can build web-based online plots in pure Python. The needed technique of UI and web are covered by Dash, so you can focus on data manipulation and visualization. It is easy for data scientist to share their analysis on web interface over whole group by Dash. This tutorial will introduce basic usage of Plotly, then, the procedures of building the apps by Dash are described as following layout by \"html\" and \"core\" components, callback to make your apps more interactive, and distributing your apps to Heroku.\n\nSlides: https://docs.google.com/presentation/d/1QBCLbgaJKH27CqP-6NlwrnCjGk1J3YuLk4GOvOe8lpI/edit?usp=sharing\n\nSpeaker: 黃坤賢\n\n目前從事粒子物理實驗研究，在日本和台灣之間飛來飛去。喜歡python,C++,shell script等程式語言，並用python完成了好累的博士論文。目前栽進了用機器學習來完成實驗數據分析的坑洞，準備挖另一個平行運算的坑掉下去。\n專長是睡過頭，未來方向是尋找一個可叫得醒我的鬧鐘。",
  "recorded": "2020-09-05",
  "speakers": [
    "黃坤賢"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/9WquGPG7j2k/hqdefault.jpg",
  "title": "Build an interactive plot website using Plotly/Dash – PyCon Taiwan 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9WquGPG7j2k"
    }
  ]
}
