{
  "description": "Day 1, R3 16:15–16:30\n\nThe session begins with a discussion on homomorphic properties of cryptographic algorithms such as RSA, Elgamal, Paillier, Elliptic Curve, and Gentry’s Cryptosystems with the demonstration. The session discusses techniques to reduce computational complexity. This session also discusses a case study on how machine learning techniques can be applied to encrypted data for secure computation and protecting the machine learning model. The talk will include the demonstration of the Python implementation of the RSA algorithm. To demonstrate the techniques to reduce complexity, we will perform multiplication over large random numbers using common * operator, multiplication using FFT, and Karatsuba algorithm. SciPy package has an in-built implementation for FFT. To demonstrate the implementation of secure machine learning model we used PyBRAIN and cryptography packages of python.\n\nSlides not uploaded by the speaker.\n\nSpeaker: Gajendra Deshpande\n\nMr. Gajendra Deshpande holds a masters degree in Computer Science and Engineering and working as Assistant Professor at the Department of Computer Science and Engineering, KLS Gogte Institute of Technology, Belagavi, Karnataka, India.  He has a teaching experience of 12 years and a Linux and Network Administration experience of one year. Under his mentor-ship teams have won Smart India Hackathon 2018 and Smart India Hackathon 2019. He is the Technical Director for Sestoauto Networks Pvt. Ltd. and Founder of Thingsvalley. His areas of Interest include Programming, Web Designing, Cyber Security, Artificial Intelligence, Machine Learning, Brain-Computer Interface, Internet of Things, and Virtual Reality. He has presented papers at NIT Goa, Scipy India 2017 IIT Bombay, JuliaCon 2018 London, Scipy India 2018 IIT Bombay, Scipy 2019 USA, and PyCon FR 2019, Bordeaux, France.",
  "language": "eng",
  "recorded": "2020-09-05",
  "speakers": [
    "Gajendra Deshpande"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/AFPnHqthjGs/hqdefault.jpg",
  "title": "Computation Techniques for Encrypted Data using Python – PyCon Taiwan 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AFPnHqthjGs"
    }
  ]
}
