{
  "description": "Day 1, 16:40–17:40\n\nThe world’s response to COVID-19 has resulted in the most rapid transformation of work styles and teaching methods. Many world-renowned companies like Google and Facebook had made announcements that WFH (Work From Home) will be extended until at least 2021.\nIn February 2020, National Cheng Kung University announced that courses with more than a hundred students enrolled should be moved into online courses. Many professors have to prepare online learning materials in a short time frame. Most of them made teaching videos and used moodle in the school as support for student learning.\nMy class, The Basics of Game-based Machine Learning, is an undergraduate elective course. I prepared to move it online for students because of the pandemic. I heard that online classes are not effective in educating students, so my graduate students and I, along with an online learning expert, think together on how to get through this semester of this class without too much effect on students’ learnings.\nBesides pre-recorded teaching videos, we also use several online applications and social media, build collaborative FAQs for all questions, and establish an online competition platform that allows students to upload programming tasks for tests.  The competition for all uploaded programming tasks will be significant evaluation factors and be broadcast live on the platform.\nIn my keynote section, I will give details on how the class is conducted, the use of the platform, and the future prospects of it. As a teacher, adapting trends and changes of students and the world in my way of teachings and thinking is a necessary step to maintain the competitive strength of Taiwan.\n\nSlides not uploaded by the speaker.\n\nSpeaker: Wen Yu Su\n\nMr. Wen-Yu Su is a current Professor of Computer Science at National Cheng Kung University (NCKU), Taiwan. He holds a PhD and a Master’s degree in Electrical Engineering at New York University Tandon School of Engineering, and a Bachelor’s degree at NCKU. His prior experience includes being a postdoctoral researcher at Stanford University, an engineer in the Department of Information and Communication Technology at Industrial Technology Research Institute of Taiwan, and an Associate Professor at the Department of Computer Science and Information Engineering of Chung Hua University. Prior to 2011, Prof. Su focused on Digital Audio Signal Processing, Biomedical Signal Analysis, Image/Video Processor Design, Multi-Core Processor Design, Embedded Memory Management, and OpenESL. After 2012, he turned to focus on Audio Processing, Machine Learning, and Virtual Orchestra. Over the years, he has been working on improving students' practical ability.\nRecognizing the increasing importance of information technology and computer programming as well as reduced students' practical and inquiry skills, Prof. Su established the Program the World Association (PTWA) in 2013. Starting from Dongshih Township in Chiayi County, he led a team to teach disadvantaged students in rural elementary and secondary schools how to program in 2014. As of 2020, he has assisted more than 70 schools and non-profit organizations spanning 12 counties and cities, which benefits over 2,500 students and teachers. Over the years, courses have become more diverse. The teaching plan includes Train the Trainer, Seeing Hometown, Programming and Maker Courses, Self-propelled Car Contests, and Coding-X Programming for High School Students. To promote the progress of higher education, PTWA held more than 70 events each year and proactively participated in NCKU’s admissions for disadvantaged students, computer-based exams for special selection, online courses, and exam systems, etc. Although having been using donations to offer educational activities for many years is difficult, it is very gratifying to see children from disadvantaged families growing and developing.\nArtificial Intelligence is becoming increasingly important nowadays, but most courses lack hands-on practice to attract students’ interests. Thus, in 2018, Prof. Su invested in the development of courses and the online platform, ML Game, that use games to beat monsters, modeled after prestigious foreign schools. In 2020, the platform was completed, and courses were successfully launched in the Department of Computer Science and Information Engineering at NCKU. Many schools have approached the platform for promoting courses until now. The platform is also expected to cooperate with Microsoft Taiwan to promote courses in 2020 or 2021 and hold a national Machine Learning competition.\nIn addition to general academic works, Prof. Su also published books including \"Being Significant Other to Children\" and \"Teacher is a belated parent of children\" that record several years of counseling work for children from disadvantaged families in remote areas.",
  "recorded": "2020-09-05",
  "speakers": [
    "Wen Yu Su"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/wlKvSgOIjBA/hqdefault.jpg",
  "title": "Keynote: A New Era of Teaching - Starting from Online Machine Learning Platform  – PyCon Taiwan 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wlKvSgOIjBA"
    }
  ]
}
