{
  "description": "The Pattern: Machine Learning Natural Language Processing meets VR/AR\n[EuroPython 2021 - Interactive session - 2021-07-28 - Argument-Clinic [Interactive]]\n[Online]\n\nBy Alexander Mikhalev, Dvir Dukhan\n\nOpen-source project \"The Pattern\" is the platform to inspire collaboration for building modern natural language processing tools and techniques and making them practically useful for end-users. In this session, I will walk through creating 3 Machine Learning NLP pipelines and deploying them using Redis and Redis Modules: RedisGears, RedisGraph and RedisAI. \nThe first pipeline demonstrates how to use traditional NLP techniques, such as the Aho-Corasic algorithm to build a knowledge graph from medical literature using a medical thesaurus (UMLS).\nThe second pipeline demonstrates how to build and deploy BERT Question/Answering model and create API for text to speech interface. Leveraging Redis Cluster sharding and capturing Redis Gears \"keymiss\" event to trigger processing of BERT QA in RedisAI.\nThe third pipeline demonstrates how to deploy Google's T5 (text to text transfer transformers) to build summary of each article.\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 3398,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ZN2NS4_X1AE/sddefault.jpg?sqp=-oaymwEmCIAFEOAD8quKqQMa8AEB-AH-DoACuAiKAgwIABABGBkgNSh_MA8=&rs=AOn4CLAOM6M6b-O2tyEJhcVCxNGKFxbZSA",
  "title": "A. Mikhalev, D. Dukhan - The Pattern: Machine Learning Natural Language Processing meets VR/AR",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZN2NS4_X1AE"
    }
  ]
}
