{
  "description": "Introduction to Quantum Deep Learning\n[EuroPython 2021 - Talk - 2021-07-28 - Optiver]\n[Online]\n\nBy Abhilash Majumder\n\nIntroduction to Quantum Deep Learning\nAbstract\nThe aim of the lightning talk is to shed light into the field of Quantum computation in the field of Deep Learning. Qubits , which form the fundamental units of quantum computing can be used to create quantum variational circuits which can be placed over traditional deep learning networks to create hybrid quantum-deep learning models. These models not only rely on the gradient convergence properties of general backpropagation technique, but also on the final probabilistic states of the Qubits. Essentially there has been quite a development to optimize the gradient convergence of these hybrid models with the help of Fischer approximation and Natural Gradient Descent.The talk would focus on the importance of Quantum Variational Deep Learning Circuits and how they provide an advantage over traditional Autograd based Circuits. The application of Quantum Variational circuits in the field of Reinforcement Learning as well as NLP would be one of the main points of the talk. There has been sufficient development in the field of quantum computing and this talk aims to throw light on how to exploit the probabilistic states of Qubits to enhance deep learning models.\n\nTopics:\nIntroduction to Quantum Computing and Qubit system\nQuantum Variational Circuits\nCreating Hybrid Circuits (Classical-Quantum-Classical etc.)\nRealizing Performance of Hybrid Circuits\nApplications in the field of Quantum RL and Quantum NLP (research)\nDemocratizing adoption of Quantum Circuits over traditional deep learning circuits\nResources\nResources (slides, repositories) would be added in course of time.\nResources: https://drive.google.com/file/d/1gtCc8JViacFhlV3-XfKlGruh_OqI0ZIa/view?usp=sharing\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 2591,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://drive.google.com/file/d/1gtCc8JViacFhlV3-XfKlGruh_OqI0ZIa/view?usp=sharing",
      "url": "https://drive.google.com/file/d/1gtCc8JViacFhlV3-XfKlGruh_OqI0ZIa/view?usp=sharing"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/p5jOwsnGgwI/sddefault.jpg?sqp=-oaymwEmCIAFEOAD8quKqQMa8AEB-AH-DoACuAiKAgwIABABGBMgMSh_MA8=&rs=AOn4CLBbLsGK64asNdIBCYb-xLf2ioxTeA",
  "title": "Abhilash Majumder - Introduction to Quantum Deep Learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=p5jOwsnGgwI"
    }
  ]
}
