{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Production ML Monitoring: Outliers, Drift, Explainers & Statistical Performance\n[EuroPython 2021 - Talk - 2021-07-30 - Parrot [Data Science]]\n[Online]\n\nBy Alejandro Saucedo\n\nSession Description\n\nThe lifecycle of a machine learning model only begins once it's in production. In this talk we provide a practical deep dive on best practices, principles, patterns and techniques around production monitoring of machine learning models. We will cover standard microservice monitoring techniques applied into deployed machine learning models, as well as more advanced paradigms to monitor machine learning models with Python leveraging advanced monitoring concepts such as concept drift, outlier detector and explainability.\n\nWe'll dive into a hands on example, where we will train an image classification machine learning model from scratch using Tensorflow, deploy it, and introduce advanced monitoring components as architectural patterns with hands on examples. These monitoring techniques will include AI Explainers, Outlier Detectors, Concept Drift detectors and Adversarial Detectors. We will also be understanding high level architectural patterns that abstract these complex and advanced monitoring techniques into infrastructural components that will enable for scale, introducing the standardised interfaces required for us to enable monitoring across hundreds or thousands of heterogeneous machine learning models.\n\nBenefits to ecosystem\n\nThis talk will benefit the ecosystem by providing cross-functional knowledge, bringing together best practices from data scientists, software engineers and DevOps to tackle the challenge of machine learning monitoring at scale. During this talk we will shed light into best practices in the python ecosystem that can be adopted towards production machine learning, and we will provide a conceptual and practical hands on deep dive which will allow the community to both, tackle this issues and help further the discussion.\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 1541,
  "language": "eng",
  "recorded": "2020-07-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2021.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "europython-2021",
    "europython-online",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/n0bR0IArJDo/hqdefault.jpg",
  "title": "Alejandro Saucedo - Production ML Monitoring: Outliers, Drift, Explainers & Statistical Performance",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=n0bR0IArJDo"
    }
  ]
}
