{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Create beautiful and localized documentations and websites using MkDocs + Github\n[EuroPython 2021 - Talk - 2021-07-28 - Optiver]\n[Online]\n\nBy Alexys Jacob\n\nIn this talk I will walk you through all the steps needed to create and host feature rich and localized documentations (and even websites) using MkDocs + Github Pages.\n\nMkDocs is a famous Python powered project used to build documentation for a lot of projects. It's based on Markdown and supports Markdown extensions, custom themes and plugins to extend its rendering capabilities.\n\nBut it did not support building documentations in multiple languages and this was a wanted feature since 2014...\n\nAfter building documentations using MkDocs I decided to use it to switch my website and blog from Wordpress to a static page generator. I thus took on the challenge to contribute localization support to the MkDocs project because I needed it and it could benefit the community.\n\nAfter 2 months of work, 175 comments and 85 commits over 55 files I'm glad that my PR have been merged and is part of the MkDocs 1.2 version.\n\nI learned a lot along the way and I wanted to share my experience and a comprehensive walk through to get you ready and happy to use these new MkDocs features!\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 2374,
  "language": "eng",
  "recorded": "2020-07-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2021.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "europython-2021",
    "europython-online",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/0pYN6Z-t1-s/hqdefault.jpg",
  "title": "Alexys Jacob - Create beautiful and localized documentations and websites using MkDocs + Github",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0pYN6Z-t1-s"
    }
  ]
}
