{
  "description": "Finding Magic in Python\n[EuroPython 2021 - Talk - 2021-07-29 - Optiver]\n[Online]\n\nBy Anna-Lena Popkes\n\nThis talk was inspired by a personal project I worked on a while ago where I created my own magical universe in order to learn and apply Python concepts I hadn’t used before. Some of these concepts are included in the talk in a clear, precise and well-explained manner, including examples from the magical universe. The talk tells a story about how our passions can be used for learning to create something magical. \n\nLevel: The talk is suited both for beginners and intermediates. It might even contain some new knowledge for professionals. \n\nRequired knowledge: Only basic Python knowledge is required, all other concepts will be introduced and explained clearly in the talk. \n\nThe goal of the talk is two-fold:\na) the audience should understand that learning becomes much more fun and engaging when they look for a topic they are interested in and use it for learning.\nb) the presented Python features should become clear such that everyone is able to use them in future projects or come back to the talk if they need a well-explained reference.\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 2752,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/J4e4YCZ-jiQ/sddefault.jpg?sqp=-oaymwEmCIAFEOAD8quKqQMa8AEB-AH-DoACuAiKAgwIABABGBMgMSh_MA8=&rs=AOn4CLCTWkaXQFNSHN6iyP8LyzSA7Bj8_w",
  "title": "Anna-Lena Popkes - Finding Magic in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=J4e4YCZ-jiQ"
    }
  ]
}
