{
  "description": "Why you always had trouble understanding metaclasses\n[EuroPython 2021 - Talk - 2021-07-28 - Optiver]\n[Online]\n\nBy Antonis Christofides\n\n\"Smart people sometimes like to show off their smarts\n    by demonstrating their mental juggling abilities. After all,\n    if you can reliably remember that r is the lower-cased\n    version of the url with the host and scheme removed,\n    then you must clearly be very smart.\n\nOne difference between a smart programmer and a \nprofessional programmer is that the professional\nunderstands that clarity is king.\"\n\n— Robert C. Martin, \"Clean Code\", p.25\n\n\nRobert C. Martin says it’s hard to mentally translate one name (e.g. “r”) to another, and you can avoid it by using a better name (e.g. “urlPath”). But the problem is not just lost brainpower; it can also be misunderstanding. I’ve seen experienced Python programmers trying to teach Python “metaclasses” by explaining that a metaclass is the class of a class—which it isn’t. Metaclasses have a reputation of being difficult, but they actually become easy once you use the right term for them.\n\nBad terminology can be far more damaging than just confusing people. In April 2021, the European Commission published a proposal for an Artificial Intelligence Act, which they proudly advertise as the “first ever legal framework on AI”. It has provisions such as prohibiting \"an AI system that deploys subliminal techniques beyond a person’s consciousness in order to materially distort a person’s behaviour in a manner that causes or is likely to cause that person or another person physical or psychological harm.” What do they mean with \"AI system\"? Well, more or less... statistics.\n\nNone of this would happen if we didn't use misleading terms such as \"artificial intelligence\".\n\nWhile I do get to metaclasses, the main part of this talk is a tour of bad names. The talk is suitable for all audiences, beginners and advanced alike.\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 1476,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/A2dOFAXLb1E/sddefault.jpg?sqp=-oaymwEmCIAFEOAD8quKqQMa8AEB-AH-DoACuAiKAgwIABABGBMgMyh_MA8=&rs=AOn4CLDU_33_sgOeZXwClGHrTYQPuIgaTQ",
  "title": "Antonis Christofides - Why you always had trouble understanding metaclasses",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=A2dOFAXLb1E"
    }
  ]
}
