{
  "description": "Functional Programming inside OOP? It’s possible with Python\n[EuroPython 2021 - Talk - 2021-07-28 - Optiver]\n[Online]\n\nBy Carlos Villavicencio\n\nIt is well known that Python 3 is an object-oriented language. But if we look back at the roots of the language, functions as first-class objects were part of the initial design. Recently, functional programming has gained considerable popularity because it is robust, concise, and easier to test. That set of benefits are not only reserved for functional pure programming languages such as Haskell.\n\nIn this talk, I will run into a series of concepts, such as shared state, pure functions, side effects, and some other functional programming lingo that will help us understand how to use some not well-known Python features influenced by functional principles. We'll see how to implement our functional patterns in the code we write every day. In the end, you will see why this paradigm is relevant right now and why most of the existing languages and libraries actually evolved and keep going in that direction.\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 1597,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/43yNp4D2UKo/sddefault.jpg?sqp=-oaymwEmCIAFEOAD8quKqQMa8AEB-AH-DoACuAiKAgwIABABGBMgMSh_MA8=&rs=AOn4CLBW3hIRX3ngtM0WXqWykaQKu8xNsA",
  "title": "Carlos Villavicencio - Functional Programming inside OOP? It’s possible with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=43yNp4D2UKo"
    }
  ]
}
