{
  "description": "How Scientific Computing is advancing the world of Football\n[EuroPython 2021 - Talk - 2021-07-28 - Parrot [Data Science]]\n[Online]\n\nBy Chiin-Rui Tan, Sara Nunnington\n\nIn the ultra-competitive sporting world, the value of data and computing has been on the rise. When the difference between winning and losing, success and failure hinges on the smallest of margins, being able to calculate and implement optimal, timely decisions is literally game-changing, and potentially life-changing.\n\nFootball, or Soccer to others, as the most popular sport in the world, perfectly illustrates the importance of computational data-empowered decisions, both on and off the pitch. This talk, accessible to beginner Pythonistas with intermediate football knowledge, provides the audience with an overview of popular applications of Python Scientific Computing &amp; Data Science within the ecosystem of typically well-funded clubs, but emphasising the opportunities available to democratise such enabling tech more inclusively, and benefiting a more diverse base. Example takeaways are real-world use-cases involving spatio-temporal tracking &amp; event data, Computer Vision/video AI, tactical analysis, and player insights.\n\nThis talk ultimately supports the audience discovering this fast-growing domain and the role Python has and continues to play in advancing it globally.\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 1763,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/m1iYz1XYuQ8/sddefault.jpg?sqp=-oaymwEmCIAFEOAD8quKqQMa8AEB-AH-DoACuAiKAgwIABABGBMgMCh_MA8=&rs=AOn4CLCto4Cq_zyJLV0Fmq6AEs5begxr1A",
  "title": "Chiin-Rui Tan, Sara Nunnington - How Scientific Computing is advancing the world of Football",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=m1iYz1XYuQ8"
    }
  ]
}
