{
  "description": "Designing Functional Data Pipelines for Reproducibility and Maintainability\n[EuroPython 2021 - Talk - 2021-07-29 - Parrot [Data Science]]\n[Online]\n\nBy Chin Hwee Ong\n\nWhen building data pipelines at scale, it is crucial to design data pipelines that are reliable, scalable and extensible according to evolving business needs. Designing data pipelines for reproducibility and maintainability is a challenge, as testing and debugging across compute units (threads/cores/computes) are often complex and time-consuming due to dependencies and shared states at runtime. In this talk, Chin Hwee will be sharing about common challenges in designing reproducible and maintainable data pipelines at scale, and exploring the use of functional programming in Python to build scalable production-ready data pipelines that are designed for reproducibility and maintainability. Through analogies and realistic examples inspired by data pipeline designs in production environments, you will learn about:\n\n\nWhat is Functional Programming, and how it differs from other programming paradigms\nKey Principles of Functional Programming\nHow \"control flow\" is implemented in Functional Programming\nFunctional design patterns for data pipeline design in Python, and how they improve reproducibility and maintainability\nWhether it is possible to write a purely functional program in Python\n\n\nThis talk assumes basic understanding of building data pipelines with functions and classes/objects. While the main target audience are data scientists/engineers and developers building data-intensive applications, anyone with hands-on experience in imperative programming (including Python) would be able to understand the key concepts and use-cases in functional programming.\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 2018,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "Chin Hwee Ong"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/UY2WFPeEVN0/maxresdefault.jpg",
  "title": "Designing Functional Data Pipelines for Reproducibility and Maintainability",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UY2WFPeEVN0"
    }
  ]
}
