{
  "description": "Adventures in Real-time Python NoSQL-style\n[EuroPython 2021 - Talk - 2021-07-29 - Ni]\n[Online]\n\nBy Christoph Dr. Zimmermann\n\nThe presentation introduces RedisGears, a novel approach to Python programming on the server side of an open source real-time NoSQL database. \nTen years in the making, redis has achieved a significant following among the community concerned with ultra-fast processing of NoSQL-based data. \nWith the advent of modules a few years back, redis can be further extended to bridge the gap between the comprehensive set of data structures already offered by the server core and application-specific requirements such as graphs, timeseries data or full-text search capabilities. RedisGears is such a module. At its core, it offers a flexible infrastructure allowing the combination of different modules in addition to scheduling, mapping, filtering and other functionality to process data on the server side. In addition, it allows the execution of Python code on server side, yielding an ultra-performant and flexible approach to the implementation of business logic as part of an application code base. \n\nThe presentation is structured as follows: after a short introduction to redis, the main architecture of RedisGears is discussed in addition to an overview of how to use Python with RedisGears. Benchmark figures detail the performance benefits from such an approach. The focus of this presentation is not only the theory behind approach but rather hands-on, using code examples wherever possible. \n\nA basic understanding of Python is required for this presentation, basic redis exposure and general NoSQL know-how optional but beneficial.\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 2793,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/JjBpkDfXFUE/sddefault.jpg?sqp=-oaymwEmCIAFEOAD8quKqQMa8AEB-AHUBoAC4AOKAgwIABABGBMgLyh_MA8=&rs=AOn4CLDI-JOG_mXqMLe7iHR9jgDoM_aTwA",
  "title": "Christoph Dr. Zimmermann - Adventures in Real-time Python NoSQL-style",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JjBpkDfXFUE"
    }
  ]
}
