{
  "description": "Learn CPython by breaking it\n[EuroPython 2021 - Talk - 2021-07-30 - Optiver]\n[Online]\n\nBy Cristián Maureira-Fredes\n\nOne of the main reasons that stop people to write Python C extensions and even attempt to contribute to CPython is due to the fact that you need to know another programming language, C.                                                   \n\nWait, don't go! don't be scared by the fact that you will hear about C, this talks objective is not that! but only to learn the essential bits to get more comfortable around CPython.                                          \n\nBy understanding the internals, you will feel like the same as that time in your childhood when you took something apart, then re-assemble it again and it worked (if that was not the case, this will be your first time I promise).                                                                                         \n\nDuring this talk, you will go on a journey to understand how Python works, and which are the places you can look to understand the implementation of different Python details, from the whole interpretation process, until look what's lies under the module/types functions you use everyday. You will get the power to add new functionality to Python and even how to create your first C-based extension module.                                                         \n\nIf you are not familiar with C, don't worry, I will guide you every time some C code is shown, and if you know some C, then you will be able to sit back and relax during this ride.\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 1770,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "Cristián Maureira-Fredes"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/WThKZDUt_UM/sddefault.jpg?sqp=-oaymwEmCIAFEOAD8quKqQMa8AEB-AH-DoACuAiKAgwIABABGEIgVShlMA8=&rs=AOn4CLAO083QS4LvgOZqE25hVzuqqcDUMw",
  "title": "Learn CPython by breaking it",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WThKZDUt_UM"
    }
  ]
}
