{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Darts: Unifying time series forecasting models from ARIMA to Deep Learning\n[EuroPython 2021 - Talk - 2021-07-30 - Parrot [Data Science]]\n[Online]\n\nBy Gael Grosch, Francesco Lässig\n\nTime series are everywhere in science and business, and the ability to forecast them accurately and efficiently can provide decisive advantages. For much of its history, time series forecasting has mostly been relying on \"classical\" statistical methods such as ARIMA. These methods work very well in many cases, but they are not appropriate for capturing patterns in large quantities of data. Very recently, some deep learning techniques have been proposed as a way to build very advanced and accurate models from large quantities of time series data. \n\nIn our work, it has become very important to quickly develop and compare these new learning based methods against the more established statistical ones. Unfortunately there were no easy way to do that in Python and that is why we developed Darts.\n\nDarts is an open-source Python library that provides ready-to-use implementations of all sorts of forecasting models under a unified and simple API. It puts emphasis on reducing the experiment cycle duration and improving the ease of using, comparing and combining different models. \n\nIn this talk, we will give a tour of Darts and show how it can be used to obtain great forecasting results in few lines of code.\n\nGoal of the talk:\n\n\nIntroduce how one can tackle forecasting problems\nOverview of best practices from pre-processing to backtesting\nObtain great results quickly in few line of codes\n\n\nPre-requisites:\n\n\nBasic knowledge of Python and Pandas\nIntermediate knowledge of DS/ML\n\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 2673,
  "language": "eng",
  "recorded": "2020-07-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2021.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "europython-2021",
    "europython-online",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/thg10qDqpRE/hqdefault.jpg",
  "title": "G. Grosch, F. Lässig - Darts: Unifying time series forecasting models from ARIMA to Deep Learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=thg10qDqpRE"
    }
  ]
}
