{
  "description": "Build Your First Cyber Forensic Application using Python\n[EuroPython 2021 - Talk - 2021-07-29 - Ni]\n[Online]\n\nBy Gajendra Deshpande\n\nA recent study by CheckPoint Research has recorded over 1,50,000 cyber-attacks every week during the COVID-19 pandemic. There has been an increase of 30% in cyber-attacks compared to previous weeks. The pandemic has been the main reason for job loss and pay cuts of people and has led to an increase in cybercrimes. Examples of cyber-attacks include phishing, ransomware, fake news, fake medicine, extortion, and insider frauds. Cyber forensics is a field that deals with the investigation of digital crimes by analyzing, examining, identifying, and recovering digital evidence from electronic devices and producing them in the court of law. Python has a great collection of built-in modules for digital forensics tasks. The talk begins with an introduction to digital crimes, digital forensics, the process of investigation, and the collection of evidence. Next, I will cover the various python modules and built-in functions required to build your first cyber forensic application. The modules covered in the discussion are pyscreenshot, PIL, secrets, argparse, hashlib, os,csv, logging, time, sys, stat and NLTK. Finally, I will demonstrate using code walk through the sample cyber forensic application.\n\nOutline\n1. Introduction to digital crimes, digital forensics, the process of investigation, and the collection of evidence. (03 Minutes)\n2. Setting up Python for forensics application development (02 Minutes)\n3. Built-in functions and modules for forensic tasks (05 Minutes)\n4. Forensic Indexing and searching (03 Minutes)\n5. Forensic Evidence extraction (03 Minutes)\n6. Using Natural Language Tools in Forensics (05 Minutes)\n7. Code walkthrough of sample forensic application (08 Minutes)\n8. Conclusion and Next steps (01 Minutes)\n9. Questions and Answers (05 Minutes)\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 1594,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "Gajendra Deshpande"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/zXF4vWuhFi8/maxresdefault.jpg",
  "title": "Build Your First Cyber Forensic Application using Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zXF4vWuhFi8"
    }
  ]
}
