{
  "description": "Computational Complexity Theoretical Foundation on How Long Will Program Run\n[EuroPython 2021 - Talk - 2021-07-29 - Parrot [Data Science]]\n[Online]\n\nBy Kautilya Katariya\n\nOnline teaching materials enable learning programming at any age. Kautilya, a 7-year-old programmer who has learned his way through multiple courses in Python and Artificial Intelligence, shares his takeaways and examples so that we can learn what he has learned about Computational Complexity.\n In this talk, he focuses on the time complexity in computational/algorithmic complexity. As he lays out the theoretical foundations of how we formally measure how fast a program or algorithm runs, he teaches us to analyse the amount of time our program creation choices have on how much time program will take to finish.\n\nIn computer science, the time complexity is the computational complexity that describes the time it takes to run an algorithm. With strong theoretical computer science foundation, he walks us through Big-O, Big-θ, Big-Ω notations for complexity, helps us make sense of it and shows with examples of searching (linear, binary, exponential) and sorting (merge, insertion, selection) how our choices of design of algorithm impact what we experience as time to execute the program.\n\nLearn foundations and draw inspiration for learning from the Guinness World record holder on ‘Youngest Computer Programmer’ at the age of 6.\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 1642,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Vv6-VJIaoiY/sddefault.jpg?sqp=-oaymwEmCIAFEOAD8quKqQMa8AEB-AH-DoACuAiKAgwIABABGBMgMCh_MA8=&rs=AOn4CLDujWHxockehx3gTWv8w9kRSx17Lw",
  "title": "Kautilya Katariya - Computational Complexity Theoretical Foundation on How Long Will Program Run",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Vv6-VJIaoiY"
    }
  ]
}
