{
  "description": "Speeding up the deep learning development life cycle for cancer diagnostics\n[EuroPython 2021 - Talk - 2021-07-30 - Parrot [Data Science]]\n[Online]\n\nBy Marc Päpper\n\nAn important, but often overlooked aspect of developing a high-quality deep learning model is the iteration speed.\nIf you can iterate faster, you can try out more ideas and over time you get better results.\nIn this talk, you will learn about the different tricks you can use to train a great machine learning model in a shorter amount of time.\nIn particular, I will discuss how we optimized our deep learning development life cycle at Mindpeak to create robust deep learning models for cancer diagnostics that work in vastly different laboratory settings.\n\nThe goal of this talk is to point to the most important aspects which you can adjust to speed up the time it takes to go from idea to validated result.\nI will talk about many different aspects like task prioritization, data processing, communication, GPU parallelization, code quality, unit tests, continuous integration, data fit and profiling for speed.\nSo hopefully, after the talk, you should be able to point to some items that you could do to improve the iteration speed when developing machine learning models.\n\nThere are no strict requirements for the talk, but you probably obtain the highest benefit if you have gained some initial experience in developing machine learning models.\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 2745,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "Marc Päpper"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/-bshQNux7ms/sddefault.jpg?sqp=-oaymwEmCIAFEOAD8quKqQMa8AEB-AH-DoACuAiKAgwIABABGBMgMSh_MA8=&rs=AOn4CLBwqB2PPjt1sNB2L3OPrGyQfl2D9g",
  "title": "Speeding up the deep learning development life cycle for cancer diagnostics",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-bshQNux7ms"
    }
  ]
}
