{
  "description": "DIY Home Automation with Microcontrollers and CircuitPython\n[EuroPython 2021 - Talk - 2021-07-28 - Optiver]\n[Online]\n\nBy Maria Jose Molina-Contreras, PhD\n\nFor many years, people have been filling their home with devices that are based on Microcontrollers, like virtual assistants, smart fridges, washing machines, security systems, and many others that can be either programmable, or even replicated with a couple of boards and our Python knowledge.\nDuring this talk, we will start exploring CircuitPython without the need of a physical device, using a microcontroller emulator.  If you are new to the microcontroller world, don’t worry, we will have an introduction to the main concepts, so we have the base knowledge to start doing little experiments by ourselves.\nAfter the introduction, you will be able to start programming microcontrollers using the emulator or in real life, moreover, you will see a couple of real projects (with real devices!) that could easily be replicated by yourself: a low-cost robot floor cleaner, and a plant watering and monitoring system, as examples.\n\nOutline\nTalk motivation\nIntroduction to Microcontrollers and CircuitPython.\nHow to use an emulator for hardware programming.\nDIY Home Automation (Real projects) :\nLow-cost robot cleaner.\nWatering and monitoring plant system.\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 1717,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/2Wzx2Hu35WQ/sddefault.jpg?sqp=-oaymwEmCIAFEOAD8quKqQMa8AEB-AH-DoACuAiKAgwIABABGBMgMSh_MA8=&rs=AOn4CLDYP6miA7lq8LkXpw9u5mwMb4OEXg",
  "title": "Maria Jose Molina-Contreras, PhD - DIY Home Automation with Microcontrollers and CircuitPython",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2Wzx2Hu35WQ"
    }
  ]
}
