{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Writing Better Documentation for Developers\n[EuroPython 2021 - Talk - 2021-07-29 - Optiver]\n[Online]\n\nBy Meredydd Luff\n\nIf you're building something for developers, you want it to get used. This means your potential users need to find your library, framework, or API. They need to work out whether it's useful for them, learn how to use it, and solve problems they encounter along the way. All these things depend on your developer docs!\n\nThis talk is about important functions of your developer docs that you might not think about, some particular pitfalls of documenting things for developers, and how we can make things better.\n\n--\nYour docs are content marketing. Your prospective users are out there, Googling \"how to [what your product does]\", and your docs are the answer.\n\nYour docs define your product. When a developer is evaluating your project, this is what they're reading.\n\nYour docs are your user interface. Developers using your API aren't looking at your website - they're looking at your docs, and their code.\n\nSo let's look at some \"dos and don'ts\":\n\n\nDo know what type of doc you're writing. Tutorials are not the same thing as reference docs. I'll walk you through a useful framework for thinking about types of documentation.\nDon't confuse reference docs and API docs. Merely enumerating the classes, methods and functions of your API isn't enough to describe its behaviour. I'll explain why it's tempting, and why it's a bad idea!\nDo make it easy to navigate between types of documentation. Your user is on a journey, from \"what should I use?\" to \"how do I use it?\" to \"what arguments does this function take?\". Make it easy for them.\nDo talk to your users. They will tell you where the weaknesses in your docs are. Even better: have a public Q&amp;A forum, where deficiencies in your documentation get found and filled in, and the long tail takes care of itself.\n\n\nYour docs are your UI, your marketing and the definition of your product - so act like it!\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 1842,
  "language": "eng",
  "recorded": "2020-07-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2021.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "europython-2021",
    "europython-online",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/kNpyC4LY5gI/hqdefault.jpg",
  "title": "Meredydd Luff - Writing Better Documentation for Developers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kNpyC4LY5gI"
    }
  ]
}
