{
  "description": "Virtual Tourism In Covid Times\n[EuroPython 2021 - Talk - 2021-07-28 - Ni]\n[Online]\n\nBy Nithish Raghunandanan\n\nThe introduction to the talk would cover the motivation for the solution. As someone who loves to travel and has been travelling quite extensively in Europe over the past years, the lockdown &amp; travel restrictions preventing travels are quire hard to adjust to. This gave me the idea to build a dashboard around my past travels to improve my spirits. \n\nIn the next part, I cover how I get the data. In this case, I use the location history from Google Maps. A brief description of the data is included along with what data I select. I also cover some of the problems faced like the non standardization of the raw data (timestamps, latitude / longitude pairs) &amp; how to resolve it. \n\nIn the next part, I explain how I can do some basic analysis with the raw data like the distribution &amp; visualization of my travels over time interactively. This will go through some code examples on how you can build these components using matplotlib &amp; how to make them interactive using Streamlit without writing any Javascript code. \n\nIn the next section, I explain how I can augment this data with data from other sources like public images from Flickr to bring out my memories. This would also explain how to integrate these components using Streamlit. This would also cover the deployment aspects of the solution. Also covered here would be some future additions that I am considering.\n\nIn the final part, I conclude the presentation with my learnings from building this app to do some virtual tourism in COVID times. I cover some of the scenarios where Streamlit could be useful &amp; other places where it might not be suitable.\n\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 1625,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/5DnWwEozKiY/sddefault.jpg?sqp=-oaymwEmCIAFEOAD8quKqQMa8AEB-AH-DoACuAiKAgwIABABGBMgMSh_MA8=&rs=AOn4CLB6pWfa-xYA2FDlErlHRnihhKJwCA",
  "title": "Nithish Raghunandanan - Virtual Tourism In Covid Times",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5DnWwEozKiY"
    }
  ]
}
