{
  "description": "Automated Machine Learning With Keras\n[EuroPython 2021 - Talk - 2021-07-29 - Parrot [Data Science]]\n[Online]\n\nBy Ondrej Urban\n\nDurante mis primeros pasos en el campo, me prometieron que el aprendizaje automático estaría automatizado desde el principio. Desafortunadamente, una vez que delegué la búsqueda de los parámetros que mejor se ajustaban a mis datos a las máquinas, me quedé teniendo que buscar los hiperparámetros que definen la mejor arquitectura del modelo, todo por mi cuenta. Esto a menudo termina siendo un proceso manual largo. ¿Hay alguna manera de delegar también esta parte?\n\nEn esta charla veremos las bibliotecas de aprendizaje automático automatizado Keras Tuner y AutoKeras, que permiten al usuario crear plantillas de alto nivel de modelos de aprendizaje profundo y usarlas en la búsqueda automatizada de los mejores hiperparámetros. No solo permiten un desarrollo más rápido de mejores modelos, sino que también hacen que el aprendizaje profundo sea accesible a un público más amplio gracias a las abstracciones que ofrecen.\n\nEn la presentación pasaremos por varias iteraciones de pretender saber cada vez menos sobre nuestros datos y el aprendizaje automático en general, y veremos cómo estas bibliotecas nos ayudan a crear modelos de aprendizaje profundo altamente eficientes con una fracción del esfuerzo. Está dirigida a una audiencia general familiarizada con Python. El conocimiento de Keras es una ventaja pero no un requisito, ¡ese es el punto!\n\nEl repositorio con un notebook con ejemplos de código está disponible en: https://github.com/ondrejiayc/ep2021automlkeras\n\n\nLicencia: Este video está licenciado bajo la licencia CC BY-NC-SA 4.0: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPor favor, consulte nuestro acuerdo de liberación de ponentes para más detalles: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 1863,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://github.com/ondrejiayc/ep2021automlkeras",
      "url": "https://github.com/ondrejiayc/ep2021automlkeras"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "Ondrej Urban"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/9UlM6DmKIj8/sddefault.jpg?sqp=-oaymwEmCIAFEOAD8quKqQMa8AEB-AH-DoACuAiKAgwIABABGBMgMSh_MA8=&rs=AOn4CLDYJhQpD7TcoyA8H1E1oaND80-OCA",
  "title": "Automated Machine Learning With Keras",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9UlM6DmKIj8"
    }
  ]
}
