{
  "description": "Building Brain-Computer Interfaces with Timeflux\n[EuroPython 2021 - Talk - 2021-07-30 - Ni]\n[Online]\n\nBy Pierre Clisson\n\nBrain-Computer Interfaces (BCIs) enable people to interact with physical devices by using their mind only. For a long time, building such systems has been the prerogative of the academic world, and has required cumbersome tools and expensive hardware. It is now time to get BCIs out of the lab and into the hands of programmers.\n\nThe field of BCIs is currently experiencing a momentum, attracting not only researchers, but also companies and hackers. At the same time, a growing number of people rely on the thriving Python datascience and machine learning ecosystem. Yet, until recently, there was not any real Python solution for building BCIs. Timeflux (https://timeflux.io), a free and open-source framework for the acquisition and real-time processing of biosignals, aims to fill this gap.\n\nDuring this talk, we will cover all you need to get started: you will learn the basics of neurophysiology and how BCIs actually work, where to get the hardware to measure the electrical activity of your brain, the general architecture of Timeflux and how you can use this framework to build processing pipelines and interfaces available from a web browser.\n\nFinally, we will demonstrate a virtual keyboard on which you can type with nothing else but your mind.\n\nBeginners are welcome to this presentation. Data scientists, machine learning enthusiasts and web developers will be able to leverage their skills. More broadly, we invite anyone curious to know why the future of BCIs is written in Python.\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 2725,
  "language": "eng",
  "recorded": "2021-07-26",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://timeflux.io",
      "url": "https://timeflux.io"
    }
  ],
  "speakers": [
    "Pierre Clisson"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/lNUXqOWYjUs/maxresdefault.jpg",
  "title": "Building Brain-Computer Interfaces with Timeflux",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lNUXqOWYjUs"
    }
  ]
}
