{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Faceoff Fun with Python Frameworks: FastAPI vs Flask\n[EuroPython 2021 - Talk - 2021-07-28 - Ni]\n[Online]\n\nBy Tonya Sims\n\n“All the cool kids are using FastAPI for API development.” Imagine hearing this, just as you start getting more comfortable using other frameworks, like Python’s Django or Flask, to build out your API’s. Ladies and gentlemen, there’s a new kid on the block and in this talk there’s going to be an epic faceoff between FastAPI and Flask.\n\nWhat is Flask?\n\nFlask is a micro web framework built for Python designed to get your application up and running quickly. It’s lightweight and used by many different well known projects.\n\nWhat is Fast API?\n\nFast API (aka the new kid) is a modern Python web framework that takes all your favorite features from other tools and combines them into one. It was built for speed, rapid development and enhanced developer experience.\n\nWe’ll do a side by side comparison of the two frameworks including features and code structure, using a REST API. By the end of the faceoff you’ll have a much better understanding of which one you’ll use in your next project.\n\nLet’s analyze the pros and cons of each and why you’d use one over the other. You may even find a lot of similarities between the two and some contrast as well. You’ll see different categories of features for the frameworks and a winner will be chosen for each.\n\nFinally, no matter which you prefer, FastAPI and Flask are both great choices for API development, so let’s have fun and let the faceoff begin.\n\n\nLicense: This video is licensed under the CC BY-NC-SA 4.0 license: https://creativecommons.org/licenses/by-nc-sa/4.0/\nPlease see our speaker release agreement for details: https://ep2021.europython.eu/events/speaker-release-agreement/",
  "duration": 1807,
  "language": "eng",
  "recorded": "2020-07-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2021.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2021.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    {
      "label": "https://ep2021.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2021.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "conference",
    "europython",
    "europython-2021",
    "europython-online",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Xoqv9NMO24Q/hqdefault.jpg",
  "title": "Tonya Sims - Faceoff Fun with Python Frameworks: FastAPI vs Flask",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Xoqv9NMO24Q"
    }
  ]
}
