{
  "description": "Andrea Morales Garzón y Antonio Manjavacas Lucas nos presentan \"Introducción a los algoritmos bioinspirados con Python\".\n\nResumen:\nLa naturaleza ha sido desde siempre un foco de inspiración para la resolución de problemas cotidianos: desde los más simples a los más complejos. La Inteligencia Artificial tiene mucho que aportar en este aspecto, y es que existe todo un campo de estudio centrado en cómo la naturaleza y los seres vivos resuelven procesos complejos de forma eficiente, con el objetivo de replicarlo y optimizar la solución de problemas de computación costosos. Los algoritmos basados en esta idea son conocidos como \"bioinspirados\". El objetivo de esta charla será conocer más de cerca qué son los algoritmos bioinspirados y cómo estos pueden llevarse a la práctica utilizando Python. En concreto, nos centraremos en el paquete inspyred, orientado a la computación bioinspirada, del cual mostraremos sus principales funcionalidades. Finalmente, veremos algunos ejemplos prácticos destinados a la resolución de problemas de optimización.\n\n---\nLa novena edición de la PyConES se celebra como un evento en línea y totalmente gratuito durante los días 2 y 3 de Octubre de 2021.\nWeb: https://2021.es.pycon.org\nAgenda: https://2021.es.pycon.org/#schedule",
  "duration": 1228,
  "language": "spa",
  "recorded": "2021-10-02",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2021.es.pycon.org/"
    },
    {
      "label": "https://2021.es.pycon.org",
      "url": "https://2021.es.pycon.org"
    },
    {
      "label": "https://2021.es.pycon.org/#schedule",
      "url": "https://2021.es.pycon.org/#schedule"
    }
  ],
  "speakers": [
    "Andrea Morales Garzón",
    "Antonio Manjavacas Lucas"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/r1Xeyf669m8/maxresdefault.jpg",
  "title": "Introducción a los algoritmos bioinspirados con Python - PyConES 2021",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=r1Xeyf669m8"
    }
  ]
}
