{
    "description": "Join us for a panel on the State of Django: the state of the Django codebase and also the state of the Django community as represented by organizations like the Django Software Foundation, Django Girls, the Python Software Foundation and DEFNA.\n\nModerated by Dawn Wages, our panelists will discuss:\n\n- how we can continue to grow the Django community and create a welcoming space for beginners\n- the priorities for the continued development and maturation of Django\n- ways to improve Django events and bring them to new regions worldwide, especially in the COVID landscapee\n- success stories from Django communities\n- concrete steps toward better and more effective diversity and inclusion efforts\n- how Django fits into the larger Python ecosystem, especially as other fields like data science continue to grow\n\nand much more. It’s been a long time since we gathered leaders of the Django community on one stage to have an open-ended discussion about Django’s present and future, and we hope you’ll join us for this special event.\n\n## Panelists\n\n- [Carlton Gibson](/presenters/carlton-gibson/), Django Fellow and co-host of the Django Chat podcast\n- [Andrew Godwin](https://aeracode.org/), longtime Django core contributor\n- [Jeff Triplett](https://webology.dev/), DEFNA President and PSF board member\n- [Will Vincent](https://wsvincent.com/), DSF Treasurer and co-host of the Django Chat podcast\n- [Rachell Calhoun](https://www.rachellcalhoun.com/), DjangoGirls Trustee, DjangoGirls Grand Rapids (Michigan), PyLadies Grand Rapids\n- [Mariusz Felisiak](https://twitter.com/MariuszFelisiak), Django Fellow and core team member",
    "language": "eng",
    "recorded": "2022-10-19",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2022.djangocon.us"
        }
    ],
    "speakers": [
        "Andrew Godwin",
        "Carlton Gibson",
        "Dawn Wages",
        "Jeff Triplett",
        "Mariusz Felisiak",
        "Rachell Calhoun",
        "Will Vincent"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/IumYtz0G5v0/maxresdefault.jpg",
    "title": "Panel Discussion: The State of Django",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=IumYtz0G5v0"
        }
    ]
}
