{
    "description": "Delivering Django applications doesn’t just mean deployment. It means clearly defining\na delivery lifecycle so that updates and upgrades are consistently tested and packaged,\ninfrastructure is reliably provisioned, and deployed production code comes with a level\nof observability that makes responding to problems feasible. Throughout it all, it needs\nto be secure and increasingly compliant, with those same standards replicated for all of\nthe apps important to your organization.\n\nThis real need can lead organizations to grow “platform teams”, or “Cloud Centers of\nExcellence” - an interdisciplinary group of people tasked with defining, creating and\nmaintaining a high level of operational standards so complexity can be managed, drift is\nminimized, and so everything stays relatively stable as technologies deprecate and\npeople off- and on-board. The thing is, implementing stability in-house is an expensive\nmoving target - in time, money, and environmental impact. Deprecating tools and\nessential people with too many responsibilities leaving the organization will have you\nreinventing the wheel forever.\n\nIn this session, I’ll show you how Platform.sh can allow your team to deploy updates and\nupgrades that are secure, compliant, stable, and consistently tested. We’ll explore ways\nthat our tooling provides insights into your code’s performance, all while providing your\nteams with clearly defined lifecycles and guardrails that ensure standards are replicated\nfor all your organization’s apps. And for far less money and time than trying to build it\nin-house.",
    "language": "eng",
    "recorded": "2022-10-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2022.djangocon.us"
        }
    ],
    "speakers": [
        "Chad Carlson"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/MkAgiD_EJN8/maxresdefault.jpg",
    "title": "Sponsored Talk: Production Django on Platform.sh: reaching operational maturity in days, not years",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=MkAgiD_EJN8"
        }
    ]
}
