{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "**Christian Staudt** (@C_L_Staudt)\n\nI am an independent data scientist with a background in computer science, in-depth in algorithms, data analysis, high-performance computing and software engineering. My current interests include machine learning and data visualization.\n\n**Abstract**\n\nPythonistas have access to an extensive collection of tools for data analysis. The space of tools is best understood as an ecosystem: Libraries build upon each other, and a good library fills an ecological niche by doing certain jobs well. This is a guided tour of the Python data science ecosystem.\n\n**Description**\n\nThe Python Ecosystem for Data Science: A Guided Tour\n\nPython is on its way to becoming the lingua franca of data science, and Pythonistas have access to an impressive and extensive collection of tools for data analysis. Here, a data scientist needs to see the forest for the trees: The space of tools is best understood as an ecosystem, where libraries build upon each other, and where a good library fills an ecological niche by doing certain jobs well. This talk is a guided tour of the Python data science ecosystem. More than a list of libraries, it aims to provide some structure, classing tools by type of data, size of data, and type of analysis. In our tour, we visit a number of areas, including working with tabular data (numpy, pandas, dask, ...) and graph data (e.g. networkx), statistics (e.g. statsmodels), machine learning (scikit-learn, ...), data visualization (matplotlib, seaborn, bokeh, ...). Aspiring data scientists, and everyone else working with data, should find this useful for selecting the right tools for their next data-driven project.\n\n\n**Recorded at** PyCon.DE 2017 Karlsruhe: https://de.pycon.org/\n\n**Video editing**: Sebastian Neubauer & Andrei Dan\n\n**Tools**: Blender, Avidemux & Sonic Pi",
  "duration": 2243,
  "language": "eng",
  "recorded": "2017-10-25",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Christian Staudt"
  ],
  "tags": [
    "use-case",
    "business",
    "ai",
    "analytics",
    "data-science",
    "python",
    "machine learning"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/BIWcciNeMm0/maxresdefault.jpg",
  "title": "The Python Ecosystem for Data Science: A Guided Tour",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BIWcciNeMm0"
    }
  ]
}
