{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "**Nafiul Islam** (@gamesbrainiac)\n\nI'm Nafiul. I am a Bangladeshi who got lucky and is now working in Amsterdam. I have a deep passion for teaching and learning; I spend a lot of time on StackOverflow, answering questions, and I also spend a lot of time mentoring people on hackhands. I've even written a book in PyCharm, to share all of my IDE secrets. I don't I have a right to have people listening to me, but I feel that what I have to say is worth a try listening to, and I'm also (I believe) a good guy to have a discussion with.\n\nI'm not a fan of One Direction, primarily because they seem like a bunch of overgrown teenage boys unable to come to terms with their own maturity. In case you want to hear some real music you might want to try out \"Fortunate Son\" by Creedence Clearwater Revival. I have more :)\n\n**Abstract**\n\nSo you've heard about this new thing called Graphql. What is it all about? What problems does it solve, and most importantly, how can you leverage it the python ecosystem? This talk is a tell all on what what Graphql is and how you can start using it with Python.\n\n**Description**\n\nGraphql is a new way of communicating with your data sources. It will very likely replace RESTful APIs because it provides a better framework for dealing with your data. This talk is about what Graphql is, what problems it actually solves in comparison to RESTful APIs, and if you like it, how you can get started using the python graphene library, and how to use it with different ORMs like Django and SQLAlchemy.\n\n\n**Recorded at** PyCon.DE 2017 Karlsruhe: https://de.pycon.org/\n\n**Video editing**: Sebastian Neubauer & Andrei Dan\n\n**Tools**: Blender, Avidemux & Sonic Pi",
  "duration": 1503,
  "language": "eng",
  "recorded": "2017-10-25",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Nafiul Islam"
  ],
  "tags": [
    "graphql"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/FpQpF0BTrJU/maxresdefault.jpg",
  "title": "Graphql in the Python World",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FpQpF0BTrJU"
    }
  ]
}
