{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "**Adrian Seyboldt**\n\nI studied Mathematics and Bioinformatics in Bonn and Tübingen and I am a core developer of pymc3 since Feb 2017. Currently, I work for Quantopian on the development of Bayesian Methods for portfolio allocation.\n\n**Abstract**\n\nPyMC3 allows you to build statistical models for a wide range of datasets, use those models to estimate underlying parameters, and compute the uncertainty about those parameters. In this talk I will try to give a gentle introduction to PyMC3, and help avoid common pitfalls for new users.\n\n**Description**\n\nSome of the problems that are discussed in the context of the reproducibility crisis in science and statistics can be solved or alleviated by tools like PyMC3 or Stan. They allow users to build much more realistic models and get a full distribution of the possible values for parameters as output – instead of p-values that are often hard to interpret correctly. Thanks to Hamiltonian and Variational methods, they are more flexible and can be applied to larger problems than predecessors like JAGS and BUGS. However, these new methods also come with challenges. Writing good models isn't easy, and when inference algorithms cry out in pain, they need someone who listens to them. This talk uses some real-world applications to give an introduction to PyMC3, without requiring a lot of background in math, statistics or programming.\n\n\n**Recorded at** PyCon.DE 2017 Karlsruhe: https://de.pycon.org/\n\n**Video editing**: Sebastian Neubauer & Andrei Dan\n\n**Tools**: Blender, Avidemux & Sonic Pi",
  "duration": 2612,
  "language": "eng",
  "recorded": "2017-10-25",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Adrian Seyboldt"
  ],
  "tags": [
    "python",
    "data-science",
    "machine learning",
    "analysis"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/FKhivuCLIT0/maxresdefault.jpg",
  "title": "An introduction to PyMC3",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FKhivuCLIT0"
    }
  ]
}
