{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "**Jens Nie, Peer Wagner** (@jneines)\n\nJens works primarily as a Technology Scout focusing on Big Data and Data Science at the ROSEN Technology & Research Center in Lingen, Germany. In this role he screens for latest developments in these areas and evaluates and demonstrates their possible use and benefit for the company. Looking back to more than 20 years in using Python and Linux, he considers him to be an Open Source enthusiast and committed Python advocate.\n\n**Abstract**\n\nIntroducing a new programming language in a company is always a daring task, usually involving a lot of effort and the will for change.\n\nWe'd like to take you on a journey reflecting eight years of challenges, solutions and success ending in a best practice guide helping you to achieve the same.\n\n**Description**\n\nROSEN is most recognized as a technology leader in the pipeline inspection business. To steadily achieve the best in class service for our customers, we are building and using the most sophisticated tools in the industry to perform the inspection services. This often results in very large volumes of data which have to be handled and analyzed.\n\nAs a consequence, we were always out to search for the latest technology and state of the art tools to aid us.\n\nAt a point where the most traditionally used tools for data analysis no longer scaled a handful of pioneers were brave enough to introduce a massive change in the scientific tool chain. This involved to address driving laboratory equipment, data processing, analysis and display, handling large volumes of data efficiently, building attractive graphical user interfaces, integrate with existing software applications and prepare for modern data analysis concepts based on machine learning to ensure both increasing result quality and faster data analysis.\n\nWe've found Python to be the ideal foundation to achieve all this and started off with a few initial projects in order to prove. It turned out Python would be a real game changer for us.\n\n\n**Recorded at** PyCon.DE 2017 Karlsruhe: https://de.pycon.org/\n\n**Video editing**: Sebastian Neubauer & Andrei Dan\n\n**Tools**: Blender, Avidemux & Sonic Pi",
  "duration": 1790,
  "language": "eng",
  "recorded": "2017-10-25",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Jens Nie",
    "Peer Wagner"
  ],
  "tags": [
    "use-case",
    "python",
    "business"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/2Ku3tV3QQ3M/maxresdefault.jpg",
  "title": "Empowered by Python - A success story",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2Ku3tV3QQ3M"
    }
  ]
}
