{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Since 2008 Susanne Mertens is working on the experimental investigation of the elusive elementary particle, the Neutrino. With the two large-scale experiments, KATRIN and LEGEND, she explores their mass and the question of whether the neutrino is its own anti-particle. Beyond that, the group of Susanne Mertens is developing a novel detector system, to search for a new type of neutrino, the so-called sterile neutrino, which could make up a large part of the dark matter of our universe.\nNeutrinos: who are you and if yes how many?\n\nThe neutrino is a strange particle: it it extremely light and flies through matter without leaving a trace. Nevertheless --due to its vast abundance-- it plays a key role as cosmological architect in the formation of galaxies in our universe. One of the missing puzzle pieces for the exact understanding of the evolution of the universe is the mass of the neutrino. The discovery of neutrino oscillations, awarded with the Nobel prize in 2015, proofs that neutrinos are not massless, but does not reveal its actual value. The Karlsruhe Tritium Neutrino (KATRIN) experiment aims at directly measuring the neutrino mass by investigating the radioactive decay of tritium with unprecedented precision. The talk will report on the mysterious neutrinos, how KATRIN will track down their mass, and which role computational methods play in the realization of such a large-scale experiment.     TU-Munich Susanne Mertens: /redirect?q=https%3A%2F%2Fwww.ph.tum.de%2Fabout%2Fpeople%2Fvcard%2F8C819C16F9AF3575%2F%3Flanguage%3Den&redir_token=3UMhaB3KttJ3Ym7GiiBsFVaxy898MTUxNDcyNTk2NEAxNTE0NjM5NTY0&v=3h-6GBBF4Hg&event=video_description     KATRIN and TRISTAN: Neutrinos and Dark Matter: /redirect?q=https%3A%2F%2Fwww.mpp.mpg.de%2Fforschung%2Fastroteilchenphysik-und-kosmologie%2Fkatrin-und-tristan-neutrinos-und-dunkle-materie%2F&redir_token=3UMhaB3KttJ3Ym7GiiBsFVaxy898MTUxNDcyNTk2NEAxNTE0NjM5NTY0&v=3h-6GBBF4Hg&event=video_description\n\nRecorded at PyCon.DE 2017 Karlsruhe: pycon.de\nVideo editing: Sebastian Neubauer & Andrei Dan\nTools: Blender, Avidemux & Sonic Pi",
  "duration": 3442,
  "language": "eng",
  "recorded": "2017-11-27",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "TODO",
    "enter_manually"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/3h-6GBBF4Hg/maxresdefault.jpg",
  "title": "PyCon.DE 2017 Keynote Prof. Dr. Susanne Mertens - Neutrinos: who are you and if yes how many?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3h-6GBBF4Hg"
    }
  ]
}
