{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "**Stephan Erb** (@ErbStephan)\n\nStephan Erb is a software engineer driven by the goal to make Blue Yonder's data scientists more productive. Stephan holds a master's degree in computer science from the Karlsruhe Institute of Technology (KIT). He is a PMC member of the Apache Aurora project and tweets at @ErbStephan.\n\n**Description**\n\nBeautiful is better than ugly. Explicit is better than implicit. Simple is better than complex. ...\n\nThat is how the Zen of Python motivates us Python programmers to build software that is easy to maintain and extend. In reality however, after years of development, we often end up with systems that are quite the opposite: large code bases, slow turn around times, and brittle operations.\n\nIn this talk we will explore software design methodologies that can help to prevent this from happening. We will have a closer look at seminal work by computer scientists that has proven to be useful in practice. This includes:\n\n- Out of the Tar Pit by Ben Moseley and Peter Marks\n- End-to-End Arguments in System Design by Saltzer et al.\n- Programming Pearls by Jon Bentley\n\nA conference talk is clearly not sufficient to cover the breath of the mentioned literature. Main goal of the talk is therefore to illustrate a few key messages using examples from real-world Python projects.\n\n\n**Recorded at** PyCon.DE 2017 Karlsruhe: https://de.pycon.org/\n\n**Video editing**: Sebastian Neubauer & Andrei Dan\n\n**Tools**: Blender, Avidemux & Sonic Pi",
  "duration": 2471,
  "language": "eng",
  "recorded": "2017-10-25",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Stephan Erb"
  ],
  "tags": [
    "system",
    "design",
    "complexity",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/pee-e01DiyI/hqdefault.jpg",
  "title": "The Snake in the Tar Pit: Complex Systems with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pee-e01DiyI"
    }
  ]
}
