{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "**Yenny Cheung** (@yennycheung)\n\nYenny Cheung, Software Engineer, Biz National, Yelp\n\nOriginally from Hong Kong, Yenny moved to Pennsylvania in the US to study Computer Science at Swarthmore College. She attended the Grace Hopper Conference three times during her college years. After graduation, Yenny moved to Hamburg and joined Yelp as a full-stack software engineer. Yenny works on the Biz National team, where she is scaling advertising tools and reporting for multi-location businesses and franchises. She is a pioneer of the Awesome Women in Engineering Group at Yelp in Germany and she is active in Women in Engineering Meetups in Hamburg. Outside of work, Yenny enjoys yelping for good food and painting.\n\n**Abstract**\n\nEver stumbled upon poorly-maintained codebases that suck away your productivity? Fear no more! This talk addresses how to identify code smell (from Brie to Bleu cheese) and go through examples to refactor code and APIs. You will learn the art of writing clean, maintainable and idiomatic Python code.\n\n**Description**\n\nThis talk targets beginner software engineers yet also aims to provide interesting content for more advanced developers. You will leave knowing more about code smells and understanding the whys and hows of refactoring.\n\nCode smells refer to the symptoms of problematic code design. Identifying different types of code smells is the first step to successful refactoring. I will talk through some classic examples:\n\n- Unnecessarily complex code\n- Inappropriate naming\n- Duplicated code\n- Non-modularized code\n\nKnowing what to refactor, I will share a few learnings that lead to good quality code:\n\n- Good python practices (The Zen of Python & PEP8)\n- Good use of data structures (named tuples & sets)\n- The art of pythonic naming\n- DRY principle\n- Separation of concerns principle (modularity & encapsulation)\n\nRefactoring also makes testing easier. I will discuss how to write unit tests that cover all use cases. Finally I will talk about integration testing strategies that ensure that you and people who want to modify your API in the future are not breaking upstream code.\n\n\n**Recorded at** PyCon.DE 2017 Karlsruhe: https://de.pycon.org/\n\n**Video editing**: Sebastian Neubauer & Andrei Dan\n\n**Tools**: Blender, Avidemux & Sonic Pi",
  "duration": 1863,
  "language": "eng",
  "recorded": "2017-10-25",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Yenny Cheung"
  ],
  "tags": [
    "code smell",
    "api refactoring",
    "python web"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Yq9-b2JKUyU/maxresdefault.jpg",
  "title": "Technical Lessons Learned from Pythonic Refactoring",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Yq9-b2JKUyU"
    }
  ]
}
