{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "**Natalie Speiser,Jens Beyer** (@natalie_lavrio)\n\nNatalie is a psychologist focused on statistics and machine learning for predictions. Jens is a pyhsicist turned consultant for IBM and d-fine and helped big companies with statistical models since 2009. Together, we founded LAVRIO.solutions and help our clients to make the most out of their data. In our recent data science projects, we faced specific hurdles which seem to be typical.\n\n**Abstract**\n\nAI and Machine Learning are taking over the world - but how do you actually start with understanding your data and predicting events? And what kind of \"political\" trouble could you run into? With examples from real projects, we try to give you a feeling for data science projects.\n\n**Description**\n\nWe will be talking about examples from projects we did as data science consultants. What should be organized before you go to a client (internal or external). How should the data look like. What are problems you have to face while working with the clients IT department. You get to see a rough draft of our code. It won't be a thorough manual, just our experiences and how we dealt with problems.\n\n\n**Recorded at** PyCon.DE 2017 Karlsruhe: https://de.pycon.org/\n\n**Video editing**: Sebastian Neubauer & Andrei Dan\n\n**Tools**: Blender, Avidemux & Sonic Pi",
  "duration": 1848,
  "language": "eng",
  "recorded": "2017-10-25",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Natalie Speiser",
    "Jens Beyer"
  ],
  "tags": [
    "business",
    "data-science",
    "use-case",
    "python",
    "machine learning"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/4BBCqCgVDLI/maxresdefault.jpg",
  "title": "Data Science Project for Beginners",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4BBCqCgVDLI"
    }
  ]
}
