{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "**Suhas SG** (@jargnar)\n\nSuhas is a data scientist, full stack engineer, and a design hacker originally from Bangalore, India. He is currently a data engineer at Zalando SE, Berlin. Earlier, he has designed and built big data solutions for some of the Fortune 500 companies.\n\nHe is also the founder and curator of a data visualization and art museum called LifeWithData.\n\n**Abstract**\n\nComputer languages are a remarkable feat of human scientific engineering. In this talk, we'll look at the innards of CPython, and specifically learn how to modify and hack Abstract Syntax Trees (for world peace, of course).\n\n**Description**\n\n*Summary*\n\nComputer languages are a remarkable feat of human scientific engineering. In this talk, we'll look at the innards of CPython, and specifically learn how to modify Abstract Syntax Trees (for world peace, of course).\n\n*Rough agenda*\n\n- [ 05 mins ] --- A brief intro to languages and compilers\n- [ 05 mins ] --- CPython and parsing grammars\n- [ 10 mins ] --- Everything about Python ASTs\n- [ 15 mins ] --- Let's write a flake8 plugin (to understand ASTs better)\n- [ 05 mins ] --- Metaprogramming, code as data, possibilities and more!\n\n*What we'll learn*\n\n- We'll learn the life of a python code, and how the CPython process works.\n- We'll understand and be able to participate in conversations that include words like LL(1) parser\n- We'll make our devious minds work towards hacking into source code and modifying it with the help of ast.NodeTransformer\n- We'll learn to write a Flake8 plugin\n- A treasure map to dive into deeper waters\n\n*Prerequisites*:\n\n- Basics of Python, must be comfortable with lists, functions, classes\n- Basic idea / understanding of data structures\n- A mischievous mind to get hands dirty for intercepting source code and parsing ASTs\n- A bottle of water to keep yourself hydrated\n\n\n**Recorded at** PyCon.DE 2017 Karlsruhe: https://de.pycon.org/\n\n**Video editing**: Sebastian Neubauer & Andrei Dan\n\n**Tools**: Blender, Avidemux & Sonic Pi",
  "duration": 2166,
  "language": "eng",
  "recorded": "2017-10-25",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Suhas SG"
  ],
  "tags": [
    "ast"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/kaxAF542Cic/maxresdefault.jpg",
  "title": "Hacking the Python AST",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kaxAF542Cic"
    }
  ]
}
