{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "**Anne Matthies** (@babeltron)\n\nAnne Matthies has been coding data stuff professionally since 1996. She switched to Python 2 in 2000, to Python 3 in 2015. Currently, she’s working at Babbel, Berlin, responsible for building and operating the data platform – and developing the next generation.\n\n**Abstract**\n\nSo you’ve decoupled your code monolith into all those micro chunks. When someone asks \"How can I…\" you want to answer: \"That’s easy! We’ve built that.\" Actually, you’ve built all parts needed for that. Who plugs them together? And how?\n\n**Description**\n\nKeeping the grip on decoupled code using CLIs\n\nSo you’ve decoupled your monolith spaghetti code into micro chunks. You’ve switched to infrastructure as code, and you’re confident that it scales horizontally. Your data pipelines are pretty resilient, your CI pipeline runs tests on every single git push.\n\nAnd then, you get a new team member. Or your CTO wants to plot data of his brandnew sandbox project that isn’t integrated into your pipelines. Or someone just asks \"How can I…\" and you want to answer: \"That’s easy! We’ve built that… – Well, actually, we’ve built all parts needed for that.\" Who plugs them together? And how?\n\nIn my talk, I’d like to show how lightweight CLIs can be Ariadne Threads through the labyrinth of micro components. How at Babbel we use conda, setuptools entrypoints and simple CLI scripts to keep the grip on our data platform code chunks\n\n\n**Recorded at** PyCon.DE 2017 Karlsruhe: https://de.pycon.org/\n\n**Video editing**: Sebastian Neubauer & Andrei Dan\n\n**Tools**: Blender, Avidemux & Sonic Pi",
  "duration": 1256,
  "language": "eng",
  "recorded": "2017-10-25",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Anne Matthies"
  ],
  "tags": [
    "pydata",
    "devops",
    "cli",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/F20vrgQCFMs/maxresdefault.jpg",
  "title": "Keeping the grip on decoupled code using CLIs",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=F20vrgQCFMs"
    }
  ]
}
