{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "**Christian Theune** (@theuni)\n\n**Abstract**\n\nPython's versatility is known to admins - in this talk I'd like to show how it fits for many small and big challenges I meet regularly: from tiny scripts to large systems. Also, I'll show how using the languages' advanced and/or newer features makes scripts more compact and robust.\n\n**Description**\n\nDRAFT Unfortunately I got sick just a few days before the CFP date, so hopefully you can live with a draft description for now. I'll be happy to update this during or after the review as needed.\n\nI'd like to give a hands-on approach for how to use Python in a mixed environment where you may be writing very small standalone scripts, small integration programs and/or larger systems. As an admin bash is always a very close friend and one quickly uses it and then ends up with large scripts that should never have seen the day of light. Also, admins nowadays might be writing larger software bases that are actual software projects and the lines between \"ops\" and \"devs\" are - on purpose - more and more blurry. However, there are some differences in \"application development\" and \"system development\". Those are more of a mindset issue, however, and Python as a technology fits in both situations quite well and allows one to transition between those modes rather seamlessly.\n\nI'll be reviewing specific pieces of code from our infrastructure, ranging from smaller scripts to subsystems to a full-born Pyramid application that we use for inventory management. All of those will use different versions of Python, different libraries and different approaches how to solve certain problems. I will likely show how not to do things as well.\n\n\n**Recorded at** PyCon.DE 2017 Karlsruhe: https://de.pycon.org/\n\n**Video editing**: Sebastian Neubauer & Andrei Dan\n\n**Tools**: Blender, Avidemux & Sonic Pi",
  "duration": 1782,
  "language": "eng",
  "recorded": "2017-10-25",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://2017.de.pycon.org/schedule/"
    }
  ],
  "speakers": [
    "Christian Theune"
  ],
  "tags": [
    "python",
    "devops"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/CQ3qwmld5V8/maxresdefault.jpg",
  "title": "An Admin's Cornucopia - Python Is More Than Just A Better Bash",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CQ3qwmld5V8"
    }
  ]
}
