{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Adam Dangoor - Another pair of eyes: Reviewing code well\n[EuroPython 2016]\n[21 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/another-pair-of-eyes-reviewing-code-well)\n\nMany of us have been taught to code, but we know that software\nengineering jobs are so much more than that.\nProgrammers can spend 5-6 hours per week on code review, but doing\nthat is almost ignored as a skill.\nHow many of us have seen poor reviews, which don't catch bugs, make\npeople feel bad or block important features being merged?\nAn introduction to what code review is alongside guidelines, tips,\ntricks and anecdotes to help make your code reviews be as productive\nas possible.\n\n-----\n\nMany of us have been taught to code, but we know that software\nengineering is so much more than that. Programmers can spend 5-6 hours\nper week on code review, but doing that is almost ignored as a skill,\nand instead it is often treated as a rote chore.\n\nHow many of us have seen poor reviews - those which upset people,\ndon't catch bugs or block important features being merged? This talk\nexplores the social and technical impacts of various code review\npractices as well as helpful tooling. The goal is to provide a\nstructure to help improve how teams review code, and to introduce the\ncosts and benefits of code review to anyone unfamiliar with the\npractice.\n\nThere are always trade-offs to be made - e.g. think how costly a\nsecurity flaw in this code could be to your organisation - perhaps\nintense scrutiny is not necessary for prototypes soon to be thrown\naway. It is useful to consider the  trade-offs in order to optimise\nfor a particular problem domain. Perhaps right now it is more\nimportant to look for issues with maintainability, functionality or\nperformance.\n\nI talk about how some fantastic code reviews from mentors, colleagues\nand strangers have helped me become a better programmer and team\nmember, as well as occasions where code review has been detrimental by\nslowing things down and causing arguments.\n\nThis is aimed at everyone from beginner to advanced programmers.",
  "duration": 1507,
  "language": "eng",
  "recorded": "2016-08-04",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/another-pair-of-eyes-reviewing-code-well"
  ],
  "speakers": [
    "Adam Dangoor"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/JWBBI-jFVOc/maxresdefault.jpg",
  "title": "Another pair of eyes: Reviewing code well",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JWBBI-jFVOc"
    }
  ]
}