{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Anjana Vakil - Using and abusing Python’s double-underscore methods and attributes\n[EuroPython 2016]\n[21 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/using-and-abusing-pythons-double-underscore-methods-and-attributes)\n\nPython’s double-underscore ('`__`') methods and attributes go by many\nnames, including “special”, “dunder”, and “magic”. You already use\nsome, like `__init__`, but there are many more!\n\nIn this talk, we’ll see how dunders can be useful, silly, dangerous,\nand fun! We’ll trick Python’s arithmetic and comparison operators.\nWe’ll make objects behave like dictionaries and containers. We’ll\nreduce an object’s memory usage, and speed up membership tests. We’ll\neven try some naughty function hacks!\n\n-----\n\nThe curious Python methods and attributes surrounded by double\nunderscores ('`__`') go by many names, including “special”, “dunder”,\nand “magic”. You probably use some of them, like `__init__`, every\nday. But that’s just the tip of the iceberg!\n\nIn this talk, we’ll explore the weird and wonderful world of the\ndouble-underscore, and find out how dunders can be useful, silly,\ndangerous, and just fun! We’ll play pranks on Python’s builtin\noperators for arithmetic and comparison. We’ll make arbitrary objects\nbehave like dictionaries and containers. We’ll reduce an object’s\nmemory usage, and speed up tests for membership. We’ll even try some\nnaughty function hacks that we should never use in real life!\n\nYou'll get the most out of this talk if you're already comfortable\nwriting object-oriented Python code. If you already use special dunder\nmagic in your own code, that's excellent! You’ll have a chance to\nshare your tips & tricks with the rest of the audience at the end of\nthe talk.\n\n**Talk repo**: https://github.com/vakila/dunders\n\n",
  "duration": 1860,
  "language": "eng",
  "recorded": "2016-08-04",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/using-and-abusing-pythons-double-underscore-methods-and-attributes",
    "https://github.com/vakila/dunders"
  ],
  "speakers": [
    "Anjana Vakil"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/WKu7T976WkA/maxresdefault.jpg",
  "title": "Using and abusing Python’s double-underscore methods and attributes",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WKu7T976WkA"
    }
  ]
}
