{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Daniel Pope - Pygame Zero\n[EuroPython 2016]\n[18 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/pygame-zero)\n\nPygame Zero is a new game engine for education, built on top of\nPygame. It makes writing your first games extremely simple, while\nsaving beginners from certain potential pitfalls. Daniel will\nintroduce Pygame Zero, walk through creating a simple game, and\ndiscuss the background for Python in education and the design\nphilosophy behind Pygame Zero.\n\n-----\n\nPygame Zero is a new game engine for education, built on top of\nPygame. It makes writing your first games extremely simple, while\nsaving beginners from certain potential pitfalls. This talk will\nintroduce Pygame Zero, walk through creating a simple game, and\ndiscuss the background for Python in education and the design\nphilosophy behind Pygame Zero.\n\nPygame is a powerful set of libraries for graphics, sound, input and\nmore. But it is just a library: each program needs to import and set\nup the libraries, implement a game loop and load resources among\nnumerous other concerns. While seasoned Pythonistas have no trouble\nwith this, teachers told us that they found it difficult to teach with\nPygame. There is simply too much boilerplate involved, and getting\nstudents to reproduce the boilerplate perfectly before useful lessons\ncan begin takes too much time out of a 40-minute lesson.\n\nPygame Zero is simple enough that a lesson can be broken down into\nbitesize steps where meaningful progress can be made with just a\ncouple of lines of code at a time.",
  "duration": 1438,
  "language": "eng",
  "recorded": "2016-07-28",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/pygame-zero"
  ],
  "speakers": [
    "Daniel Pope"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Pzs-c-B3RiM/maxresdefault.jpg",
  "title": "Pygame Zero",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Pzs-c-B3RiM"
    }
  ]
}
