{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Guillem Duran - Interactive data Kung Fu with Shaolin\n[EuroPython 2016]\n[18 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/interactive-data-kung-fu-with-shaolin)\n\n“Notebooks come alive when interactive widgets are used”, but\nprogramming complex applications that rely entirely on widgets may end\nup being a painful and frustrating process. Shaolin is a new python\nproject that aims to provide a framework for building interactive\ncomplex dashboards.\n\n-----\n\nYou can read in The Project Jupyter web page that “Notebooks come\nalive when interactive widgets are used”, but programming complex\napplications that rely entirely on widgets may end up being a painful\nand frustrating process. Shaolin is a new python project that aims to\nprovide a framework for building interactive complex dashboards.\n\nShaolin provides all the basic tools for building complex interactive\ndata analysis applications using the pydata ecosystem. Arbitrary code\ncan be embedded into a Dashboard -a class that works as a “black box”\nthat allows to easily define a GUI based on the ipywidgets package- to\nprocess any data in any form and then let you interactively define how\nto plot it using automatically generated widgets. Hierarchical\ncombinations of Dashboards can be arranged then to build more complex\napplications.\n\nThe talk is divided in two sections. First one introduce the framework\nand its main features:\n\n- Custom syntax for defining widgets in a simplified way.\n- Dashboards: Syntax rules and capabilities.\n- Combining Dashboards to build complex applications.\n- Interactive plot creation.\n- Integration with pydata.\n\nSecond section will show how this framework can be used to analyse\nreal data using Dashboards without writing any code. I will show how\nto transform market data time series into graphs using pandas and\nnetworkx, then plot it interactively using bokeh and Vpython.",
  "duration": 1857,
  "language": "eng",
  "recorded": "2016-08-05",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/interactive-data-kung-fu-with-shaolin"
  ],
  "speakers": [
    "Guillem Duran"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/hnp-bvizDOA/maxresdefault.jpg",
  "title": "Interactive data Kung Fu with Shaolin",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hnp-bvizDOA"
    }
  ]
}