{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Helen Sherwood-Taylor - Managing Mocks\n[EuroPython 2016]\n[21 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/managing-mocks)\n\nMocking is a valuable technique for writing tests but mocking\neffectively is often a stumbling block for many developers and can\nraise questions about its overall value as a technique.\n\nThere will be a brief introduction to mocking, then a look at features\nand techniques of Python’s unittest.mock library and cover some useful\ntips and common scenarios, so this will be useful to those who have\nsome experience mocking but would like to do so more effectively.\n\n-----\n\nMocking is a valuable technique for writing tests but mocking\neffectively is often a stumbling block for many developers and can\nraise questions about its overall value as a technique.\n\nThe audience will have some familiarity with unit testing and may have\ntried mocking before, but some introduction will be provided for those\nwho haven’t. We will look at some features and techniques of Python’s\nunittest.mock library and cover some useful tips and common scenarios,\nso this will be useful to those who have some experience mocking but\nwould like to do so more effectively.\n\nSummary of proposed content:\n\n1. A short introduction to what mocking is and why it is useful.\n2. Tour of Python’s mock library and how to make the most of it     * Creating and manipulating Mock objects     * Setting up return values and side effects to control test environment     * Inspecting mocks - different ways to examine a mock object and\nfind out what happened during the test     * How and where to patch\n3. Common mocking situations - scenarios where mocking is particularly\nuseful and/or tricky to get right. For example - date/time,\nfilesystem, read only properties\n4. Some discussion of when mocking is and isn't helpful.\n\nFocus will be mainly on Python's unittest.mock module but we will also\nhave a brief look at some other useful libraries.",
  "duration": 1517,
  "language": "eng",
  "recorded": "2016-08-04",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/managing-mocks"
  ],
  "speakers": [
    "Helen Sherwood-Taylor"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Ahnw72diels/maxresdefault.jpg",
  "title": "Managing Mocks",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ahnw72diels"
    }
  ]
}