{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Iwan Vosloo - What's the point of Object Orientation?\n[EuroPython 2016]\n[21 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/whats-the-point-of-object-orientation)\n\nThis talk covers the basics of what Object Orientation (OO) is really\nabout. It focusses on the problem OO is aimed at solving and shows\nwhere the OO mechanisms of Python fit into this picture. This material\ncan serve as an introduction to OO for beginners, but also as a homing\nsignal for experienced programmers who are doubting whether they are\nreaping the benefits OO promises.\n\n-----\n\nObject Orientation (OO) is often introduced in terms of how it is\nimplemented by a specific language. However, understanding the theory\nunderlying OO is not quite the same as understanding how OO concepts\nare supported by a particular language. It is insightful to understand\nthe simple OO fundamentals and how these map to the particular\nimplementation provided by Python.\n\nIn this talk I will first explain the very basics of OO from a\nlanguage-neutral point of view with the aim of showing what OO can\noffer you and to give a glimpse of the simple mathematical theory\nunderlying OO. I hope to give you enough information to help you\ndistinguish between better and worse designs and to detect whether\nyou’re using OO as it was intended. I will also very briefly show how\nthese fundamentals map to Python.\n\nThis talk is for anyone: whether you’re new at Object Orientation, or\na practitioner wondering whether OO is worth the effort you’ve spent\ntrying to use it.",
  "duration": 2293,
  "language": "eng",
  "recorded": "2016-08-04",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/whats-the-point-of-object-orientation"
  ],
  "speakers": [
    "Iwan Vosloo"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/M179-VQ2kxI/maxresdefault.jpg",
  "title": "What's the point of Object Orientation? - EuroPython 2016",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=M179-VQ2kxI"
    }
  ]
}
