{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Jose Manuel Ortega - Ethical hacking with Python tools\n[EuroPython 2016]\n[21 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/ethical-hacking-with-python-tools)\n\nPython, as well as offering an ecosystem of tools for testing security\nand application pentesting.Python offers a tool ecosystem for\ndeveloping our own tools security for testing applications and the\nservers security,identifying information about servers and potential\nvulnerabilities.\n\nThe ultimate objective is show a pentesting tool integrating some of\nthe modules commented and try a demo showing info about our domain\ntarget and find vulnerabilities in it,\n\n-----\n\nNowdays, Python is the language more used for developing tools within\nthe field of security. Many of the tools can be found today as port\nscanner, vulnerability analysis, brute force attacks and hacking of\npasswords are written in python. The goal of the talk would show the\ntools available within the Python API and third-party modules  for\ndeveloping our own pentesting and security tools and finally show a\npentesting tool integrating some of the modules.\n\nThe main topics of the talk could include:\n\n**1.Enter Python language as platform for developing security tools**\n\nIntroduction about the main libraries we can use for introducing in\ndevelopment of security    tools such as socket and requests.\n\n**2.Libraries for obtain servers information such as Shodan,\npygeocoder,pythonwhois**\n\nShodan is a search engine that lets you find specific computers\n(routers, servers, etc.) and get information about ports and services\nthat are opened.\n\n**3.Analysis and metadata extraction in Python for images and documents**\n\nShow tools for scraping web data and obtain metadata information  in\ndocuments and images\n\n**4.Port scanning with tools like python-nmap**\n\nWith python-nmap module we can check ports open for a target ip or domain.\n\n**5.Check vulnerabilities in FTP and SSH servers**\n\nWith libraries like ftplib and paramiko we can check if the server is\nvulnerable to ftp and ssh anonymous connections.",
  "duration": 2410,
  "language": "eng",
  "recorded": "2016-08-04",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/ethical-hacking-with-python-tools"
  ],
  "speakers": [
    "Jose Manuel Ortega"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/sC9N16E0a2E/maxresdefault.jpg",
  "title": "Ethical hacking with Python tools",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sC9N16E0a2E"
    }
  ]
}