{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Juan Manuel Santos - Salting things up in the DevOps' World: things just got real\n[EuroPython 2016]\n[19 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/salting-things-up-in-the-devops-world-things-just-got-real)\n\nSaltStack is a thriving configuration management system written in\nPython that leverages YAML and Jinja2 which, by now, probably needs no\nintroduction. This talk will explore Salt beyond the minimum required\nsetup, targeting developers/sysadmins already using Salt, and those\nconsidering making the switch from other systems but wishing to dive\ndeeper first. Attendees should be familiar with configuration\nmanagement systems and practices, and comfortable using and reading\nYAML and Jinja syntax.\n\n-----\n\nThere is much more to Salt than the basics. This talk will go beyond\nthe minimum required setup and will take a look at Salt under the\nhood, which will appeal not only to system administrators, but will\nalso be more interesting to developers and to the DevOps community in\ngeneral as the talk progresses. Topics include:\n\n* Introduction and basics review (master/minions, matching, grains, pillar)\n* Salt Mine\n* Syndic node\n* State modules vs. runner modules\n* The Reactor\n* The Event System\n* Salt Beacons\n* Salt API\n\nAttendees should be familiar with configuration management systems and\npractices, and also feel comfortable using and reading YAML and Jinja\nsyntax. This talk is targeted to developers or sysadmins already using\nSalt, and to those who are considering switching to it from other\nsystems but wish to dive deeper before making that decision. After the\ntalk, attendees will have a better grasp of the more advanced\npossibilities that Salt brings, and be ready to apply them to their\nuse cases.",
  "duration": 2538,
  "language": "eng",
  "recorded": "2016-07-31",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/salting-things-up-in-the-devops-world-things-just-got-real"
  ],
  "speakers": [
    "Juan Manuel Santos"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/srx6SvSw2us/maxresdefault.jpg",
  "title": "Salting things up in the DevOps' World: things just got real",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=srx6SvSw2us"
    }
  ]
}
