{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Kali Kaneko - Against the silos: usable encrypted email & the quest for privacy-aware services\n[EuroPython 2016]\n[20 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/against-the-silos-usable-encrypted-email-the-quest-for-privacy-aware-services)\n\nAt the LEAP Encryption Access Project we aim to make secure\ncommunications both easy to use and easy to provide.\n\nWe bring some tales (and some, hopefully, tools) from the quest for\nuser-friendly crypto software. How to make people love the email\nexperience in the 21st century, without risking their privacy. How to\nencrypt data locally, sync it to servers that you can lose, and still\nbe sexy.\n\n-----\n\nTechnologies that allow for privacy in the communications, allowing\nthe escape from the pervasive massive surveillance, have been there\nfor some years now, but yet its use by the general public is far from\nwidespread. The challenge, in our view, can be defined by one of\nmaking usable crypto. Usable for the end user, usable for the sysadmin\nand for the fellow application developer. In the quest for massive\nadoption of encryption technologies, we've been forging several python\npackages to solve different problems, always standing in the shoulders\nof giants.\nWe bring some tales from the trenches to share, from our humble\nexperience trying to deploy clients and servers to provide Secured\nEncrypted Internet Tunnels and Encrypted Email. This includes\ninteresting challenges dealing with key management, automatic and\nsecure software updates, and processing of email while using stock\ncloud providers, while still being resistant to hostile environments.\nWe'll show a webmail email user agent based on this architecture, a\npromising future for decentralization and privacy.\nWe'll also talk about how to store locally encrypted data, and will\npresent Soledad (Synchronization of Locally Encrypted Data Across\nDevices). Soledad is a library with server and client components that\nallows the development of different applications based on client-side,\nend-to-end and cloud-syncable encryption of private data. We'll play\nwith some toy apps to showcase its features and potential.",
  "duration": 2695,
  "language": "eng",
  "recorded": "2016-08-01",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/against-the-silos-usable-encrypted-email-the-quest-for-privacy-aware-services"
  ],
  "speakers": [
    "Kali Kaneko"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/F7_NWyOmMb8/maxresdefault.jpg",
  "title": "Against the silos: usable encrypted email & the quest for privacy-aware services",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=F7_NWyOmMb8"
    }
  ]
}
