{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "L. Ozaeta - Endor, ipuinak kontatzen zituen Nao robota.\n[EuroPython 2016]\n[20 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/endor-ipuinak-kontatzen-zituen-nao-robota)\n\nAurkezpen honetan Nao robotaren Choreographe programazio ingurumenaren\nsarrera bat egiten da, pythonek errobotikan duen erabilpena erakutsiz.\nAurkezpen guztia aurkezleak orain arte egindako lanean oinarritzen da.\nLehenik eta behin, programa baten estruktura erakutsiko da. Ondoren,\nliburutegi bat nola gehitu erakutsiko da, liburutegiaren instalazioak\nekar ditzakeen arazoak aztertuz. Azkenik, Naoaren gorputz jarreran\nzein diskurtsoaren naturaltasunean egindako aurrerapenak azalduko\ndira.\n\n-----\n\nHonekin lortu nahi diren helburuak honako hauek dira:\n- Choreographeko proiektu baten estruktura ezagutzea.\n- Nao robot baten oinarrizko programa bat ikustea.\n- Chorepgraphek ematen dituen programazio blokeak eraldatzen jakitea,\npython erabiliz.\n- Choreographen eskaintzen diren tresnen bitartez, programan python\nliburutegi bat gehitzen ikastea.\nAurkezpen hau ulertzeko ez dago eskakizunik. Python pixka bat dakien\nedonork (“hello world” bat egiten jakitearekin balio du) ulertzeko\nmailan emango da eta ez da konplexutasun tekniko handiko azalpenik\nemango. Printzipioz python ezagutzen ez duen edonor ere aurkezpen ia\nosoa ulertzeko gai izango da, programazio ingurumen bezala ez baita\nkodean gehiegi sartzen, pythonekin hasteko aukera ona izanez.",
  "duration": 1810,
  "language": "eng",
  "recorded": "2016-08-05",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/endor-ipuinak-kontatzen-zituen-nao-robota"
  ],
  "speakers": [
    "L. Ozaeta"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/llN1L0TA9aU/maxresdefault.jpg",
  "title": "Endor, ipuinak kontatzen zituen Nao robota.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=llN1L0TA9aU"
    }
  ]
}