{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Liana Bakradze - Learn Python The Fun Way\n[EuroPython 2016]\n[18 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/learn-python-the-fun-way)\n\nProgramming is one of the most important 21st-century skills and tons\nof different online and offline resources can help you to master it.\n\nOn the other hand, playing games is really effective way for us to\nlearn and it's also the most fun.\n\nBut is it possible to learn real programming language like Python by\nplaying a game?\n\nIn this talk I'll show you some projects that allow you to achieve\nthat. I also want to inspire you to help such projects and to suggest\nideas how to do that.\n\n-----\n\nProgramming is one of the most important 21st-century skills. It\ndoesn't only provide promising career opportunities but teaches how to\nreason logically, systematically and creatively.\n\nCode readability, rich standard library, straightforward syntax and\nother features make Python a great language for teaching beginners how\nto program. Python community is very supportive and friendly to\nnewcomers and does awesome work to make Python available to everyone.\nTons of different online and offline resources can help you to master\nPython programming. Problem solving is the classical way of learning\nhow to code. But it can be boring for some people, especially for\nkids.\n\nOn the other hand, playing games is really effective way for us to\nlearn and it's also the most fun. You can find different games\ndesigned to teach basics of programming, but most of them use special\nvisual environments and don't teach real text based languages.\n\nBut is it possible to learn programming language like Python by playing a game?\n\nIn this talk I'll show you a few projects for different age and levels\nthat allow you to achieve that. I'll pay attention on methods that are\nused to teach programming.\n\nI also want to inspire you to help such projects and to suggest ideas\nhow to do that.",
  "duration": 1084,
  "language": "eng",
  "recorded": "2016-07-28",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/learn-python-the-fun-way"
  ],
  "speakers": [
    "Liana Bakradze"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/_KkPcHKbE4I/maxresdefault.jpg",
  "title": "Learn Python The Fun Way",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_KkPcHKbE4I"
    }
  ]
}