{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Maciej Dziergwa - The Journey from Python Developer to Python Company Owner\n[EuroPython 2016]\n[18 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/the-journey-from-python-developer-to-python-company-owner)\n\nI would like to indicate main keys to success, factors and features\nthat help a developer to find himself on an independent career path.\nHow to create employee-friendly work environment for Python developers?\nWhich business model gives a chance to attract and keep more than 100\nPython enthusiast?\nI will also gladly share some lessons learned working with dozens of\nclients, dozens of Python frameworks, and lots, lots of great\ndevelopers.\n\n-----\n\nTen years ago I became a big Python fan, but at the time there were no\njobs for Python developers in Poland. So, I decided to start my own\nPython company. Today, ten years later, this company employs more than\n100 Python Developers in four cities.\n\nThere are a lot of Python enthusiasts in the world, many of them more\nskilled than I was at that time, but clearly not anyone can become a\n„Python Business Developer”. In this talk I would like to indicate\nmain keys to success, factors and features that help a developer to\nfind himself on an independent career path.\n\nMy goal is to answear these questions:\n\nHow to create employee-friendly work environment for Python developers?\n\nWhich business model gives a chance to attract and keep more than 100\nPython enthusiast?\n\nI will also gladly share some lessons learned while working with\ndozens of clients, dozens of Python frameworks, and lots, lots of\ngreat developers.",
  "duration": 2253,
  "language": "eng",
  "recorded": "2016-07-28",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/the-journey-from-python-developer-to-python-company-owner"
  ],
  "speakers": [
    "Maciej Dziergwa"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/DSXkazo_Tn4/maxresdefault.jpg",
  "title": "The Journey from Python Developer to Python Company Owner",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DSXkazo_Tn4"
    }
  ]
}
