{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Malwina Nowakowska - RESTful API - Best Practices.\n[EuroPython 2016]\n[22 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/restful-api-best-practises)\n\nIt is important to understand from the beginning how model API should look like.\nDo not repeat your friends’ mistakes and make developers upset!\nThere are some simple rules that can make your API cooler - clean,\nsafe and efficient.\n\nBased on both bad and good examples of REST APIs (I had to deal with)\nwe will learn about best practices.\n\n-----\n\nNowadays building and integrating with Representational State Transfer\nweb services is a very common thing. It seems that creating RESTful\nAPI is trivial - nothing could be more wrong.\nIn my previous projects I had to integrate with lots of APIs.\nUnfortunately only some of them were easy to work with. Most of the\nAPIs did not follow the main rules of model API.\n\nIt is really important to understand how model REST API should look like.\nTo make developers happy we will learn best practices of creating REST\nAPI from the beginning.\n\nWe will start with quick introduction what REST is, why principle of\nREST is so amazing, talk about identifires and explain some key terms.\nWe will discuss about architectall constraints and properties.\n\nMistakes and best practices are based on my experience of developing\nand maintaining the projects. After this talk you will be able to\ncreate model RESTful API developers will be happy to work with.",
  "duration": 1400,
  "language": "eng",
  "recorded": "2016-08-05",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/restful-api-best-practises"
  ],
  "speakers": [
    "Malwina Nowakowska"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/LAxOj0mtq6I/maxresdefault.jpg",
  "title": "RESTful API - Best Practices.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LAxOj0mtq6I"
    }
  ]
}
