{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Manuel Miranda - Where is the bottleneck?\n[EuroPython 2016]\n[18 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/where-is-the-bottleneck)\n\nWe all know Python strength does not rely on its performance and speed\nwhen running programs. This plus the flexibility of it, can lead to\nbuild real slow and bad quality software.\n\nIn this talk you will discover a set of useful tools for diagnosing\nwhere the bottleneck is in your programs along with trips for quickly\nrealizing which is the most needed resource.\n\n-----\n\nHave you ever felt like your software is eating your resources and you\nhave no clue why? Have you reviewed all the lines, debugged and\nprinted everything but you still don't know what's wrong?\n\nIn this talk I will conduct a fast intro of a basic set of tools you\ncan use to diagnose your software's performance and then we will go\nthrough a simple piece of code to show how those tools work and what\nyou can expect from them\n\nThis set of tools will include basic ones given by the OS itself like\n`htop`, `lsof`, `ps` and more advanced ones that let you plot the\nmemory usage for given functions like `memory_profiler`, check CPU\nusage and the call graph between functions like `cprofile` and\n`kcachegrind` and others.\n\nBy the end of the talk, you should have an idea of which are the most\ntypical causes that can make your program slow and you will have a\nlist of tools to search for and identify the source of the problems.",
  "duration": 2328,
  "language": "eng",
  "recorded": "2016-07-28",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/where-is-the-bottleneck"
  ],
  "speakers": [
    "Manuel Miranda"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/qKdxOdT4c1U/maxresdefault.jpg",
  "title": "Where is the bottleneck?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qKdxOdT4c1U"
    }
  ]
}
