{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Marc-André Lemburg - So you think your Python startup is worth $10 million...\n[EuroPython 2016]\n[19 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/so-you-think-your-startup-is-worth-10-million)\n\nThis talk is based on a recent consulting project the speaker ran to\nsupport the valuation of a Python startup company in the due diligence\nphase.\n\nBy following some of the advice from this talk, you should be possible\nto improve the valuation of your Python startup or consulting business\nin preparation for investment rounds or an acquisition.\n\n-----\n\nThis talk is based on the speaker's experience running a Python\nfocused software company for more than 15 years and a recent\nconsulting project to support the valuation of a Python startup\ncompany in the due diligence phase.\n\nFor the valuation we had to come up with metrics, a catalog of\ncriteria analyzing risks, potential and benefits of the startup's\nsolution, as well as an estimate for how much effort it would take to\nreimplement the solution from scratch.\n\nIn the talk, I am going to show the metrics we used, how they can be\napplied to Python code, the importance of addressing risk factors,\nwell designed code and data(base) structures.\n\nBy following some of the advice from this talk, you should be able to\nimprove the valuation of your startup or consulting business in\npreparation for investment rounds or an acquisition.",
  "duration": 1817,
  "language": "eng",
  "recorded": "2016-07-31",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/so-you-think-your-startup-is-worth-10-million"
  ],
  "speakers": [
    "Marc-André Lemburg"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/nIoE3KJxK6U/maxresdefault.jpg",
  "title": "So you think your Python startup is worth $10 million...",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nIoE3KJxK6U"
    }
  ]
}
