{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Mariano Anaya - Clean code in Python\n[EuroPython 2016]\n[20 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/clean-code-in-python)\n\nIntroduction to the clean code principles applied to Python code.\nLet's honor the readable nature of the Python syntax so anyone can\nmaintain our code: \"readability counts\".\n\nThis talk introduces general concepts of code quality and how they\napply for Python. We analyse technical debt, refactoring, and unit\ntesting in the context of a project striving for a better code base.\n\n-----\n\nIntroduction to the clean code principles tailored for Python\nprojects. The goal is to achieve better code quality and a more\nmaintainable code base. Python has a nature of being clear, and easy\nto follow, so let's take advantage of it in our own code, in order to\nenforce the principle \"readability counts\" by writing pythonic code.\n\nThis talk introduces general concepts of code quality for Python\ndevelopers, analyzing technical debt, with examples on how to achieve\na more legible, maintainable and clean code base, by refactoring,\nwriting unit tests and having good coding guidelines for the project.\nIf you are giving your first steps with Python, you will gain insight\non best practices for writing good software from the start. If you are\na experienced developer, the ideas should work as food for thought,\nhelping with recommendations for code reviews, best practices, etc.",
  "duration": 1304,
  "language": "eng",
  "recorded": "2016-08-05",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/clean-code-in-python"
  ],
  "speakers": [
    "Mariano Anaya"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/7ADbOHW1dTA/maxresdefault.jpg",
  "title": "Clean code in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7ADbOHW1dTA"
    }
  ]
}
