{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Miguel Cabrera - Things I wish I knew before starting using Python for Data Processing\n[EuroPython 2016]\n[20 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/things-i-wish-i-knew-before-starting-using-python-for-data-processing)\n\nIn recent years one of the ways people get introduced into Python is\nthrough its scientific stack. Although this is not bad, it may lead to\nlearn solely one aspect of the language, while overlooking other\nidioms and functionality included in Python as well as some basic\nsoftware development good practices. I will share some useful tricks,\ntools and techniques and software design and development principles\nthat I find beneficial when working on a data processing / science\nproject.\n\n-----\n\nIn recent years of the ways people get introduced into Python is\nthrough its scientific stack. Most people  that learned Python this\nway are not trained software developers and many times it is the first\ncontact with a  programming language.\nAlthough this is not bad, it may lead to learn solely one aspect of\nthe language while overlooking other idioms, standard and common\nlibraries included in Python as well as some basic software\ndevelopment good practices. This may become a problem when a data\nscience project is moved from an experimentation phase to an\nintegration with technical environment.\n\nIn this talk I share some useful tricks, tools and techniques and as\nwell as some software design and development principles that I find\nbeneficial when working on a data processing / science project.\n\nThe talk is divided into two parts,  one  is Python centered, where I\nwill talk about some powerful Python construct that are useful in data\nprocessing tasks. This include some parts  collections module,\ngenerators and iterators among others.  The other I will describe some\ngeneral software development concepts including SOLID, DRY, and KISS\nthat are important to understand the rationale behind software design\ndecisions.",
  "duration": 1997,
  "language": "eng",
  "recorded": "2016-08-01",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/things-i-wish-i-knew-before-starting-using-python-for-data-processing"
  ],
  "speakers": [
    "Miguel Cabrera"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/KBcfWqNCvmA/maxresdefault.jpg",
  "title": "Things I wish I knew before starting using Python for Data Processing",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KBcfWqNCvmA"
    }
  ]
}