{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Naomi Ceder - Come for the Language, Stay for the Community\n[EuroPython 2016]\n[21 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/keynote-stay-for-the-community)\n\nWhile Python the language is wonderful, the Python community and the\npersonal, social, and professional benefits that flow from involvement\nin a community like ours are often more compelling.\n\nLearn about the goals of the Python Software Foundation and how\neveryone can take part to help build even better Python communities\nlocally, regionally, and globally.  I will also discuss some of our\nstrengths as a community, and also look at some of the challenges we\nface going forward.\n\n-----\n\nPython is a powerful and flexible tool that many of us love and use in\nmany ways. And yet, as wonderful as  the language is, many would say\nthat the community is even more attractive. This talk will focus on\ninvolvement in the Python community and what that means - in\nparticular the many personal, social, and professional benefits that\nflow from involvement in a community like ours.\n\nI will also discuss what the Python Software Foundation does, what its\ngoals and purpose are, and how everyone in the community can take part\nin the PSF to help build even better Python communities. This will\ninclude specific explanations of the membership model and how active\ncontributors (both in terms of code and community organisation) can\nand should become full voting members of the PSF.\n\nI will also touch on our strengths, like our commitment to safe and\ninclusive spaces and our devotion to education, and also look at some\nof the challenges we face as a community going forward.",
  "duration": 2968,
  "language": "eng",
  "recorded": "2016-08-04",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/keynote-stay-for-the-community"
  ],
  "speakers": [
    "Naomi Ceder"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/cCCiA-IlVco/maxresdefault.jpg",
  "title": "Come for the Language, Stay for the Community",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cCCiA-IlVco"
    }
  ]
}
