{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Olga Lyashevska - How can machine learning help to predict changes in size of Atlantic herring ?\n[EuroPython 2016]\n[22 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/how-can-machine-learning-help-to-predict-changes-in-size-of-atlantic-herring)\n\nThis talk is a case-study of how Python (Pandas, NumPy, SciKit-learn)\ncan be implemented to identify the influence of the potential drivers\nof a decline in size of Atlantic herring populations using Gradient\nBoosting Regression Trees.\n\n-----\n\nA decline in size and weight of Atlantic herring  in the Celtic Sea\nhas been observed since the mid-1980’s.  The cause of the decline\nremains largely unexplained but is likely to be driven by the\ninteractive effect of various endogenous and exogenous factors. The\ngoal of this study is to interrogate a long time-series of biological\ndata obtained from commercial fisheries from 1959 to 2012.  We use\ngradient boosting regression trees to identify important variables\nunderlying changes in growth from various potential drivers, such as:\n- Atlantic multidecadal oscillation;\n- sea surface temperature;\n- salinity;\n- wind;\n- zooplankton abundance;\n- fishing pressure.\nThis learning algorithm allows to quantify the influence of the\npotential drivers of change with the test error lower when compared to\nother supervised learning techniques. The predictor variables\nimportance spectrum (feature importance) helps to identify the\nunderlying patterns and potential tipping points while resolving the\nexternal mechanisms underlying observed changes in size and weight of\nherring.  This analysis is a useful case-study of how Python can be\nimplemented in academia.  The outputs of the analysis are of relevance\nto conservation efforts and sustainable fisheries management which\npromotes species resistance and resilience.",
  "duration": 1300,
  "language": "eng",
  "recorded": "2016-08-05",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/how-can-machine-learning-help-to-predict-changes-in-size-of-atlantic-herring"
  ],
  "speakers": [
    "Olga Lyashevska"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/iGMef0eRrdM/maxresdefault.jpg",
  "title": "How can machine learning help to predict changes in size of Atlantic herring ?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iGMef0eRrdM"
    }
  ]
}