{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Pau Ruŀlan Ferragut - Pytest desde las trincheras\n[EuroPython 2016]\n[19 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/pytest-desde-las-trincheras)\n\nTodo programador tiene interés para que su software sea fiable y\nestable. Haremos una sencilla introducción a pytest con el caso de uso\nde un site internacional para el que generamos cientos de tests y\nredujimos drásticamente los errores en producción. Con este simple\nejemplo demostraremos que no siempre necesitamos hacer TDD para\ndisfrutar de las ventajas de un framework de testing.\n\n-----\n\nLas metodologías de desarrollo que incorporan la escritura de pruebas\ndesde el momento cero tienden a generar código más estable y fiable\npero la realidad es que muchas veces no gozamos del privilegio ni del\npresupuesto para escribir tests para todas las características de\nnuestro producto. Pero si tenemos a nuestra disposición herramientas\nde testing que nos permitan eliminar los errores evitables como romper\nenlaces en la página de inicio nos quitaremos el miedo a hacer pases a\nproducción y generaremos más valor al negocio.\n\nLa charla no tiene pretensión de ser ni una introducción al test\ndriven development ni de las complejidades de qué es un buen o mal\ntest. El objetivo es animar a todo aquel que todavía pruebe sus\nproyectos manualmente a intentar algún grado de automatización. Para\nello la estructura será una presentación de pytest, exponer algunos\nplugins altamente recomendados y centrarse en el caso de uso de una\npágina con presencia en ocho países donde automatizamos un montón de\ncomprobaciones simples que nos permitieron reducir los errores\nevitables.",
  "duration": 1353,
  "language": "spa",
  "recorded": "2016-08-05",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/pytest-desde-las-trincheras"
  ],
  "speakers": [
    "Pau Ruŀlan Ferragut"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/q3549t2EalY/maxresdefault.jpg",
  "title": "Pytest desde las trincheras",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=q3549t2EalY"
    }
  ]
}