{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Rachel Willmer - 20 years without a 'proper job'\n[EuroPython 2016]\n[18 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/keynote-20-years-without-a-proper-job)\n\nHave you ever wondered how you could be your own boss? or how you\ncould make money from your side project? or build the next Facebook or\nUber.\n\nTo be a coder in today's world of work is to have amazing\nopportunities to design the business life you want.\n\nI've enjoyed the last 20 years without a 'real job', as company\nfounder, freelancer and side-project-hacker.\n\nNow I am bootstrapping my current company to profitability. Listen to\nmy stories and learn from my mistakes and successes.\n\n-----\n\nHave you ever wondered how you could be your own boss? If so, then\nthis talk is for you.\n\nMaybe you're working on a sideproject and wonder how you could make\nsome money from it? Or maybe you have the idea for the next Facebook\nor Uber?\n\nTo be a coder in today's world of work is to have amazing\nopportunities to design the business life you want. You can work\nremotely; you can write books, or teach, or consult, with anyone\nanywhere.\n\nYou can have a crazy idea on Friday and have it running by Monday.\nDesign your architecture to use cloud computing, so your tiny team can\nscale up your huge ideas.\n\nOr keep it small, and just earn some extra money with a Wordpress\nplugin, or a training course.\n\nIt has been 21 years since I last had a 'real job' and a regular income.\n\nI survived creating and running a company through the madness of the\ndotcom years.  I made money from sideprojects, that I had started just\nfor fun and for learning.  I have freelanced without needing to use an\nagency to find the work.\n\nAnd now I'm bootstrapping my current business to profitability. Listen\nto my stories and learn from my mistakes and successes.",
  "duration": 2237,
  "language": "eng",
  "recorded": "2016-07-28",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/keynote-20-years-without-a-proper-job"
  ],
  "speakers": [
    "Rachel Willmer"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ZNx6UIdLDLk/hqdefault.jpg",
  "title": "20 years without a 'proper job'",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZNx6UIdLDLk"
    }
  ]
}