{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Ralph Heinkel - The value of mindfulness and how it has arrived at Google\n[EuroPython 2016]\n[22 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/the-value-of-mindfulness-and-how-it-has-arrived-at-google)\n\nMindfulness has proven to be a foundational skill that started as a\npure buddhist practice. Nowadays mindfulness serves as the core\ntechnique of several western programs ranging from  curing stress-\ninduced medical problems to curricula for teaching successful business\nleadership, such as the Search Inside Yourself program developed at\nGoogle.\n\nThe aim of this seminar is to provide a practical experience of\nmindfulness with a short introduction to how it can be applied by\ndigital workers.\n\n-----\n\nMindfulness has proven to be a foundational skill that started as a\npure buddhist practice. Nowadays mindfulness serves as the core\ntechnique of several western programs ranging from  curing stress-\ninduced medical problems to curricula for teaching successful business\nleadership, such as the Search Inside Yourself  (SIY) program\ndeveloped at Google in 2002.\n\nMind is the root of all things. Neuroscience shows that attention is a\nfundamental function of the mind. Being able to direct attention to\nthe present moment - and keep it there while performing daily tasks -\nis a great tool to navigate through life and its  challenges with more\nengagement, more happiness, and more resilience. Focusing attention in\na relaxed way enables us to disconnect from the overall noise found in\na high-speed environment and get things done without feeling too\noverwhelmed by them. But being effective is not only about checking\noff more tasks - it is about how we are in resonance with our\nenvironment, how we interact with others, and how we face the\nincreasing complexity in our professional life.\n\nThe aim of this seminar is to provide a practical experience of\nmindfulness with a short introduction to how it can be applied in a\ntechnology driven world as experience by digital workers.",
  "duration": 1467,
  "language": "eng",
  "recorded": "2016-08-05",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/the-value-of-mindfulness-and-how-it-has-arrived-at-google"
  ],
  "speakers": [
    "Ralph Heinkel"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/8TAJ9ytl9qE/maxresdefault.jpg",
  "title": "The value of mindfulness and how it has arrived at Google",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8TAJ9ytl9qE"
    }
  ]
}