{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Raphael Pierzina - Pytest 3.0\n[EuroPython 2016]\n[21 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/pytest-30)\n\n- New features of pytest's upcoming major version 3.0\n- Breaking changes and other important information\n- Recap of the first developer sprint in June, 2016\n- Thank you notes to all who have contributed to the fundraiser\n\n-----\n\nPytest is a mature testing framework for Python that is developed by a\nthriving and ever-growing community of volunteers. Following the\nprinciple of \"no API is the best API\" it uses plain assert statements\nand regular Python comparisons. Writing tests with pytest requires\nlittle to no boilerplate code and powerful features allow easy\nparametrization and intelligent test selection.\n\nIn this talk we will have an in-depth look at new features of pytest\n3.0 and live demo possible use cases. We will also learn about\nimportant bugfixes and other enhancements of the upcoming major\nrelease. Backwards-incompatible changes will be addressed and changes\nmade to the documentation will be highlighted.\n\nIf you are already familiar with pytest, you will be happy to hear\nabout significant improvements of the fixture and hook system but also\nwhat's in store for a better integration with tox, an important tool\nthat allows testing across different Python versions.\n\nIn June, 2016 more than 25 Pythonistas from around the globe gather in\nFreiburg, Germany to work on the release and set the path for future\ndevelopments of the core framework. This is a big step forward for the\nproject made posssible by a fundraiser that reached 108% of it's\ninitial goal.\n\nI will share our experiences from the developer sprint while they are\nstill fresh and explain why these events are incredibly important for\na community and give advice on how to organize your own.",
  "duration": 2101,
  "language": "eng",
  "recorded": "2016-08-04",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/pytest-30"
  ],
  "speakers": [
    "Raphael Pierzina"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/HPUg31eylds/maxresdefault.jpg",
  "title": "Pytest 3.0",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HPUg31eylds"
    }
  ]
}
