{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Sławomir Piasecki - Python in Astronomy\n[EuroPython 2016]\n[21 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/python-in-astronomy)\n\nI would like to talk about modern Astronomy where I would give a brief\nhistory of Astronomy. I will answer some question:\nWhat do we use computers for today in astronomy?\nWhere is Python’s place in today’s science?\nIs Python is the best language for scientific computation?\nI would like to give a short introduction into AstroPy module. Finally\nI would like presents some result of my research where Python was used\nto create data.\n\n-----\n\nFor ages people have been watching the sky, and tried to learn\nsomething about all those mysterious lights. In ancient times,\nscientist used mostly their naked eyes to watch what happened in the\nnight sky. Astronomy is one of the oldest fields in science.\nEverything changed when Galileo invented his lunette. Thanks to thi,\nwe were able to proof Copernicus’ new model of the solar system with\nthe sun in the center.\n\nThe next big step in Astronomy was using computers. Where there are\ncomputers and Astronomy, there is a place for programming. For many\nyears astronomers were mostly using Fortran and C/C++. Both are suited\nto numeric computation and scientific computing. Since they are\nstructured programming language, that makes them very valuable for\nscience.\n\nOver the past decade, Python has started to be used by more and more\npeople in astronomy. But is there a place in Astronomy for Python, as\nit is not as fast as Fortran or C/C++? In Python there is a module\ncalled AstroPy which helps astronomers in their work.\n\nMatPlotLib is one of the most popular library use in astronomy. This\ntool helps created very sophisticated plots and graphs.\n\nFinally I would like talk about some research I did using Python. For\nresearch, we decided to use AUTO. It is a hybrid of Fortran and\nPython, to compute bifurcation points in mathematical models. In\nPython we introduce mathematical model, ODE and initial parameters.\nFortran does all the computation.",
  "duration": 2115,
  "language": "eng",
  "recorded": "2016-08-04",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/python-in-astronomy"
  ],
  "speakers": [
    "Sławomir Piasecki"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/TU5DvG7Fl04/maxresdefault.jpg",
  "title": "Python in Astronomy",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TU5DvG7Fl04"
    }
  ]
}
