{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Scott Reeve - Keeping the Lights on with Python\n[EuroPython 2016]\n[19 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/keeping-the-lights-on-with-python)\n\nWe are using Python to help the National Grid in the UK to balance\nelectricity production and usage. We do this by installing Python\npowered devices at customers sites that allow us to monitor and set\ncontrol criteria to automatically turn on and off power consuming and\nproducing devices when there is a mismatch between electricity supply\nand demand.\nIn this talk we will be talking about how and why we have used Python,\nas well as where in our system we would like to use Python.\n\n-----\n\nWe are using Python to help the National Grid in the UK to balance\nelectricity production and usage. We do this by installing Python\npowered devices at customers sites that allow us to monitor and set\ncontrol criteria to automatically turn on and off power consuming and\nproducing devices when there is a mismatch between electricity supply\nand demand. These devices talk to our Python powered cloud based\nsystem using the 3g network, giving us near real-time monitoring of\nour customers assets.\nOur entire infrastructure is written in Python, from our billing\nsystems, data analytics systems and customer portal all the way\nthrough to our on site industrial system interfaces. In this talk we\nwill be talking about how and why we have used Python, where we have\nhad problems, as well as where in our system we would like to use\nPython and why we cannot.  We will also be talking about what we are\ngoing to do next, moving our system from near real time monitoring to\nnear real-time control, using Python for both system modelling and\ncontrol. We will discuss how we are using Python to creating a system\nthat monitors the balance between electricity supply and demand many\ntimes per second and is able to provide a corrective control based on\nthe sum of the output of a dynamic set of our customer sites and the\nchallenges that presents.",
  "duration": 1131,
  "language": "eng",
  "recorded": "2016-08-05",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/keeping-the-lights-on-with-python"
  ],
  "speakers": [
    "Scott Reeve"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/evRKI0Y890Y/maxresdefault.jpg",
  "title": "Keeping the Lights on with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=evRKI0Y890Y"
    }
  ]
}