{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Scott Triglia - Protect your users with Circuit Breakers\n[EuroPython 2016]\n[19 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/protect-your-users-with-circuit-breakers)\n\nFailures are the bane of scaling a modern web service and can cause\nserious pain for end users! Lucky for us, there are techniques that\ncan help protect your product and handle failures in subsystems\ngracefully. This talk will dive into one of these in depth, the\nCircuit Breaker pattern, and explore the options it gives us for\nkeeping all our users safe. We will be focusing on several real-world\nproblems and options for how to implement your circuit breaker setup\nin nice, readable python code.\n\n-----\n\nThe inevitability of failures is the bane of scaling any modern web\nservice and can cause serious pain for end users! Lucky for us, there\nare techniques that can help protect your product handle failures in\nsubsystems gracefully. This talk will dive into one of these in depth,\nthe Circuit Breaker pattern, and explore the options it gives us for\nkeeping our users safe.\n\nWe will be focusing on several real-world problems and how they can be\naddressed by circuit breakers. You should expect to leave the talk\nwith details on simple circuit breakers as well as understanding how\nthey can be adapted for more complex situations. We’ll also discuss\nsome options for how to implement your circuit breaker in readable\npython.\n\n\n**Contrived FAQ time!**\n\n**I don’t know what Circuit Breakers are, should I come?**\nDefinitely! We’re going to start from scratch and work our way up.\nOnly requirement is basic familiarity with backend services receiving\nand making HTTP requests.\n\n**I totally know what Circuit Breakers are, should I come?**\nDefinitely! After the intro, the main meat of the talk will be working\nthrough a series of more advanced situations and talking about how we\ncan alter the basic circuit breaker setup to address them.\n\n**I want real-world advice, not made up hypotheticals!**\nWell that’s not really a question, but you’ll be happy to know that\nthe examples we’ll discuss come straight from my experience at Yelp.\nThey should be very realistic and broadly applicable.",
  "duration": 1637,
  "language": "eng",
  "recorded": "2016-07-31",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/protect-your-users-with-circuit-breakers"
  ],
  "speakers": [
    "Scott Triglia"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/vdS88uyGayM/maxresdefault.jpg",
  "title": "Protect your users with Circuit Breakers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vdS88uyGayM"
    }
  ]
}
