{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Stephan Jaensch - Building Service interfaces with OpenAPI / Swagger\n[EuroPython 2016]\n[20 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/building-service-interfaces-using-OpenAPI)\n\nEver wondered how to keep track of all of your services and their\nAPIs? I'm going to explore how to build your Python services with\nOpenAPI/Swagger and how it helps you solve problems like communication\nbetween services, request and response validation, and documentation\nof your API. I'll also discuss some challenges you might face when\nrunning Swagger in production, gathered from over a year of heavy\nusage at Yelp.\n\n-----\n\nImplementing a service-oriented architecture (SOA) is a proven way to\nsplit up large monolithic codebases and to scale development when your\norganization grows to hundreds or thousands of engineers. I'm going to\nexplore how to build and document your services with OpenAPI (formerly\nknown as Swagger). I’ll discuss the benefits, how to generate a\nbeautiful HTML documentation for your API, and how you can\neffortlessly make calls to your services. In the second part of the\ntalk I'll discuss and tell you how to overcome challenges you might\nface when running OpenAPI in production, gathered from over a year of\nheavy usage at Yelp for hundreds of services.\n\nThe OpenAPI initiative is a cross-vendor consortium focused on\ncreating, evolving and promoting a vendor neutral description format.\nAs an open governance structure under the Linux Foundation, its\nmembers include Google, IBM, Atlassian and PayPal.",
  "duration": 2592,
  "language": "eng",
  "recorded": "2016-08-05",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/building-service-interfaces-using-OpenAPI"
  ],
  "speakers": [
    "Stephan Jaensch"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/QWF3GNWV4_w/maxresdefault.jpg",
  "title": "Building Service interfaces with OpenAPI / Swagger",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QWF3GNWV4_w"
    }
  ]
}
