{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Stephane Wirtel - Exploring our Python Interpreter\n[EuroPython 2016]\n[19 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/exploring-our-python-interpreter)\n\nDuring the last CPython sprints at PyCon US (Montreal), I started to\ncontribute to the CPython project and I\nwanted to understand the beast.\nIn this case, there is only one solution, trace the code from the beginning.\nFrom the command line to the interpreter, we will take part to an\nadventure. The idea behind is just to show how CPython works for a new\ncontributor.\n\n-----\n\nDuring my last CPython sprint, I started to contribute to the CPython code and I\nwanted to understand the beast.\n\nIn this case, there is only one solution, trace the code from the beginning.\nFrom the command line to the interpreter, we will take part to an adventure\n\n* Overview of the structure of the project and the directories.\n* From the Py_Main function to the interpreter.\n* The used technics for the Lexer, Parser and the generation of the AST and of course of the Bytecodes.\n* We will see some bytecodes with the dis module.\n* How does VM works, it's a stack machine.\n* The interpreter and its main loop of the Virtual Machine.\n\nThe idea behind is just to show how CPython works for a new contributor to\nCPython.\n\nFrom the command line, we will learn that Python is a library and that we can\nembed it in a C project. In fact we will see the Py_Main function to the ceval.c\nfile of the interpreter.\n\nBut there is no magic in the CPython code, we will travel in the lexer and the\nparser of CPython, and why not, by the AST for one Python expression.\n\nAfter the AST, we will visit the Compiler and the Bytecodes for the\ninterpreter.\nOf course, we will learn there is the peepholer where some basic instructions\nare optimised by the this component.\n\nAnd of course, the interpreter, this virtual machine is really interesting for\nthe newbiew, because it's a big stack where the bytecodes are executed one by\none on the stack and the ceval.c file.",
  "duration": 1588,
  "language": "eng",
  "recorded": "2016-07-31",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/exploring-our-python-interpreter"
  ],
  "speakers": [
    "Stephane Wirtel"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/R0lDKw0FQSI/maxresdefault.jpg",
  "title": "Exploring our Python Interpreter",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=R0lDKw0FQSI"
    }
  ]
}