{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Thierry Carrez/Doug Hellmann - How OpenStack makes Python better (and vice-versa)\n[EuroPython 2016]\n[18 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/how-openstack-makes-python-better-and-vice-versa)\n\nOpenStack is an infrastructure stack mostly developed in Python. In\nthis talk, Thierry Carrez and Doug Hellmann, both Python Software\nFoundation fellows and OpenStack Technical Committee members, will\nlook at the symbiotic relationship between OpenStack and Python.\n\n-----\n\nOpenStack is an open source stack that can be deployed on raw\ncomputing resources to privately or publicly present Infrastructure as\na Service. It now consists of more than 4.5 million lines of code, 85%\nof which is Python. In this talk, Thierry Carrez and Doug Hellmann,\nboth Python Software Foundation fellows and OpenStack Technical\nCommittee members, will look at the symbiotic relationship between\nOpenStack and Python.\n\nWe'll go back in history and explain why OpenStack originally picked\nPython as its main language 6 years ago, and explore what does Python\nbring to OpenStack. We'll dive into examples of OpenStack pushing\nPython libraries to their limits and exposing new bugs. We'll look\ninto the massive cloud-based continuous integration system that\nOpenStack uses and explain how it exposes bugs in Python libraries in\nthe minutes after they are published to PyPI. We'll look into Python\nlibraries that were created by the OpenStack community and libraries\nthat the OpenStack community took over. Finally we'll expose a few\nbest practices that Python developers can follow to get the most of\nthis symbiotic relationship.",
  "duration": 2391,
  "language": "eng",
  "recorded": "2016-08-05",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/how-openstack-makes-python-better-and-vice-versa"
  ],
  "speakers": [
    "Thierry Carrez",
    "Doug Hellmann"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/5MaDhl01fpc/maxresdefault.jpg",
  "title": "How OpenStack makes Python better (and vice-versa)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5MaDhl01fpc"
    }
  ]
}