{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Valeria Pettorino - Unveiling the Universe with python\n[EuroPython 2016]\n[21 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/unveiling-the-universe-with-python)\n\nI will describe a scientific application of python in the field of\nAstrophysics and Cosmology. How the publicly available package Monte\nPython is used to compare data from space satellite missions with\ntheoretical models that attempt to describe the evolution and content\nof the Universe. The result is surprising, as it points towards a\nUniverse which is mainly dark.\n\n-----\n\nPython is widely used in Cosmology, which is the study of the Universe\nand all forms of energy in it. A large amount of data has been\nrecently obtained through space satellite missions, such as Planck,\nfinanced by ESA/NASA. Planck has observed the radiation emitted about\n13 billion years ago (the Cosmic Microwave Background, CMB), which\ngives us information on the content and space-time geometry of the\nUniverse. Many competitive theoretical models have been proposed that\naim at describing the evolution of the species contained in the\nUniverse: therefore, cosmologists need a method to identify which\ntheoretical model better fits the data. In order to compare data with\ntheoretical predictions, cosmologists use Bayesian statistics and\nMonte Carlo simulations. Among the tools developed for the analysis,\nthe package ‘Monte Python’ is publicly available and uses python to\nperform Monte Carlo simulations: this allows to determine the\ntheoretical model that maximizes the likelihood to obtain the observed\ndata. Such model is now the standard cosmological model and reveals a\nUniverse that is very different from what scientists had ever\nexpected. A Universe in which the atoms we are made of, constitute\nonly 5% of the total energy budget. The rest is the so-called ‘Dark\nUniverse’.\n\nI will illustrate the story of how cosmologists used python to analyse\nthe data of the CMB and unveil the Dark Universe.",
  "duration": 2463,
  "language": "eng",
  "recorded": "2016-08-04",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/unveiling-the-universe-with-python"
  ],
  "speakers": [
    "Valeria Pettorino"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/1H5uU_lcdWQ/maxresdefault.jpg",
  "title": "Unveiling the Universe with python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1H5uU_lcdWQ"
    }
  ]
}