{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Vincent D. Warmerdam - The Joy of Simulation: for Fun and Profit\n[EuroPython 2016]\n[19 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/the-joy-of-simulation-for-fun-and-profit)\n\nIn this talk discusses some joyful exercises in simulation. I'll\ndemonstrate it's usefulness but moreover I'll discuss the sheer joy.\nI'll discuss how to generate song lyrics, I'll discuss how to get\nbetter at casino games, how to avoid math, how to play monopoly or\neven how to invest in lego minifigures. No maths required; just a\nrandom number generator.\n\n-----\n\nIn this talk discusses some joyful exercises in simulation. I'll\ndemonstrate it's usefulness but moreover I'll discuss the sheer joy\nyou can experience.\n\nI'll go over the following points (the short list):\n\n- I'll show how you can avoid math by simulating; I'll calculate the probability that two people in the live room have the same birthday.\n- I'll show how simulation can help you get better at many games. I'll start with simple card games and with the game of roulette. Most prominently I'll discuss how to determine the value of buying an asset in the game of monopoly (See blogpost: http://koaning.io/monopoly-simulations.html).\n- I'll demonstrate how you can simulate Red Hot Chilli Pepper lyrics. Or any other band. Or legalese.\n- I'll demonstrate the results of a scraping exercise which helped me to determine the value of investing in Lego Minifigures (See blogpost: http://koaning.io/lego-minifigs-stochastics-profit.html).\n\nDepending on the level of the audience I might also discuss how biased\nsimulation can help you solve optimisation problems or even introduce\nbayesian statistics via sampling. I'll gladly leave this decision to\nthe EuroPython committee.",
  "duration": 2483,
  "language": "eng",
  "recorded": "2016-07-31",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/the-joy-of-simulation-for-fun-and-profit",
    "http://koaning.io/monopoly-simulations.html",
    "http://koaning.io/lego-minifigs-stochastics-profit.html"
  ],
  "speakers": [
    "Vincent D. Warmerdam"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/TkHT3sLwtkY/maxresdefault.jpg",
  "title": "The Joy of Simulation: for Fun and Profit",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TkHT3sLwtkY"
    }
  ]
}
