{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Zuria Bauer/Daniel Domene López - How to improve your diet and save money with Python\n[EuroPython 2016]\n[19 July 2016]\n[Bilbao, Euskadi, Spain]\n(https://ep2016.europython.eu//conference/talks/how-to-improve-your-diet-and-save-money-with-python)\n\nOptimization in Python (also known as mathematical programming) can be\nperformed by minimization (or maximization) of an objective function\nwithin a model that can include discrete variables subject to a set of\nconstrains. At this talk, chemical engineering students of the\nUniversity of Alicante will introduce the audience to the\npossibilities of optimization, presenting Pyomo and showing real world\nexamples such as how to improve your diet and save money at fast food\nrestaurants.\n\n-----\n\nProcess optimization in industry has become essential in order to\nmaximize the resources available and reduce energy consumption.\nOptimization problems become interesting when dealing with\nrestrictions (linear or nonlinear) and integer variables (modeling the\ndiscrete decisions). Python ecosystem presents different libraries to\nsolve optimization problems, some of them are CVXOpt, CVXPy, PulP,\nOpenOpt, or Pyomo.\nAmong them, Pyomo results interesting because:\n\n- It can be used for Mathematical modeling in Python similarly to AMPL\n(and GAMS)\n- It communicates with the main solvers used in this field such as\nGLPK, Gurobi, CPLEX, CBC and PICO\n- It's free and open source Python library (BSD license), being\ndeveloped by Sandia National Laboratories, USA.\n- It supports Python 3 and it is easy to install.\n\nThe talk will be divided in three parts:\n\n1. _Introduction to Mathematical Programming/Optimization (15 min):_\nvisual introduction to optimization concepts including restrictions\nand non linearties (linear Programming, Nonlinear Programming, ILP,\nMIP, MINLP).\n\n2. _Introduction to the Pyomo sintax and a quick note for the\ninstallation (20 min):_ showing how to improve their diet and save\nmoney when ordering food in fast food restaurants.\n\n3. _Optimization problems in engineering (10 min):_ showing more\nadvanced optimization examples that include decision variables.",
  "duration": 1993,
  "language": "eng",
  "recorded": "2016-07-31",
  "related_urls": [
    "https://ep2016.europython.eu//conference/talks/how-to-improve-your-diet-and-save-money-with-python"
  ],
  "speakers": [
    "Zuria Bauer",
    "Daniel Domene López"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/YgC-Eqw47fI/maxresdefault.jpg",
  "title": "How to improve your diet and save money with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YgC-Eqw47fI"
    }
  ]
}