{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "The prominent reasons for the wide adoption of Python is the ease of learning, usability and readability coupled with the powerful ecosystem of Python packages. This often makes Python an attractive language for researchers & scholars to undertake computational projects and thesis. The ease of prototyping and tinkering also allows for higher number of iterations and customization in the project, leading to increase in research output. But, one of the pain points of Python is its speed when compared to languages like C++ or FORTRAN which are still widely used in research. \nScholars, when hit by the performance bottleneck of pure python code, often come across some methods to increase their code performance like using PyMPI, Numpy or CPython. But, the learning curve is steep as things get less familiar. If learning Python is so easy, why should increasing the performance of Python code be so difficult?\nThis talk will address this question and introduce Numba, an open source JIT compiler that translates Python and NumPy code into fast machine code. 3 real world computational problems and their Numba counter-parts will be presented to the audience to demonstrate the ease and effectiveness of using Numba. Thereby showcasing how it can be useful in lowering the barrier to achieve code performance for scientific computing using Python.",
  "duration": 1633,
  "language": "eng",
  "recorded": "2019-10-12",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://in.pycon.org/2019/#schedule"
    }
  ],
  "speakers": [
    "Ankit Mahato"
  ],
  "tags": [
    "numba",
    "scientific computing"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/7Ltqdw2X_Oc/maxresdefault.jpg",
  "title": "Real World Numba: Taking the Path of Least Resistance",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7Ltqdw2X_Oc"
    }
  ]
}
