{
  "abstract": "| Software developers interested in getting started with data science\n  are often overwhelmed by the amount of choices: what programming\n  language to use, which machine learning libraries, and where to find\n  suitable data? Furthermore, it can be difficult to understand the\n  whole scope of a data science project, which entails explorative\n  analysis, data cleansing, feature engineering, machine learning\n  prototyping, machine learning productization, and finally continuous\n  model serving and model integration. Software developers are often\n  specifically unaware about the approaches and tools for explorative\n  analysis and feature engineering, although these skills are crucial to\n  the success of a machine learning project. That’s why we concentrate\n  on these topics in our workshop. We believe there is no better way of\n  learning than to actually touch and modify a system (of understandable\n  size) and to see how the results change.\n| To aid in this process, we have created an open-source example\n  application that is optimized to serve as a playground for learning\n  and experimentation. It works on a realistic dataset, addresses a\n  typical machine learning task one may encounter on the job, and\n  applies an industry-standard toolset (Python, Pandas, Jupyter\n  Notebook, AWS). The application uses machine learning to make purchase\n  predictions for a large grocery store in Ecuador, which is a task that\n  comes up in many industries. Sales forecasting helps lower costs,\n  reduce waste of perishable goods, and helps lower prices for\n  consumers. The data is from a company called Favorita, which has\n  published sales data in the public domain on Kaggle.com and\n  illustrates the complexity of a data science problem with a range of\n  stores, products, and dates of sales transactions.\n| In our presentation, we first explain the problem of demand\n  forecasting, and the dataset we will be working with. Then, we move\n  directly into hands-on data analysis. Participants will spend most of\n  their time doing data analysis, using the same tools data scientists\n  use day to day to improve machine learning models. This will include\n  explanations of how and why and where to ask questions of data, and\n  instruction on using the appropriate tools for the job. Towards the\n  end of the workshop, we will talk about turning insights from the\n  session into improvements on the predictive power of machine learning\n  models. The data and the challenge are publicly available and have\n  easily findable discussions and resources to go with them. The source\n  code for our playground application is also open source and can also\n  be found on GitHub at github.com/ThoughtWorksInc/twde-datalab so\n  participants can continue working after the tutorial if they choose\n  to.\n",
  "copyright_text": null,
  "description": "We’ve created a playground data science application that’s ready for you\nto jump in to. It uses real data, an industry-standard tool set, and\naddresses a typical machine learning task. We will run you through the\nworkflow and life cycle of the data science application, and you’ll\nspend most of the session experimenting and improving the machine\nlearning model. Please bring a computer!\n",
  "duration": 5000,
  "language": "eng",
  "recorded": "2018-07-06",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/berlin2018/schedule/"
    }
  ],
  "speakers": [
    "Em Grasmeder",
    "Jin Yang"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/W6fKHs977sk/maxresdefault.jpg",
  "title": "A Hands-On Introduction to Your First Data Science Project",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=W6fKHs977sk"
    }
  ]
}
