{
  "abstract": "The confusion around terms such as like NoSQl, Big Data, Data Science,\nSQL, and Data Lakes often creates more fog than clarity. However,\nclarity about the underlying technologies is crucial to designing the\nbest technical solution in any field relying on huge amounts of data\nincluding \\`data science', machine learning, but also more traditional\nanalytical systems such as data integration, data warehousing,\nreporting, and OLAP.\n\nIn my presentation, I will show that often at least three dimensions are\ncluttered and confused in discussions when it comes to data management:\nFirst, buzzwords (labels & terms); second, data design patterns\n(principles & best practices); and Third, software platforms (concrete\nimplementations & frameworks).\n\nOnly by keeping these three dimensions apart, it is possible to create\ntechnically-sound architectures in the field of big data analytics.\n\nI will show concrete examples, which through a simple redesign and wise\nchoice of the right tools and technologies, run thereby up to 10,000\ntimes faster. This in turn triggers tremendous savings in terms of\ndevelopment time, hardware costs, and maintenance effort.\n",
  "copyright_text": null,
  "description": "The confusion around terms such as like NoSQl, Big Data, Data Science,\nSQL, and Data Lakes often creates more fog than clarity. However,\nclarity about the underlying technologies is crucial to designing the\nbest technical solution in any field relying on huge amounts of data\nincluding \\`data science' and machine learning. In this talk I will try\nto lift the fog.\n",
  "duration": 2351,
  "language": "eng",
  "recorded": "2018-07-08",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/berlin2018/schedule/"
    }
  ],
  "speakers": [
    "Jens Dittrich"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/DbViPBTq8Xc/maxresdefault.jpg",
  "title": "Big Data Systems Performance: The Little Shop of Horrors",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DbViPBTq8Xc"
    }
  ]
}
