{
  "abstract": "As data scientists working in small and mid-sized companies, we\nfrequently want to make use of the research published by our colleagues\nin academia and large companies. Avoiding reinventing the wheel and\nstaying on the cutting edge seems like a fantastic idea in general, yet\nthe conditions in which research publications are written are usually\nnot the same as in our industry settings. Accordingly, as data\nscientists, we need to evaluate the relevance, quality and\nreproducibility of each research paper for our specific work situation.\nSo how do we access the gold mine that is published research in ML,\nstats, and related fields, and turn it into nuggets and even refined\ngold jewelry useful for our industry work and our customers? In my talk\nI will go over a five-step workflow I used for evaluating academic\nresearch papers and prototyping solutions based on them: Choosing your\nbaseline and metrics, identifying the right research findings for your\nproblem, evaluating quality, relevance and reproducibility, determining\nwhich findings to test first and what to keep in mind when prototyping\nthem in your own work. Some of the things I will cover include a\nchecklist for identifying papers for prototyping, a decision matrix for\nprioritizing which findings to prototype, some advice for finding the\nright papers and prototyping your chosen papers.\n",
  "copyright_text": null,
  "description": "As data scientists, building on published research allows us to stay on\nthe cutting edge and not reinvent the wheel. However, in most cases,\nthis transfer is not trivial. My talk will provide you with a five-step\nworkflow that has made this transfer easier for me.\n",
  "duration": 1767,
  "language": "eng",
  "recorded": "2018-07-07",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/berlin2018/schedule/"
    }
  ],
  "speakers": [
    "Ellen König"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/CdQJUqS-t4c/maxresdefault.jpg",
  "title": "Five things I learned from turning research papers into industry prototypes",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CdQJUqS-t4c"
    }
  ]
}
