{
  "abstract": "In the 1970s, NASA developed the Technical Readiness Level scale to\nmeasure the progress of nascent technology. Since then, many other\nengineering bodies have developed similar scales. In most TRL models,\nreadiness levels increase from basic research (lowest numbers) to\ncommercial availability (highest numbers). This is useful not just for\ntracking progress of technology development, but also for setting\nrealistic expectations for work output.\n\nIn web-centric engineering spaces, TRL models are not commonly used. The\nreasons for this are manifold, but the reality is that most projects\nstart well above the basic research levels. However, as we seek to\nintegrate Data Science into our web-space projects and apps, we find\nourselves doing more fundamental research to understand just what the\ndata tell us and how they can be used. This can be difficult to\nreconcile with continuous improvement/continuous delivery project\nmanagement models. The TRL scale may offer some insight on how to set\nexpectations and track progress.\n\nBy thinking of Data Science as a \"full stack\" problem, we span the TRL\nscale from basic research (e.g. exploring our data to see what patterns\nmay emerge, developing new algorithms) to commercial release (e.g.\nshipped features). Instead of treating Data Science as a standalone team\nthat interacts with product teams at-a-distance, we can use TRL scales\nto intelligently integrate data science with other teams, from front-end\nand back-end engineering to QA to UX to customer relations. The TRL\nmodel also allows us to identify strengths and weaknesses among\nscientists so we can focus on how to allocate time, effort, and training\nto put together more effective data science teams.\n\nThis talk will break down a basic TRL model, explore what data science\nmight look like at every step, and how to use it to fill out a true\n\"full-stack\" data science team.\n",
  "copyright_text": null,
  "description": "In the 1970s, NASA developed the Technical Readiness Level (TRL) scale\nto measure research and development of cutting edge technology. While\nseveral engineering bodies use this scale, web-focused engineering has\nleft it behind. This talk will explore TRL scales and how we can use\nthem to measure and guide success of data science teams to build a true\nvision of \"full stack data science.\"\n",
  "duration": 1791,
  "language": "eng",
  "recorded": "2018-07-08",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/berlin2018/schedule/"
    }
  ],
  "speakers": [
    "Emily Gorcenski"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/huqpXMNFD54/maxresdefault.jpg",
  "title": "Going Full Stack with Data Science: Using Technical Readiness Level to Guide Data Science Outcomes",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=huqpXMNFD54"
    }
  ]
}
