{
  "abstract": "After a short introduction we will present various data use cases that\nwhere tackled by mobile.de, Germany's largest vehicle marketplace\nonline, in the last two years. In a combined endeavour inovex, an IT\nproject house with a strong focus on digitalization, has supported\nmobile.de on this voyage.\n\nPersonalized web experience is a commonly used term in e-commerce that\nis hard to grasp. Thus, we illustrate how mobile.de understands\npersonalized web experience and outline its features as well as\nopportunities. In more detail, we will elaborate on the Bayesian\nframework that we use to approximate user preferences. Furthermore, we\ndiscuss the modelling of user intent and how this can be used to\nunderstand the buyer's journey.\n\nBesides the data science and modelling aspects of the use cases we will\nalso dive into the technical details and how we solved them with the\nhelp of Python and Spark (PySpark). In more detail we will address the\nimplementation of efficient User-Defined-(Aggregation)-Functions with\nPandas in PySpark as well as the management of isolated environments and\ndependencies with PySpark.\n\nWe will conclude our talk with the benefits of a personalized web\nexperience for the users of mobile.de which was achieved with the help\nof Python and PySpark in production.\n",
  "copyright_text": null,
  "description": "As Germany's biggest online car marketplace, mobile.de provides a\npersonalized web experience. Our Data Team leverages the interactions of\nour users to infer their preferences. For this tasks we often apply\nPython and Spark to wrangle massive amounts of data. In this talk, we\nare going to present our personalization use-cases as well as the\napplication of PySpark in production.\n",
  "duration": 2492,
  "language": "eng",
  "recorded": "2018-07-08",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/berlin2018/schedule/"
    }
  ],
  "speakers": [
    "Dr. Florian Wilhelm",
    "Dr. Markus Schüler"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/fFiI6HABW-0/maxresdefault.jpg",
  "title": "How mobile.de brings Data Science to Production for a Personalized Web Experience",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fFiI6HABW-0"
    }
  ]
}
