{
  "abstract": "Intensive data collection is a cornerstone of modern intensive care\\*.\nState- of-the-art computerised life support equipment (e.g. mechanical\nventilators, patient monitors) display multiple parameters obtained at a\nhigh sampling rate. However, busy clinicians frequently ignore most of\nthese data; moreover, they are very rarely stored or analysed\nsystematically even later.\n\nAround 3 years ago I started to download anonymous data from the\n**mechanical ventilators** and **patient monitors** of the critically\nill babies we have been looking after on the **Neonatal Intensive Care\nUnit**. Using a sampling rate of 100 per second, by now I have collected\nwell over 1 billion data points. To process, analyse and visualise these\nlarge datasets I have employed Python and its data science tools:\n*Jupyter Notebook, numpy, pandas, matplotlib, seaborn, scipy,\nsckit-learn*. In my talk I would like to show how I have used these\ntools to gain insight into these data. I also would like to demonstrate\nwhy it is useful for people with specialist knowledge and interest to\nlearn how to code, why Python is a good choice for them and how I think\nthis is best achieved.\n\nI hope that my talk will be of interest to people who started to use\nthese data tools for their own purposes not too long ago and also for\nthose who are interested in medical big data, its analysis and future\nchallenges.\n",
  "copyright_text": null,
  "description": "I would like to show how I have been using Python and its data science\ntools to interpret large datasets retrieved from modern equipment used\nin neonatal intensive care, mechanical ventilators and patient monitors.\nI also would like to talk about my journey to Python: why it is\nimportant for professionals without computational background to learn\ncoding and how I think it is the easiest to do it.\n",
  "duration": 2134,
  "language": "eng",
  "recorded": "2018-07-07",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://pydata.org/berlin2018/schedule/"
    }
  ],
  "speakers": [
    "Gusztav Belteki"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/BZbGyQqQIe8/maxresdefault.jpg",
  "title": "Python in Medicine: analysing data from mechanical ventilators and patient monitors",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BZbGyQqQIe8"
    }
  ]
}
