{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroScipy 2014", "speakers": ["Mike Müller"], "title": "Developing Scientific Simulation Systems", "quality_notes": "", "video_flv_length": null, "recorded": "2014-10-22", "video_mp4_length": null, "description": "Scientific simulation models often need to incorporate many aspects into a\r\nworking software system. This talk gives an overview of\r\n[PITLAKQ](http://www.pitlakq.com/), a complex, coupled model for water\r\nquality predictions of pit lakes. The focus is on experiences gained that\r\nmight be useful for similar projects from other domains. This includes\r\nwrapping of legacy code, creating flexible but simple to use model input\r\napproaches and simplifying automation by users.  Description\r\n\r\nThe model PITLAKQ helps to predict the water quality of pit lakes. These\r\nlakes can form in voids created by mining and may pose considerable\r\nenvironmental challenges. PITLAKQ couples several existing numerical models\r\nand adds lots of new functionality to account for the complex interactions\r\nof hydrodynamics, geochemical processes and anthropogenic influences.\r\n\r\nObviously, there is lots of scientific details. The talk only gives a very\r\nshort overview of the functionality of the software. The main focus is on\r\ngeneral principles that can be applied to other domains of scientific\r\nmodeling. This includes:\r\n\r\n* wrapping legacy Fortran code\r\n* coupling models from different domains\r\n* creating a simple, yet flexible input system for model users\r\n* simplifying automation of simulation runs\r\n\r\nI think the lessons I learned over the last 15 years I've been working on\r\nthis project can be useful for other scientists who need to solve simulation\r\nand modeling problems in other fields.\r\n", "video_mp4_url": "", "tags": [], "copyright_text": "youtube", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=Fo2aZGDgFCM", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/Fo2aZGDgFCM/hqdefault.jpg", "video_flv_url": ""}