{
  "id": 3330,
  "category": "EuroScipy 2014",
  "slug": "developing-scientific-simulation-systems",
  "title": "Developing Scientific Simulation Systems",
  "alias": "video/3330/developing-scientific-simulation-systems",
  "summary": "",
  "description": "Scientific simulation models often need to incorporate many aspects into\na working software system. This talk gives an overview of\n`PITLAKQ <http://www.pitlakq.com/>`__, a complex, coupled model for\nwater quality predictions of pit lakes. The focus is on experiences\ngained that might be useful for similar projects from other domains.\nThis includes wrapping of legacy code, creating flexible but simple to\nuse model input approaches and simplifying automation by users.\nDescription\n\nThe model PITLAKQ helps to predict the water quality of pit lakes. These\nlakes can form in voids created by mining and may pose considerable\nenvironmental challenges. PITLAKQ couples several existing numerical\nmodels and adds lots of new functionality to account for the complex\ninteractions of hydrodynamics, geochemical processes and anthropogenic\ninfluences.\n\nObviously, there is lots of scientific details. The talk only gives a\nvery short overview of the functionality of the software. The main focus\nis on general principles that can be applied to other domains of\nscientific modeling. This includes:\n\n-  wrapping legacy Fortran code\n-  coupling models from different domains\n-  creating a simple, yet flexible input system for model users\n-  simplifying automation of simulation runs\n\nI think the lessons I learned over the last 15 years I've been working\non this project can be useful for other scientists who need to solve\nsimulation and modeling problems in other fields.\n",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "youtube",
  "thumbnail_url": "https://i.ytimg.com/vi/Fo2aZGDgFCM/hqdefault.jpg",
  "duration": null,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=Fo2aZGDgFCM",
      "type": "youtube",
      "length": 0
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=Fo2aZGDgFCM",
  "tags": [],
  "speakers": [
    "Mike Müller"
  ],
  "recorded": "2014-10-22"
}