{
  "alias": "video/3323/neural-networks-for-computer-vision",
  "category": "EuroScipy 2014",
  "copyright_text": "youtube",
  "description": "Neural networks with many layers are known as \"deep\" neural networks.\nWhile the phrase \"deep learning\" to describe deep neural networks is\nnew, the ideas behind these networks have been around for many years.\nDeep neural networks attempt to learn concise, hierarchical\nrepresentations of complex data, and recent advances in research have\nmade it much easier to use these networks on many tasks, including\ncomputer vision. Due to massive increases in compute power, available\ndata, and algorithmic techniques, neural networks have greatly improved\nthe state of the art for many aspects of computer vision including\nobject recognition and localization.\n\nTwo key Python packages (pylearn2 and theano) enable machine learning\nresearchers easily develop new architectures and algorithms for neural\nnetworks which utilize GPU processing. This specialized hardware\nimproves the computational feasibility of big neural networks, and GPU\nprogramming was a key driver (along with the development of a technique\ncalled dropout) in the resurgence of neural networks for machine\nlearning tasks.\n\nUtilizing networks trained on extremely large compute farms as\n\"black-box\" preprocessing, a consumer grade desktop or laptop can\napproach state of the art results using standard machine learning\ntechniques such as logistic regression and support vector machines\n(SVM). This idea has serious potential in the embedded/FPGA/ASIC space\nas well.\n\nThe python interface to pylearn2 will be heavily discussed, while also\nusing the preprocessing features of scikit-learn for data preparation.\nThere will also be discussion of the recent advances for pre-trained\nneural networks as preprocessing.\n\nAt the end of this talk, I hope you will understand what \"deep learning\"\nreally means, how to apply these techniques to image data using Python,\nand how these techniques will shape the future of machine learning\nresearch and its applications.\n",
  "duration": null,
  "id": 3323,
  "language": "English",
  "quality_notes": "",
  "recorded": "2014-10-22",
  "slug": "neural-networks-for-computer-vision",
  "source_url": "https://www.youtube.com/watch?v=2O3vCltvicM",
  "speakers": [
    "Kyle Kastner"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/2O3vCltvicM/hqdefault.jpg",
  "title": "Neural Networks for Computer Vision",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2O3vCltvicM"
    }
  ]
}