{
  "id": 3328,
  "category": "EuroScipy 2014",
  "slug": "plotly-collaborative-python-and-matplotlib-plotti",
  "title": "Plotly Collaborative Python and Matplotlib Plotting",
  "alias": "video/3328/plotly-collaborative-python-and-matplotlib-plotti",
  "summary": "Plotly's Python API and sandbox let you make and share beautiful,\nweb-based plots. This talk will be a walk-through of Plotly's library.\nWe will craft and embed interactive graphs within an IPython Notebook\nfrom our gallery, use Plotly's GUI to edit and share graphs, and use\nPlotly's matplotlib wrapper to create web-based graphs and data files\nfrom matplotlib scripts.\n",
  "description": "Plotly: GitHub for Data and Graphs\n----------------------------------\n\n`Plotly <https://plot.ly/>`__ is an online plotting platform. Think of\nit like GitHub, but for sharing data, graphs, and scripts for plotting.\nPlotly has a GUI and APIs for making graphs with Python, R, MATLAB,\nPerl, Julia, Arduino, Ruby, Raspberry Pi, and REST. The APIs let users\nmake and share web-based graphs and interface a desktop environment with\nPlotly. Public sharing is free, users own their data, and users control\nwhether data and graphs are public or private. Plotly also always pairs\ndata and graphs, and lets you import by uploading or\n`live-streaming <https://github.com/plotly/Streaming-Demos>`__.\n\nWhat We'll Build\n----------------\n\nPlotly allows users to make graphs with the GUI, Python, or other\nprogramming languages. We will make a number of beautiful graphs. We\nwill make graphs with Python, share a graph, and then edit with the GUI\nor another programming language of choice. We will also uses Plotly's\n`matplotlib\nwrapper <http://nbviewer.ipython.org/github/plotly/IPython-plotly/blob/master/See%20more/Plotly%20and%20mpld3.ipynb>`__\nto make web-based Plotly graphs from matplotlib figures.\n\nWe will add data to a pre-existing graph, making a new version and\nalways reverting back to previous versions. We will make a graph and\nstore scripts, data sets, graphs, and past versions of files in Plotly.\n\nAuthors, and journalists from the and Wired Science use these Plotly\nfeatures and the capacity to embed graphs in an iframe. We will conclude\nby showing how to optimize your embedding.\n\nMore examples can be found at https://plot.ly/python/.\n",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "youtube",
  "thumbnail_url": "https://i.ytimg.com/vi/DObmPAtuNw0/hqdefault.jpg",
  "duration": null,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=DObmPAtuNw0",
      "type": "youtube",
      "length": 0
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=DObmPAtuNw0",
  "tags": [],
  "speakers": [
    "Matthew Sundquist"
  ],
  "recorded": "2014-10-22"
}