{
  "alias": "video/3337/the-radio-astronomical-transient-detection-pipeli",
  "category": "EuroScipy 2014",
  "copyright_text": "youtube",
  "description": "LOFAR, the Low Frequency Array, is an innovative new radio telescope in\nthe Netherlands, which will continuously monitor the radio sky. The\nstudy of transient sources is one of the key science projects of LOFAR.\nUnder this remit come all time-variable astronomical radio sources,\nincluding pulsars, gamma-ray bursts, X-ray binaries, radio supernovae,\nflare stars, and even exo-planets. With its continuous monitoring of a\nlarge area of sky, it is hoped that LOFAR will detect many new transient\nevents, and provide alerts to the international community for follow-up\nobservations at other wavelengths.\n\nTo detect and analyse transient sources we’ve created a software\npipeline named TRAP. The TRAP is almost completely written in Python. In\nshort the TRAP consists of:\n\n-  Source detection\n-  Storing to database\n-  Association in time and frequency (in database)\n-  Visualising results (webinterface)\n\nSince the datarates in the pipeline are high, key in the design of our\npipeline is that we move most calculations to the database. This implies\ncomplex and math heavy queries. To assist in managing these queries we\nuse SQLAlchemy. TRAP can be used on various database backends like\nPostgreSQL, but also the less known MonetDB. MonetDB is a column store\ndatabase which is believed to outperform traditional SQL databases on\nhuge datasets. To interact with MonetDB we developed a Python API,\nSQLALchemy dialect and Django backend. For visualisation of the results\nwe’ve created an interactive browser based web interface based on\nDjango, bootstrap and highcharts. For parallising the image processing\nwe use Celery. In my talk i’ll explain why we use these frameworks and\ndive in the internals of our pipeline.\n\nTarget audience is people that are interested in how to build a\nscientific processing pipline using off the shelf libraries.\n",
  "duration": null,
  "id": 3337,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-10-22",
  "slug": "the-radio-astronomical-transient-detection-pipeli",
  "speakers": [
    "Gijs Molenaar"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/_ExWz-j1ZhY/hqdefault.jpg",
  "title": "The Radio astronomical TRAnsient detection Pipeline (TRAP)",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_ExWz-j1ZhY"
    }
  ]
}
