{
  "description": "Deep learning has proven very effective for machine learning tasks in the past couple of years, but it is sometimes shrouded in jargon and unnecessary technical detail. This talk will provide a practical introduction to the topic focusing on building an end-to-end text classification system. No machine learning or deep learning experience required. Intermediate knowledge of Python required.\n\n**Abstract**\n\nIf you wondered what all the hype about deep learning is about but haven't taken the leap to trying it yourself, this talk is for you. First, we'll cover the basics of Deep Learning, focusing on the general intuition of the process. Then get hands-on experience by analyzing common examples of text and training models to predict the category the text belongs to, for example whether a movie review is positive or negative. Along the way, you will learn the necessary machine learning and text processing concepts. We will be using the Kera package which provides a Pythonic way to build deep learning models.\n\n**Bio**\n\nDr. Brian Spiering is a Data Science Faculty member at GalvanizeU which, in cooperation with the University of New Haven, offers a Master of Science in Data Science. He teaches humans the languages of computers (primarily Python) and teaches computers the languages of humans (through Deep Learning and Natural Language Processing). He is active in the San Francisco tech community through volunteering and mentoring.",
  "language": "eng",
  "recorded": "2017-08-12",
  "related_urls": [
    {
      "label": "talk slides",
      "url": "https://speakerdeck.com/pybay/2017-a-gentle-introduction-to-text-classification-with-deep-learning/edit"
    }
  ],
  "speakers": [
    "Brian Spiering"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Xgk1w0Vdx-0/hqdefault.jpg",
  "title": "A Gentle Introduction to Text Classification with Deep Learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Xgk1w0Vdx-0"
    }
  ]
}
