{
  "description": "Open source communities have led to the development of a majority of useful tools and technologies. Open source software is understated because becoming involved can be daunting when a project has hundreds of active developers. In reality, open source communities are warm, welcoming, and diverse. Learn more about open source, its significance, opportunities to contribute, and how to get started.\n\n**Abstract**\n\nEveryday, thousands of developers gather in teams and collaborate in open source communities to collaborate together to celebrate the principles of community-oriented development, such as open exchange, collaborative participation, rapid prototyping, transparency, and meritocracy.\n\nBy publicizing their source code on websites like GitHub, open source projects allow others to easily develop, modify, and distribute their source code, dispelling the stigma of software as a private, commercial product. Various examples of open source software include the Atom text editor, Rust programming language, Django Python-based web application framework, and Zulip group chat application.\n\nHowever, individuals often hesitate to join open source communities due to several concerns; some fear ridicule for their lack of experience or invaluable contributions, and others believe that they cannot gain valuable rewards from committing their time to a non-profit project.\n\nInstead, new contributors to open source projects discover opportunities to develop their technical, communication, and collaboration skills under the guidance of experienced mentors by collaborating with a network of like-minded individuals with various backgrounds, experience, and fields of expertise. By contributing to open source projects, individuals gain a chance to make a difference by developing software that revolutionizes the technology industry.\n\nLearn more about open source, its significance, opportunities to contribute, and how to get started.\n\n**Bio**\n\nCynthia Lin is a 15-year-old high school student from Torrance, California. A full-stack developer at heart, she has extensive experience developing software, web applications, automated bots, and games through various projects. As an avid supporter of open source software, Cynthia actively contributes to the Zulip open source group chat application as a core developer and the lead developer of zulipbot. She placed as a Finalist in Google Code-in 2016 for her accomplishments in open source software and has presented her experiences as a high school student in the open source community at several technology conferences.\nSpeaker home page",
  "language": "eng",
  "recorded": "2017-08-13",
  "related_urls": [
    {
      "label": "talk slides",
      "url": "https://speakerdeck.com/pybay/2017-opening-up-to-open-source"
    }
  ],
  "speakers": [
    "Cynthia Lin"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/rfdzOZkDqYk/hqdefault.jpg",
  "title": "Opening Up to Open Source",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rfdzOZkDqYk"
    }
  ]
}
