{
  "description": "An overview of what is Celery (an asynchronous task queue/job queue based on distributed message passing. It is focused on real-time operation, but supports scheduling as well) and how they are helpful. Then a walkthrough of how to set up celery task, connecting it to a messaging server (RabbitMQ) and running it.\n\n**Abstract**\n\nWant to be able to have a task queue, where your user's experience isn't interrupted because you need to do run a process every day, every hour or when a action is triggered? Best part of all, Celery code is testable! We are going do an overview of what Celery is and how its works. Then we'll do a walk through of Celery app.\n\n**Bios**\n\nJessica Dene Earley-Cha is from Calexico, CA and received her bachelor’s in Sociology, Education: Applied Psychology from UCSB. After receiving her diploma she started working in the nonprofit sector. She spent almost a decade working with at-risk youth and people with mental health challenges in disadvantaged areas. After years of supporting and encouraging other to pursue their dream, Jessica decided to pivot her career into tech. She is full stack developer who still enjoys sharing knowledge and support others. She is currently the Director of Part Time Education at Hackbright Academy, providing avenues for women to get quality software engineering education. Jessica is active in Google Developers Group, Women Techmakers, Girl Develop It, Latin@s in Tech and DevelopHerDevelopHim. You’ll find her either listening to other’s life stories or coding one of her many personal projects.\n\nJames Cha is a software developer who takes his development practices into all aspects of his life. Do life, fix bugs, refactor life, branch for exploration, merge some branches, archive others. He enjoys building up communities and loves to share the knowledge he has.",
  "language": "eng",
  "recorded": "2017-08-12",
  "speakers": [
    "Jessica Earl Cha",
    "James Earl Cha"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/YK7ZNBnoHrk/hqdefault.jpg",
  "title": "Introduction to Celery",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YK7ZNBnoHrk"
    }
  ]
}
