{
  "description": "The presentation will be helpful for engineers, who developed an application in Python, or library or microservice. The presentation will cover the practices automating continuous integration, continuous delivery, and continuous deployment with Python ( examples: Jenkins and Gocd).\n\n**Abstract**\n\nContinuous Deployment is a process to ensure that code can be rapidly and safely deployed to production by delivering every change to a production-like environment and ensuring business applications and services(microservices) function as expected.\n\n**Bio**\n\nMy name is Natalie; I have a Networking and Security background but recently decided to challenge myself in different space. That's why currently I work at Vevo as Tools Engineer in coolest DevOps team in San Francisco. Where part of my job includes building and automating various tools that help our development team be more productive and happy. I have an MS in Compute Since degree. For my first job, I had to do a lot of scripting for configuring and managing thousands of switches, routers and other networking devices in our company testing lab. After using sed, awk, Tcl I discovered and learned Python. It was straightforward to pick up and worked well since then Python became my language of preference. I also like Python for its big community.\n\nIn my spare time, I like to spend time with my pup Chai, bake and blog about baking.\n\nThank you, organizers, for giving me and people the opportunity to speak and this conference and share our knowledge with community .",
  "language": "eng",
  "recorded": "2017-08-13",
  "related_urls": [
    {
      "label": "talk slides",
      "url": "https://speakerdeck.com/pybay/2017-natalie-serebryakov-continuous-deployment"
    }
  ],
  "speakers": [
    "Natalie Sere Bryakova"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ZaCV9bPQa4w/hqdefault.jpg",
  "title": "Continuous Deployment with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZaCV9bPQa4w"
    }
  ]
}
