{
  "copyright_text": null,
  "description": "**De la ciencia de datos, la exoplanetología y otros demonios**\n\nLa existencia de planetas alrededor de otras estrellas aparte del Sol ha sido un tema de fascinación para la humanidad desde hace muchos siglos. Hasta hoy, se han detectado casi cuatro mil exoplanetas, de los cuales hemos observados directamente menos de un 1%. Esto se debe a que tomarle una \"foto\" a un exoplaneta es una tarea extremadamente difícil. El estudio de exoplanetas por imagen directa se ha logrado de unos 15 años para acá gracias a avances en instrumentación (óptica adaptativa y componentes de coronografía), técnicas observacionales, y al desarrollo de algoritmos de análisis de imágenes especializados. Este ultimo componente es el que finalmente define el desempeño y los limites de detección de los instrumentos diseñados para observar exoplanetas.\n\nEn esta charla, después de una breve introducción a las técnicas de procesamiento de imágenes para la imagen directa de exoplanetas, presentaré mi trabajo integrando las mejores practicas de la ciencia de datos al estudio de dichos cuerpos celestes. Estos esfuerzos incluyen el desarrollo de software científico libre en Python, por ejemplo la librería VIP - `Vortex Image Processing`_. Otro aspecto de mi trabajo como científico de datos, es el replanteamiento de problemas astronómicos, como la detección de exoplanetas en imágenes plagadas de ruido, utilizando `técnicas de aprendizaje automático supervisado y redes neuronales`. Finalmente, describiré mi experiencia organizando un `\"data challenge\"`_ para unir la comunidad de especialistas en la comparación de diferentes algoritmos de procesamiento de imágenes aplicadas a la exoplanetología.\n\n.. _`Vortex Image Processing`: https://github.com/vortex-exoplanet/VIP\n.. _`técnicas de aprendizaje automático supervisado y redes neuronales`: https://www.aanda.org/articles/aa/abs/2018/05/aa31961-17/aa31961-17.html\n.. _`\"data challenge\"`: https://carlgogo.github.io/exoimaging_challenge/\n",
  "duration": 1357,
  "language": "spa",
  "recorded": "2018-10-07",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.es.pycon.org/#schedule"
    },
    {
      "label": "Vortex Image Processing",
      "url": "https://github.com/vortex-exoplanet/VIP"
    },
    {
      "label": "Supervised detection of exoplanets in high-contrast imaging sequences",
      "url": "https://www.aanda.org/articles/aa/abs/2018/05/aa31961-17/aa31961-17.html"
    },
    {
      "label": "Exoplanet imaging data challenge",
      "url": "https://carlgogo.github.io/exoimaging_challenge/"
    }
  ],
  "speakers": [
    "Carlos Alberto Gomez Gonzalez"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/yakMw7kfIqY/maxresdefault.jpg",
  "title": "A la caza de exoplanetas por imagen directa con Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yakMw7kfIqY"
    }
  ]
}
