{
  "copyright_text": null,
  "description": "Poder determinar la distancia entre objetos a partir de una imagen en dos dimensiones es una tarea que ha intrigado a multitud de investigadores en estos últimos años. Esto permitiría la estimación de la profundidad en imágenes monoculares, siendo capaces de realizar predicciones precisas en mapas de profundidad. Las ventajas son evidentes, ya que, cualquier cámara de color detectaría datos tridimensionales. Esta capacidad es importante para crear sistemas de asistencia de bajo coste para ayudar a personas con discapacidad visual a desplazarse y desarrollar su vida en entornos exteriores de forma autónoma. Entre otras aplicaciones, esta técnica permitiría generar reconstrucciones tridimensionales de un objeto o escena sin necesidad de disponer de dispositivos específicos.\n\nEn esta charla se mostrará un sistema basado en visión capaz de detectar estas distancias a partir de imágenes en 2D, con el objetivo de implementarse en sistemas para ayudar a personas con discapacidad visual a desplazarse en entornos exteriores.\n\nDurante la charla se hablará de conceptos relacionados con el Deep Learning, empleando la herramienta Tensorflow. La charla está dirigida a todos los públicos, pues se tratarán los conceptos de una manera sencilla, y desde la perspectiva del trabajo con Python de una persona que no ha estudiado informática. Por otro lado, el proyecto que se presenta está englobado en el proyecto nacional RETOGAR (RETOrno al HoGAR) financiado por el Ministerio de Economía y Competitividad del Gobierno de España y en el cual se tratan diversos temas de la robótica social enfocada a personas dependientes.\n",
  "duration": 1422,
  "language": "spa",
  "recorded": "2018-10-06",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.es.pycon.org/#schedule"
    }
  ],
  "speakers": [
    "Zuria Bauer"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/BE8YLm4nrjI/maxresdefault.jpg",
  "title": "Desde imágenes RGB a mapas de profundidad pasando por redes convolucionales profundas",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BE8YLm4nrjI"
    }
  ]
}
