{
  "copyright_text": null,
  "description": "A pesar de los recientes avances en el campo del aprendizaje por refuerzo (Reinforcement Learning), generar fácilmente datasets de ejemplos de buena calidad sigue siendo un auténtico infierno. Por suerte, si nos permitimos hacer un poco de trampas y utilizar algoritmos de planificación, es posible conseguirlo. En hackeando el Reinforcement Learning, presentaremos una `nueva familia de algoritmos de planificación`_ capaces de obtener puntuaciones sobrehumanas utilizando muy pocos recursos de computación.\n\nEl objetivo de esta charla es ofrecer una explicación intuitiva de cómo funciona esta nueva familia de algoritmos mediante animaciones visuales y demostraciones en vivo. Esta charla estará dividida en cuatro apartados que se corresponden con los pasos a seguir para hackear cualquier sistema.\n\n#.    **Recopilación de información**: En esta es una breve introducción a los conceptos necesarios para poder seguir la charla y entender el probema que queremos resolver.\n#.    **Escaneo y detección de vulnerabilidades**: Aquí explicaremos con animaciones visuales y sin entrar en detalles matemáticos en qué consisten los nuevos algoritmos presentados y cómo se integran con el aprendizaje por refuerzo.\n#.    **Explotación del sistema**: Python ofrece una gran cantidad de librerias y herramientas para trabajar con problemas de aprendizaje por refuerzo. En esta sección realizaremos una prueba de concepto en la que mostraremos como generar partidas de Ms.Pacman de calidad sobrehumana en tan solo unos minutos. Además, se mostraran ejemplos de como integrar los algoritmos presentados con las liberías ya existentes.\n#.    **Mantener el acceso y gestionar huellas**: Por último, se explicará que tipo de problemas pueden ser resueltos eficientemente, qué resultados hemos obtenido en diferentes pruebas, y dónde encontrar recursos adicionales para aprender más sobre el tema.\n\nEsta charla es una adaptación de `Hacking reinforcement learning`_, presentada en EuroPython2018. \n\n.. _`nueva familia de algoritmos de planificación`: https://github.com/FragileTheory/FractalAI\n.. _`Hacking reinforcement learning`: https://github.com/Guillemdb/hacking-rl\n",
  "duration": 1556,
  "language": "spa",
  "recorded": "2018-10-06",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.es.pycon.org/#schedule"
    },
    {
      "label": "FractalAI",
      "url": "https://github.com/FragileTheory/FractalAI"
    },
    {
      "label": "Hacking reinforcement learning",
      "url": "https://github.com/Guillemdb/hacking-rl"
    }
  ],
  "speakers": [
    "Guillem Duran Ballester"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/FxqwL5Esh7I/maxresdefault.jpg",
  "title": "Hackeando el Reinforcement Learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FxqwL5Esh7I"
    }
  ]
}
