{
  "copyright_text": null,
  "description": "Uno de los motivos por los que programar en Python es cómodo y sencillo es que no tenemos que preocuparnos por el tiempo de vida de nuestros objetos. Es decir, una vez que deja de ser necesaria, una variable desaparece de la memoria “magicamente”. Esto puede —erróneamente— llevarnos a creer que no es necesario preocuparnos por lo que ocurre entre bastidores.\n\nNada más alejado de la realidad: conocer cómo Python gestiona la memoria es fundamental en ciertos escenarios, y desconocer qué está ocurriendo puede tener consecuencias tan importantes como desagradables. Por ejemplo, si nuestros programas gestionan una gran cantidad de datos al mismo tiempo o lanzan múltiples processos en paralelo esto deja de ser una cuestión teórica y convierte en algo que a nosotros, mentes pragmáticas, también nos importa.\n\nPython utiliza para manejar la memoria una estrategia combinada consistente en dos intimidantes términos: (1) conteo de referencias y (2) colector de basura generacional. Entender cómo ambos sistemas trabajan juntos y cuáles son las limitaciones de cada uno nos ayudará a entender aspectos específicos de nuestra programación del día a día. Ejemplos: (a) qué ocurre con la memoria exactamente cuando hay multiples hilos o procesos, (b) qué pasa si nuestras estructuras de datos se contienen a si mismas, un escenario posible al trabajar con grafos, o (c) qué hace Python con los valores temporales que se producen, sin ir más lejos, al sumar dos números o dos arrays de NumPy.\n\nAunque estos conceptos suelen considerarse avanzados y difíciles de entender, veremos que no es así. Éste no es un asunto meramente teórico ni es difícil encontrar sus aplicaciones prácticas. En esta charla explicaremos por qué es algo que debe importarnos y hablaremos de cómo aplicar los conocimientos que hemos adquirido a problemas específicos.\n\nResumen esquemático de la charla:\n\n#. Repaso express: qué son las variables en Python\n\n   #. Variables como etiquetas\n   #. Variables vs objetos\n\n#. Qué es la recoleción de basura.\n#. Conteo por referencias\n\n   #. Qué problema resuelve.\n   #. Problemas del conteo por referencia.\n\n      #. Hilos\n      #. Ciclos\n\n#. Recolector de basura para ciclos\n\n   #. Las tres generaciones.\n   #. El algoritmo\n\n#. Aplicaciones prácticas y conocimiento útil.\n\n   #. Que ocurre al implementar ``__del__()``.\n   #. Copy-on-write.\n   #. ``__slots__``\n   #. Hilos versus procesos.\n   #. Extras\n",
  "duration": 1524,
  "language": "spa",
  "recorded": "2018-10-07",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.es.pycon.org/#schedule"
    }
  ],
  "speakers": [
    "Pablo Galindo",
    "Victor Terrón"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/G9wOSExzs5g/maxresdefault.jpg",
  "title": "Hora de sacar la basura: garbage collector",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=G9wOSExzs5g"
    }
  ]
}
