{
  "copyright_text": null,
  "description": "Como programadores de Python, estamos acostumbrados a usar nuestro\nlenguaje favorito continuamente pero alguna vez que otra pasa por\nnuestra cabeza la duda de cómo funciona todo esto. ¿Cómo está\nimplementado un lenguaje de programación? ¿Cómo sabe Python si lo que\nescribo es correcto o no? ¿Cómo se transforma y ejecuta el código que\nescribimos?\n\nEl objetivo de esta charla es aprender todo lo posible acerca de\nsintaxis, gramática, `árboles sintácticos abstractos`_, como un lenguaje\ncomo Python funciona y cómo `CPython`_ (la implementación por defecto\ndel intérprete) en particular está implementado. Para que la sesión no\nsea simplemente una serie de diatribas teóricas, utilizaremos la excusa\nde modificar, retorcer y extender la gramática de Python como hilo\nconductor para entender cómo todas las piezas encajan y para aprender\ncómo funcionan todas las técnicas avanzadas de análisis y modificación\nde código. Para ello empezaremos hablando de cómo modificar código de\nPython modificando su árbol sintáctico abstracto y veremos algunos\nejemplos de librerías (pytest, 2to3…) que utilizan esta técnica. Después\nveremos como extender la gramática de Python “informalmente” utilizando\nun `códec`_ personalizado y qué aplicaciones podría tener esto.\nFinalmente hablaremos de cómo modificar realmente la gramática de Python\ncreando nuestro propio intérprete modificado en caso de que algún día\nqueramos implementar nuestro propio lenguage o modificar el propio\nPython.\n\nTras terminar la charla (¡para aquellos que sobrevivan a los nueve\ncirculos!) ganaremos conocimiento de como funciona Python y, por\nextensión, otros lenguajes de programación además de tener un montón de\nmalas ideas inmantenibles en mente para la próxima vez que queramos\nasustar a nuestros compañeros programadores.\n\n.. _árboles sintácticos abstractos: https://en.wikipedia.org/wiki/Abstract_syntax_tree\n.. _CPython: https://en.wikipedia.org/wiki/CPython\n.. _códec: https://docs.python.org/3/library/codecs.html\n",
  "duration": 1604,
  "language": "spa",
  "recorded": "2018-10-06",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.es.pycon.org/#schedule"
    }
  ],
  "speakers": [
    "Pablo Galindo Salgado"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/vOGacccUsog/maxresdefault.jpg",
  "title": "¡Oh vosotros los que entráis, abandonad toda esperanza!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vOGacccUsog"
    }
  ]
}
