{
  "copyright_text": null,
  "description": "La contaminación medioambiental debida a los vertidos de plásticos es un tema cada vez de mayor actualidad. Muy conocidos son ya los casos en los que el plástico vertido en los mares es el principal causante de daños en animales y vegetación, como el caso de la gran isla de plástico del pacífico, o la muerte de ballenas por la ingesta de bolsas de plástico y otros materiales. Ciertamente, los plásticos están muy asimilados en nuestro modo de vida, por lo que acciones orientadas a su eliminación no pueden tener una gran aceptación en el corto plazo. Por este motivo, desde hace unos años, investigadores de todo el mundo están trabajando para diseñar materiales que puedan sustituir a los plásticos convencionales y que, además, sean biodegradables. En nuestro Grupo de Investigación trabajamos para la elaboración de biopolímeros basados en almidón de patata con los que poder sustituir los embalajes convencionales empleados en productos alimenticios, y que son completamente biodegradables. Para la caracterización de los materiales que sintetizamos es preciso analizar multitud de variables calculadas a partir de una gran cantidad de datos para lo que Python se convierte en una poderosa herramienta.\n\nLa charla quedará dividida en dos partes:\n\n*    Parte I: introducción a la ciencia de materiales y presentación de la línea de investigación del Grupo. (5 min)\n*    Parte II: exposición de las herramientas de Python empleadas para el análisis de datos de ensayos a tracción de materiales y aplicación de técnicas de optimización a los criterios de selección de materiales. Los ensayos a tracción nos proporcionan información sobre la elasticidad del material y su resistencia mecánica a partir de una curva de esfuerzo vs deformación que puede ser analizada utilizando Python. También con Python se pueden realizar cálculos de optimización matemática que permitan realizar una selección de los mejores materiales atendiendo a estos criterios de elasticidad y resistencia. (20min)\n\nEl objetivo de la charla es mostrar cómo Python es una potente herramienta en el campo de la ciencia y la ingeniería, utilizando para ello un caso de estudio, lo que le aporta un verdadero valor añadido, pues muestra el empleo de Python en un entorno real.\n\nLa charla está dirigida a todos los niveles, pues se han intentado implementar los programas de la manera más sencilla posible. Además, la charla se dirige a todos los públicos, pues se introducirán funciones de Numpy, Scipy, Matplotlib, etc. que pueden resultar de interés en áreas distintas a las de esta presentación.\n",
  "duration": 1310,
  "language": "spa",
  "recorded": "2018-10-07",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.es.pycon.org/#schedule"
    }
  ],
  "speakers": [
    "Daniel Domene López"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/IFrv1nU7qbQ/maxresdefault.jpg",
  "title": "Python ayudando a salvar a las ballenas: cómo el lenguaje puede ser útil en el área del diseño de biopolímeros",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IFrv1nU7qbQ"
    }
  ]
}
