{
  "copyright_text": null,
  "description": "La retina de los vertebrados está formada por distintos circuitos\nneuronales compuestos por varios tipos de células diferentes, cada uno\ncon su propio rol y su característica particular de respuesta ante\nestímulos visuales. Dichas neuronas están dispuestas en tres capas\ncelulares distintas que definen entre ellas dos interfaces de conexión\nque llamamos capas sinápticas [1].\n\nPor otra parte, uno de los principales objetivos de la neurociencia es\ncomprender cómo se codifica la información visual en la retina por parte\nde las neuronas que la forman. Además, las enfermedades que afectan a la\nvisión, como la retinosis pigmentaria o la degeneración macular asociada\na la edad, tienen una incidencia cada vez más acusada año tras año en\npersonas de todo el mundo. Esto define el enorme desafío para nuestra\nsociedad de dar solución a estos problemas, mediante el uso de terapias\ngenéticas y neuroprótesis visuales [2]. Es por ello que es muy\nimportante disponer de modelos computacionales de la retina, para\nconocer más su estructura y funcionamiento así como para poder ser\nutilizados en neuroprótesis visuales.\n\nEn este estudio se presenta un **modelo computacional de la retina** que\nse encarga de transformar estímulos visuales en patrones de disparo de\npotenciales de acción de manera precisa. Se aborda el problema del\nentrenamiento de modelos neuronales de células ganglionares de la retina\n(RGC) así como de grupos de células ganglionares, todo ello haciendo uso\nde registros electrofisiológicos de ratones. De manera específica, se\nmodelan **redes neuronales convolucionales (CNN)** para aprender a\npredecir las respuestas neuronales de RGC individuales y poblaciones de\néstas ante un estímulo de ruido natural. Los modelos se han desarrollado\nhaciendo uso de los **frameworks TensorFlow y Keras para Python**. Los\nresultados muestran que las CNN pueden ser utilizadas de manera efectiva\npara modelar y aprender los procesos computacionales llevados a cabo en\nla retina en forma de redes neuronales multicapa similares a los\ncircuitos neuronales de la misma.\n\n\n#. Kolb H, Fernandez E, Nelson R, editors. Webvision: The Organization\n   of the Retina and Visual System [Internet]. Salt Lake City (UT):\n   University of Utah Health Sciences Center; 1995. Available from:\n   https://www.ncbi.nlm.nih.gov/books/NBK11530/\n#. Fernández, E. and Normann, R. A. (2017). CORTIVIS Approach for an\n   Intracortical Visual Prostheses (Cham: Springer International\n   Publishing). 191–201. doi:10.1007/978-3-319-41876-6 15\n",
  "duration": 1414,
  "language": "spa",
  "recorded": "2018-10-07",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.es.pycon.org/#schedule"
    }
  ],
  "speakers": [
    "Rubén Crespo Cano"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/8UAL-qIZKxY/maxresdefault.jpg",
  "title": "YADLRetina: Yet Another Deep Learning Retina",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8UAL-qIZKxY"
    }
  ]
}
