{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 24.04.2024\nhttps://2024.pycon.de/program/LERYUY/\n\n🎓 Watch a comprehensive tutorial on the Arrow Columnar format with pyarrow and nanoarrow, exploring its intricate details and interactive examples to enhance your understanding of this efficient in-memory data representation standard.\n\nSpeakers:\nJoris Van den Bossche, Raúl Cumplido, Alenka Frim\n\nDescription:\nIn a compelling talk titled \"A deep dive into the Arrow Columnar format with pyarrow and nanoarrow,\" speakers Joris Van den Bossche and Alenka Frim from Voltron Data along with Raúl Cumplido, a Senior Software Developer, will elucidate the intricacies of the Apache Arrow columnar format. The speakers, who are active contributors and maintainers in the Apache Arrow project, will shed light on the significance and utility of the Arrow format for efficient in-memory columnar data representation.\n\nThe tutorial aims to offer a comprehensive understanding of the Arrow columnar format, including its different types and buffer layouts, providing participants with interactive demonstrations using the pyarrow and nanoarrow libraries. The talk emphasizes Apache Arrow as a multi-language toolbox for accelerated data interchange and in-memory processing, illustrating the format's role in enabling efficient analytic operations on modern hardware such as CPUs and GPUs.\n\nAttendees will have the opportunity to explore the physical memory layout and various data types associated with the Arrow columnar format. The talk will feature practical code examples using pyarrow and nanoarrow libraries, allowing participants to create and inspect Arrow data effectively. Furthermore, the discussion will highlight the broader applicability of the columnar format, as it underpins multiple libraries like pandas, polars, datafusion, duckdb, cudf, influxdb, among others.\n\nBy delving into the nuances of the Arrow columnar format and providing hands-on demonstrations with pyarrow and nanoarrow, the speakers will equip participants\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/pydata-pydata-scientific-libraries-stack\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 5452,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    },
    {
      "label": "http://2024.pycon.de/program/categories/pydata-pydata-scientific-libraries-stack",
      "url": "http://2024.pycon.de/program/categories/pydata-pydata-scientific-libraries-stack"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "https://2024.pycon.de/program/LERYUY/",
      "url": "https://2024.pycon.de/program/LERYUY/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/k0mkDXWfLb4/maxresdefault.jpg",
  "title": "A deep dive into the Arrow Columnar format with pyarrow and nanoarrow",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=k0mkDXWfLb4"
    }
  ]
}
