{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 23.04.2024\nhttps://2024.pycon.de/program/CY97LS/\n\n🎓 Watch a fascinating analysis on the Austrian COVID-19 protest movement using geo-social media data to unveil the network structure, spatial hotspots, and dominant content themes through multi-dimensional network analysis.\n\nSpeakers:\nNefta Kanilmaz\n\nDescription:\nNefta Kanilmaz, a researcher and PhD candidate at the University of Salzburg, discussed a multidimensional approach to analyzing COVID-19 protest movements using geo-social media data. The talk focused on the use of publicly available social media data to understand the geographical centers of activity, network structure, and key themes of conspiracy movements. Kanilmaz presented a multi-dimensional network analysis for the Austrian COVID-19 protest movement, utilizing Python libraries such as geopandas, networkx, and gensim. The analysis included identifying geo-spatial hot spots, densely connected clusters, and dominating content themes through spatial statistics, community detection techniques, and topic modeling approaches respectively. The presentation underscored the importance of data-driven analysis in understanding movements that may threaten democracy, emphasizing the significance of publicly available social media data in addressing societal challenges. Python libraries employed in the analysis included geopandas, networkx, berttopic, lda, and others.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/general-ethics-privacy\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.",
  "duration": 1860,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "https://2024.pycon.de/program/CY97LS/",
      "url": "https://2024.pycon.de/program/CY97LS/"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "http://2024.pycon.de/program/categories/general-ethics-privacy",
      "url": "http://2024.pycon.de/program/categories/general-ethics-privacy"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/54OVK_ShXVY/maxresdefault.jpg",
  "title": "Analyzing COVID-19 Protest Movements: A Multidimensional Approach Using Geo-Social Media Data",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=54OVK_ShXVY"
    }
  ]
}
