{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 22.04.2024\nhttps://2024.pycon.de/program/LMMM7D/\n\n🎓 Watch how mobile.de utilizes Learning to Rank techniques like XGBoost to constantly optimize search relevance, providing users with a faster and unique search experience for finding their dream vehicles.\n\nSpeakers:\nManish Saraswat\n\nDescription:\nManish Saraswat, a Senior Data Scientist at mobile.de, emphasizes the importance of providing a seamless search experience for users looking for vehicles on their platform. By leveraging machine learning systems that work around the clock, the company ensures that search results are continuously optimized based on evolving user interests. Through techniques like learning to rank using XGBoost, Manish explains mobile.de's search relevance ranking framework, which handles millions of searches daily. The talk focuses on the company's commitment to enhancing user experience through efficient machine learning and Python applications. With millions of daily visitors searching for their ideal cars, the search engine plays a crucial role in connecting users with relevant sellers. Manish discusses various aspects, including the significance of search functionality, the benefits of learning to rank techniques, existing challenges with ranking models, proposed solutions, model deployment under strict latency constraints, AB test outcomes, key insights, and strategies for further improvement.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/sponsor\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 2702,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "https://2024.pycon.de/program/LMMM7D/",
      "url": "https://2024.pycon.de/program/LMMM7D/"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "http://2024.pycon.de/program/categories/sponsor",
      "url": "http://2024.pycon.de/program/categories/sponsor"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/cwDnYWcMJ1c/maxresdefault.jpg",
  "title": "Better search relevance using Learning to Rank at mobile.de [PyCon DE & PyData Berlin 2024]",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cwDnYWcMJ1c"
    }
  ]
}
