{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 24.04.2024\nhttps://2024.pycon.de/program/7UYHYP/\n\n🎓 Watch Dr. Tania Allard discuss practical tools and strategies to make your project's documentation sites more accessible, inclusive, and user-friendly for all.\n\nSpeakers:\nDr. Tania Allard\n\nDescription:\nIn the engaging talk on \"Building Accessible Documentation Sites\", presented by Dr. Tania Allard, the Director of Quansight Labs and a well-known figure in the Python community, the importance of creating inclusive documentation is highlighted. Dr. Allard emphasizes the need for documentation sites to be up-to-date, well-organized, and accessible to a diverse range of users, including those with disabilities.\n\nThe talk addresses the fact that approximately 25% of the global population has some form of disability, underlining the necessity of ensuring that project documentation is accessible to all individuals, including disabled developers and end-users. Dr. Allard stresses that accessibility is not limited to front-end web development but encompasses all aspects of digital experiences, making it a collective responsibility for everyone involved in building projects, whether at the backend, documentation, CLI, or API levels.\n\nDrawing on her extensive experience in open-source accessibility, Dr. Allard shares practical advice, tools, and workflows to enhance the accessibility of documentation and user-facing resources. The talk covers various strategies, from auditing to remediation, aimed at making documentation sites more inclusive and user-friendly for disabled individuals. By implementing minor changes in workflows and practices, Dr. Allard demonstrates how project maintainers can significantly improve the accessibility of their documentation, even without in-depth accessibility knowledge.\n\nThe presentation is structured to provide a brief context setting, an introduction to accessibility principles applicable to documentation and user-facing resources, and practical strategies for auditing, remediating, and implementing\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/general-others\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.",
  "duration": 1999,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "https://2024.pycon.de/program/7UYHYP/",
      "url": "https://2024.pycon.de/program/7UYHYP/"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "http://2024.pycon.de/program/categories/general-others",
      "url": "http://2024.pycon.de/program/categories/general-others"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/2voKwaCuhw4/maxresdefault.jpg",
  "title": "Building accessible documentation sites [PyCon DE & PyData Berlin 2024]",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2voKwaCuhw4"
    }
  ]
}
