{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 23.04.2024\nhttps://2024.pycon.de/program/PLJKUH/\n\n🎓 Watch the dynamic panel of seasoned community organizers share insights and best practices on volunteer organization to foster inclusion and diversity in tech communities.\n\nSpeakers:\nFlorian Wilhelm, Alexander CS Hendorf, Valentina Scipione, Lais Carvalho\n\nDescription:\nAt the upcoming community conference, Florian Wilhelm, Head of Data Science at inovex GmbH, Alexander CS Hendorf, Head of Data & AI at a boutique consultancy, Valentina Scipione, Software Engineering Manager at Planet, and Laís Carvalho, Site Reliability Engineer at Workday Inc., will lead a session on volunteer organization's vital role in tech communities. \nThey will shed light on the challenges and successes of community organization, emphasizing authenticity, inclusion, and diversity. The panel, comprising seasoned community organizers, aims to inspire current and budding leaders in nurturing collaborative and diverse tech ecosystems. \nAttendees will gain insights and best practices from the speakers, who have extensive experience in building and maintaining inclusive communities. This interactive session is open to all individuals passionate about fostering a more inclusive tech environment. Join the panel to learn how to contribute to a vibrant and diverse Python community through effective volunteer organization, creating a supportive and progressive tech ecosystem.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/general-community-diversity-career-life-and-everything-else\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.",
  "duration": 3907,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://2024.pycon.de/program/PLJKUH/",
      "url": "https://2024.pycon.de/program/PLJKUH/"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://2024.pycon.de/program/categories/general-community-diversity-career-life-and-everything-else",
      "url": "http://2024.pycon.de/program/categories/general-community-diversity-career-life-and-everything-else"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/WRhAUBwWEgU/maxresdefault.jpg",
  "title": "Community Conferences under the Hood. Perspectives and Best Practices in Volunteer Organization",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WRhAUBwWEgU"
    }
  ]
}
