{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 24.04.2024\nhttps://2024.pycon.de/program/TCSERC/\n\n🎓 Watch as Jannis Lübbe discusses how to enhance your balcony power plant with Python, covering the basics of plug-in solar systems, energy consumption, and optimizing power output for sustainability.\n\nSpeakers:\nJannis Lübbe\n\nDescription:\nJannis Lübbe, Sensor Developer at ROSEN Group, shared insights on enhancing balcony power plants using Python. As plug-in solar systems gain popularity, the talk focused on understanding household energy consumption and optimizing power output. Lübbe highlighted the simplicity of installing balcony power plants without requiring an electrician. By utilizing devices like WiFi plugs from Shelly and myStrom with REST APIs, power consumption can be measured. Power production, ideally monitored using OpenDTU with compatible microinverters, can also be achieved using WiFi plugs. Recorded values are then published to Redis for observation via WebSockets and FastAPI. Lübbe emphasized the potential for pushing these values to a public server managed by FastAPI and Redis, with access control through social logins like Google or GitHub.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/general-infrastructure-hardware-cloud\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.",
  "duration": 1807,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "https://2024.pycon.de/program/TCSERC/",
      "url": "https://2024.pycon.de/program/TCSERC/"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "http://2024.pycon.de/program/categories/general-infrastructure-hardware-cloud",
      "url": "http://2024.pycon.de/program/categories/general-infrastructure-hardware-cloud"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/5CiDAmKi-k4/maxresdefault.jpg",
  "title": "Enhance your balcony power plant with Python [PyCon DE & PyData Berlin 2024]",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5CiDAmKi-k4"
    }
  ]
}
