{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 23.04.2024\nhttps://2024.pycon.de/program/93MHQ3/\n\n🎓 Watch as Sanket Verma delves into the evolution of the Zarr data format, exploring the latest Version 3.0 and beyond, revealing critical design updates and performance improvements for scalable, persistent storage of large datasets.\n\nSpeakers:\nSanket Verma\n\nDescription:\nSanket Verma, Community Manager at Zarr, presents a systematic exploration of the Zarr Specification Version 3, discussing critical design updates and performance enhancements. Zarr, a data format for storing compressed N-dimensional arrays, offers scalable and persistent storage for large datasets. The talk covers the evolution of Zarr, including the Zarr Enhancement Process and its adoption in the scientific community. The audience will gain insights into Zarr basics, the new features of Zarr Specification V3, and hands-on experience in creating Zarr arrays using Zarr-Python V3.0. The talk targets individuals working with substantial data volumes seeking a transparent, open-source, cloud-optimized, and eco-friendly format, with an intermediate level of Python and NumPy knowledge recommended. Attendees will leave understanding the benefits of Zarr V3 for both local and cloud storage, the importance of project processes, and insights into OSS project maturation.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/pydata-data-handling-engineering\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1804,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "https://2024.pycon.de/program/93MHQ3/",
      "url": "https://2024.pycon.de/program/93MHQ3/"
    },
    {
      "label": "http://2024.pycon.de/program/categories/pydata-data-handling-engineering",
      "url": "http://2024.pycon.de/program/categories/pydata-data-handling-engineering"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/05uyjOP_8OU/maxresdefault.jpg",
  "title": "Exploring Zarr: From Fundamentals to Version 3.0 and Beyond [PyCon DE & PyData Berlin 2024]",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=05uyjOP_8OU"
    }
  ]
}
