{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 23.04.2024\nhttps://2024.pycon.de/program/Z3FALV/\n\n🎓 Watch Farah, a passionate Software Engineer, explain how green software engineering can help in environment sustainability and how to incorporate it into everyday life to protect our planet.\n\nSpeakers:\nFarah\n\nDescription:\nFarah, a Software Engineer at Smartmicro Braunschweig, delivered an insightful talk on Green Software Engineering, emphasizing the pivotal role technology plays in achieving environmental sustainability. Highlighting the pressing issue of global warming, Farah shed light on how software engineering can contribute to alleviating environmental concerns without compromising economic benefits. By integrating green practices throughout the software development cycle - from requirement engineering to end product usage - Farah emphasized the importance of maximizing efficiency and reducing carbon footprints in the digital age. Discussing topics such as Green Requirement Engineering, Architecture and Design, Coding, and Infrastructure Optimization, she provided practical solutions for implementing green software practices. Encouraging the audience to choose coding languages wisely, optimize infrastructure usage, and adopt green computing habits, Farah inspired a shift towards more sustainable software development methods. By the end of the talk, attendees were equipped with actionable steps to incorporate green computing concepts into their daily routines, fostering a more environmentally conscious approach to technology.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/pycon-programming-software-engineering\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.",
  "duration": 1706,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "http://2024.pycon.de/program/categories/pycon-programming-software-engineering",
      "url": "http://2024.pycon.de/program/categories/pycon-programming-software-engineering"
    },
    {
      "label": "https://2024.pycon.de/program/Z3FALV/",
      "url": "https://2024.pycon.de/program/Z3FALV/"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/vTIkZwrrIwM/maxresdefault.jpg",
  "title": "Green Software Engineering [PyCon DE & PyData Berlin 2024]",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vTIkZwrrIwM"
    }
  ]
}
