{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 22.04.2024\nhttps://2024.pycon.de/program/GLXJPC/\n\n🎓 Watch the fascinating journey of the major re-architecture of Haystack 2.0 and discover how modern LLM frameworks can revolutionize your projects.\n\nSpeakers:\nSilvano Cerza\n\nDescription:\nSilvano Cerza, a Senior Software Engineer at deepset, shared the intriguing tale of rewriting Haystack, a free open-source Python LLM framework, in his talk. The decision to revamp the software in 2023 was not taken lightly, considering potential community disruption with breaking changes. By engaging early on with the open-source community and key companies, the team ensured a more adaptable foundation for the future. Silvano highlighted the importance of flexibility and composability in adapting to the evolving LLM landscape. The talk unveiled the enhancements in Haystack 2.0 and offered a glimpse into the roadmap ahead. Attendees gained insights into leveraging modern LLM frameworks to address user needs and long-term community building. The talk underscored Haystack's standout features in modularity and user-friendliness, setting it apart from other libraries. Demos provided a practical understanding of integrating Haystack into diverse projects, sparking innovative ideas for implementation.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/sponsor\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1631,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "https://2024.pycon.de/program/GLXJPC/",
      "url": "https://2024.pycon.de/program/GLXJPC/"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "http://2024.pycon.de/program/categories/sponsor",
      "url": "http://2024.pycon.de/program/categories/sponsor"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/0CNSvGlMNSo/maxresdefault.jpg",
  "title": "Haystack 2.0: the story of a rewrite [PyCon DE & PyData Berlin 2024]",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0CNSvGlMNSo"
    }
  ]
}
