{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 24.04.2024\nhttps://2024.pycon.de/program/9JEZ8E/\n\n🎓 Watch as Tim Paine showcases how to create high-performance data visualization websites using Perspective, ideal for handling large and streaming datasets with ease.\n\nSpeakers:\nTim Paine\n\nDescription:\nTim Paine, Quantitative Developer at Cubist Systematic Strategies and Associate in Computer Science at Columbia University, delivered a talk on \"High Performance Data Visualization for the Web.\" Paine focused on using Perspective, an open-source analytics and data visualization component ideal for large and streaming datasets. Perspective, written in C++ and Rust with bindings to Python and WebAssembly, offers various visualization plugins like datagrids and charts. Moreover, it includes a Jupyter widget for quick iteration towards production websites. The talk highlighted the scarcity of tools within the Python ecosystem capable of handling substantial streaming data and live aggregations, filtering, and sorting. Paine demonstrated setting up a website using Perspective, starting with static data on a FastAPI-based platform, showcasing pivotal features such as sorting, filtering, and cross-filtering. The audience learned how to integrate Perspective into their applications for static and streaming data, ranging from high-performance datagrids to interconnected visualization components.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/pydata-visualisation-jupyter\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1758,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "http://2024.pycon.de/program/categories/pydata-visualisation-jupyter",
      "url": "http://2024.pycon.de/program/categories/pydata-visualisation-jupyter"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "https://2024.pycon.de/program/9JEZ8E/",
      "url": "https://2024.pycon.de/program/9JEZ8E/"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/v5Y5ftlGNhU/maxresdefault.jpg",
  "title": "High Performance Data Visualization for the Web [PyCon DE & PyData Berlin 2024]",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=v5Y5ftlGNhU"
    }
  ]
}
