{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 22.04.2024\nhttps://2024.pycon.de/program/NYHFSB/\n\n🎓 Watch Jon Nordby explain how to deploy machine learning models on microcontrollers using MicroPython and emlearn, enabling the creation of devices that can automatically analyze and react to physical phenomena in a cost-effective manner.\n\nSpeakers:\nJon Nordby\n\nDescription:\nIn the talk by Jon Nordby, Head of Data Science at Soundsensing, attendees will discover how to implement machine learning models on microcontroller-based systems using MicroPython and emlearn. This approach, known as \"TinyML,\" enables the creation of devices capable of analyzing and responding to real-world data captured by sensors like microphones, accelerometers, and cameras. The session will delve into training models with scikit-learn and Keras, and deploying them on devices using the emlearn library. By showcasing applications like Sound Event Detection, Image Classification, and Human Activity Recognition, Jon will illustrate the practicality and versatility of TinyML across various industries and consumer electronics segments.\n\nWith a focus on cost-effective microcontrollers that have become increasingly powerful, Jon will highlight the significance of efficiently utilizing limited resources like RAM and CPU time, a key aspect addressed by emlearn. This open-source Python library facilitates the conversion of machine learning models to efficient C code, ensuring seamless deployment on a wide array of microcontrollers that support C99 compilation. By integrating MicroPython, developers can leverage Python's familiar syntax to code applications for microcontrollers, streamlining the workflow and enhancing productivity. The models generated with emlearn deliver superior performance compared to pure-Python alternatives, paving the way for rapid and optimized model deployment in various applications, from vehicle detection to real-time malware identification.\n\nThroughout the presentation, the audience will gain insights into core machine learning concepts, while also exploring the convergence of Python, microcontrollers, and embedded systems\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/pydata-machine-learning-deep-learning-stats\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1552,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    },
    {
      "label": "http://2024.pycon.de/program/categories/pydata-machine-learning-deep-learning-stats",
      "url": "http://2024.pycon.de/program/categories/pydata-machine-learning-deep-learning-stats"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "https://2024.pycon.de/program/NYHFSB/",
      "url": "https://2024.pycon.de/program/NYHFSB/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/S3GjLr0ZIE0/maxresdefault.jpg",
  "title": "Machine Learning on microcontrollers using MicroPython and emlearn [PyCon DE & PyData Berlin 2024]",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=S3GjLr0ZIE0"
    }
  ]
}
