{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 22.04.2024\nhttps://2024.pycon.de/program/83ZGV3/\n\n🎓 Watch the presentation to discover how Streamlit and Snowflake come together to power up engaging data stories with real-world insights from Deutsche Bahn's datasets!\n\nSpeakers:\nMarie-Kristin Wirsching\n\nDescription:\nMarie-Kristin Wirsching, a Data Scientist at inovex GmbH, presents on the power of Streamlit and Snowflake in enhancing data stories. Data stories are crucial in translating complex insights into actionable narratives for business value. Streamlit, an open-source Python package, simplifies the creation of interactive data dashboards. Since September 2023, Streamlit has been integrated into Snowflake, providing developers the ability to securely build, deploy, and share apps within Snowflake's data cloud, leveraging its scale, performance, and security.\n\nThe talk showcases a proof-of-concept using Deutsche Bahn's open-source dataset on Wi-Fi connectivity in trains to develop a data story implemented through a Streamlit app in Snowflake. Attendees will gain insights into utilizing Streamlit within Snowflake, creating data stories, and implementing Streamlit apps in Snowflake. This talk caters to data enthusiasts looking to present data insights effectively, construct appealing data applications effortlessly, and explore the synergy between Streamlit and Snowflake.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/pydata-data-handling-engineering\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1739,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "https://2024.pycon.de/program/83ZGV3/",
      "url": "https://2024.pycon.de/program/83ZGV3/"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "http://2024.pycon.de/program/categories/pydata-data-handling-engineering",
      "url": "http://2024.pycon.de/program/categories/pydata-data-handling-engineering"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Vinwx4w-iUU/maxresdefault.jpg",
  "title": "Next Stop: Insights! How Streamlit and Snowflake Power Up Data Stories",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Vinwx4w-iUU"
    }
  ]
}
