{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 22.04.2024\nhttps://2024.pycon.de/program/DSFWRC/\n\n🎓 Watch as Florian Bruhin, the mastermind behind pytest, unveils advanced tips and tricks to elevate your testsuite to the next level, from recommended settings to custom fixtures and plugins.\n\nSpeakers:\nFlorian Bruhin\n\nDescription:\nFlorian Bruhin, founder and lecturer known as \"The Compiler,\" presents valuable insights in his talk on pytest tips and tricks for enhancing your testsuite. With a profound understanding of pytest gained through years of contribution, Florian's expertise shines through as he navigates through intermediate and advanced features of the framework. Throughout the training, Florian emphasizes the significance of familiarizing oneself with pytest basics before delving into recommended settings for stricter testing, the utility of xfail, and innovative ways to enhance test suites. Attendees will benefit from Florian's guidance on leveraging built-in pytest fixtures efficiently, advanced fixture and parametrization techniques, and customizing fixture behavior based on markers. Moreover, Florian will touch on patching, mocking, and plugins, offering insights on writing custom plugins. The talk promises to introduce attendees to property-based testing with Hypothesis, adding a new dimension to their testing repertoire. With Florian's comprehensive knowledge and practical tips, participants are sure to elevate their pytest proficiency and optimize their test suites effectively.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/pycon-testing\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.",
  "duration": 5503,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "https://2024.pycon.de/program/DSFWRC/",
      "url": "https://2024.pycon.de/program/DSFWRC/"
    },
    {
      "label": "http://2024.pycon.de/program/categories/pycon-testing",
      "url": "http://2024.pycon.de/program/categories/pycon-testing"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/FG_DgVo0hU0/maxresdefault.jpg",
  "title": "pytest tips and tricks for a better testsuite [PyCon DE & PyData Berlin 2024]",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FG_DgVo0hU0"
    }
  ]
}
