{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 24.04.2024\nhttps://2024.pycon.de/program/VEACZM/\n\n🎓 Watch David Vujic share how Polylith revolutionizes the developer experience by turning software development into a playful LEGO-like creation process in Python monorepos.\n\nSpeakers:\nDavid Vujic\n\nDescription:\nDavid Vujic, a software developer passionate about agile ideas and test-driven development, presents a unique approach to software development in his talk \"Python Monorepos: The Polylith Developer Experience.\" Drawing inspiration from LEGO bricks, he advocates for a more playful and productive developer experience, emphasizing the importance of code simplicity and design flexibility. David introduces Polylith, a Python-specific tool based on the Polylith Architecture originating from the Clojure community. Polylith promotes the use of small building blocks akin to LEGO bricks, facilitating code sharing and reuse within monorepos. By leveraging Polylith's developer-friendly tooling, developers can make design decisions seamlessly while building their projects. David's presentation offers insights into how Polylith can enhance the Python development process, making it more efficient and enjoyable.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/pycon-programming-software-engineering\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.",
  "duration": 1783,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "http://2024.pycon.de/program/categories/pycon-programming-software-engineering",
      "url": "http://2024.pycon.de/program/categories/pycon-programming-software-engineering"
    },
    {
      "label": "https://2024.pycon.de/program/VEACZM/",
      "url": "https://2024.pycon.de/program/VEACZM/"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/wGWjt9GJLU4/maxresdefault.jpg",
  "title": "Python Monorepos: The Polylith Developer Experience [PyCon DE & PyData Berlin 2024]",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wGWjt9GJLU4"
    }
  ]
}
