{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 24.04.2024\nhttps://2024.pycon.de/program/Y7R9GZ/\n\n🎓 Watch how Matthieu Amiguet transforms a complex callback mess into a readable and efficient system using generators in computer-assisted live music.\n\nSpeakers:\nMatthieu Amiguet\n\nDescription:\nIn a fascinating talk titled \"Replacing Callbacks with Generators: A Case Study in Computer-Assisted Live Music,\" Matthieu Amiguet, a musician and mathematician turned developer, shared insights based on his work at Les Chemins de Traverse. The collective, which focuses on sonic exploration and live performance, dived into the challenges faced in developing an interactive realtime audio processing system for live music performances. They found that the use of callbacks, although commonly employed in programming, became burdensome in this context.\n\nAmiguet detailed how they streamlined their system by implementing a thin abstraction layer, replacing complex callback structures with more readable generators. By utilizing generators, which yield results instead of the traditional return method, they were able to enhance the efficiency and clarity of their code significantly.\n\nAt Les Chemins de Traverse, they blend different musical styles and techniques, creating a unique sonic experience. By leveraging tools like Olivier Bélanger's pyo module for realtime audio processing, they aim to augment traditional acoustical instruments with computer-generated sounds, adding a new dimension to live music performances.\n\nThrough their experience, Amiguet showcased how a thoughtful abstraction layer can simplify code, enabling a more focused approach to music production rather than getting entangled in technical complexities. While their case study is music-specific, the principles they applied can be adapted to various scenarios where callbacks lead to convoluted and cumbersome code structures.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/pycon-python-language-ecosystem\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.",
  "duration": 1684,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://2024.pycon.de/program/categories/pycon-python-language-ecosystem",
      "url": "http://2024.pycon.de/program/categories/pycon-python-language-ecosystem"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "https://2024.pycon.de/program/Y7R9GZ/",
      "url": "https://2024.pycon.de/program/Y7R9GZ/"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/PkAE6dsqIJw/maxresdefault.jpg",
  "title": "Replacing Callbacks with Generators: A Case Study in Computer-Assisted Live Music",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PkAE6dsqIJw"
    }
  ]
}
