{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 24.04.2024\nhttps://2024.pycon.de/program/A8HJHV/\n\n🎓 Watch as Shahriyar Rzayev delves into the world of race condition vulnerabilities in Python, equipping viewers with practical skills to enhance code security and robustness.\n\nSpeakers:\nShahriyar Rzayev\n\nDescription:\nShahriyar Rzayev, a Senior Software Engineer at NordVPN under Nord Security, is set to lead an insightful workshop on race condition vulnerabilities in Python. The session will delve into the security risks associated with race conditions, often overlooked in Python development. Attendees will engage with practical exercises, analyzing vulnerable Python applications to pinpoint critical sections prone to race conditions. The workshop progresses to simulate attacks exploiting these weaknesses, showcasing the ease with which malicious entities can capitalize on such vulnerabilities. Participants will also explore effective mitigation strategies, focusing on thread synchronization and safe programming practices to bolster code security. By the end of the workshop, attendees will possess a comprehensive understanding of race conditions in Python and practical skills to fortify the security of their projects, reflecting contemporary best practices in Python development.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/pycon-security\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.",
  "duration": 4795,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://2024.pycon.de/program/categories/pycon-security",
      "url": "http://2024.pycon.de/program/categories/pycon-security"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "https://2024.pycon.de/program/A8HJHV/",
      "url": "https://2024.pycon.de/program/A8HJHV/"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/wzpFKWTa0kM/maxresdefault.jpg",
  "title": "Securing Python: Race Condition Vulnerabilities [PyCon DE & PyData Berlin 2024]",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wzpFKWTa0kM"
    }
  ]
}
