{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 22.04.2024\nhttps://2024.pycon.de/program/RBNJRK/\n\n🎓 Watch how modern databases are revolutionizing machine learning model development and inference in this insightful talk by Gregor Bauer from Couchbase.\n\nSpeakers:\nGregor Bauer\n\nDescription:\nGregor Bauer, Manager Solutions Engineering at Couchbase, presents a groundbreaking approach in his talk at the conference. He discusses the fusion of machine learning models with modern databases, unlocking unique capabilities for users. The talk outlines the transition from traditional model-building workflows to utilizing current databases for enhanced machine learning outcomes.\n\nAs the volume of data surged over the years, databases became the natural storage choice. Typically, data would be retrieved from databases, transformed into features, and used for model training. In some instances, these features would be stored in feature stores within databases for future use. Real-time model inference was enabled through services or API endpoints for delivering results to end-users.\n\nTo cater to evolving needs, modern databases now integrate features that facilitate machine learning model development. Gregor details the diverse offerings such as supporting common models like linear regression, image classification, and text processing. Moreover, these databases streamline model deployment by eliminating the need for external services for inference. Instead, they offer native interfaces like SQL queries for seamless inferencing.\n\nA notable example shared by Gregor illustrates the creation of a custom model in Python and its integration within Couchbase database. This integration simplifies the inference process by seamlessly incorporating the model into database queries. The talk underscores the profound impact of modern databases in advancing machine learning capabilities.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/pydata-machine-learning-deep-learning-stats\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 2628,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://2024.pycon.de/program/RBNJRK/",
      "url": "https://2024.pycon.de/program/RBNJRK/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "http://2024.pycon.de/program/categories/pydata-machine-learning-deep-learning-stats",
      "url": "http://2024.pycon.de/program/categories/pydata-machine-learning-deep-learning-stats"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Gh9UZ95GBNg/maxresdefault.jpg",
  "title": "Select ML from Databases [PyCon DE & PyData Berlin 2024]",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Gh9UZ95GBNg"
    }
  ]
}
