{
  "description": "🔊 Recorded at PyCon DE & PyData Berlin 2024, 22.04.2024\nhttps://2024.pycon.de/program/7898PU/\n\n🎓 Watch as John Sandall takes you on a journey to build a real-time, on-device GenAI-powered application for live transcription and summarization using open-source components, no ML expertise required!\n\nSpeakers:\nJohn Sandall\n\nDescription:\nJohn Sandall, CEO of Coefficient, will be sharing his insights on building an open-source tool for live transcription and conversation summarization during his talk. The session will guide participants through creating a real-time GenAI-powered application that operates offline, ensuring data privacy. Attendees will learn to construct a live streaming voice-to-text transcription pipeline along with an LLM-based conversation summarization layer. The presentation will include a practical demonstration using open-source Python libraries such as Streamlit for the frontend and Django for the backend. The talk is tailored for Python enthusiasts, requiring no prior ML expertise, and aims to empower attendees to design personalized, specialized tools for their unique needs. By demonstrating the simplicity of building LLM-based applications, John will inspire the audience to explore the vast possibilities offered by open-source AI components. Attendees can expect engaging live demos, plenty of Python code, and GitHub resources for hands-on experimentation. The talk will showcase the ease of integrating various tools like Whisper for transcription, LangChain for summarization, and Django for web API, highlighting the accessibility and versatility of modern open-source AI solutions.\n\n⭐️ About PyCon DE & PyData Berlin:\nThe PyCon DE & PyData conference unite the Python, AI, and data science communities, offering a unique platform for collaboration and innovation. The PyCon DE & PyData Berlin 2024 conference, hosted in partnership with the local Berlin PyData chapter, provided an exceptional experience, fostering deeper connections within the Python community while showcasing advancements in AI and data science. Attendees enjoyed a diverse and engaging program, solidifying the event as a highlight for Python and AI enthusiasts nationwide.\n\nFollow us:\n   •  LinkedIn: https://www.linkedin.com/company/28908640/\n   •  X: https://www.x.com/pyconde\n   •  X: https://www.x.com/pydataberlin\n\nLinks:\n   • Conference website: http://pycon.de\n   • Related sessions: http://2024.pycon.de/program/categories/pydata-generative-ai\n\nThe conference is organized by\n   • Python Softwareverband e.V.: http://pysv.org\n   • NumFOCUS Inc.: http://numfocus.org\n   • Pioneers Hub gemeinnützige GmbH: http://pioneershub.org\n\n\nIf you enjoyed this session, please like, comment, and subscribe to our channel for more insightful talks and discussions.\nShare this video with your network to spread the knowledge!\n\nHashtags:\n#Python #PyConDE #PyData #OpenSource #AI #DataScience #MachineLearning #SoftwareDevelopment #LLMs #Community\n\nAcknowledgements:\nSpecial thanks to all the volunteers and sponsors who made this event possible.\n\nAbout:\nPython Softwareverband e.V.:\nPySV is a non-profit that promotes the use and development of Python in Germany through events, education, and advocacy, fostering an open Python community.\n\nNumFOCUS Inc.\nsupports open-source scientific computing by providing financial and logistical support to key projects like NumPy and Jupyter, promoting sustainable development and collaboration.\n\nPioneers Hub gemeinnützige GmbH:\nis a non-profit fostering innovation in AI and tech by connecting experts and promoting knowledge exchange through events and collaborative initiatives.\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1569,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2024.pycon.de/"
    },
    {
      "label": "https://www.x.com/pyconde",
      "url": "https://www.x.com/pyconde"
    },
    {
      "label": "https://www.linkedin.com/company/28908640/",
      "url": "https://www.linkedin.com/company/28908640/"
    },
    {
      "label": "http://numfocus.org",
      "url": "http://numfocus.org"
    },
    {
      "label": "http://pycon.de",
      "url": "http://pycon.de"
    },
    {
      "label": "http://pysv.org",
      "url": "http://pysv.org"
    },
    {
      "label": "https://2024.pycon.de/program/7898PU/",
      "url": "https://2024.pycon.de/program/7898PU/"
    },
    {
      "label": "http://pioneershub.org",
      "url": "http://pioneershub.org"
    },
    {
      "label": "https://www.x.com/pydataberlin",
      "url": "https://www.x.com/pydataberlin"
    },
    {
      "label": "http://2024.pycon.de/program/categories/pydata-generative-ai",
      "url": "http://2024.pycon.de/program/categories/pydata-generative-ai"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/C8gm8S90Ys4/maxresdefault.jpg",
  "title": "Whispered Secrets: Building An Open-Source Tool To Live Transcribe & Summarize Conversations",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=C8gm8S90Ys4"
    }
  ]
}
