{
    "description": "We’ll revisit three stories from WWII where statisticians for the Allied forces got things perfectly right - and terribly wrong. We'll explore the flaws of averages, survivorship bias, and the German tanks problem. Drawing parallels to modern business situations, we'll discuss the takeaways for modern day data scientists.\n\nWorld War II, the largest armed conflict in human history, not only required unfathomable firepower but also unprecedented brain power. Data scientists - or statisticians as they were called back in the day - worked tirelessly to advance military technology and produce indispensable intelligence reports. Eighty years on, the lessons they learned remain relevant and are important for anyone doing data science or analysis at present.\n\nIn this talk, we’ll visit three stories from WWII and discuss how the lessons learned then apply for modern day business settings. We’ll explore:\n- How the flaw of averages made the scientifically optimised cockpit to be a perfect fit for no-one.\n- How survivorship bias impacted the armour placed on bomber planes.\n- How the need to assess the monthly rate of German tank production bred a simple solution.\n\nIn the second part of the talk we’ll discuss how learnings from these stories can be used in a business environment, working through business use-cases with real (looking) data and some basic Python manipulations.\n\nWhile the talk was prepared with data scientists and analysts in mind, anyone with a curious mind may find it worthwhile. Basic familiarity of Python is helpful but not required. By the end of this talk audience members will be familiar with several common pitfalls in data science and equipped to handle business problems in a more mature and well-rounded way.",
    "language": "eng",
    "recorded": "2023-09-24",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2023.pyconuk.org/"
        }
    ],
    "speakers": [
        "Alon Nir"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/yXGQBB_RFec/hqdefault.jpg",
    "title": "3 Lessons Data Scientists Can Learn from World War II",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=yXGQBB_RFec"
        }
    ]
}