{
    "description": "Technology is often hidden backstage at the theatre – a toolkit to enhance performance, not something artists make plays about. But generations of audience members have ‘grown up online’. To tell contemporary stories, don’t we need to put tech centre stage? What is digital theatre – and is it still theatre?\n\nAda Lovelace was the daughter of a social reformer and a mad/bad/dangerous-to-know poet. She grew up to be a mathematician, an analyst, a musician, a gambler, and the first computer programmer. But the engine she coded for was never built – and she didn’t live to see whether her programme worked or not. \n\nI’m the daughter of an English tutor and a ‘works in software’. I’ve grown up to be a playwright and a digital theatre-maker. I was also commissioned to research, write, and develop a play about Ada Lovelace, music, AI, and poetical science. But it was never staged – and I have no idea if it works in performance or not.  \n\nLuckily I’m not dead yet, and I have actually managed to stage other work exploring how tech-y themes, online communities, and virtual spaces work in live theatre. My theatre-making overlaps with gaming, radio, film, and livestreaming. I love thinking about how staging the tech can create restrictions/opportunities, feeding into the form and the theme of a story. And I’m especially interested in how theatre – an artform that had to change dramatically to survive lockdown – might move forwards now that audiences are more reluctant to leave their homes than ever.\n\nIf you’re not the kind of person who goes to the theatre then you might be the kind of person who’s up for digital theatre – poetical science, maybe, rather than just poetry. If, of course, we can agree on what digital theatre even is…",
    "language": "eng",
    "recorded": "2023-09-23",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2023.pyconuk.org/"
        }
    ],
    "speakers": [
        "Emily Holyoake"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/PeUb0D8VDWU/hqdefault.jpg",
    "title": "If you can’t give me poetry, can’t you give me poetical science?",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=PeUb0D8VDWU"
        }
    ]
}