{
    "description": "Tired of complex code? Python's standard library has tools to simplify your tasks! Join us for a tour of the standard library where we'll dive into less-known modules that do well-known things and well-known modules that do less-known things.\n\nThe Standard Library Tour is designed to provide attendees with an understanding of Python's standard library less known features. Have you ever found yourself writing complex code only to discover that Python has tools available within its library that could have made your job easier? Then this talk is for you!\n\nThe outline of the talk:\n\n* Basic information about the library\n* Well-known modules which do less-known things\n\n  - functools less-known features: @singledispatch, partial(), @cache\n  - itertools less-known features: product(), filterfalse(), zip_longest()\n  - collections less-known features: ChainMap, defaultdict\n\n* Less-known modules which do well-known things\n   * doctest for testing: testmod()\n   * Difflib & Filecmp for comparison: Difflib.SequenceMatcher, Filecmp.cmpfiles()\n   * contextlib for tasks involving the with statement: @contextmanager, @asynccontextmanager\n\n\nBy attending this session, you'll gain a deeper understanding of Python's standard library and you'll discover the \"unknown unknowns\" - tools that you may not even know exist within Python's standard library. By becoming familiar with the library and all of its capabilities, you'll be better equipped to solve problems and build applications more efficiently, without reinventing the wheel. You'll also receive recommendations on where to find additional resources and information so you can continue learning and exploring Python's tools after the conference has ended.",
    "language": "eng",
    "recorded": "2023-09-24",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2023.pyconuk.org/"
        }
    ],
    "speakers": [
        "Mia Bajić"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/9J3Wfizht9E/hqdefault.jpg",
    "title": "The Standard Library Tour",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=9J3Wfizht9E"
        }
    ]
}
