{
    "description": "This talk will present how one can use acoustic-based clinical gait analysis to predict onset & progression of cognitive decline as well as assess increase in risk of falls in highly frail and vulnerable demographics of the population, especially older adults who live alone and with multiple co-morbidities.\n\nDo you know how the sound of your footsteps can be used to predict the likelihood of a fatal fall? Do you know that they can also be used to predict whether you will develop dementia in the next 6 months or so?\n\nThis talk will be a gentle introduction to the world of clinical gait analysis and how your gait (a.k.a the way you walk) is a digital biomarker for predicting physical and cognitive health. We will take an strong multidisciplinary approach where we will combine know-how of clinical science, remote monitoring, assistive technology and state-of-art acoustic AI engineering to showcase how this is possible.\n\nThe topics that we will cover are as follows:\n\nDigital Biomarker Engineering : We will discuss the framework of how you can feature engineer health indictors (\"biomarkers\") from data collected by sensors in an IOT ecosystem like PIR, magnetic sensors and even microphones/audio recorders.\nGait Analysis : We will do a crash course on Human Gait to set the foundation required to use gait data to predict for neurodegenerative conditions and cognitive decline.\nAcoustic Gait Analysis : We will spend majority of our time here to understand how acoustics engineering and machine learning can help in analysing human gait from just audio recordings to predict for cognitive decline discussed in #2 earlier.\nTo demonstrate a real life application, I will share how this concept was used to track the progression of dementia of an older adult over the past 2 years.\n\nI will showcase the tech stack to make this possible.\nI will showcase the challenges we faced along the way in undertaking niche research, architecture development, AI development and real-life feedback from the older adult, family members and care-givers.",
    "language": "eng",
    "recorded": "2023-09-23",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2023.pyconuk.org/"
        }
    ],
    "speakers": [
        "Debayan Das"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/4M9VNKVEX5o/hqdefault.jpg",
    "title": "The Sound of Your Footsteps can Predict for Dementia",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=4M9VNKVEX5o"
        }
    ]
}