{
    "description": "As creators of software, we're repeatedly told that we're not merely imagining the future of the world, but bringing it into being. Let's suppose that's true. What, exactly, are we imagining, and why does it matter?\n\nOf all our faculties, imagination is usually considered the freest, the seat of creation. I'm interested in what we are doing with this freedom, and I am suspicious of it.\n\nAt the same time, I believe that our imagination tells us truths we might not always want to hear, forcefully. \n\nIn this talk I want to pay attention to the programmer's imagination, and show how the imagination draws lines between things as disparate as Django's success page for new projects and [Dracoraptor hanigani](https://en.wikipedia.org/wiki/Dracoraptor), the recently discovered Welsh dinosaur (on view at the National Museum, next door to Cardiff City Hall). \n\nAs programmers, our imagination conjures up new worlds on blank pages, but I think that imagination can always be traced back to assumptions, prejudices and desires that are active right now - the programmer's imagination isn't telling us about the future, but about *now* - and what's wrong with it.\n\nI want to show what the imagination has meant for what we do with the software we create, and what it means for the future. I will use it to identify some of the things we have lost in the last decades, and how we can find them again.\n\nAmongst other things I'll discuss dinosaurs and birds, palaeoart and 1980s computer programming books, David H Ahl and Joseph Wiezenbaum, to help make sense of what we're doing, what we think we're doing, the relationship between them - and what, perhaps, we *should* be doing.",
    "language": "eng",
    "recorded": "2023-09-24",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2023.pyconuk.org/"
        }
    ],
    "speakers": [
        "Daniele Procida"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/25onRvaR3MA/hqdefault.jpg",
    "title": "The programmer's imagination",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=25onRvaR3MA"
        }
    ]
}