{
  "abstract": "There's been a lot of exciting developments in the past few years using\nnew neural network techniques to classify images and video. Some of the\nnew techniques address text and language processing problems as well.\nBut, beyond LSTMs there is not as much focus in applying these new\ntechniques to time- series modeling. This talk describes an experimental\napproach to modeling advertising category value using network\narchitectures inspired by both the current wave of 2D convolutional\nneural network layer architectures and also the more traditional 1D\nconvolution filters as they apply to discrete time signal processing.\n\nWe present some experimental network architectures using these\ninspirations that have performance at parity and better with standard\nARIMA models. Practicing data scientists as well as those with some\nknowledge of neural networks should find this talk of interest. We also\npresent an open source Python package using standard neural network\ntools which implements this approach.\n",
  "copyright_text": null,
  "description": "This talk describes an experimental approach to time series modeling\nusing 1D convolution filter layers in a neural network architecture.\nThis approach was developed at System1 for forecasting marketplace value\nof online advertising categories.\n",
  "duration": 2135,
  "language": "eng",
  "recorded": "2018-10-22",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/la2018/schedule/"
    },
    {
      "label": "Slides",
      "url": "https://www.slideshare.net/PyData/1d-convolutional-neural-networks-for-time-series-modeling-nathan-janos-jeff-roach"
    }
  ],
  "speakers": [
    "Nathan Janos",
    "Jeff Roach"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/nMkqWxMjWzg/maxresdefault.jpg",
  "title": "1D Convolutional Neural Networks for Time Series Modeling",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nMkqWxMjWzg"
    }
  ]
}
