{
  "abstract": "For this workshop, existing materials are Jupyter notebooks available on\njuliabox.com, where attendees can use Julia in a sandbox environment\nwithout any prior installation. Because we (the instructors) and\ntutorial attendees will be working in the same Julia notebooks,\nattendees will be able to interact with tutorial materials and play with\ncode throughout the tutorial. Each notebook will have easy exercises at\nits end to help participants become comfortable working in Julia and to\nstart writing code within the first few minutes of the tutorial. The\nnames/topics of these Jupyter notebooks are 1. Getting started with\nJulia 2. Strings 3. Data structures 4. Loops 5. Conditionals 6.\nFunctions 7. Packages 8. Plotting 9. Julia is fast 10. Multiple dispatch\n11. Basic linear algebra 12. Factorizations and other fun The primary\npurpose of notebooks 1 to 6 is to provide an interactive crash course in\nJulia’s syntax and to show how easy these syntax are to pick up,\nespecially when coming from Python. In notebooks 7 and 8, we’ll see how\nto use the Julia package manager and how to create basic plots. Finally,\nnotebooks 9, 10, 11, and 12 give a taste of Julia’s speed, power, and\ngenericity.\n",
  "copyright_text": null,
  "description": "This introductory workshop assumes no prior exposure to Julia. It should\nbe accessible (and hopefully useful!) to scientists, engineers, and\nanyone else with technical computing needs. We will show you why Julia\nis special, demonstrate how easy it is to come to Julia from a Python\nbackground, and get you writing your first Julia programs.\n",
  "duration": 5855,
  "language": "eng",
  "recorded": "2018-10-21",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/la2018/schedule/"
    }
  ],
  "speakers": [
    "Jane Herriman"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/IpjssmJXcbc/maxresdefault.jpg",
  "title": "An Introduction to Julia",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IpjssmJXcbc"
    }
  ]
}
