{
  "copyright_text": null,
  "description": "PyData LA 2018\n\nForecasting time-series data has applications in many fields, including finance, health, etc. There are potential pitfalls when applying classic statistical and machine learning methods to time-series problems. This talk will give folks the basic toolbox to analyze time-series data and perform forecasting using statistical and machine learning models, as well as interpret and convey the outputs.\n\nSlides - https://www.slideshare.net/PyData/applying-statistical-modeling-and-machine-learning-to-perform-timeseries-forecasting\n---\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.\n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.",
  "duration": 5164,
  "language": "eng",
  "recorded": "2018-10-22",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/la2018/schedule/"
    },
    {
      "label": "https://www.slideshare.net/PyData/applying-statistical-modeling-and-machine-learning-to-perform-timeseries-forecasting",
      "url": "https://www.slideshare.net/PyData/applying-statistical-modeling-and-machine-learning-to-perform-timeseries-forecasting"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/JntA9XaTebs/maxresdefault.jpg",
  "title": "Applying Statistical Modeling and Machine Learning to Perform Time-Series Forecasting - Tamara Louie",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JntA9XaTebs"
    }
  ]
}
