{
  "abstract": "Folks who attend this session will gain a basic understanding of\ndifferent time series modeling and forecasting methods, both statistical\nand machine learning based.\n\nThis tutorial will include: - Why it is important to consider\ntime-series data differently than other data for modeling and\nforecasting. - How to process time-series data for modeling and\nforecasting purposes. - How to perform exploratory analysis and create\ninformative statistical plots to better understand time-series data\n(e.g., auto-correlation and partial auto- correlation, covariance\nmatrices). - Provide a couple of examples of statistical and machine\nlearning models to perform forecasting tasks. - Detail the strengths and\nweaknesses of different modeling methods through examples. - How to\nevaluate, interpret, and convey the output from forecasting models.\n",
  "copyright_text": null,
  "description": "Forecasting time-series data has applications in many fields, including\nfinance, health, etc. There are potential pitfalls when applying classic\nstatistical and machine learning methods to time-series problems. This\ntalk will give folks the basic toolbox to analyze time-series data and\nperform forecasting using statistical and machine learning models, as\nwell as interpret and convey the outputs.\n",
  "duration": 5164,
  "language": "eng",
  "recorded": "2018-10-21",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/la2018/schedule/"
    },
    {
      "label": "Slides",
      "url": "https://www.slideshare.net/PyData/applying-statistical-modeling-and-machine-learning-to-perform-timeseries-forecasting"
    }
  ],
  "speakers": [
    "Tamara Louie"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/JntA9XaTebs/maxresdefault.jpg",
  "title": "Applying Statistical Modeling and Machine Learning to Perform Time-Series Forecasting",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JntA9XaTebs"
    }
  ]
}
