{
  "abstract": "Lots of data in the wild has a clustered structure. In fact, clustered\ndata is all around us. The best way to attack it? Mixed effect models.\nBased on the work of Prof. Larocque from HEC and Prof. Ahlem from l’UQAM\nand later expanded upon by Sourav and the team at Manifold, they\ndeveloped an open source- implementation package for the Python\ncommunity to use, — and build upon: Mixed Effects Random Forests.\n\nTL;DR: MERFs are great if your model has non-negligible random effects,\ne.g. there are large idiosyncrasies by cluster. Want to learn more? Read\non.\n\nSourav will explain how the mixed effects random forests model marries\nthe world of classical mixed effect modeling with modern machine\nlearning algorithms, and how it can be extended to be used with other\nadvanced modeling techniques like gradient boosting machines and deep\nlearning. He will dive into the MERF algorithm including origins, model,\nprinciples, mathematical details, and predictions for known and new\nclusters, provide examples of use cases of mixed effects random forests,\nand demonstrate MERF performance on synthetic and real data.\n\nLearn the history of mixed effect modeling, why the mixed effect random\nforests model is the best way to attack clustered data as opposed to\nother modeling techniques like complete pooling, one hot encoding, and\nthe classical mixed effects model, and how to use the MERF open source\nPython package on your data.\n",
  "copyright_text": null,
  "description": "Clustered data is all around us. The best way to attack it? Mixed effect\nmodels. Sourav will explain the use cases of MERF, how the mixed effects\nrandom forests model marries the world of classical mixed effect\nmodeling with modern machine learning algorithms, and how it can be\nextended to be used with other advanced modeling techniques like\ngradient boosting machines and deep learning.\n",
  "duration": 2201,
  "language": "eng",
  "recorded": "2018-10-22",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/la2018/schedule/"
    }
  ],
  "speakers": [
    "Sourav Dey"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/gWj4ZwB7f3o/maxresdefault.jpg",
  "title": "Attacking Clustered Data with a Mixed Effects Random Forests Model in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gWj4ZwB7f3o"
    }
  ]
}
