{
  "abstract": "Businesses derive value from their customer base. This makes it critical\nto be able to forecast the value of a customer to the business. At the\nsame time, modeling customer behavior is not a straightforward\nmeasurement -- the data generating process is subtle, data is\ncharacteristically sparse & stochastic, and heterogeneity abounds.\n\nWe'll look at business analysis from a customer-centric mindset, where\nanalysis of growth and retention is at the core. We'll dive into the\nmodel of Fader & Hardie, which provides a principled, probabilistic\nmodel to forecast customer lifetime value (CLV) from a stream of\npurchases. We'll motivate multilevel models and show how they can\naccount for customer heterogeneity in purchase behavior. We'll analyze\npredictive fits using lifetimes, an open- source implementation of\nseveral useful Bayesian CLV models. We'll look across businesses and\nbriefly cover insights that come from looking at large-scale datasets of\ncustomer purchase behavior.\n\nCLV estimates have a multitude of business uses, across: *forecasting of\ncashflow, profitability and demand* investment & valuation *customer\nbase segmentation* allocation of marketing spend, or \\* monitoring the\nhealth of the business\n\nData scientists and business analysts should leave this talk with\nanother tool in their predictive modeling toolkit. More importantly,\nthey should have clarity on how customer lifetime value is defined, how\nit can be reasoned about, and how forward-looking estimates can be fit\nfrom purchase data.\n",
  "copyright_text": null,
  "description": "Businesses derive value from their customer base. This makes it critical\nto forecast the value of a customer to the business -- critical but\ntricky. We'll introduce probabilistic models for estimating customer\nlifetime value, look at real world data across industries, and talk\nabout how this fits into a business analysis toolbox (spoiler alert:\nit's everywhere).\n",
  "duration": 2159,
  "language": "eng",
  "recorded": "2018-10-23",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/la2018/schedule/"
    },
    "https://github.com/b11z/pydata-la-18-clv"
  ],
  "speakers": [
    "Brian Bloniarz"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/f3ua_dDjTNU/maxresdefault.jpg",
  "title": "Customer Lifetime Value: Models, Metrics and a Multitude of Uses",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=f3ua_dDjTNU"
    }
  ]
}
