{
  "abstract": "When machine learning models make decisions that affect people’s lives,\nhow can you be sure those decisions are fair? What does it even mean for\nan algorithm to be \"fair\"? As machine learning becomes more prevalent in\nsocially impactful domains like policing, lending, and education these\nquestions take on a new urgency.\n\nIn this talk I’ll introduce several common metrics which measure the\nfairness of model predictions. Next I’ll relate these metrics to\ndifferent notions of fairness and show how the context in which a model\nis used determines which metrics (if any) are applicable. Finally I’ll\nillustrate the difficulties of applying fairness measures to real-world\nproblems with a case study using data from one of Civis Analytics’s\nclient engagements.\n\nTakeaways\n~~~~~~~~~\n\nBy the end of this talk you should be familiar with several common\nfairness metrics, be aware of the tradeoffs between them, and understand\nthe subtleties of applying these metrics to real-world problems.\n\nIntended audience\n~~~~~~~~~~~~~~~~~\n\nThis talk is for data scientists or researchers who are training models\nwhose decisions can affect people. It will be accessible to anyone with\nan understanding of binary classification problems.\n",
  "copyright_text": null,
  "description": "Machine learning models are increasingly used to make decisions that\naffect people’s lives. With this power comes a responsibility to ensure\nthat model predictions are fair. In this talk I’ll introduce several\ncommon model fairness metrics, discuss their tradeoffs, and finally\ndemonstrate their use with a case study analyzing anonymized data from\none of Civis Analytics’s client engagements.\n",
  "duration": 1880,
  "language": "eng",
  "recorded": "2018-10-23",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/la2018/schedule/"
    },
    {
      "label": "Slides",
      "url": "https://www.slideshare.net/PyData/measuring-model-fairness-stephen-hoover"
    }
  ],
  "speakers": [
    "Stephen Hoover"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/9h-j18RrYAM/maxresdefault.jpg",
  "title": "Measuring Model Fairness",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9h-j18RrYAM"
    }
  ]
}
