{
  "abstract": "This tutorial will introduce the basics of network theory and working\nwith graphs/networks using python and the NetworkX package. This will be\na hands on tutorial and will require writing a lot of code snippets. The\nparticipants should be comfortable with basic python (loops,\ndictionaries, lists) and have some (minimal) experience with working\ninside a jupyter notebook.\n\nBroadly the tutorial is divided into three parts:\n\nPart A (20 mins) - Basics of graph theory, NetworkX and various examples\nof networks in real life.\n\nPart B (35 mins) - Study the Game of Thrones network and find important\ncharacters and communities in the network.\n\nPart C (35 mins) - Analyze the structure of the US Airport dataset and\nlook at the temporal evolution of the network from 1990 to 2015.\n\nBy the end of the tutorial everyone should be comfortable with hacking\non the NetworkX API, modelling data as networks and basic analysis on\nnetworks using python.\n\nThe tutorial and the datasets is available on GitHub at:\nhttps://github.com/MridulS/pydata-networkx\n",
  "copyright_text": null,
  "description": "Network Science deals with modeling and analyzing networks. Politics,\nmathematics, law, finance, pretty much any data can be modelled as a\nnetwork and in this tutorial we introduce the basic of network theory\nusing the pydata ecosystem(NetworkX, Pandas, matplotlib) and we will use\na Game of Thrones character network and the US Airport dataset to look\nat some real world network data.\n",
  "duration": 5097,
  "language": "eng",
  "recorded": "2018-10-21",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/la2018/schedule/"
    },
    "https://github.com/MridulS/pydata-networkx"
  ],
  "speakers": [
    "Mridul Seth"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/q8zqU9nWzDE/maxresdefault.jpg",
  "title": "Network Science, Game of Thrones and US Airports",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=q8zqU9nWzDE"
    }
  ]
}
