{
  "abstract": "In this workshop we will be dealing with the entire text analysis\nprocess - this means we'll start by finding our data, set up a pipeline\nto clean our text, annotate it, and then have it ready to do some more\nadvanced analysis. We will also spend a while discussing the different\nways you can actually create your own dataset for text analysis, and how\nmany of our personal textual data (e-mails, messages, tweets) can be\naccessed and used.\n\nAfter this, we'll introduce two different approaches to playing with\ntext - one is a more statistical, machine learning apporach, where we\nwill use Topic Modelling, Clustering/Classification, and Deep Learning\ntechniques to understand what may be hidden in our text. The other\ntechnique is a Computational Linguistics approach, where we will use\nlinguistic information such as Part-Of-Speech tags, Named Entity\nRecognizers and Dependency trees.\n\nThe tutorial will be carried out via a Jupyter Notebook, and the\npackages we will use will be spaCy, Gensim, and Keras. The purpose of\nthe tutorial is to introduce the audience to the different sources of\ntextual data available, and give a taste of the different ways we can\napproach our analysis. It is meant to be more of a breadth than depth\nsurvey of the techniques in the field, and we leave the audience to\ndecide which technique would be most useful for their particular\nuse-case.\n",
  "copyright_text": null,
  "description": "Not only is there an abundance of textual data, there is also an\nabundance of tools help analyse this data - and it is tough to choose\nthe right tool for the right task. In this workshop we will be dealing\nwith the entire text analysis process - this means we'll start with\nfinding data, set up a pipeline to clean our text, annotate it, and then\nhave it ready to do some more advanced analysis.\n",
  "duration": 5242,
  "language": "eng",
  "recorded": "2018-10-21",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/la2018/schedule/"
    },
    "https://github.com/bhargavvader/personal/tree/master/notebooks/text_analysis_tutorial"
  ],
  "speakers": [
    "Bhargav Srinivasa Desikan"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/mWSs325tGoc/maxresdefault.jpg",
  "title": "Tips, Tricks and Topics in Text Analysis",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mWSs325tGoc"
    }
  ]
}
