{
  "abstract": "Hands on Demo! Get ready to get excited about Cassandra, Spark, Jupyter,\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n\nData Science, and Python!\n\nRequirements: Some knowledge of python, some knowledge of databases,\n''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''\n\nsome knowledge of Jupyter, experience of installing Linux based software\non your laptop. Windows users might want to have a Linux based VM ready\nto be used for this. Must be able to install on laptop, or just happy to\nsit and follow along.\n\n-  15 minute presentation on \"What is Apache Cassandra/DataStax\n   Enterprise, What is Apache Spark, and What is Sentiment Analysis\"\n-  30 minutes Installing DataStax Enterprise and Jupyter on laptops\n-  10 minutes setting up a Twitter Dev account (People may also choose\n   to just get data from provided CSV files)\n-  5 minutes installing dependencies (pandas, numpy etc)\n-  15 minutes walking through Jupyter notebook together\n-  15 minutes exploring, questions, and wrap up discussion \"How could we\n   have gotten better results etc?\"\n\nBy the end of the 90 minutes everyone should be able to run the notebook\n''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''\n\nindependently, have Cassandra (DataStax Enterprise) installed, explore\nother topics (changing search terms etc)\n",
  "copyright_text": null,
  "description": "In this tutorial, we’ll use sentiment analysis on Twitter data about the\nlatest movie titles to answer that age old question: “Is that movie any\ngood?” We’ll show how we built the solution using Apache Cassandra,\nApache Spark, DataStax Enterprise Analytics, Python and Jupyter\nnotebooks. This is a great tutorial to attend if you are new to big data\nor want to learn more about Cassandra and Spark!\n",
  "duration": 4892,
  "language": "eng",
  "recorded": "2018-10-21",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://pydata.org/la2018/schedule/"
    }
  ],
  "speakers": [
    "Amanda K Moran"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ux0H0qPDUso/maxresdefault.jpg",
  "title": "When Rotten Tomatoes Isn’t Enough: Analyzing Twitter Movie Reviews Using DataStax Enterprise",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ux0H0qPDUso"
    }
  ]
}
