{
  "description": "This talk will summarize the history of the creation of PyLadies and Django Girls Brazil and the work done over the last three years to achieve the biggest number of Pyladies subgroups in the world.\nInitiatives concerning gender disparity have been gaining strength internationally in recent years, and the Brazilian open-source community has stood out in the quantity and effectiveness of actions aimed at these projects, changing the scenario of our regional and national conferences and events. Here in Brazil, we also have the biggest PyLadies community of the world (in number of chapters), with over 30 chapters around the country. But how did we get here? How do we manage to have such a huge group of people working together and specially learning from each other to run our activities so organically?\nIn this talk we will discuss about our experience with PyLadies and Django Girls in different regions in Brazil, where we summarize some of the history of the creation of PyLadies and Django Girls Brazil, how everything started and the path we follow to this day. During the talk, we’ll learn more about how do we get ladies (and gentlemen) to work together for these changes to happen, also how the organizers of the chapters and workshops communicate in order to improve their routines and activities and finally, the annual experience sharing meeting we have to gather people who represent the groups to brainstorm ideas of how to make our community better. It will be mentioned all the construction and exchange that takes place within our community and with the diverse communities that support us in the most various corners of the country, their particularities, difficulties and results.\n",
  "language": "eng",
  "recorded": "2019-04-20",
  "speakers": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ACUttvP4azA/hqdefault.jpg",
  "title": "How PyLadies Brazil became the biggest PyLadies chapter of the world",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ACUttvP4azA"
    }
  ]
}
