{
  "description": "What is deep learning? How do I start? Can I use Python? This survey talk will include a brief overview of deep learning before addressing how you can get started doing deep learning in a matter of minutes using your laptop and your favorite PyData libraries. There will be a live demo of a few famous trained DNNs, and we'll touch on a few jumping-off points for real-world applications.\n\nWhat is deep learning? How do I start? Can I use Python? (short answer: yes!) This survey talk will include a brief overview of the past, present, and future of deep learning (what is a perceptron, what is backpropagation, and (briefly) what are some of the newer methods and their applications (drop out, convolutional nets, recurrent nets, Hinton's theory of capsules)) before addressing how you (yes, you!) can get started doing deep learning against your GPU(s) in a matter of minutes using your laptop and your favorite PyData libraries. We’ll navigate the landscape of existing tools for doing deep learning with Python (Caffe, Theano, PyLearn, Graphlab-Create, etc.), and discuss some of the advantages and pitfalls of each. There will be a live demo including a few famous multi-layer neural networks (LeNet, AlexNet, and an unsupervised example such as QuocNet) trained using Python and open datasets (MNIST, ImageNet, etc.). Visualization will also be discussed. Finally, we’ll touch on a few ideas that can be used as jumping-off points for real-world applications using these basic building blocks (image classification, music classification, natural language processing, automatic speech recognition, time series modeling, video game AI (via reinforcement learning), etc.).\n\nSlides can be found here: http://www.slideshare.net/AlexanderKorbonits/deep-learning-with-python-pydata-seattle-2015",
  "recorded": "2015-07-25",
  "speakers": [
    "Alex Korbonits"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/MVyauNNinC0/hqdefault.jpg",
  "title": "Deep Learning with Python: getting started & getting from ideas to insights in mins",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MVyauNNinC0"
    }
  ]
}
