{
  "description": "Recommendation systems are needed to locate appropriate data on same topic or on similar topics of interest. In this talk, I will describe a recommender system framework for PubMed articles. I will present the background and motivation for these recommendation systems, and discuss the implementations of this PubMed recommendation engine with codes and examples.\n\nOne of the most popular features of Big Data is predictive analytics. Predictive analytics is a form of business intelligence gathering. Far from the latest business buzzword, predictive analytics is a set of techniques that have become fundamental to the business strategies. In this tutorial, we will cover an example of predictive analytics through implementing a recommendation engine using python. A recommendation engine (sometimes referred to as a recommender system) is a tool that lets algorithm developers predict what a user may or may not like among a list of given items.\n\nIt is very common now a day to have access to large amount of data on similar or related topics. Recommendation systems are needed to locate appropriate data on same topic or on similar topics of interest. In this talk, I will describe a recommender system framework for PubMed articles. PubMed is a free search engine that primarily accesses the MEDLINE database of references and abstracts on life-sciences and biomedical topics. The proposed recommender system produces two types of recommendations – i) content-based recommendation and (ii) recommendations based on similarities with other users' search profiles. The first type of recommendation, viz., content-based recommendation, can efficiently search for material that is similar in context or topic to the input publication. The second mechanism generates recommendations using the search history of users whose search profiles match the current user. In the talk I will present the background and motivation for these recommendation systems, and discuss the implementations of this PubMed recommendation system using python.\n\nSlides available here: http://www.slideshare.net/PyData/an-example-of-predictive-analytics-building-a-recommendation-engine-using-pythonanusua-trivedi",
  "language": "eng",
  "recorded": "2015-07-26",
  "speakers": [
    "Anusua Trivedi"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/E9XTOnEgqRY/hqdefault.jpg",
  "title": "An example of Predictive Analytics: Building a Recommendation Engine using Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=E9XTOnEgqRY"
    }
  ]
}
