{
  "description": "Pandas is a fast and expressive library for data analysis that doesn’t naturally scale to more data than can fit in memory. PySpark is the Python API for Apache Spark that is designed to scale to huge amounts of data but lacks the natural expressiveness of Pandas. This talk introduces Sparkling Pandas, a library that brings together the best features of Pandas and PySpark.\n\nPandas is a fast and expressive library for data analysis that doesn’t naturally scale to more data than can fit in memory. PySpark is the Python API for Apache Spark that is designed to scale to huge amounts of data but lacks the natural expressiveness of Pandas. This talk introduces Sparkling Pandas, a library that brings together the best features of Pandas and PySpark; Expressiveness, speed, and scalability.\n\nWhile both Spark 1.3 and Pandas have classes named ‘DataFrame’ the Pandas DataFrame API is broader and not fully covered by the ‘DataFrame’ class in Spark. This talk will explore some of the differences between Spark’s DataFrames and Panda’s DataFrames and then examine some of the work done to implement Panda’s like DataFrames on top of Spark. In some cases, providing Pandas like functionality is computationally expensive in a distributed environment, and we will explore some techniques to minimize this cost.\n\nAt the end of this talk you should have a better understanding of both Sparkling Pandas and Spark’s own DataFrames. Whether you end up using Sparkling Pandas or Spark directly, you will have a greater understanding of how to work with structured data in a distributed context using Apache Spark and familiar DataFrame APIs.\n\nMaterials available here:\nSlides: http://www.slideshare.net/hkarau/sparkling-pandas-electric-bugaloo-py-data-seattle-2015 \nProject github: https://github.com/sparklingpandas/sparklingpandas \nProject website: http://sparklingpandas.com/",
  "language": "eng",
  "recorded": "2015-07-25",
  "speakers": [
    "Holden Karau"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/borv_KMI9Ac/hqdefault.jpg",
  "title": "Sparkling Pandas- Letting Pandas Roam on Spark DataFrames",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=borv_KMI9Ac"
    }
  ]
}
