{
  "description": "This tutorial will offer an introduction to the core concepts of machine learning and the Scikit-Learn package. We will introduce the scikit-learn API, and use it to explore the basic categories of machine learning problems and related topics such as feature selection and model validation, and practice applying these tools to real-world data sets.\n\nMachine learning is the branch of computer science concerned with the development of algorithms which can be trained by previously-seen data in order to make predictions about future data. It has become an important aspect of work in a variety of applications: from optimization of web searches, to financial forecasts, to studies of the nature of the Universe.\n\nThis tutorial will explore machine learning with a hands-on introduction to the scikit-learn package. Beginning from the broad categories of supervised and unsupervised learning problems, we will dive into the fundamental areas of classification, regression, clustering, and dimensionality reduction. In each section, we will introduce aspects of the Scikit-learn API and explore practical examples of some of the most popular and useful methods from the machine learning literature.\n\nThe strengths of scikit-learn lie in its uniform and well-document interface, and its efficient implementations of a large number of the most important machine learning algorithms. Those present at this tutorial will gain a basic practical background in machine learning and the use of scikit-learn, and will be well poised to begin applying these tools in many areas, whether for work, for research, for Kaggle-style competitions, or for their own pet projects.\n\nSlides available here: https://github.com/jakevdp/sklearn_pydata2015",
  "language": "eng",
  "recorded": "2015-07-24",
  "speakers": [
    "Jake VanderPlas"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/HC0J_SPm9co/hqdefault.jpg",
  "title": "Machine Learning with Scikit Learn",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HC0J_SPm9co"
    }
  ]
}
