{
  "description": "In this workshop you see how (and why) to leverage the PyData ecosystem to build a robust data pipeline. More specifically you will learn how to use the Luigi framework to integrate multiple stages of a model building pipeline (collection, processing, vectorization, training of multiple models, and validation) all in Python!\n\nAs companies scale prototypes and ad hoc analyses into production systems, it is critical to build automated (and repeatable) systems for data collection/processing and model training /evaluation which are fault tolerant enough to adapt to changing constraints. Sustainable software development is often an afterthought for data scientists, especially since the tools for analysis (R, scientific python, etc.) do not naturally lend themselves to building scalable and extensible software abstractions. But now we can have our cake and eat it too... all with Python!\n\nIn this workshop you see how (and why) to leverage the PyData ecosystem to build a robust data pipeline. More specifically you will learn how to use the Luigi framework to integrate multiple stages of a model building pipeline: collection, processing, vectorization, training of multiple models, and validation.\n\nOutline:\nThe basic components of a data pipeline (5min)\nWhat and Why Luigi (10min)\nLab: The Smallest (1 stage) pipeline (15min)\nManaging dependencies in a pipeline (10min)\nLab: Multi-stage pipeline and introduction to the Luigi Visualizer (15min)\nSerialization in a Data Pipeline (10min)\nLab: Integrating your pipeline with HDFS and Postgres (20min)\nScheduling (10min)\nLab: Parallelism and recurring jobs with Luigi (20min)\nWrap up and next steps (5min)\n\nMaterials available here: \nGithub Repo:  https://github.com/Jay-Oh-eN/data-engineering-101\nSlides:  http://www.slideshare.net/jonathandinu/presentation-45784222",
  "recorded": "2015-07-24",
  "speakers": [
    "Jonathan Dinu"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Ny2X_WNxrB4/hqdefault.jpg",
  "title": "Scalable Pipelines with Luigi or: I’ll have the Data Engineering, hold the Java!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ny2X_WNxrB4"
    }
  ]
}
