{
  "description": "O'Reilly Learning focuses on the evolution of learning experiences for our audience, across O'Reilly Media. One key part leverages containerized notebooks as a radically different approach to publishing. This talk provides a deep-dive into the tech stack, its impact on rubric, the resulting author workflow, and overall how this moves beyond Books, beyond Kindle, beyond MOOCs.\n\nO'Reilly Learning is a new business unit focused on the (rapid) evolution of learning experiences for our audience, across O'Reilly Media.\n\nOne key part of our work leverages cloud-based containerized notebooks as a radically different approach to publishing. This is in close collaboration with Project Jupyter. See Jupyter at O'Reilly for examples.\n\nThis talk reviews how O'Reilly Media leverages Jupiter's interactive reproducible computing environments for patterns of \"code-as-media\" -- delivered across a spectrum of technology and business education. Moving forward, key concepts include: learning paths, continuous learning, inverted classroom, computational thinking, learner segmentation, computational narratives, social context.\n\nJupyter helps O'Reilly provide on-demand environments for learning and analytics. It is also important to consider how it integrates classroom and remote learning environments, and the spectrum of learning modes engaged.\n\nMoving beyond Books, beyond Kindle, beyond MOOCs ... this talk looks at the required tech stack for a learning architecture at scale, as well as some of the impact of this technology on rubric.\n\nWe show our curated list of excellent examples of notebook usage throughout academia and industry, as well as compare/contrast Jupyter with other notebook technologies.\n\nWe also show how this work from the author workflow perspective, leveraging two key components: Atlas (editing/publishing platform) and the open source project Thebe (notebook media player).\n\nThe speaker has taught for the past two years using mixed media integrated with notebooks as the central focus, and now leads the O'Reilly Learning team.\n\nSlides: http://www.slideshare.net/pacoid/jupyter-for-education-beyond-gutenberg-and-erasmus",
  "language": "eng",
  "recorded": "2015-07-25",
  "speakers": [
    "Paco Nathan"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/BVueLWN2QPc/hqdefault.jpg",
  "title": "Jupyter for Education: Beyond Gutenberg and Erasmus",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BVueLWN2QPc"
    }
  ]
}
