{
  "description": "Pandas is an extremely powerful library for data analysis. With that power comes complexity. This tutorial will focus on the core features of pandas, which handle most data munging tasks. The emphasis will be on practical applications, illustrating solutions to common problems using real-world data.\n\nThe motivation of this tutorial mirrors that of pandas itself: practicality. A brief discussion on the problems pandas tries to solve will help frame the rest of the tutorial. We'll aim for an intuitive understanding of each new method and data structure. This will help keep us from getting overwhelmed by the options available as we expand our data munging toolkit. The start of the talk will focus on the core operations of\n\nSelecting and Indexing\nReshaping and Tidy Data\nSummarization\nGrouped operations\nMerging and Joining\nThese operations can be combined into \"pandastic\" method chains that flow seamlessly from data IO to analysis.\n\nTime permitting we'll look at some of the more specialized areas of pandas including Categoricals, time-series analysis, Hierarchical Indexes, chunked / out of core processing, and data pipelines.\n\nLearning to use a library the size of pandas is a huge commitment. What's more, your goal is rarely achieved just with pandas. Rather, pandas gets you to the point where you can begin your interesting analysis. We'll build the foundation to quickly get you past the data munging, to the analysis.\n\nMaterials:\n- slides: http://www.slideshare.net/PyData/pandas-head-to-tail-slidestom-augspurger\n- Github repo: https://github.com/tomaugspurger/pydataseattle\n- nbviewer link to notebooks: http://nbviewer.ipython.org/github/TomAugspurger/PyDataSeattle/tree/master/notebooks/",
  "recorded": "2015-07-24",
  "speakers": [
    "Tom Augspurger"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/otCriSKVV_8/hqdefault.jpg",
  "title": "Pandas: .head() to .tail()",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=otCriSKVV_8"
    }
  ]
}
