{
  "copyright_text": null,
  "description": "This talk aims to discuss problems and solutions when implementing an\nend-to- end Python environment for a big company.\n\nThe term ‘Enterprise’ often has negative connotations in much of the\nopen- source world, usually along the lines of ‘expensive and bloated’.\nIn this case I’d like to use it for describing a systems environment\nwhere the freedoms of a developer working at home with her laptop are\nnot always available or practical. For example, coding on the holodeck\nof the Starship Enterprise.\n\nBig teams and codebases need tools that make it very easy for new\ndevelopers to get up and running writing code with the minimum of fuss.\nLarge software platforms needs tools to manage complex package\ndependency graphs and release workflows. Also, production environments\ndon’t always have compilers or direct internet access so many of\nPython’s standard packaging tools make it a bit tricky to get things\ngoing in these regards.\n\nI’d like to present how we managed to solve a number of these problems\nfor a recent client, a task which happily culminated in much of the\nsoftware being open-sourced at https://github.com/eeaston/pkglib\n\nEdit: The software also has numerous testing tools included which I’ll\ndemonstrate, including py.test fixtures for mongo, redis, pyramid and\ngeneric servers, selenium webdriver and C/C++ code coverage and\nprofiling.\n",
  "duration": 2125,
  "language": "eng",
  "recorded": "2013-07-05",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/en/ep2013/"
    }
  ],
  "speakers": [
    "Edward Easton"
  ],
  "tags": [
    "packaging",
    "jenkins",
    "continuous-integration",
    "systems-programming",
    "sysadmin"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/IacmaNwU458/hqdefault.jpg",
  "title": "Python Packaging on the Enterprise",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IacmaNwU458"
    }
  ]
}
