{
  "copyright_text": null,
  "description": "Competitive programming is really fantastic discipline to improve your programming and math skills. The idea is very simple given well-known computer science problems, solve them as quickly as possible. From another point, these challenges have been used frequently in the initial coding interview tasks. Usually all participants uses C/C++/Java, but last decade we can see increasing trend of contestants who uses Python in programming challenges.\n\nIn this talk I’ll show you how to start compete using Python, I’ll share couple personal tips & tricks how to prepare and start to take part into programming contests using Python. I’ll show you how to motivate yourself to practice and how to define of class of problem and how to try to solve it. I’ll demonstrate you some limits of Python and how to avoid it to make correct and fast solutions. I’ll discuss with you how to master the art of testing and how to crack and generate hidden test cases and boundaries. Also I’ll explain how to quickly estimate complexity of you solution, without too many proofs and math to get desired AC (Accepted).\n\nIt takes a long time to become a good competitive programmer, but it is also an opportunity to learn a lot.\n",
  "duration": 2065,
  "language": "rus",
  "recorded": "2018-09-30",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://odessapyconf.org.ua/en/#schedule"
    },
    {
      "label": "Conference slides",
      "url": "https://www.slideshare.net/OdessaPyConference/presentations"
    },
    {
      "label": "Talk slides",
      "url": "https://drive.google.com/open?id=1mfR_Wtx-00p91JGWCDX4SLyUcqahGLbT"
    }
  ],
  "speakers": [
    "Andrii Soldatenko"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/j9Q6nkg0iS0/maxresdefault.jpg",
  "title": "Competitive programming using Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=j9Q6nkg0iS0"
    }
  ]
}
