{
  "alias": "video/3936/kivy-showcase-a-short-exploration-of-how-kivy-is",
  "category": "PyCon ZA 2015",
  "copyright_text": "",
  "description": "In this talk, we will look at some real-world success stories using\nKivy. From exhibition-size interactive displays to race car telemetry\nsystems to robotics, Kivy is being used to deliver many compelling and\ninnovative applications. We'll use these applications to discuss some of\nthe features and abilities of the framework that make it such a good\nchoice for a wide range of uses.\n\nWe'll briefly cover some exciting projects using Kivy, namely:\n\n-  Project Liatris: a new, open source project using Kivy touch devices\n   to control robots.\n\n-  RaceCapture Pro: A race car telemetry system that uses Kivy\n   interactive displays both in-car and in post-session analytics\n   interaction.\n\n-  Brain Trainer Plus: A mental dexterity trainer deployed to old age\n   homes and medical treatment facilities that has been shown effective\n   in treating dementia and other mental disorders, as well as bringing\n   a greatly enhanced quality-of-life to the aged and mentally ill.\n\n-  CAMI Educational products: The rich feature set and effortless\n   animation abilities of Kivy make developing compelling, responsive\n   desktop and mobile interactions easy.\n\n-  The Icarus touch and Touch live projects: creating radically new and\n   exciting interactive musical instruments.\n\nAll of these applications are being delivered using Kivy, a free, open\nsource, full stack, multi-touch, cross-platform Python/Cython framework\nthat runs on a watch. I kid you not.\n",
  "duration": 3239,
  "id": 3936,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-10-02",
  "slug": "kivy-showcase-a-short-exploration-of-how-kivy-is",
  "speakers": [
    "Richard Larkin"
  ],
  "summary": "",
  "tags": [
    "kivy",
    "Room 215"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/kXLQ_7GGMnM/hqdefault.jpg",
  "title": "Kivy Showcase: a short exploration of how Kivy is changing the world",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtu.be/kXLQ_7GGMnM"
    }
  ]
}
