{
  "description": "Deep learning models are powered by data, the abundance of it. Most of the deep learning models that empower many critical applications in our day-to-day lives depend on labeled data. Affording humongous amounts of labeled datasets is not always possible for a number of different factors like budget, human resources, lack of expert annotators, and so on. The internet is practically an infinite source of unlabeled data. So, at this point, an important question that gets raised is - how can we effectively utilize this large pool of unlabeled data for developing better deep learning models? Self-supervised learning can be helpful here to answer questions like this.\n\nディープラーニングモデルは、豊富なデータを動力源としています。私たちの日常生活における多くの重要なアプリケーションに力を与えているディープラーニングモデルのほとんどは、ラベル付きデータに依存しています。膨大な量のラベル付きデータセットを提供することは、予算、人的資源、専門家のアノテータの不足など、さまざまな要因により常に可能とは限りません。インターネットには、事実上、ラベル付けされていないデータが無限に存在します。そこで、この時点で重要な疑問が浮かび上がってきます-どのようにして、より良いディープラーニングモデルを開発するために、この大規模な非ラベルデータのプールを効果的に利用することができるのでしょうか？自己教師付き学習は、このような疑問に答えるのに役立ちます。",
  "duration": 1238,
  "language": "eng",
  "recorded": "2020-10-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.scipyjapan.scipy.org/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/3686AJmoDTA/maxresdefault.webp",
  "title": "Demystifying Self Supervised Learning for Visual Recognition | Sayak Paul | SciPy japan 2020",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3686AJmoDTA"
    }
  ]
}
