{
  "description": "The discovery and utilizing of new materials has the potential to create the world that is more convenient and richer for our lives and more eco-friendly and cleaner for the natural environment.On the other hand, conventional materials research has required a great deal of time and money for discovery and development, and this is the major issue that needs to be solved in order to realize the practical application of new materials.\nAs a solution to this problem, the use of informatics technology for materials research is considered to be effective.\nIn this presentation ,I’ll talk about my research of next-gen Semiconductor Material (Crystal) Growth Process with utilizing Process Informatics technologies mainly for next-gen automobile especially from the view point of how I utilized Python with the overview about how Informatics is utilized for R&D in materials science.\n\n新しい材料の発見と活用は、私達の暮らしに対しより豊かで便利な世界を、また自然環境にとって優しくクリーンな世界を実現する可能性を秘めています。\n一方で、従来の材料研究は発見や開発に多大な時間・コストを必要することが多く、このことは新材料の実用化実現に対する解決すべき大きな課題となっています。\nこの課題の解決策として、我々は材料研究に対するインフォマティクス技術の活用が有効だと考えています。\nこの発表では、プロセス・インフォマティクスを活用した次世代半導体材料（結晶）の成長プロセスにおける私の研究について、特にどのようにPythonを活用したかという観点から、材料科学のR&Dへのインフォマティクス活用の俯瞰とともに発表します。",
  "duration": 1462,
  "language": "eng",
  "recorded": "2020-10-30",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://www.scipyjapan.scipy.org/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/v8MnQz1j3fw/maxresdefault.webp",
  "title": "Process Informatics Tech- Accelerating Devt- Semiconductor Crystal Growth Process | Daisuke Uematsu",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=v8MnQz1j3fw"
    }
  ]
}
