{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "In Mozambique, as well as in other African countries, ICT is still seen\nas being exclusively for boys. Social norms do not teach women to choose\ncoding or others ICT areas.\n\nBringing Django Girls Workshop to Maputo was meant to teach girls more\nthan how to code and create amazing blogs, we also wanted to use it as a\nplatform to create opportunities that would empower them and promoting\nthe diversity in technology.\n\nToday we have started to hold small and informal meetings to teach girls\nand boys how to program in python. Some of the girls who have\nparticipated in Django Girls Maputo workshops have continued to learn\nmore and develop their skills. We hope to have more girls learn how to\ncode in python so they can also share their experiences.\n\nOur talk will cover the importance of how bringing Django Girls\ncommunity to our girls in Mozambique and how powerful it was, is and it\nwill be to bring them to demonstrate their abilities, skills and belief\nin their capabilities.\n\nThe message we intend to cover to the audience is that Django Girls is\nnot only for a some women, but it's for all women that we can reach, so\nthat we can encouraging more women to strive for programming careers\nbenefits the tech community at large and also is a way to give them\ntools and show them the way that they can empower themselves and\ncontribute in technological development, so that better the societies\nthey are situated in.\n\nOne of the most amazing feedbacks that we got was: \"In this event it is\npossible to realize that anyone is capable of developing technological\ntools. Django Girls has come to say that women are capable of\nprogramming, coding and creating technological solutions\".\n",
  "duration": 2299,
  "language": "eng",
  "recorded": "2018-10-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.za.pycon.org/schedule/"
    },
    {
      "label": "Slides",
      "url": "https://speakerdeck.com/pyconza/bring-django-girls-workshop-to-mozambique-by-cecilia-tivir-and-carina-matimbe"
    }
  ],
  "speakers": [
    "Cecilia Tivir",
    "Carina Matimbe"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/q7wzAZlpdnM/maxresdefault.jpg",
  "title": "Bring Django Girls Workshop to Mozambique.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=q7wzAZlpdnM"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyconza2018-Bring_Django_Girls_Workshop_to_Mozambique"
    }
  ]
}
