{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "In retail, understanding your customer is all, and when you do not have\na brick and mortar storefront to attract new shoppers, it is even more\nimportant to get insight into the array of visitors who frequent your\nsite. You need an idea of who they are, what they want and how to\nattract them. This is a universal truth of all businesses and the\nlessons learned here could be easily applied to other industries.\n\nEnter data science and the ability to segment your customers. What is\ncustomer segmentation? What types of segmentation are there? What models\ncould you use? How do you do it? What is it good for? Having done it a\nfew times, first for Superbalist, then for the Spree customers during\nthe Superbalist/Spree merger, I might have a few tricks and tips to\nshare.\n\nThe talk will look at a high-level overview of clustering, then\ndeep-dive into the code a bit before coming up at the end with a few use\ncases and conclusions. I'll discuss a few potential model algorithms we\ninvestigated, but focus mostly on the K-Means clustering model.\n\nIf you have some data science experience it would be helpful, but the\ntalk should provide interesting information for everyone. The talk aims\nto leave you with a solid idea of how to build a customer segmentation\nmodel of your own. Come discover the joys of classification models with\nme!\n",
  "duration": 2238,
  "language": "eng",
  "recorded": "2018-10-12",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.za.pycon.org/schedule/"
    },
    {
      "label": "Slides",
      "url": "https://speakerdeck.com/pyconza/insight-into-customer-segmentation-by-cornelia-van-der-walt"
    },
    {
      "label": "Notebooks & Example data (github)",
      "url": "https://github.com/Echochi/PyConZA2018"
    },
    {
      "label": "Notebooks & Example data (google)",
      "url": "https://drive.google.com/drive/folders/1qTCigjYaVC2ZOz2afAOWE1YK3f1hM4c2"
    }
  ],
  "speakers": [
    "Cornelia van der Walt"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/KOW4ecqnTow/maxresdefault.jpg",
  "title": "Insight into Customer Segmentation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KOW4ecqnTow"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyconza2018-Insight_into_Customer_Segmentation"
    }
  ]
}
