{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "E-health has proven to have many benefits including reduced errors in\nmedical diagnosis. A number of machine learning (ML) techniques have\nbeen applied in medical diagnosis, each having its benefits and\ndisadvantages. With its powerful pre-built libraries, Python is great\nfor implementing machine learning in the medical field, where many\npeople do not have an Artificial Intelligence background.\n\nThis talk will focus on applying ML on medical datasets using\nScikit-learn, a Python module that comes packed with various machine\nlearning algorithms. It will be structured as follows:\n\n-  An introduction to e-health.\n-  Types of medical data.\n-  Some Benchmark algorithms used in medical diagnosis: Decision trees,\n   K-Nearest Neighbours, Naive Bayes and Support Vector Machines.\n-  How to implement benchmark algorithms using Scikit-learn.\n-  Performance evaluation metrics used in e-health.\n\nThis talk is aimed at people interested in real-life applications of\nmachine learning using Python. Although centered around ML in medicine,\nthe acquired skills can be extended to other fields.\n\nAbout the speaker: Diana Pholo is a PhD student and lecturer in the\ndepartment of Computer Systems Engineering, at the Tshwane University of\nTechnology.\n",
  "duration": 2094,
  "language": "eng",
  "recorded": "2018-10-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.za.pycon.org/schedule/"
    },
    {
      "label": "Slides",
      "url": "https://speakerdeck.com/pyconza/python-as-a-tool-for-e-health-systems-by-diana-pholo"
    }
  ],
  "speakers": [
    "Diana Pholo"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/CmVK87fkh2U/maxresdefault.jpg",
  "title": "Python as a tool for e-health systems",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CmVK87fkh2U"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyconza2018-Jupyter_Notebooks_for_Data_Science"
    }
  ]
}
