{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "The myth of data science holds that you need an army of machine learning\nPHDs to be able to implement anything impactful with data science. In\nthis talk I will attempt to dispel this myth and show how software\ndevelopers can skip getting the machine learning PHD and start building\nawesome software with Data Science and Machine Learning today.\n\nI believe developers are well situated to implement data science\nprojects as they possess the understanding of how the product works, how\nusers like to interact with the product and their opinions are already\nvalued within the business.\n\nTo help developers level up their data science skills, I’ll discuss the\ncore concepts behind the most prevalent methods in data science, how the\ndata science process works, how to think like a data scientist, which\nframeworks and programming languages to choose (surprise Python!) and\nhow to measure and communicate the value-add of data science projects to\nthe business.\n\n*About the speaker: Helge Reikeras is a Data Scientist at Offerzen with\nover 6 years experience in practical data science and has also worked as\na software developer at various points in his career.*\n",
  "duration": 2402,
  "language": "eng",
  "recorded": "2018-10-11",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2018.za.pycon.org/schedule/"
    },
    {
      "label": "Slides",
      "url": "https://speakerdeck.com/pyconza/the-developers-guide-to-data-science-by-helge-reikeras"
    }
  ],
  "speakers": [
    "Helge Reikeras"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Krgp7A21-Y4/maxresdefault.jpg",
  "title": "The Developer's Guide to Data Science",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Krgp7A21-Y4"
    },
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyconza2018-The_Developers_Guide_to_Data_Science"
    }
  ]
}
