{
  "description": "Talk is an introduction to OpenCV 4+ pythonic API. We are going to go\nthrough most popular methods that are used in image processing and\ncomputer vision apps. We will also explore new methods that have been\nadded in the newest release of the package. No prior OpenCV knowledge is\nrequired to participate.\n\n**Intro & added value**\n\nImage processing and computer vision are gaining huge interest nowadays.\nModern machine learning models very often take advantage of features\ncalculated on images. The talk is an introduction to the most popular\npythonic image processing package → OpenCV.\n\nYou will learn the most important concepts in computer vision, and see\nhow these are applied on images. After this talk you will be ready to\nstart your first computer vision project!\n\n**Topic a.k.a. come if you:**\n\nThe talk is addressed to Data Scientists, Python Developers and Data\nEngineers that would like to see what OpenCV package offers and if it’s\nthe right tool to learn. I will provide a lot of examples explaining how\nimage/video processing and feature extraction can be done in OpenCV.\n\n**The type of talk**\n\nAll code examples will be shared afterwards through GitHub repository.\nDuring the talk, presentation will be either done with the help of\nJupyter Notebook or interactive slides (to simulate the programming\nprocess).\n\n**What you will learn**\n\n1. Intro to key image processing methods, such as:\n\n   -  thresholding techniques\n   -  colorspace conversion\n   -  contour detection\n   -  image filtering\n   -  morphological transformations\n   -  arithmetic with images\n   -  color histograms\n   -  shape detection\n   -  template matching\n   -  new methods that have been added since the release of 4.0 version.\n\n2. How these methods are applied with the use of OpenCV 4+ api.\n\n3. Tips&tricks to speed up image processing and feature extraction\n   development time.\n",
  "duration": 1294,
  "published_at": "2020-01-03T02:09:49.000Z",
  "recorded": "2019-12-13",
  "speakers": [
    "Filip Geppert"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/XUOSnB_QWtw/hqdefault.jpg",
  "title": "How to effectively extract image features – let’s play with OpenCV API!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XUOSnB_QWtw"
    }
  ]
}
