{
  "description": "Up to 85% of data-related projects fail. Most of that is due to ill\nmanagement of these projects, and no one-size-fits-all solution (not\neven agile), can solve the problem. I want to share what I learned so\nfar: from experience but also from good books and articles, start and\npromote a wider discussion on the data-related project and people\nmanagement, and how we can help ourselves.\n\nDepending on estimates between 60% and 85% of Big Data projects fail; we\nsee similar numbers for AI/ML projects. Why is that? Have you ever been\non a good- looking project that didn't deliver or was abruptly closed? A\nlot of that has to do with management, and if you think product based on\nsoftware development was hard, data-related projects are even harder. In\nthis talk I will combine my experience of being a part of or running\nteams in a few data-related projects, spanning from big data engineering\nto machine learning engineering in organization of a different size. I\nwill tell you about my successes and failures, how I feel the\ndata-related projects are perceived by the business and what can we do\nabout this. The ideas and experience are backed by a number of books,\narticles and methods circulating around in the community. You will learn\nnot only what you can do as a manager, but also as a team member. Also,\nthat Agile is good, but is also not one-size-fits-all solution, and what\nis better to pass. By no means I feel as a know-it-all person in\nmanagement, I just want to share what I learned so far, start and\npromote a wider discussion on the data-related project and people\nmanagement, and how we can help ourselves.\n",
  "duration": 1650,
  "language": "eng",
  "published_at": "2020-01-02T16:36:52.000Z",
  "recorded": "2019-12-13",
  "speakers": [
    "Jakub Nowacki"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/HRLxgosl9dQ/hqdefault.jpg",
  "title": "How to manage data-related projects and not fail (too often)?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HRLxgosl9dQ"
    }
  ]
}
