{
  "description": "Sentiment analysis in texts is a problem that can be solved using\nArtificial Intelligence. The talk's goal is to present how to make\ndetect five emotions (happiness, anger, sadness, fear, disgust) for\ntweets in Polish language using open source tools. During the\npresentation, the process from data collecting to creating a deep neural\nnetwork will be shown.\n\nSentiment analysis is one of the problems which can be solved using\nArtificial Intelligence. Most research related to the analysis of\nemotions in Polish texts from social media, (especially from Twitter)\nfocus only on classification as positive, negative or neutral. In my\npitch, I would like to concentrate on detecting 5 emotions like\nhappiness, sadness, anger, disgust and fear.\n\nDuring the presentation I will show how the whole process from data\ncollecting, preprocessing and labelling to training model and presenting\nresults looks like. The implementation was done using Python.\n\nFirst, text data from Twitter was cleaned from links, emojis and unknown\nsymbols, which are unnecessary for the analysis. For input to the model,\ntexts were converted to numeric representation in vectors. This\nrepresentation was generated using pretrained Word2vec model for the\nPolish language.\n\nFor labelling data, words were transformed to lemmas (dictionary form)\nusing Morfeusz 2 package, which is an inflectional analyser. This\noperation was necessary to generate vectors of the numeric\nrepresentation of emotions. For every word a vector with the numeric\nrepresentation of 5 emotions using Necki Affective Word List was\ncreated. This list contains numeric information of emotions about words\nin lemma grammar form.\n\nThe model used for the sentiment analysis was LSTM network. The first\nlayer of the model was the embedding layer which takes weights for every\nword from Word2vec model. Then were LSTM and dense layers.\n\nAt the end of presentation, I will show the results with examples of\ngood classification and misclassification.\n",
  "duration": 1594,
  "published_at": "2020-01-03T08:00:08.000Z",
  "recorded": "2019-12-13",
  "speakers": [
    "Joanna Piwko"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/lw66bbPYH5Q/hqdefault.jpg",
  "title": "Sentiment analysis of tweets in Polish language using deep learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lw66bbPYH5Q"
    }
  ]
}
