{
  "description": "The main goal of the article is to present the results of a study on the\nuse of deep learning networks to detect solar panels based on aerial\nimages of Poznan. In addition, the main motivation is to obtain more\ndetailed information about the use of solar energy in Poland drawing on\nbig data sources, which until now have not been used for this purpose.\n\nThe data was acquired from the Management Board of Geodesy and Municipal\nCadastre GEOPOZ in Poznań and included orthophotomaps for 2016 and the\nlayer of buildings and plots of lands. We extracted buildings from the\nimages using R statistical software and the sf package. To detect solar\npanels we used the Turi Create library written in Python which\nre-implements the YOLO (You Only Look Once) library.\n\nThe object recognition algorithm was trained on a sample of images that\nincluded annotations (bounding boxes) about the exact location of solar\npanels. The results indicate a very high recognition efficiency at the\nlevel of 96-99% on the test sample. Based on this procedure we found\nthat around 2% of residential buildings in Poznań in 2016 had solar\npanels mounted on roofs.\n\nAs far as we know, this is the first use of deep learning to detect\nsolar panels in Poland. Currently, similar studies are being carried out\nby for instance Statistics Netherlands as part of the DeepSolaris\nproject. The study exemplifies a trend involving the use of aerial and\nsatellite images for statistical purposes thanks to advanced machine\nlearning algorithms and open source software.\n",
  "duration": 1062,
  "language": "eng",
  "published_at": "2020-01-03T08:00:08.000Z",
  "recorded": "2019-12-13",
  "speakers": [
    "Michel Voss"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/RHV3TDgbhbc/hqdefault.jpg",
  "title": "Detection of solar panels based on aerial images of the city of Poznań using deep neural networks",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RHV3TDgbhbc"
    }
  ]
}
