{
  "description": "Sound in digital form for years is in the loop of steps: record, mix,\nedit, playback and listen. Some creative ones did create synthetic\nspeech and music with affordable tools. Now both computation and data\nresources available made synthesis and sound shaping possible using\nparametric, physical methods or with the latest deep learning\nrepresentation models. Discover the theory and code to do it.\n\nSound in digital form for years is in the loop of steps: record, mix,\nedit, playback and listen. Some creative ones did create synthetic\nspeech and music with affordable tools. Now both computation and data\nresources available made synthesis and sound shaping possible using\nparametric, physical methods or with the latest deep learning\nrepresentation models. Discover the theory and code to do it.\n\nTechniques like deep learning can now create a whole set of basic audio\nprocessing functions - filtering, equalization, compression - are\nbecoming available to model too. They can also extract latent\nrepresentation and make it be controlled to produce real sound. One can\ncreate his own replica for specific guitar amplifier sound or try to\nfind parameters that produces unique audio for film or game sound\neffects.\n\nWe will take a quest to find out how to model sound by exploring and\nrunning experiments with python code. The experiment consists of three\nmain parts:\n\n1. Exploration how to get audio data and represent it using equations\n   and recent deep learning models.\n2. Analysis by visualization, clustering .\n3. Mimicking real vibrations by approximation using parametric physical\n   models .\n4. Grab DNN models to make them speak, play and sing.\n\nIn addition, I will describe the model used, present the code the\nresults that perform audio out of the model.\n\nIn summary, at the end of this talk you will have learned (I hope) how\ndeal with sound signals and that it may be combined to create music or\njust bizarre, wacky sounds\n",
  "duration": 1776,
  "language": "eng",
  "published_at": "2020-01-03T00:31:29.000Z",
  "recorded": "2019-12-12",
  "speakers": [
    "Pawel Cyrta"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/j6iJm7LP7Ts/hqdefault.jpg",
  "title": "Sound Modelling - parametric methods and deep learning representations to create and shape audio",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=j6iJm7LP7Ts"
    }
  ]
}
