{
  "description": "In the cyber security world, analysis of command line logs is important\nfor breach detection, but it is one of the most challenging problems. To\nsimplify this process, we propose a framework called CMDLang – command\nline language, which has features of natural language. I will present\nresults of successful POS and NER training using popular NLP algorithms\nand demonstrate a real use case of CMDLang\n\nAt F-Secure, in order to protect our customers, we use streams of\ncommand line logs coming from their systems to detect breaches and\nanomalies. Analysis of such data is one of the most challenging problems\nin the cyber security world. It requires domain knowledge and is hard to\nencapsulate in sets of rules.\n\nWhat if we treat command lines logs as semi-structured text data? They\nfollow a set of grammar rules and have semantics. Therefore, we propose\nthe framework of CMDLang – command line language, which has features of\nnatural language. We performed successful trainings of part of speech\n(POS) tagger and named entities recognition (NER) models. Using CMDLang\nalong with NLP methods enables normalization of logs, parsing and their\ncategorization. With a defined language framework, we are able to\nanalyze huge streams of data faster, which improves our detection\ncapabilities.\n\nDuring the talk, I will present results of the CMDLang creation using\npopular, open-source NLP algorithms. I will give a walkthrough of the\nprocess and define the main ideas behind this language. At the end I\nwill demonstrate usage of CMDLang in a real use case.\n\nThis talk will be interesting for every NLP enthusiast, as well for\npeople working with (semi-)structured text data or log processing.\nDuring the presentation, I will explain any cyber security terminology\nused.\n",
  "duration": 1587,
  "published_at": "2020-01-03T02:09:49.000Z",
  "recorded": "2019-12-13",
  "speakers": [
    "Zuzanna Kunik"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/_rEjSDPHxJY/hqdefault.jpg",
  "title": "Command line language – where NLP and cyber security meets",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_rEjSDPHxJY"
    }
  ]
}
