{
  "description": "Data visualizations are not always sufficient in understanding important\naspects of data. People have to interpret charts and build narratives\nabout it. Natural language generation technology can be used to greatly\nimprove the communicative power of the data. In this talk I will\nintroduce NLG and will present a case through the use of two open source\ntools: Accelerate Text (NLG) and Metabase (BI)\n\nBI tools excel at visually organizing data in various dashboards. Yet\ndata visualizations are not always sufficient in understanding important\naspects of data. People have to interpret charts and build narratives\nabout data on their own. Furthermore, different groups of people often\nneed different narratives about the same data. For example, a story\nabout the same sales data is different for a CFO and for an Order\nFulfillment Manager.\n\nNatural language generation technology (NLG) can be used to greatly\nimprove the communicative power of a BI dashboards. With the use of NLG\nwe can produce different descriptions of the same data adopted to the\nneeds of each person reading it.\n\nThe integration between BI and NLG will be demonstrated through the use\nof two open source products: (a) TokenMill's open source NLG tool called\nAccelerated Text (https://github.com/tokenmill/acceleratedtext), to\nillustrate how natural language can be generated using data; (b) and the\nBI platform Metabase (https://github.com/metabase/metabase), to provide\nanalytical dashboards which will include both data visualizations and\nautomatically generated natural language.\n",
  "duration": 1551,
  "language": "eng",
  "published_at": "2020-01-03T02:09:49.000Z",
  "recorded": "2019-12-13",
  "speakers": [
    "Žygimantas Medelis"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/yb_NUPfmlDI/hqdefault.jpg",
  "title": "Adding Narrative to BI Dashboards with Natural Language Generation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yb_NUPfmlDI"
    }
  ]
}
