{
  "alias": "video/1171/aspettando-postgresql-91",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "PostgreSQL è un sistema open-source per la gestione di database molto\navanzato ed estremamente versatile che si integra perfettamente con\nPython. E' sviluppato da una comunità internazionale molto attiva ed è\ndistribuito secondo la licenza in stile BSD denominata \"PostgreSQL\nLicense\".\n\nLe funzionalità di classe enterprise (come la conformità con lo standard\nSQL, le transazioni ACID, la disaster recovery, l'alta disponibilità o\nHA, la replica, il partizionamento e in generale l'estensibilità)\nrendono PostgreSQL particolarmente adatto per quegli ambienti\nbusiness-critical che intendono ridurre il costo di proprietà totale\n(TCO) delle loro soluzioni di database senza alterarne i requisiti\nfunzionali. PostgreSQL 9.0, rilasciato nel settembre del 2010, è stata\nla prima versione di PostgreSQL con Hot Standby, un meccanismo nativo\nper la replica master/slave. Al consueto e collaudato meccanismo di\nreplica secondo la tecnica del log shipping (usata precedentemente per\nscopi di HA con Warm Standby) è stata aggiunta la replica in streaming.\n\nLa versione 9.1, attesa per la seconda parte del 2011, aggiungerà la\nreplica sincrona a PostgreSQL, rendendolo il primo DBMS in grado di\npermettere a sviluppatori e utenti di controllare la strategia di\nreplica a livello di singola transazione. Partecipa al talk per scoprire\ntutte le altre funzionalità principali che saranno incluse in PostgreSQL\n9.1, fra le quali: gestione delle estensioni, writable common table\nexpression, ecc.\n",
  "duration": null,
  "id": 1171,
  "language": "ita",
  "quality_notes": "",
  "recorded": "2011-07-07",
  "slug": "aspettando-postgresql-91",
  "speakers": [
    "Gabriele Bartolini"
  ],
  "summary": "[EuroPython 2011] Gabriele Bartolini - 22 June 2011 in \"Track Italiana\nBig Mac \"\n",
  "tags": [
    "database",
    "postgresql"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/hsIEX2PBvJo/hqdefault.jpg",
  "title": "Aspettando PostgreSQL 9.1",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hsIEX2PBvJo"
    }
  ]
}
