{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2011", "speakers": ["Federico Caboni"], "title": "Gestione di processi clinici in Python: un caso d'uso", "quality_notes": "", "video_flv_length": null, "recorded": "2011-07-18", "video_mp4_length": null, "description": "In questo seminario descriverò la nostra esperienza positiva d'uso di Python\nper lo sviluppo di un sistema di etichettatura di provette per il prelievo\nsanguigno in ambito di laboratorio e corsia ospedaliera. Il sistema è basato\nsui Technical Framework di IHE –standard industriale per la modellazione di\nprocessi clinici– ed è progettato per ridurre gli errori umani e assicurare la\ntracciabilità del processo.\n\nDurante il seminario spiegherò perché abbiamo scelto Python in primo luogo, e\ndescriverò come siamo stati in grado di sfruttarne le caratteristiche\npeculiari nello specifico del nostro dominio, esaminando le limitazioni e i\nproblemi affrontati.\n\nMostrerò specifici casi d'uso di Python in parti differenti del progetto, come\nun driver di basso livello per la gestione della robotica di laboratorio, un\nmodulo di comunicazione asincrona, l'implementazione di attori IHE, e\nl'inevitabile applicazione web sviluppata in Django.\n\nUsare Python ha contribuito enormemente alla progettazione del sistema, e ci\nha consentito di adottare cicli di prototipizzazione estremamente rapidi, sia\nper l'hardware che per il software. Durante il seminario parlerò anche di ciò\nche, secondo noi, ancora manca perché Python possa guadagnarsi il posto che\ngli spetta come piattaforma credibile per l'implementazione di processi\nclinici basati sui più diffusi standard internazionali.\n\n", "video_mp4_url": null, "tags": ["ci", "framework", "web"], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=l7e6NmyWclM", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "Italian", "video_webm_length": null, "summary": "[EuroPython 2011] Federico Caboni - 23 June 2011 in \"Track Italiana Big Mac \"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/l7e6NmyWclM/hqdefault.jpg", "video_flv_url": null}