{
  "alias": "video/1175/gestione-di-processi-clinici-in-python-un-caso-d",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "In questo seminario descriverò la nostra esperienza positiva d'uso di\nPython per lo sviluppo di un sistema di etichettatura di provette per il\nprelievo sanguigno in ambito di laboratorio e corsia ospedaliera. Il\nsistema è basato sui Technical Framework di IHE –standard industriale\nper la modellazione di processi clinici– ed è progettato per ridurre gli\nerrori umani e assicurare la tracciabilità del processo.\n\nDurante il seminario spiegherò perché abbiamo scelto Python in primo\nluogo, e descriverò come siamo stati in grado di sfruttarne le\ncaratteristiche peculiari nello specifico del nostro dominio, esaminando\nle limitazioni e i problemi affrontati.\n\nMostrerò specifici casi d'uso di Python in parti differenti del\nprogetto, come un driver di basso livello per la gestione della robotica\ndi laboratorio, un modulo di comunicazione asincrona, l'implementazione\ndi attori IHE, e l'inevitabile applicazione web sviluppata in Django.\n\nUsare Python ha contribuito enormemente alla progettazione del sistema,\ne ci ha consentito di adottare cicli di prototipizzazione estremamente\nrapidi, sia per l'hardware che per il software. Durante il seminario\nparlerò anche di ciò che, secondo noi, ancora manca perché Python possa\nguadagnarsi il posto che gli spetta come piattaforma credibile per\nl'implementazione di processi clinici basati sui più diffusi standard\ninternazionali.\n",
  "duration": null,
  "id": 1175,
  "language": "ita",
  "quality_notes": "",
  "recorded": "2011-07-18",
  "slug": "gestione-di-processi-clinici-in-python-un-caso-d",
  "speakers": [
    "Federico Caboni"
  ],
  "summary": "[EuroPython 2011] Federico Caboni - 23 June 2011 in \"Track Italiana Big\nMac \"\n",
  "tags": [
    "ci",
    "framework",
    "web"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/l7e6NmyWclM/hqdefault.jpg",
  "title": "Gestione di processi clinici in Python: un caso d'uso",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=l7e6NmyWclM"
    }
  ]
}
