{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2011", "speakers": ["Gabriele Bartolini", "Harald Armin Massa", "Marco Nenciarini"], "title": "Getting ready for PostgreSQL 9.1", "quality_notes": "", "video_flv_length": null, "recorded": "2011-07-13", "video_mp4_length": null, "description": "PostgreSQL is an advanced, versatile open-source database management system\nthat integrates perfectly with Python. It is developed by a very active\ninternational community and is distributed under the BSD-like PostgreSQL\nLicense.\n\nEnterprise-class features (including SQL standard compliance, ACID\ntransactions, disaster recovery, high availability, replication, partitioning\nand general extensibility) make PostgreSQL suitable for business critical\nenvironments seeking to reduce the TCO of their database solutions without\naltering their functional needs. PostgreSQL 9.0, released in September 2010,\nwas the first version of PostgreSQL with Hot Standby, a built-in master/slave\nreplication mechanism. Asynchronous replication through the standard and\nconsolidated log shipping technique (previously used with Warm Standby for\nhigh availability) has been enhanced with streaming replication.\n\nVersion 9.1, expected to be out later in 2011, will add synchronous\nreplication to PostgreSQL, making it the first DBMS that allows developers and\nusers to control the replication strategy at transactional granularity. Come\nto the talk and discover all the major new features of PostgreSQL 9.1,\nincluding extensions management, writable common table expressions (WCTE),\netc.\n\n", "video_mp4_url": null, "tags": ["asynchronous", "business", "community", "database", "distributed", "extensions", "partitioning", "postgresql", "replication"], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=71i5FlW30s0", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2011] Gabriele Bartolini,Harald Armin Massa,Marco Nenciarini - 22\nJune 2011 in \"Training Pizza Napoli \"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/71i5FlW30s0/hqdefault.jpg", "video_flv_url": null}