{
  "alias": "video/1021/healthcare-process-management-in-python-a-use-ca",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "In this talk I'll describe our successful experience in introducing\nPython into a system for blood collection tube labeling in laboratory\nand hospital environments, based on IHE Technical Frameworks –the\nindustry standard for modeling and streamlining healthcare processes–\nand designed to avoid human errors and ensure process traceability.\n\nDuring the talk I will explain why we chose Python in the first place,\nhow we've been able to leverage the language's features and\ncharacteristics for our specific field and what problems and limitations\nwe faced.\n\nI will show specific instances of Python usage in different parts of the\nproject, including a low-level driver for laboratory automation\nmachinery, an asynchronous messaging module, the implementation of\nIHE-compliant actors and the inevitable end-user web application,\nimplemented with Django.\n\nUsing Python greatly helped us in building our system, allowing very\nrapid prototyping cycles for both hardware and software, but during the\ntalk I'll also point out what we found was missing, and what would be\nnice to have to ensure Python has its proper place as a viable platform\nfor designing streamlined healthcare workflows based on established\ninternational standards.\n",
  "duration": null,
  "id": 1021,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-24",
  "slug": "healthcare-process-management-in-python-a-use-ca",
  "speakers": [
    "Federico Caboni"
  ],
  "summary": "[EuroPython 2011] Federico Caboni - 24 June 2011 in \"Track Tagliatelle \"\n",
  "tags": [
    "asynchronous",
    "prototyping",
    "web"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/btyuUwcfLW0/hqdefault.jpg",
  "title": "Healthcare process management in Python: a use case",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=btyuUwcfLW0"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MsmmrfkLuvY"
    }
  ]
}
