{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2011", "speakers": ["Yann Le Du"], "title": "High-performance computing on gamer PCs", "quality_notes": "", "video_flv_length": null, "recorded": "2011-07-13", "video_mp4_length": null, "description": "In Electron Paramagnetic Resonance Imaging, we are faced with a deconvolution\nproblem that has a strong impact on the image actually reconstructed. Faced\nwith the need of mapping the distribution of organic matter in Terrestrial and\nMartian rock samples for applications in exobiology, we needed to see how to\nextract a maximum amount of information from our data: our approach uses\nreservoir computing artificial neural networks coupled to a particle swarm\nalgorithm that evolves the reservoirs’ weights.\n\nThe code runs on the Hybrid Processing Units for Science (HPU4Science) cluster\nlocated at the Laboratoire de Chimie de la Matière Condensée de Paris (LCMCP).\nThe cluster is composed of a central data storage machine and a heterogeneous\nensemble of 6 decentralized nodes. Each node is equipped with a Core2 Quad or\ni7 CPU and 3-7 NVIDIA Graphical Processing Units (GPUs) including the GF110\nseries. Each of the 28 GPUs independently explores a different parameter space\nsphere of the same problem. Our application shows a sustained real performance\nof 15.6 TFLOPS. The HPU4Science cluster cost $36,090 resulting in a 432.3\nMFLOPS/$ cost performance.\n\nThat talk is meant to demonstrate on a practical case how consumer grade\ncomputer hardware coupled to a very popular computer language can be used to\ntackle a difficult yet very elementary scientific problem: how do you go from\nformulating the problem, to choosing the right hardware and software, and all\nthe way to programming the algorithms using the appropriate development tools\nand methodologies (notably Literate Programming). On the math side, the talk\nrequires a basic understanding of matrix algebra and of the discretization\nprocess involved when computing integrals.\n\n", "video_mp4_url": null, "tags": ["image", "mapping", "nvidia", "performance", "processing", "science", "scientific"], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=TkBkGGPY2P0", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2011] Yann Le Du - 20 June 2011 in \"Track Lasagne\"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/TkBkGGPY2P0/hqdefault.jpg", "video_flv_url": null}