{
  "alias": "video/1048/high-performance-computing-on-gamer-pcs",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "In Electron Paramagnetic Resonance Imaging, we are faced with a\ndeconvolution problem that has a strong impact on the image actually\nreconstructed. Faced with the need of mapping the distribution of\norganic matter in Terrestrial and Martian rock samples for applications\nin exobiology, we needed to see how to extract a maximum amount of\ninformation from our data: our approach uses reservoir computing\nartificial neural networks coupled to a particle swarm algorithm that\nevolves the reservoirs’ weights.\n\nThe code runs on the Hybrid Processing Units for Science (HPU4Science)\ncluster located at the Laboratoire de Chimie de la Matière Condensée de\nParis (LCMCP). The cluster is composed of a central data storage machine\nand a heterogeneous ensemble of 6 decentralized nodes. Each node is\nequipped with a Core2 Quad or i7 CPU and 3-7 NVIDIA Graphical Processing\nUnits (GPUs) including the GF110 series. Each of the 28 GPUs\nindependently explores a different parameter space sphere of the same\nproblem. Our application shows a sustained real performance of 15.6\nTFLOPS. The HPU4Science cluster cost\n:math:`36,090 resulting in a 432.3 MFLOPS/` cost performance.\n\nThat talk is meant to demonstrate on a practical case how consumer grade\ncomputer hardware coupled to a very popular computer language can be\nused to tackle a difficult yet very elementary scientific problem: how\ndo you go from formulating the problem, to choosing the right hardware\nand software, and all the way to programming the algorithms using the\nappropriate development tools and methodologies (notably Literate\nProgramming). On the math side, the talk requires a basic understanding\nof matrix algebra and of the discretization process involved when\ncomputing integrals.\n",
  "duration": null,
  "id": 1048,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-21",
  "slug": "high-performance-computing-on-gamer-pcs",
  "speakers": [
    "Yann Le Du"
  ],
  "summary": "[EuroPython 2011] Yann Le Du - 20 June 2011 in \"Track Lasagne\"\n",
  "tags": [
    "image",
    "mapping",
    "nvidia",
    "performance",
    "processing",
    "science",
    "scientific"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/5epAiVgitL0/hqdefault.jpg",
  "title": "High-performance computing on gamer PCs",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5epAiVgitL0"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TkBkGGPY2P0"
    }
  ]
}
