{
  "alias": "video/1126/meteorology-climate-and-python-desperately-tryi",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "Contents\n========\n\nPython is a great language for writing programming frameworks. Python\nframeworks are normally addressed to software developers who are Python\nprofessionals. I developed a software package in a scientific\ninstitution, designed to be used by non-programmers, but also designed\nto enable customisation through programming by some users. I finally\ndesigned a three level package:\n\n-  A Python programming framework, addressed whoever wanted to invest in\n   Python and had plans to develop applications;\n\n-  An application built on that framework with an interface designed for\n   non-programmers;\n\n-  Ways of customising the behaviour of the application by providing\n   some basic Python functions or more elaborated code.\n\nOne of the challenges was to offer an application with an easy to use\ninterface, not graphical, not web-based and not requiring Python\nprogramming. This interface was necessary for batch processing.\n\nThis talk addresses how this project was carried out, the technical\nsolutions adopted and how Python was introduced in an operational\nscientific institution (http://www.ecmwf.int) where most users were\nFortran programmers. Python was introduced as early as 2004 and it was a\nchallenge to gain acceptance. I will also make a parallel with a project\nI am currently working on for NASA (http://gmao.gsfc.nasa.gov/).\n*Desperately trying to forget technical details* summarises how I tried,\nusing Python, to help Meteorology scientists to focus on their domain of\nexpertise instead of constantly solving technical problems.\n\nBackground:\n===========\n\nThe disciplines of Meteorology and Climate involve numerical modelling\nof physical phenomena. The amount of data going in and out of the model\nis considerable. The organisation and the storage of data is\ncomplicated, their post-processing is a challenge. Scientists need to\naccess and process input and output data to monitor the trends of the\ninput data and to evaluate the performance of their models. Those\nstatistics, diagnostics, plots and verifications are crucial to the\nimprovement of the quality of the models. Finding the right data,\ndecoding it, transforming it to be ready for use are necessary steps to\ninitiate the pre-processing. All these actions are fundamentally the\nsame between different prediction centres, but the data organisation and\nfile formats can differ.\n",
  "duration": null,
  "id": 1126,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-13",
  "related_urls": [
    "http://gmao.gsfc.nasa.gov/).",
    "http://www.ecmwf.int)"
  ],
  "slug": "meteorology-climate-and-python-desperately-tryi",
  "speakers": [
    "Claude Gibert"
  ],
  "summary": "[EuroPython 2011] Claude Gibert - 24 June 2011 in \"Track Lasagne\"\n",
  "tags": [
    "framework",
    "nasa",
    "parallel",
    "performance",
    "python,",
    "scientific"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/zZY-5cHZsT0/hqdefault.jpg",
  "title": "Meteorology, Climate and Python: desperately trying to forget technical details",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zZY-5cHZsT0"
    }
  ]
}
