{
  "alias": "video/1043/mig-a-complete-grid-middleware-mostly-in-pyth",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "Grid computing was all the buzz in the beginning of the millennium and\nstill has serious attention in different forms although many of the\noriginal grand promises were never delivered. The general level of\nambitions have instead slowly but steadily degraded to those of the\nlatest buzz word, Cloud.\n\nWe as a project have proven that most of the original promises *can*\nactually be delivered and we have done so using Python almost solely as\nthe implementation language. The choice of Python provided us with a\nstable and versatile base for quickly getting this far and it\nsignificantly eases extending and maintaining our middleware in the\nfuture. MiG is currently about 50000 lines of source code but it still\noffers more features than competing grid systems with millions of lines\nof code.\n\nApart from introducing the open source MiG middleware and summarizing\nhow we got here, this talk will outline some of the core technologies\nused to reach that goal and underline why it can make a lot of sense to\nchoose Python for complex HPC projects like MiG, too. Talk keywords\ninclude Network Programming, Open Source Python projects, Science and\nMath and Web-based Systems. There's no special intended audience, but a\ncertain level of Python knowledge and experience may be an advantage.\nPlease refer to http://code.google.com/p/migrid/ for further MiG\ninformation.\n",
  "duration": null,
  "id": 1043,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-21",
  "related_urls": [
    "http://code.google.com/p/migrid/"
  ],
  "slug": "mig-a-complete-grid-middleware-mostly-in-pyth",
  "speakers": [
    "Jonas Bardino"
  ],
  "summary": "[EuroPython 2011] Jonas Bardino - 22 June 2011 in \"Track Tagliatelle \"\n",
  "tags": [
    "forms",
    "hpc",
    "network",
    "science"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/aRYvBuYXcjk/hqdefault.jpg",
  "title": "MiG - A Complete Grid Middleware (mostly) in Python",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aRYvBuYXcjk"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=enNcrMTg2lM"
    }
  ]
}
