{
  "alias": "video/1039/playing-tasks-with-django-celery",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "Celery is an open source task queueing system based on distributed\nmessage passing.\n\nI will talk about the tools that Celery offers for task distribution and\nhow to monitor and manage the system using a Django web interface. This\ntalk will also focus on how we use Celery at Jamendo and our real\nsolutions to some common issues you may encounter when developing a\nback-office based on Celery.\n\nThe talk will cover the following topics:\n\n-  A brief overview of Celery and the AMPQ protocol AMPQ protocol\n   overview, Celery introduction: Celery, RabbitMQ code examples\n\n-  The impact of Celery on the Jamendo work-flow; examples with real\n   tasks. Here I will talk about the Jamendo back-office infrastructure\n   and some of our common tasks. I will discuss the improvements made by\n   introducing a new back-office system based on Celery. I will show\n   some code snippets and go over some real scenarios.\n\n-  Overview of the Django Celery admin interface and some Jamendo\n   extensions. Let's talk about the Django-Celery interface that allows\n   one to monitor or schedule tasks directly from the Django admin. I\n   will explain which common additional features are necessary and how\n   to add them.\n\n-  Common \"gotchas\" we encountered while working with Celery and how we\n   solved them.\n\n-  Global task locks\n\n-  Centralized logging: be able to read all the logs of all celery\n   workers on different servers and filter them for real-time debugging\n\n\n",
  "duration": null,
  "id": 1039,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-21",
  "slug": "playing-tasks-with-django-celery",
  "speakers": [
    "Mauro Rocco"
  ],
  "summary": "[EuroPython 2011] Mauro Rocco - 22 June 2011 in \"Track Tagliatelle \"\n",
  "tags": [
    "celery",
    "distributed",
    "django",
    "infrastructure",
    "queueing",
    "rabbitmq",
    "real-time",
    "web"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/HgN8rOstPjc/hqdefault.jpg",
  "title": "Playing tasks with Django-Celery",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HgN8rOstPjc"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mAXz2kbh_3U"
    }
  ]
}
