{
  "alias": "video/1113/pypy-in-production",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "The PyPy project has recently gathered a lot of attention for its\nprogress in speeding up the Python language - it is the fastest Python\ninterpreter, and the most compatible and most stable 'alternative´ one.\nNo longer merely a research project, PyPy is now suitable for production\nuse. We are working on improvements on calling into C libraries and\ngenerally integrating with the existing Python extensions ecosystem.\n\nWe will give an overview on how the tracing Just-in-Time compiler works\nin PyPy. From there, we will then focus on what the PyPy project has\nachieved, particularly in the past two years:\n\n-  most Python benchmarks run much faster than with CPython or Psyco\n\n-  the real-world PyPy compiler toolchain itself (200 KLocs) runs twice\n   as fast\n\n-  already supports 32 and 64bit x86 and is in the process of supporting\n   ARM\n\n-  full compatibility with CPython (more than Jython/IronPython)\n\n-  full (and JIT-ed) ctypes support to call C libraries from Python\n\n-  supports Stackless Python (in-progress)\n\n-  new \"cpyext\" layer which integrates existing CPython C extensions\n\n-  an experimental super-fast JIT-compilation of calls to C++ libraries\n\nWe want to reserve time for discussing potential future work like SWIG\nand/or Cython compatibility and other areas brought up by the audience.\nThere are many interesting details that can be explored further; we will\nfocus on the points the audience is most interested in.\n\nFor more info:\n\n-  http://pypy.org/\n\n-  Our blog: http://morepypy.blogspot.com/\n\n-  Eureka program: http://www.eurostars-eureka.eu/\n\n*Eurostars Eureka is our funding source since 2009. It is a\ncross-European funding collaboration that targets small firms which\nproduce research.*\n",
  "duration": null,
  "id": 1113,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-13",
  "related_urls": [
    "http://morepypy.blogspot.com/",
    "http://pypy.org/",
    "http://www.eurostars-eureka.eu/"
  ],
  "slug": "pypy-in-production",
  "speakers": [
    "Antonio Cuni",
    "Armin Rigo"
  ],
  "summary": "[EuroPython 2011] Antonio Cuni,Armin Rigo - 23 June 2011 in \"Track\nLasagne\"\n",
  "tags": [
    "cpython",
    "ctypes",
    "cython",
    "extensions",
    "pypy",
    "stackless"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/nTpte3_jNO0/hqdefault.jpg",
  "title": "PyPy in production",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nTpte3_jNO0"
    }
  ]
}
