{
  "alias": "video/1110/python-design-patterns",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "A completely misguided meme has long been going around: that Python\ndoesn't have, or need, any Design Patterns. This terrible meme may\nspring from not realizing what the Gang Of Four state so plainly in\ntheir historical \"Design Patterns\" book: which design patterns are\nuseful DOES depend on the programming language one targets - design is\nNOT independent of implementation, as the epic-fail \"Waterfall\"\nMethodology Pattern would suggest. What patterns apply to a design,\ndepends to some extent on what implementation technologies will be used\nto realize that design.\n\nIf you focus on some \"classic DPs\" that are basically workarounds for\nsome other language's lack of garbage collection, or for a clumsy\nstatic-typing system, those may indeed be worthless for Python. But many\nother DPs are perfectly useful and applicable, and Python's strengths as\na language afford riffing on them to develop highly Pythonic, powerful,\nproductive variants.\n\nIn this talk, I analyze some of my favorite pattern families - e.g.,\nTemplate Method and its variants, Dependency Injection and its ilk,\nCallback and friends - in a highly Pythonic context. Non-pattern Idioms,\nand Patterns that aren't really Design Patterns but rather Architecture\nor Methodology ones, make cameo appearances.\n\nGoals: remove from your system any residue of the pernicious meme about\nPython not having or needing design patterns. Prereqs: experience\ndesigning and developing software; intermediate-level Python knowledge.\n",
  "duration": null,
  "id": 1110,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-13",
  "slug": "python-design-patterns",
  "speakers": [
    "Alex Martelli"
  ],
  "summary": "[EuroPython 2011] Alex Martelli - 24 June 2011 in \"Track Spaghetti\"\n",
  "tags": [
    "architecture",
    "design",
    "patterns"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/bPJKYrZjq10/hqdefault.jpg",
  "title": "Python Design Patterns",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bPJKYrZjq10"
    }
  ]
}
