{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2011", "speakers": ["Andreas Schreiber"], "title": "Python for High Performance and Scientific Computing", "quality_notes": "", "video_flv_length": null, "recorded": "2011-07-13", "video_mp4_length": null, "description": "Python is an accepted high-level scripting language with a growing community\nin academia and industry. It is used in a lot of scientific applications in\nmany different scientific fields and in more and more industries, for example,\nin engineering or life science). In all fields, the use of Python for high-\nperformance and parallel computing is increasing. Several organizations and\ncompanies are providing tools or support for Python development. This includes\nlibraries for scientific computing, parallel computing, and MPI. Python is\nalso used on many core architectures and GPUs, for which specific Python\ninterpreters are being developed. A related topic is the performance of the\nvarious interpreter and compiler implementations for Python. The talk gives an\noverview of Python’s use in HPC and Scientific Computing and gives information\non many topics, such as Python on massively parallel systems, GPU programming\nwith Python, scientific libraries in Python, and Python interpreter\nperformance issues. The talk will include examples for scientific codes and\napplications from many domains.\n\n[Slides](http://bit.ly/k94rC4)\n\n", "video_mp4_url": null, "tags": ["community", "engineering", "gpu", "hpc", "interpreters", "parallel", "performance", "python,", "scientific"], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=q3hAFI8iaqg", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2011] Andreas Schreiber - 23 June 2011 in \"Track Lasagne\"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/q3hAFI8iaqg/hqdefault.jpg", "video_flv_url": null}