{
  "alias": "video/1107/python-for-high-performance-and-scientific-comput",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "Python is an accepted high-level scripting language with a growing\ncommunity in academia and industry. It is used in a lot of scientific\napplications in many different scientific fields and in more and more\nindustries, for example, in engineering or life science). In all fields,\nthe use of Python for high- performance and parallel computing is\nincreasing. Several organizations and companies are providing tools or\nsupport for Python development. This includes libraries for scientific\ncomputing, parallel computing, and MPI. Python is also used on many core\narchitectures and GPUs, for which specific Python interpreters are being\ndeveloped. A related topic is the performance of the various interpreter\nand compiler implementations for Python. The talk gives an overview of\nPython’s use in HPC and Scientific Computing and gives information on\nmany topics, such as Python on massively parallel systems, GPU\nprogramming with Python, scientific libraries in Python, and Python\ninterpreter performance issues. The talk will include examples for\nscientific codes and applications from many domains.\n\n`Slides <http://bit.ly/k94rC4>`__\n",
  "duration": null,
  "id": 1107,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-13",
  "related_urls": [
    "http://bit.ly/k94rC4"
  ],
  "slug": "python-for-high-performance-and-scientific-comput",
  "speakers": [
    "Andreas Schreiber"
  ],
  "summary": "[EuroPython 2011] Andreas Schreiber - 23 June 2011 in \"Track Lasagne\"\n",
  "tags": [
    "community",
    "engineering",
    "gpu",
    "hpc",
    "interpreters",
    "parallel",
    "performance",
    "python,",
    "scientific"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/q3hAFI8iaqg/hqdefault.jpg",
  "title": "Python for High Performance and Scientific Computing",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=q3hAFI8iaqg"
    }
  ]
}
