{
  "alias": "video/1016/scraping-techniques-to-extract-advertisements-fro",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "Online Advertising is an emerging research field, at the intersection of\nInformation Retrieval, Machine Learning, Optimization, and\nMicroeconomics. Its main goal is to choose the right ads to present to a\nuser engaged in a given task, such as Sponsored Search Advertising or\nContextual Advertising. The former puts ads on the page returned from a\nWeb search engine following a query. The latter puts ads within the\ncontent of a generic, third party, Web page. The ads themselves are\nselected and served by automated systems based on the content displayed\nto the user.\n\nWeb scraping is the set of techniques used to automatically get some\ninformation from a website instead of manually copying it. In\nparticular, we're interested in studying and adopting scraping\ntechniques for: i. accessing tags as object members ii. finding out tags\nwhose name, contents or attributes match selection criteria iii.\naccessing tag attributes by using a dictionary-like syntax.\n\nIn this talk, we focus on the adoption of scraping techniques in the\ncontextual advertising field. In particular, we present a system aimed\nat finding the most relevant ads for a generic web page p. Starting from\np, the system selects a set of its inlinks (i.e., the pages that link p)\nand extracts the ads contained into them. Selection is performed\nquerying the Google search engine, whereas extraction is made by using\nsuitable scraping techniques.\n",
  "duration": null,
  "id": 1016,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-24",
  "slug": "scraping-techniques-to-extract-advertisements-fro",
  "speakers": [
    "Mirko Urru",
    "Stefano Cotta Ramusino"
  ],
  "summary": "[EuroPython 2011] Mirko Urru,Stefano Cotta Ramusino - 24 June 2011 in\n\"Track Tagliatelle \"\n",
  "tags": [
    "google",
    "scraping",
    "search",
    "web"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/IL4o0HSGOsU/hqdefault.jpg",
  "title": "Scraping Techniques to Extract Advertisements from Web Pages",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IL4o0HSGOsU"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cCKGqKTwfqI"
    }
  ]
}
