{
  "alias": "video/1099/source-code-processing-with-python",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "Folklore says that having a problem and trying to solve it with regular\nexpressions gives you two problems. However not applying regular\nexpressions to advanced textual search'n replace doesn't solve your\nproblem either. One step above you have large portions of recursively\nstructured text aka \"source code\" and using context free grammars and\ntools supporting them gives you two problems but not using them also\ndoesn't solve your original problem. Maybe you get uneasy at that point\nbecause what I say implies parsers and computing science and what not\nand you still wake up in the night believing that you have to learn\nautomata theory but you are lucky it was just a nightmare. Otherwise you\nare laughing about the little diatribe against regexps and use them\nwithout much deliberation, verifying your SQL input, mining source code\nand do all the other things they are not made for.\n\nIn my talk I'm addressing daily use of grammars outside of the scope of\ncompiler implementation or natural language processing. My talk covers:\n\n-  Search & Replace using grammars\n\n-  CodeTemplates for source code transformation\n\n-  Generative grammars for expression generation\n\nI'm touching this from the lightweight, \"pythonic\" angle and you might\nwonder why not everyone uses those techniques already for decades in\ntheir daily work. I can't answer this, I wonder about this too.\n",
  "duration": null,
  "id": 1099,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-13",
  "slug": "source-code-processing-with-python",
  "speakers": [
    "Kay Schluehr"
  ],
  "summary": "[EuroPython 2011] Kay Schluehr - 24 June 2011 in \"Track Lasagne\"\n",
  "tags": [
    "processing",
    "science"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/tjF5jLD31kQ/hqdefault.jpg",
  "title": "Source code processing with Python",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tjF5jLD31kQ"
    }
  ]
}
