{
  "alias": "video/1014/sqlkit-empowering-database-access",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "It's very easy to access databases with Python, and there are many ORMs\nallowing a high level of abstraction. Still, it's a long road from there\nto interactive handling of data, even for very simple tasks.\n\nSqlkit tries to act as a bridge, offering some mega-widgets that allow\nyou to build GUI applications or directly access data using the\n'sqledit' application, shipped with sqlkit; sqlkit is built with PyGTK\nand SQLAlchemy.\n\nThis presentation covers some of the most powerful features of sqlkit,\nand shows how easy it is to build small programs for personal use, as\nwell as rich and complex applications. It primarily focuses on two\npoints: how easy it is to create data forms (eventually with one2many or\nmany2many, thanks to a original definition of layouts), and the template\nsystem based on OpenOffice which allows easy report creation.\n\nThis presentation shows how sqlkit can be used both as application\ndevelopment framework and as a tool to help us while developing other\napplications (e.g.: Django, OpenERP,… ).\n\nTo deliver a gradual presentation, we'll use the configuration system of\nsqledit, starting from a minimal configuration (a single URL) we'll add\nelements to that until we'll have a full application.\n",
  "duration": null,
  "id": 1014,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-24",
  "slug": "sqlkit-empowering-database-access",
  "speakers": [
    "Alessandro Dentella"
  ],
  "summary": "[EuroPython 2011] Alessandro Dentella - 23 June 2011 in \"Track\nSpaghetti\"\n",
  "tags": [
    "database",
    "forms",
    "framework",
    "gui",
    "openoffice",
    "python,"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/UwV2Hdb8XQQ/hqdefault.jpg",
  "title": "Sqlkit: empowering database access",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UwV2Hdb8XQQ"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7oWykWu_5z4"
    }
  ]
}
