{
  "alias": "video/1173/sqlkit-database-ad-accesso-immediato",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "È molto facile accedere ad un database con Python e ci sono molti ORM\nche permettono un alto livello di astrazione. Da qui c'é ancora una\nlunga strada per arrivare a manipolare interattivamente i dati anche per\nsemplici compiti.\n\nSqlkit cerca di coprire questa distanza fornendo alcuni mega-widgets che\npermettono di costruire ogni applicazione GUI o accedere direttamente ai\ndati con l'applicazione 'sqledit', che viene distribuita con sqlkit.\nSqlkit è costruita con PyGTK e SQLAlchemy.\n\nQuesta presentazione esplora alcune fra le più potenti caratteristiche\ndi sqlkit e mostra quanto sia semplice costruire piccoli programmini ad\nuso personale o applicazioni ricche ed articolate. Si focalizza\nprincipalmente su due punti: quanto sia facile creare maschere per\neditare dati (anche relazioni on2many o many2many, grazie al modo\noriginale di definire i layout) e al sistema di template basato su\nOpenOffice che rende incredibilmente semplice creare report.\n\nQuesta presentazione vuole mostrare come sqlkit può essere usato sia\ncome framework di sviluppo di applicazioni, sia come strumento che ci\naiuta mentre sviluppiamo altre applicazioni (es.: Django, OpenERP,… ).\n\nPer rendere la presentazione più graduale, sfrutteremo il sistema di\nconfigurazione di sqledit Partendo da una configurazione minima -un URL-\naggiungeremo elementi fino ad ottenere una vera applicazione.\n",
  "duration": null,
  "id": 1173,
  "language": "ita",
  "quality_notes": "",
  "recorded": "2011-07-18",
  "slug": "sqlkit-database-ad-accesso-immediato",
  "speakers": [
    "Alessandro Dentella"
  ],
  "summary": "[EuroPython 2011] Alessandro Dentella - 21 June 2011 in \"Track Italiana\nBig Mac\"\n",
  "tags": [
    "ci",
    "database",
    "framework",
    "gui",
    "openoffice",
    "orm"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/nx04zGh3gME/hqdefault.jpg",
  "title": "Sqlkit: database ad accesso immediato",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nx04zGh3gME"
    }
  ]
}
