{
  "alias": "video/1012/the-political-implications-of-having-fun-while-p",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "What are the implications for the society if people enjoy their work,\nbecause this work is perceived as rewarding by itself? It is this\nquestion that occupies me since I have finished my Ph.D. research about\nthe motivation of open source programmers. In my research, I have been\nable to show that fun is an important driver for open source\nprogrammers. Moreover, fun plays an important role not only for\nhobbyists, but for developers who are paid for their work too (open or\nclosed source).\n\nThese findings contrast with the traditional efforts of leftist parties\nand labor unions. For those political organizations, labor is perceived\nas compulsion and exploitation and, therefore, people have to be\nliberated from labor. The resulting political praxis is to send people\ninto retirement as soon as possible and, on the other hand, to make the\nlife for unemployed people carefree.\n\nIs the software developers‘ world a little Shangri-La, apart from the\nreal world, delineated by the leftist parties, or is the open source\nmodel generalizable? What happens with the values generated through the\nlabor if the work as such is rewarding? The open source mode of\nproduction is part of our modern reality and in my presentation I would\nlike to consider this big reality from the perspective of open source.\n",
  "duration": null,
  "id": 1012,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-24",
  "slug": "the-political-implications-of-having-fun-while-p",
  "speakers": [
    "Benno Luthiger"
  ],
  "summary": "[EuroPython 2011] Benno Luthiger - 23 June 2011 in \"Track Spaghetti\"\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/SVXq0LfuPUE/hqdefault.jpg",
  "title": "The political implications of having fun (while programming open source)",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SVXq0LfuPUE"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=B5V7fWST3H0"
    }
  ]
}
