{
  "id": 1062,
  "category": "EuroPython 2011",
  "slug": "using-python-in-software-for-the-medical-industry",
  "title": "Using Python in Software for the Medical Industry",
  "alias": "video/1062/using-python-in-software-for-the-medical-industry",
  "summary": "[EuroPython 2011] wesley chun - 21 June 2011 in \"Track Tagliatelle\"\n",
  "description": "The medical industry has long been dominated by custom software written\nby manufacturers of medical equipment. With the widespread use of\nlower-cost computing power and abundance of software developers using\ncost-beneficial open source development tools, it is no surprise that\nthis is a rapidly- growing field in software engineering. In this talk,\nI will describe some of my experiences using Python and other open\nsource tools, temporarily transitioning from the world of the web and\nInternet development, jumping into the medical industry, an experience\nmuch like being a fish out of water. The experiences of working in this\nfield, specifically developing software for use in clinical trials. We\ndescribe the use of open source tools for such software development, the\nrequired integration with closed-source software, and the documentation\nrigor that is necessary in a field under the jurisdiction of the US Food\nand Drug Administration (FDA). In particular, I'll describe direct\nexperience in building an application for the use of analyzing spinal\nfractures and the various tools that make up the application suite,\nwhose primary development language was Python. We will also discuss the\nparticular role of the my employer at the time in the clinical trials\nprocess and elaborate on the data flow that was necessary for all\nmedical applications developed at the firm, not just the one in\nparticular.\n",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "Standard YouTube License",
  "thumbnail_url": "http://i.ytimg.com/vi/SFi7LpBr-JY/hqdefault.jpg",
  "duration": null,
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=SFi7LpBr-JY",
      "type": "youtube",
      "length": 0
    }
  ],
  "source_url": "http://www.youtube.com/watch?v=SFi7LpBr-JY",
  "tags": [
    "documentation",
    "web"
  ],
  "speakers": [
    "wesley chun"
  ],
  "recorded": "2011-07-18"
}