{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2011", "speakers": ["Christine Moran"], "title": "Visualization and Analysis of Large Scale Datasets with Python", "quality_notes": "", "video_flv_length": null, "recorded": "2011-07-21", "video_mp4_length": null, "description": "In this talk I will introduce ParaView, an open source application developed\nby researchers around the world for parallel visualization and analysis of\nlarge scale datasets, which in can be used to visualize and analyze terabytes\nof data in real time. ParaView’s core algorithms are implemented in C/C++ but\nall its major functionality can be scripted from python with ease. I’ll give a\nshort introduction to AstroViz, a parallel visualization tool for\nastrophysical simulations implemented as an opensource plugin to ParaView,\nwhich I have been lead developer on since 2009. The focus of the talk will be\non driving ParaView from within python however, both general out of the box\nuse and customized extensions.\n\nI also have access to several parallel supercomputers so if there’s a huge\ndataset we as a crowd would like to tackle visualizing during the course of\nthe week that would be fun project. The end of the talk will be a short\nbrainstorm of cool applications of analysis and visualization of large scale\ndatasets.\n\n[http://www.paraview.org/](http://www.paraview.org/)\n\n", "video_mp4_url": null, "tags": ["analysis", "datasets", "opensource", "parallel", "simulations", "visualization"], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=y2eKgo3gw-0", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2011] Christine Moran - 23 June 2011 in \"Training Pizza Margherita\n\"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/y2eKgo3gw-0/hqdefault.jpg", "video_flv_url": null}