{
  "alias": "video/1033/visualization-and-analysis-of-large-scale-dataset",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "In this talk I will introduce ParaView, an open source application\ndeveloped by researchers around the world for parallel visualization and\nanalysis of large scale datasets, which in can be used to visualize and\nanalyze terabytes of data in real time. ParaView’s core algorithms are\nimplemented in C/C++ but all its major functionality can be scripted\nfrom python with ease. I’ll give a short introduction to AstroViz, a\nparallel visualization tool for astrophysical simulations implemented as\nan opensource plugin to ParaView, which I have been lead developer on\nsince 2009. The focus of the talk will be on driving ParaView from\nwithin python however, both general out of the box use and customized\nextensions.\n\nI also have access to several parallel supercomputers so if there’s a\nhuge dataset we as a crowd would like to tackle visualizing during the\ncourse of the week that would be fun project. The end of the talk will\nbe a short brainstorm of cool applications of analysis and visualization\nof large scale datasets.\n\nhttp://www.paraview.org/\n",
  "duration": null,
  "id": 1033,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-21",
  "related_urls": [
    "http://www.paraview.org/"
  ],
  "slug": "visualization-and-analysis-of-large-scale-dataset",
  "speakers": [
    "Christine Moran"
  ],
  "summary": "[EuroPython 2011] Christine Moran - 23 June 2011 in \"Training Pizza\nMargherita \"\n",
  "tags": [
    "analysis",
    "datasets",
    "opensource",
    "parallel",
    "simulations",
    "visualization"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/y2eKgo3gw-0/hqdefault.jpg",
  "title": "Visualization and Analysis of Large Scale Datasets with Python",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=y2eKgo3gw-0"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4fHnMecFIyw"
    }
  ]
}
