{
  "alias": "video/1011/what-is-google-app-engine",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "Google App Engine is a unique hosting platform that lets you build\napplications and run them in Google's data centers using the massive\nglobal infrastructure built to run the Internet's most powerful company.\nApp Engine offers a development environment that uses familiar\ntechnologies (Java and Python) and provides a powerful and robust set of\nAPIs to users while maintaining security and independence from other\napps running in the cloud. It is always free to get started so you can\ntry it out with no risk, and if you need additional computing resources,\nyou can purchase additional computing resources beyond the free quota\nlimits. (If you enable billing and trust us with your credit card, we\nwill extend your free quotas even further; you won't get charged until\nyou exceed those *extended* quotas.) Scale your application to millions\nof users and pay only for what you use at competitive market pricing.\n\nIn this session, we provide an update of the newest features found in\nthe most recent releases of the App Engine platform. We also share some\nsuggestions for best practices to existing App Engine developers.\n\nBeginners to the App Engine platform will be interested in the\nintroductory workshop which may be offered (see description below).\n\nGoogle App Engine workshop\n\nIn this tutorial, we'll give you a comprehensive introduction to the\nplatform in two/three components:\n\n-  1-hour Introduction to Cloud computing and Google App Engine seminar\n-  3-hour App Engine hands-on workshop/codelab\n\nIn the first hour, we review Cloud Computing as an industry and where\nGoogle App Engine fits into the picture. Specifically, we discuss App\nEngine as a PaaS solution because of the inherent challenges of building\nweb and other applications. We'll outline the architecture of App\nEngine, what it's major components are, introduce its features and APIs,\ndiscuss the service and how it works (including information on the free\nquotas), present some information about current users and usage,\nincluding integration with Google Apps, and finally, give an overview of\nits enterprise edition called Google App Engine for Business.\n\nAfter the approximately one-hour lecture, we'll show you how to create\napplications that run on App Engine by building a simple but real web\napplication from the ground up via a hands-on coding laboratory.\nAlthough based on the online tutorial, this codelab goes up and beyond\nwhat's in the documentation: you will get a more detailed step-by-step\ninstructions to replicate that example as well as have the opportunity\nto extend your application with some of the newer APIs that come with\nApp Engine. The codelab will cover the Users service, non-relational\nDatastore, and Memcache APIs. Time-permitting, we'll also discuss some\nof the newest features found in recent App Engine releases.\n",
  "duration": null,
  "id": 1011,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-24",
  "slug": "what-is-google-app-engine",
  "speakers": [
    "Wesley J. Chun"
  ],
  "summary": "[EuroPython 2011] wesley chun - 23 June 2011 in \"Track Tagliatelle\"\n",
  "tags": [
    "architecture",
    "cloud",
    "google",
    "hosting",
    "infrastructure",
    "memcache",
    "security",
    "web"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/YiimQ3zyxRQ/hqdefault.jpg",
  "title": "What is Google App Engine?",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YiimQ3zyxRQ"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tT7nNx6ahhA"
    }
  ]
}
