{
  "alias": "video/1087/writing-books-using-python-open-source-software",
  "category": "EuroPython 2011",
  "copyright_text": "Standard YouTube License",
  "description": "All of us are familiar with using open source tools to develop software\napplications with, but instead of writing code, it is also possible to\ncreate the manuscript of a book in very much the same way. These days,\nauthors have many choices in terms of the tools which are available to\naid them in writing a book. Gone are the times when the only option is\nusing a proprietary word processor, so why not try it using open source\ntools? It's especially attractive to those who develop software using\nopen source tools as well those who are writing books about open source\ntools. Both code and the written word are created in plain text files.\nThese files are easily archived using some version control system. They\ncan be shared easily via e-mail and can also be backed up in the same\nmanner. In the end, the final product is shipped to the customer: in the\ncase of software, it's distribution via CD or DVD, or perhaps a release\nfor installation on a server, and for a book, it's delivering a\nmanuscript to the publisher, perhaps in a format such as HTML or PDF®.\n\nUpon some reflection, writing a book is, in many ways, similar to\nwriting an application: you create text or code which is saved to a file\n(or files- typically one but could be more) file in some format,\nproprietary or otherwise. Additions, changes, or deletions are made to\nthe file(s), which is then updated when the file is (re)saved. Backups\nneed to be made, some versioning may be required to keep track of\nmultiple files during the course of development, and finally, the\nresulting file(s) have to be delivered, as described above. Because of\nall the similarities described, we assert that it is possible to use a\ndevelopment environment utilizing Python and other open source tools to\nnot only write application with, but also be able to create the entire\nmanuscript for a book as well! While this entire concept should not\nreally be mind-blowing, it does represent a trend seemingly growing in\npopularity in the open source world.\n\nIn particular, we highlight the following requirements that are\nnecessary when creating a manuscript, especially with co-authors:\n\n-  Text Formatting\n-  Editing\n-  Versioning and Backups\n-  Automated Testing of Code\n-  HTML/PDF® Generation\n-  Author Communication\n\nIn this talk, we highlight one particular case study, the development of\nAddison Wesley's 2009 publication, \"Python Web Development with Django\",\nas well as provide some insight into other projects created using\nsimilar tools. Open source software has radically affected how\napplications are built today, and this phenomenon has the ability to\naffect the book publishing world in the same way.\n",
  "duration": null,
  "id": 1087,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-07-13",
  "slug": "writing-books-using-python-open-source-software",
  "speakers": [
    "Wesley J. Chun"
  ],
  "summary": "[EuroPython 2011] wesley chun - 20 June 2011 in \"Track Ravioli\"\n",
  "tags": [
    "cd",
    "html",
    "testing",
    "web"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/1QTMeb9m_lE/hqdefault.jpg",
  "title": "Writing Books using Python & Open Source Software",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1QTMeb9m_lE"
    }
  ]
}
