{
  "description": "Are you a Django novice, confused by words like class-based views, URL\ndispatchers, HTTP requests? Are you still wondering how to use all those\nthings to build the pages of your Web site?\n\nDjango programmers that started with versions prior to 1.3 are used to\ndeal with views as functions, and they learned how to process even\ncomplex forms in a procedural way. From the release 1.3, Django\nintroduced class-based views (CBVs) and ported its powerful generic\nviews to this new paradigm (class-based generic views, or CBGVs).\n\nThis change, however, has not been harmless for Django novices: the\ndjango- users mailing list and StackOverflow are full of questions about\nviews and classes.\n\nThis talk aims to lead Django novices to a good understanding of what\nclass- based functions are and how they can be effectively used.\n\nThe main topics are:\n\n-  Python classes: how OOP concepts improve the View part of Django MVT.\n   This part aims to introduce Python classes as data processors and\n   explains how OOP concepts like inheritance help the fast development\n   of customized solutions.\n\n-  URL dispatchers: how Django CBV process URL parameters. Here I\n   discuss how Django class-based views store arguments extracted from\n   URLs and how we can access them.\n\n-  HTTP verbs: how Django CBV deal with GET, POST and friends. This part\n   shows what happens to a class-based view when HTTP requests are\n   processed and how to leverage the mechanism to customize data\n   processing.\n\n-  CRUD operations through Django generic class-based views. Create,\n   Read, Update, Delete are the fundamentals operations you need on\n   data, so it is worth learning to use and customize the powerful\n   generic views of Django that implement them.\n\nThe target of this talk are Django novices who completed and understood\nthe Django tutorial. Previous knowledge of the basic Python OOP syntax\nand concepts is preferred (classes, inheritance, method overriding,\nfunction arguments processing).\n",
  "duration": 1156,
  "language": "eng",
  "recorded": "2014-05-13",
  "speakers": [
    "Leonardo Giordani"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Dpydk5qK-bo/hqdefault.jpg",
  "title": "Django class-based views: survival guide for novices",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Dpydk5qK-bo"
    }
  ]
}
