{
  "description": "All too often we see developers and system operators fail to\ncommunicate. Both teams seems to have different requirements: developers\nwant new features and releases whilst operators want stable systems. But\nthe fact of the matter is that both teams have the same goals. When both\nteams are brought together from the get-go, you notice the goals become\nvisible again and the requirements align.\n\nThe Devops movement in IT is a critical mass of developers and IT\noperations aligning their ideas. It is a collection of best practices,\ntooling and a philophy that emphasizes on collaboration and automation.\nBut the most important best practice a developer and IT operator\nrequires is the art of clear and concise communication.\n\nIn this talk, I'll finally remove the confusion of what Devops really is\nand explain the best practices and toolsets. The talk revolves around\nthe CALMS acronym:\n\n-  Culture: people and process first, if you dont have the correct\n   culture, all attempts will be fruitless.\n-  Automation: remove the human error from the equation.\n-  Lean: learn to adapt to situations, think outside the box and\n   identify processes that are a waste of time\n-  Measurements: If you can't measure, you can't identify and improve.\n   Performance metrics, process metrics and even people metrics!\n-  Sharing: This is the loopback in the CALMS cycle. Share your ideas\n   and solutions with the community. Learn from the advise of other\n   people and improve your own processes along the way.\n\nYour product is more than the application, it is also the monitoring,\nthe infrastructure, the constant improvement, the sharing of knowledge\nand the people developing it!\n",
  "duration": 1259,
  "recorded": "2014-05-14",
  "speakers": [
    "Kevin Van Wilder"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/7KKar552olY/hqdefault.jpg",
  "title": "Keynote: Your Product is more than the Application!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7KKar552olY"
    }
  ]
}
