{
  "description": "We created an automated framework for analysis of large-scale\ngeospatial data using Spark, Impala, and Python. We use this framework\nto join billions of device locations daily from mobile phone users to\nmillions of points of interest. We discuss our project structure and\nworkflow. Our work has broader application to movement of populations\nthrough time and space.\n\nLarge-scale geospatial data is a common analytical challenge. We\nreceive billions of location data points per day for user locations.\nWe need to filter this data and map it to millions of points of\ninterest. Our end use case is to provide clients with information as\nto the attributes of users who visit their stores. This workflow,\nhowever, has application to the broader analytical problem of mapping\ngeospatially located entities of interest to points of interest with\nknown locations. We also provide our approach to the frequently\nencountered issue of needing both standardized and flexible reporting.\nWe have automated the standard analyses in our workflow, but created\nan API for analysts to quickly develop ad-hoc analyses based on\ncustomer requests.\n\nThere are freely available tools to the Python user that can help us\ncomplete all of the tasks in our data analysis pipeline. At a high\nlevel, the architecture of our process is as follows: HDFS storage for\nlarge-scale geospatial data, Spark for geospatial joins, Cloudera\nImpala accessed via Ibis to query resultant datasets, and scientific\npython for conducting analyses. We make the automated analyses to the\nend users via a web portal created using Flask and Celery. We created\nan API available to analysts as a Python package so that they can\nquickly perform custom analyses created by clients. We used Sphinx to\naid in documentation for easier use of the API.",
  "duration": 1653,
  "recorded": "2016-09-15",
  "speakers": [
    "Alice Broadhead"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/bvoMa-JYSes/hqdefault.jpg",
  "title": "A pythonista’s pipeline for large-scale geospatial analytics",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bvoMa-JYSes"
    }
  ]
}
