{
  "description": "This talk will be about gaining an understanding of the real world\nentities represented by our data, creatively conceptualizing different\nperspectives from which our data can be analyzed, and then bringing\nthose conceptualizations to life with the help of Python libraries\nsuch as Pandas, Scikit-Learn, Seaborn, and Yellowbrick so that we can\nunlock the latent value and insights hidden in our data.\n\nAt the heart of data analysis, there lies a need to understand the\nreal world entities being represented in the data. Every data set we\nencounter is an attempt to capture a slice of our complex world and\ncommunicate some information about it in a way that has potential to\nbe informative to humans, machines, or both. Moving from basic\nanalyses to advanced analytics requires the ability to imagine\nmultiple ways of conceptualizing the composition of entities and the\nrelationships present in our data. It also requires the realization\nthat different levels of aggregation, disaggregation, and\ntransformation can open up new pathways to understanding our data and\nidentifying the valuable insights it contains.\n\nIn this talk, we’ll discuss several ways to think about the\ncomposition and representation of our data. We’ll also demonstrate a\nseries of methods that leverage tools like networks, hierarchical\naggregations, and unsupervised clustering to visually explore our\ndata, transform it to discover new insights, help frame analytical\nproblems and questions, and even improve machine learning model\nperformance. In exploring these approaches, and with the help of\nPython libraries such as Pandas, Scikit-Learn, Seaborn, and\nYellowbrick, we will provide a practical framework for thinking\ncreatively and visually about your data and unlocking latent value and\ninsights hidden deep beneath its surface.",
  "duration": 2264,
  "recorded": "2016-09-15",
  "speakers": [
    "Tony Ojeda"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/8dlxAkmGxwQ/hqdefault.jpg",
  "title": "Transforming Data to Unlock Its Latent Value",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8dlxAkmGxwQ"
    }
  ]
}
