{
  "alias": "video/1216/a-unified-release-of-python-iraf-software-for-a",
  "category": "SciPy 2012",
  "copyright_text": "CC BY-SA",
  "description": "As astronomical software development expands from historical data\nreduction platforms towards more sophisticated Python applications,\nnon-technically- focused users can struggle with installing and\nmaintaining a large number of heterogeneous dependencies. PyRAF has\nsuccessfully bridged the gap between IRAF and Python, but managing\ndependencies falls outside its scope. A few existing Python\ndistributions make installation easy, but don't cater for specific needs\n(such as dependence on IRAF). STScI and Gemini have therefore developed\na prototype, easy-to-install software distribution for Linux and OSX\nknown provisionally as the 'Unified Release' (UR).\n\nCurrently the UR includes STScI Python and its dependencies (eg. Python,\nNumPy, IRAF 2.15), as well as Matplotlib & Tk, SciPy, a number of IRAF\npackages, DS9, X11IRAF and some testing and documentation tools. Its\nscope extends to complementary non-Python/IRAF software, but we do not\nintend to produce a comprehensive (Scisoft-like) distribution of tools\nfor astronomy, nor to satisfy every installation preference. Our focus\nis on providing a simple way to run key tools, for users with minimal\nsupport resources and who may not have administrative privileges. Unlike\nmost comparable distributions, our approach includes basic provision for\nin-place software additions and updates.\n\nRecently we have completed a first internal version of the UR for both\nLinux and OSX, which we shall briefly demonstrate. We plan to make our\nfirst public release during the coming months.\n",
  "duration": null,
  "id": 1216,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-18",
  "slug": "a-unified-release-of-python-iraf-software-for-a",
  "speakers": [
    "James E.H. Turner"
  ],
  "summary": "",
  "tags": [
    "Astronomy Mini-Symposia"
  ],
  "thumbnail_url": "https://i4.ytimg.com/vi/cgRouxz0y_4/hqdefault.jpg",
  "title": "A Unified Release of Python & IRAF software for astronomy",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/A_Unified_Release_of_Python_IRAF_software_for_astronomy.mp4?Signature=oCxI%2FyHw3t0nEcCFJ7AYbMa1YWQ%3D&Expires=1346381851&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cgRouxz0y_4"
    }
  ]
}
