{
  "alias": "video/1213/alges-geostatistics-and-python",
  "category": "SciPy 2012",
  "copyright_text": "CC BY-SA",
  "description": "ALGES is a laboratory that develops tools applied to geostatistics.\nWe've been using python for a while and it has brought us very good\nresults. Its ease-of- use and portability allow us to rapidly offer\npractical solutions to problems. Along with a brief introduction to the\nlaboratory, we cover two particular projects we are currently working\non. One project is an application for multivariate geostatistic\nanalysis. Most available applications provide analysis for a single\nvariable at a time and either obviate how variables can relate between\none another or make it really difficult to consider any relationship.\nOur proposal provides both an interface that's both easy to use for\nprimers and fine tuning for experienced users. The other presented\nproject covers a problem in geological modeling and resource estimation.\nCommonly, when modeling geological volumes, continuity in data is\nassumed. This is not often true, as there are different kinds of faults\nthat break this continuity. This is very hard to incorporate when\nmodeling. We propose a solution to restore the original continuous\nvolume for better modeling as well as restitution to the real distorted\nvolume, all this providing a better estimation. Both projects have lots\nof heavy computations and no shortage of input data. We take this as a\nchallenge to build fast processing solutions, so we take advantage of\nboth the easiness of a python interface and the speed of C/C++ code.\n",
  "duration": null,
  "id": 1213,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-18",
  "slug": "alges-geostatistics-and-python",
  "speakers": [
    "Felipe Lema"
  ],
  "summary": "",
  "tags": [
    "Geophysics Mini-Symposia"
  ],
  "thumbnail_url": "https://i2.ytimg.com/vi/qOPNbjx5uhM/hqdefault.jpg",
  "title": "ALGES: Geostatistics and Python",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/ALGES_Geostatistics_and_Python.mp4?Signature=SY9wk52zGieTkNTs9q5txKugp1A%3D&Expires=1346381755&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtube.com/watch?v=qOPNbjx5uhM"
    }
  ]
}
