{
  "alias": "video/1218/astroml-data-mining-and-machine-learning-for-ast",
  "category": "SciPy 2012",
  "copyright_text": "CC BY-SA",
  "description": "Python is currently being adopted as the language of choice by many\nastronomical researchers. A prominent example is in the Large Synoptic\nSurvey Telescope (LSST), a project which will repeatedly observe the\nsouthern sky 1000 times over the course of 10 years. The 30,000 GB of\nraw data created each night will pass through a processing pipeline\nconsisting of C++ and legacy code, stitched together with a python\ninterface. This example underscores the need for astronomers to be\nwell-versed in large-scale statistical analysis techniques in python. We\nseek to address this need with the AstroML package, which is designed to\nbe a repository for well-tested data mining and machine learning\nroutines, with a focus on applications in astronomy and astrophysics. It\nwill be released in late 2012 with an associated graduate-level\ntextbook, 'Statistics, Data Mining and Machine Learning in Astronomy'\n(Princeton University Press). AstroML leverages many computational tools\nalready available available in the python universe, including numpy,\nscipy, scikit- learn, pymc, healpy, and others, and adds efficient\nimplementations of several routines more specific to astronomy. A main\nfeature of the package is the extensive set of practical examples of\nastronomical data analysis, all written in python. In this talk, we will\nexplore the statistical analysis of several interesting astrophysical\ndatasets using python and astroML.\n",
  "duration": null,
  "id": 1218,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-18",
  "slug": "astroml-data-mining-and-machine-learning-for-ast",
  "speakers": [
    "Alex Gray",
    "Andrew Connolly",
    "Jake Vanderplas",
    "Zeljko Ivezic"
  ],
  "summary": "",
  "tags": [
    "Astronomy Mini-Symposia"
  ],
  "thumbnail_url": "https://i3.ytimg.com/vi/62zY8mA-UVQ/hqdefault.jpg",
  "title": "AstroML: data mining and machine learning for Astronomy",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/AstroML_data_mining_and_machine_learning_for_Astronomy.mp4?Signature=wee1HpiGOvESlEYUkXaQoGp%2BgNo%3D&Expires=1346381992&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtube.com/watch?v=62zY8mA-UVQ"
    }
  ]
}
