{
  "alias": "video/1214/astropy-herding-snakes-or-astronomers-which-is",
  "category": "SciPy 2012",
  "copyright_text": "CC BY-SA",
  "description": "Developers and users of astronomical software have long bemoaned the\nabsence of shared efforts in the field. While there are well known, free\nsoftware tools available for astronomy, most have been developed by\nlarge institutions, and the past few decades have seen comparatively\nlittle progress in fostering a community-based set of software tools.\nThere is hope that is changing now. The continuing growth of Python in\nastronomy has led to an increasing awareness of needless duplication of\nefforts within the community and the need to make existing packages work\nbetter with each other; such discussions came to a head on the astropy\nemail list in the spring of 2011 leading to formation of the astropy\nproject. The first coordination meeting was held in the fall of 2011,\nand significant progress has been made in setting up a community\nrepository of core astronomical packages. We will describe the general\ngoals of astropy and the progress that has been made to date.\n",
  "duration": null,
  "id": 1214,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-18",
  "slug": "astropy-herding-snakes-or-astronomers-which-is",
  "speakers": [
    "Erik Tollerud",
    "Perry Greenfield",
    "Thomas Robitaille"
  ],
  "summary": "",
  "tags": [
    "Astronomy Mini-Symposia"
  ],
  "thumbnail_url": "https://i3.ytimg.com/vi/VmxthPjCFXo/hqdefault.jpg",
  "title": "Astropy - Herding Snakes or Astronomers: which is more difficult?",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Astropy_Herding_Snakes_or_Astronomers_which_is_more_difficult.mp4?Signature=mzIR%2FouPTEnbyJod6u03IF5%2B9Nk%3D&Expires=1346381801&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtube.com/watch?v=VmxthPjCFXo"
    }
  ]
}
