{
  "alias": "video/1224/bokeh-an-extensible-implementation-of-the-gramma",
  "category": "SciPy 2012",
  "copyright_text": "CC BY-SA",
  "description": "Bokeh is a new plotting framework for Python that natively understands\nthe relationships in multidimensional datasets, uses a Protovis-like\nexpression syntax scheme for creating novel visualizations, and is\ndesigned from the ground up to be used on the web.\n\nAlthough it can be thought of as \"ggplot for Python\", the goals of Bokeh\nare much more ambitious. The Grammar of Graphics primarily addresses the\nmapping of pre-built aeshetics and layouts to a particular data schema\nand tuples of measure variables. It has limited facility for expressing\ndata interactivity, and its small set of graph types (aka \"geoms\" or\nglyphs) are somewhat limited in both their number and in the number of\nways they can be combined with one another.\n\nOn the flip side, most existing Python plotting frameworks adopt a \"tell\nme how\" instead of a \"tell me what\" approach. Thus, user plotting code\ncanfrequently become mired down in what amounts to details of the\nrendering system.\n\nIn our talk, we will show various features of Bokeh, and talk about\nfuture development. We will also go into some detail about how Bokeh\nunifies the tasks of describing data mapping, building data-driven\nlayout, and composing novel visualizations using a single, multi-purpose\nscene and data graph.\n",
  "duration": null,
  "id": 1224,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-19",
  "slug": "bokeh-an-extensible-implementation-of-the-gramma",
  "speakers": [
    "Hugo Shi",
    "Peter Wang"
  ],
  "summary": "",
  "tags": [
    "visualization"
  ],
  "thumbnail_url": "https://i3.ytimg.com/vi/6_aE0kAedL0/hqdefault.jpg",
  "title": "Bokeh: An Extensible Implementation of the Grammar of Graphics for Python",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Bokeh_An_Extensible_Implementation_of_the_Grammar_of_Graphics_for_Python.mp4?Signature=gBH9TWy6r8GT9YBqtkCWpOmRLPE%3D&Expires=1346382408&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtube.com/watch?v=6_aE0kAedL0"
    }
  ]
}
