{
  "alias": "video/1234/fcm-a-python-library-for-flow-cytometry",
  "category": "SciPy 2012",
  "copyright_text": "CC BY-SA",
  "description": "Cellular populations in biology are often heterogeneous, and aggregate\nassays such as expression arrays can obscure the small differences\nbetween these populations. Examples where these differences can be\nhighly significant include the identification of antigen-specific immune\ncells, stem cells and circulating cancer cells. As the frequency of such\ncells in the blood can be vanishingly small, assays to detect signals at\nthe single cell level are essential. Flow cytometry is probably the best\nestablished single cell assay, and has been an integral tool in\nimmunology and biology for decades, able to measure cellular marker\nlevels for individual cells, as well as population statistics over\nmillions of cells.\n\nRecent technological innovations in flow cytometry have increased the\nnumber of cell markers capable of being resolved simultaneously, and\nvisual analysis (gating) is difficult and error prone with increasing\ndata dimensionality. Hence there is increasing demand for tools to\nautomate the analysis and management of flow data, so as to increase\naccuracy and reproducibility. However, essentially all software used by\nflow cytometry laboratories is commercial and based on the visual\nanalysis paradigm. With the exception of the R BioConductor project, we\nare not aware of any other full-featured open source tools for analyzing\nflow data. The few open source flow software modules that exist simply\nextracts data from FCS (flow cytometry standard) files into tabular/csv\nformat, losing all metadata associated with the file, and provide no\nadditional tools for analysis. We therefore decided to develop the *fcm*\nlibrary in python that would provide a foundation for flow cytometry\ndata management and analysis.\n\nThe *fcm* library provides functions to load fcs files, apply spectral\ncompensation, and perform standard log and log-like transforms for\nvisualization. The library also provides objects and methods for\ntraditional gating-based analysis, including standard polygon,\nthreshold, interval, and quadrant gates. Using *fcm* and other common\npython libraries, one can quickly write scripts for doing large scale\nbatch analysis. In addition to gating- based analysis, *fcm* provides\nmethods to do model-based analysis, utilizing GPU-optimized statistical\nmodels to identify cell subsets. These statistical models provide a\ndata-driven way to construct generative probability models that scale\nwell with the increasing dimensionality of flow data and do not require\nexpert input to identify cell subsets. High performance computational\nroutines to fit statistical models are optimized using cython and\npycuda. More specialized tools for the analysis of flow data include the\nuse of a novel information measure to optimize reagent panels and\nanalysis strategies, and optimization methods for automatic\ndetermination of positivity thresholds.\n\nWe are currently using the *fcm* library for the analysis of tetramer\nassays for cancer immunotherapy, as well as intracellular expression of\neffector molecules in the NIAID-sponsored External Quality Assurance\nPolicy Oversight Laboratory (EQAPOL) program to standardize flow\ncytometry assays in HIV studies. An illustrative example is the use of\n*fcm* in building a pipeline for the Cytostream application to automate\nthe analysis of 459 FCS files from 12 laboratories, reducing the\nanalysis time of one month to a single evening.\n",
  "duration": null,
  "id": 1234,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-19",
  "slug": "fcm-a-python-library-for-flow-cytometry",
  "speakers": [
    "Jacob Frelinger"
  ],
  "summary": "",
  "tags": [
    "Computational Bioinformatics"
  ],
  "thumbnail_url": "https://i4.ytimg.com/vi/SXdIiLPQLAo/hqdefault.jpg",
  "title": "Fcm - A python library for flow cytometry",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Fcm_A_python_library_for_flow_.mp4?Signature=47khe03tMWQWqHO71268Wx73pMs%3D&Expires=1346383053&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SXdIiLPQLAo"
    }
  ]
}
