{
  "alias": "video/1196/hdf5-is-for-lovers",
  "category": "SciPy 2012",
  "copyright_text": "CC BY-SA",
  "description": "HDF5 is a hierarchical, binary database format that has become a *de\nfacto* standard for scientific computing. While the specification may be\nused in a relatively simple way (persistence of static arrays) it also\nsupports several high-level features that prove invaluable. These\ninclude chunking, ragged data, extensible data, parallel I/O,\ncompression, complex selection, and in- core calculations. Moreover,\nHDF5 bindings exist for almost every language - including two Python\nlibraries (PyTables and h5py).\n\nThis tutorial will discuss tools, strategies, and hacks for really\nsqueezing every ounce of performance out of HDF5 in new or existing\nprojects. It will also go over fundamental limitations in the\nspecification and provide creative and subtle strategies for getting\naround them. Overall, this tutorial will show how HDF5 plays nicely with\nall parts of an application making the code and data both faster and\nsmaller. With such powerful features at the developer's disposal, what\nis not to love?!\n\nThis tutorial is targeted at a more advanced audience which has a prior\nknowledge of Python and NumPy. Knowledge of C or C++ and basic HDF5 is\nrecommended but not required.\n",
  "duration": null,
  "id": 1196,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-16",
  "slug": "hdf5-is-for-lovers",
  "speakers": [
    "Anthony Scopatz"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i3.ytimg.com/vi/Nzx0HAd3FiI/hqdefault.jpg",
  "title": "HDF5 is for lovers",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/HDF5_is_for_lovers.mp4?Signature=cM8rA2NfAmu5op3Ha%2FNG7gQUYFc%3D&Expires=1346380446&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtube.com/watch?v=Nzx0HAd3FiI"
    }
  ]
}
