{
  "alias": "video/1236/nmrglue-a-python-module-for-working-with-nmr-dat",
  "category": "SciPy 2012",
  "copyright_text": "CC BY-SA",
  "description": "Nuclear magnetic resonance (NMR) spectroscopy is a key analytical\ntechnique in the biomedical field, finding uses in drug discovery,\nmetabolomics, and imaging as well as being the primary method for the\ndetermination of the structures of biological macromolecules in\nsolution. In the course of a modern NMR structural or dynamic study of\nproteins and other biomolecules, experiments typically generate multiple\ngigabytes of 2D, 3D and even 4D data sets which must be collected,\nprocessed, analyzed, and visualized to extract useful information. The\nfield has developed a number of software products to perform these\nfunctions, but few software suites exist that can perform all of the\ntasks which a typical scientist requires. For example, it is not\nuncommon for NMR data to be collected using software provided by the\nspectrometer vendor, processed and visualized using software from the\nNIH, and analyzed using software from a University, collaborator or\ndeveloped in house. Complicating this process is the lack of a standard\nformat for storing NMR data; each software program typically uses its\nown format for data storage.\n\nnmrglue is an open source Python module for working with NMR data which\nacts as the \"glue\" to tie together existing NMR programs, and can be\nused to rapidly develop new NMR processing, analysis or visualization\nmethods. With nmrglue, spectral data from a number of common NMR file\nformats can be accessed as numpy arrays. This data can be sliced,\nrearranged or modified as needed and written out to any of the supported\nfile formats for later use in existing NMR software programs. In this\nway, nmrglue can act as the \"glue\" to tie together NMR workflows which\nemploy existing NMR software.\n\nIn addition, nmrglue can be used in conjunction with other scientific\npython libraries to rapidly test, prototype, and develop new methods for\nprocessing, analyzing, and visualizing NMR data. The nmrglue package\nprovides a number of common NMR processing functions, as well as\nimplementation of scientific routines which may be of interest to other\nPython projects including peak pickers, multidimensional lineshape\nfitting routines, linear prediction functions, and a bounded least\nsquares optimization. These functions together, with the ability to\nread, write and convert between a number of common file formats, allow\ndevelopers to harness nmrglue for established routines while focusing on\nthe novel portion of the new method being created. In addition, the\nnumerical routines in numpy and scipy can be used to further speed this\nprocess. If these packages are used with the Ipython shell and\nmatplotlib, a robust, interpreted environment for exploring and\nvisualizing NMR data can be created using only open source software.\n\nnmrglue is distributed under the New BSD license. Documentation,\ntutorials, examples, and downloadable install files and source code are\navailable at http://code.google.com/p/nmrglue/. Despite a limited\nexposure in the scientific field, nmrglue is already used in a number of\nuniversity research labs and portions of the package have been adapted\nfor use in VeSPA, a software suite for magnetic resonance spectroscopy.\n",
  "duration": null,
  "id": 1236,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-19",
  "related_urls": [
    "http://code.google.com/p/nmrglue/."
  ],
  "slug": "nmrglue-a-python-module-for-working-with-nmr-dat",
  "speakers": [
    "Jonathan J. Helmus"
  ],
  "summary": "",
  "tags": [
    "Computational Bioinformatics"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/pTxJFvLhHhI/hqdefault.jpg",
  "title": "nmrglue: a Python Module for Working with NMR Data.",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/nmrglue_a_Python_Module_for_Wo.mp4?Signature=9xiNcp6ricFFFA5M%2BrG6qgsWQ%2BU%3D&Expires=1346383171&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pTxJFvLhHhI"
    }
  ]
}
