{
  "alias": "video/1232/object-oriented-finite-elements-at-nist",
  "category": "SciPy 2012",
  "copyright_text": "CC BY-SA",
  "description": "The Object Oriented Finite-Element project at NIST\n<http://www.ctcms.nist.gov/oof\\ > is a Python and C++ tool designed to\nbring sophisticated numerical modeling capabilities to users in the\nfield of Materials Science. The software provides numerous tools for\nconstructing finite-element meshes from microstructural images, and for\nimplementing material properties from a very broad class which includes\nelasticity, chemical and thermal diffusion, and electrostatics. The\ncurrent series of releases has a robust interface for defining new\nnonlinear properties, and provides both first and second order\ntime-dependence in the equations of motion. The development team is\ncurrently working on a fully-3D version of the code, as well as\nexpanding the scope of available properties to include surface\ninteractions, such as surface tension and chemical reactions, and\ninequality constraints, such as arise in mechanical surface contact and\nplasticity. The software is a hybrid of Python and C++ code, with the\nhigh level user interface and control code in Python, and the heavy\nnumeric work being done in C++. The software can be operated either as\nan interactive, GUI- driven application, as a scripted command-line\ntool, or as a supporting library, providing useful access to users of\nvarying levels of expertise. At every level, the user-interface objects\nare intended to be familiar to the materials-science user. This\npresentation will focus on an interesting example of a nonlinear\nproperty, called Ramberg-Osgood elasticity, and the process for\nincorporating this feature into the OOF architecture.\n",
  "duration": null,
  "id": 1232,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-19",
  "related_urls": [
    "http://www.ctcms.nist.gov/oof\\"
  ],
  "slug": "object-oriented-finite-elements-at-nist",
  "speakers": [
    "Andrew Reid"
  ],
  "summary": "",
  "tags": [
    "General"
  ],
  "thumbnail_url": "https://i2.ytimg.com/vi/mSCo09arkY0/hqdefault.jpg",
  "title": "Object Oriented Finite Elements at NIST",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Object_Oriented_Finite_Element.mp4?Signature=UwtvlUJXYHNDjR5nZs59Lt1Fp7Y%3D&Expires=1346383004&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtube.com/watch?v=mSCo09arkY0"
    }
  ]
}
