{
  "alias": "video/1228/pythons-role-in-visit",
  "category": "SciPy 2012",
  "copyright_text": "CC BY-SA",
  "description": "VisIt is an open source, turnkey application for scientific data\nanalysis and visualization that runs on a wide variety of platforms from\ndesktops to petascale class supercomputers. This talk will provide an\noverview of Python’s role in VisIt with a focus on use cases of scripted\nrendering, data analysis, and custom application development.\n\nPython is the foundation of VisIt’s primary scripting interface, which\nis available from both a standard python interpreter and a custom\ncommand line client. The interface provides access to all features\navailable through VisIt’s GUI. It also includes support for macro\nrecording of GUI actions to python snippets and full control of\nwindowless batch processing.\n\nWhile Python has always played an important scripting role in VisIt, two\nrecent development efforts have greatly expanded VisIt’s python\ncapabilities:\n\n1. We recently enhanced VisIt by embedding python interpreters into our\n   data flow network pipelines. This provides fine grained access,\n   allowing users to write custom algorithms in python that manipulate\n   mesh data via VTK’s python wrappers and leverage packages such as\n   numpy and scipy. Current support includes the ability to create\n   derived mesh quantities and execute data summarization operations.\n2. We now support custom GUI development using Qt via PySide. This\n   allows users to embed VisIt’s visualization windows into their own\n   python applications. This provides a path to extend VisIt’s existing\n   GUI and for rapid development of streamlined GUIs for specific use\n   cases.\n\nThe ultimate goal of this work is to evolve Python into a true peer to\nour core C++ plugin infrastructure.\n\nThis work performed under the auspices of the U.S. Department of Energy\nby Lawrence Livermore National Laboratory under Contract\nDE-AC52-07NA27344 (LLNL- ABS-552316).\n",
  "duration": null,
  "id": 1228,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-19",
  "slug": "pythons-role-in-visit",
  "speakers": [
    "Cyrus Harrison",
    "Harinarayan Krishnan"
  ],
  "summary": "",
  "tags": [
    "visualization"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/0e4TTcswqLg/hqdefault.jpg",
  "title": "Python's role in VisIt",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Pythonu2019s_role_in_VisIt.mp4?Signature=syBSoJjkdBb1x58V850wn21fP04%3D&Expires=1346382780&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtube.com/watch?v=0e4TTcswqLg"
    }
  ]
}
