{
  "alias": "video/1347/qutip-an-open-source-python-framework-for-the-dy",
  "category": "SciPy 2012",
  "copyright_text": "CC BY-SA",
  "description": "We present QuTiP, an object-oriented open-source framework for solving\nthe dynamics of open quantum systems. The QuTiP framework is written in\na combination of Python and Cython, and using SciPy, NumPy and\nmatplotlib to provide an environment for computational quantum mechanics\nthat is easy and efficient to use. Arbitrary quantum systems, including\ntime-dependent systems, may be built up from operators and states\ndefined by a quantum object class, and then passed on to a choice of\nunitary and dissipative evolution solvers. We give an overview of the\nbasic structure for the framework and the techniques used in its\nimplementation. We also present a few selected examples from\ncontemporary research on quantum mechanics that illustrate the strengths\nof the framework, and the types of calculation that can be performed.\nThe framework described here is particularly well suited to the fields\nof quantum optics, superconducting circuit devices, nanomechanics, and\ntrapped ions, while also being ideal as an educational tool.\n\nFor more information see http://qutip.googlecode.com.\n",
  "duration": null,
  "id": 1347,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-19",
  "related_urls": [
    "http://qutip.googlecode.com."
  ],
  "slug": "qutip-an-open-source-python-framework-for-the-dy",
  "speakers": [
    "Paul Nation",
    "Robert Johansson"
  ],
  "summary": "",
  "tags": [
    "hpc"
  ],
  "thumbnail_url": "https://i4.ytimg.com/vi/KxDFDYn-6Lc/hqdefault.jpg",
  "title": "QuTiP: An open-source Python framework for the dynamics of open quantum systems",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/QuTiP_An_opensource_Python_framework_for_the_dynamics_of_open_quantum_systems.mp4?Signature=ofqa37FpyivmhkcJ4Hmj4gmwblw%3D&Expires=1346989222&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KxDFDYn-6Lc"
    }
  ]
}
