{
  "alias": "video/1198/time-series-data-analysis-with-pandas",
  "category": "SciPy 2012",
  "copyright_text": "CC BY-SA",
  "description": "In this tutorial, I'll give a brief overview of pandas basics for new\nusers, then dive into the nuts of bolts of manipulating time series data\nin memory. This includes such common topics date arithmetic, alignment\nand join / merge methods, resampling and frequency conversion, time zone\nhandling, moving window functions like moving mean and standard\ndeviation. A strong focus will be placed on working with large time\nseries efficiently using array manipulations. I'll also illustrate\nvisualization tools for slicing and dicing time series to make\ninformative plots. There will be several example data sets taken from\nfinance, economics, ecology, web analytics, or other areas.\n\nThe target audience for the tutorial includes individuals who already\nwork regularly with time series data and are looking to acquire\nadditional skills and knowledge as well as users with an interest in\ndata analysis who are new to time series. You will be expected to be\ncomfortable with general purpose Python programming and have a modest\namount of experience using NumPy. Prior experience with the basics of\npandas's data structures will also be helpful.\n",
  "duration": null,
  "id": 1198,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-17",
  "slug": "time-series-data-analysis-with-pandas",
  "speakers": [
    "Wes McKinney"
  ],
  "summary": "",
  "tags": [
    "advanced"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/0unf-C-pBYE/hqdefault.jpg",
  "title": "Time Series Data Analysis with pandas",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Time_Series_Data_Analysis_with_pandas.mp4?Signature=kkRls%2BknoyZjRP5XV2lzO%2FB%2FuKE%3D&Expires=1346381098&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0unf-C-pBYE"
    }
  ]
}
