{
  "alias": "video/1193/unlock-a-python-based-framework-for-rapid-develo",
  "category": "SciPy 2012",
  "copyright_text": "CC BY-SA",
  "description": "The Unlock Project aims to provide brain-computer interface (BCI)\ntechnologies to individuals suffering from locked-in syndrome, the\ncomplete or near- complete loss of voluntary motor function. While\nseveral BCI techniques have been demonstrated as feasible in a\nlaboratory setting, limited effort has been devoted to translating that\nresearch into a system for viable home use. This is in large part due to\nthe complexity of existing BCI software packages which are geared toward\nclinical use by domain experts. With Unlock, we have developed a\nPython-based modular framework that greatly simplifies the time and\nprogramming expertise needed to develop BCI applications and\nexperiments. Furthermore, the entire Unlock system, including data\nacquisition, brain signal decoding, user interface display, and device\nactuation, can run on a single laptop, offering exceptional portability\nfor this class of BCI.\n\nIn this talk, I will present the Unlock framework, starting with a\nhigh-level overview of the system then touching on the acquisition,\ncommunication, decoding, and visualization components. Emphasis will be\nplaced on the app developer API with several examples from our current\nwork with steady-state visually evoked potentials (SSVEP).\n",
  "duration": null,
  "id": 1193,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-18",
  "slug": "unlock-a-python-based-framework-for-rapid-develo",
  "speakers": [
    "Byron V. Galbraith",
    "Frank H. Guenther",
    "Jonathan S. Brumberg",
    "Sean D. Lorenz"
  ],
  "summary": "",
  "tags": [
    "General"
  ],
  "thumbnail_url": "https://i1.ytimg.com/vi/lIjdXLuuMlY/hqdefault.jpg",
  "title": "Unlock: A Python-based framework for rapid development of practical brain-computer interface applications",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Unlock_A_Pythonbased_framework.mp4?Signature=bLD7r1uAbL0HVyxX3BZUPBgGjiA%3D&Expires=1346444446&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtube.com/watch?v=lIjdXLuuMlY"
    }
  ]
}
