{
  "alias": "video/1242/utilizing-python-in-a-real-time-quasi-operationa",
  "category": "SciPy 2012",
  "copyright_text": "CC BY-SA",
  "description": "The National Oceanic and Atmospheric Administration's (NOAA) Hazardous\nWeather Testbed (HWT) is a facility jointly managed by NOAA's National\nSevere Storms Laboratory (NSSL), NOAA National Weather Service's (NWS)\nthe Storm Prediction Center (SPC), and the NOAA NWS Oklahoma City/Norman\nWeather Forecast Office (OUN) within the National Weather Center\nbuilding on the University of Oklahoma South Research Campus. The HWT is\ndesigned to accelerate the transition of promising new meteorological\ninsights and technologies into advances in forecasting and warning for\nhazardous weather events throughout the United States. The HWT\nfacilities include a combined forecast and research area situated\nbetween the operations rooms of the SPC and OUN, and a nearby\ndevelopment laboratory. The facilities support enhanced collaboration\nbetween research scientists and operational weather forecasters on\nspecific topics that are of mutual interest.\n\nThe cornerstone of the HWT is the yearly Experimental Forecast Program\n(EFP) and Experimental Warning Program (EWP) which take place every\nspring. In each of those programs, forecasters, researchers, and\ndevelopers come together to participate in a real-time operational\nforecasting or warning environment with the purpose of testing and\nevaluating cutting-edge tools and methods for forecasting and warning.\nIn the EFP program, between 5 and 10 TB of meteorological data are\nprocessed for evaluation over the course of a 5 week period. These data\ncome in a variety of sources, a variety of formats, each requiring a\ndifferent set of processing.\n\nThis talk will discuss how the data flow and data creation processes of\nthe EFP are accomplished in a real-time setting through the use of\nPython. The utilization of Python ranges from simple shell scripting, to\nspeeding up algorithm development (and runtimes) with Numpy and Cython,\nto creating new, open source data-visualization platforms, such as the\nSkew-T and Hodograph Analysis and Research Program in Python, or\nSHARPpy.\n",
  "duration": null,
  "id": 1242,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-07-19",
  "slug": "utilizing-python-in-a-real-time-quasi-operationa",
  "speakers": [
    "Patrick Marsh"
  ],
  "summary": "",
  "tags": [
    "Meteorology Mini-Symposia"
  ],
  "thumbnail_url": "https://i4.ytimg.com/vi/7-rey41z2us/hqdefault.jpg",
  "title": "Utilizing Python in a Real-Time, Quasi-Operational Meteorological Environment",
  "videos": [
    {
      "type": "mp4",
      "url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Utilizing_Python_in_a_RealTime.mp4?Signature=6JVnu2cqjljXJd%2F8HbsSSvJfbdg%3D&Expires=1346383456&AWSAccessKeyId=FEWGReWX3QbNk0h3"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7-rey41z2us"
    }
  ]
}
