{
  "copyright_text": null,
  "description": "In the last few years, the DevOps movement has introduced ground breaking approaches to the way we manage the lifecycle of software development and deployment. Today organisations aspire to fully automate the deployment of microservices and web applications with tools such as Chef, Puppet and Ansible. However, the deployment of data-processing pipelines remains a relic from the dark-ages of software development.\n\nProcessing large-scale data pipelines is the main engineering task of the Big Data era, and it should be treated with the same respect and craftsmanship as any other piece of software. That is why we created Apache Amaterasu (Incubating) - an open source framework that takes care of the specific needs of Big Data applications in the world of continuous delivery.\n\nIn this session, we will take a close look at Apache Amaterasu (Incubating) a simple and powerful framework to build and dispense pipelines. Amaterasu aims to help data engineers and data scientists to compose, configure, test, package, deploy and execute data pipelines written using multiple tools, languages and frameworks. We will see what Amaterasu provides today, and how it can help existing Big Data application and demo some of the new bits that are coming in the near future.",
  "duration": 1378,
  "language": "eng",
  "recorded": "2018-06-04",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://il.pycon.org/2018/schedule/"
    },
    {
      "label": "Talk slides",
      "url": "https://s3-eu-west-1.amazonaws.com/pyconil-data-amit/presentations/Nadav_Har_Tsvi_CD_data_pipelines.pdf"
    }
  ],
  "speakers": [
    "Nadav Har Tzvi"
  ],
  "tags": [
    "amaterasu"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/np8nwBRdABo/maxresdefault.jpg",
  "title": "Apache Amaterasu (incubating): A CD Framework for your Big Data Pipelines",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=np8nwBRdABo"
    }
  ]
}
