{
  "copyright_text": null,
  "description": "Conversation Intelligence: Extracting Insights from Conversations\n\nSales conversations are a valuable and still underutilized asset for organizations. Recording and analyzing these conversations allow companies to quickly train new representatives, identify optimal behaviour, share and enforce best practices and also propagate customer requests and pain points to other parts of the organization helping product designers prioritize the best features. To create value from recorded conversations one needs a Conversation Intelligence (CI) stack. We outline the different layers of our CI stack, namely Diarization (also known as Speaker Separation), Automatic Speech Recognition (ASR) and various Natural Language Processing (NLP), Deep Learning and data science algorithms for extracting insights. CI is a relatively new field because until recently conversations were not amenable to automated analysis at scale due to the high bar of applying speech recognition. However, recent developments in ASR technology (based on Deep Learning) have given rise to significantly higher accuracy rates and with that the ability to robustly extract information from conversations. We review recent advances as well the cutting-edge approaches we use for Speaker Separation which is critical to understanding the roles various speakers play in a conversation, review latest methods for embedding a segment of speech for speaker clustering and review overall system structure for a multi-modal solution. On top of these we demonstrate how both standard and novel NLP and Data Science approaches can help reveal conversational insights including: weak language, inclusive language or identifying customer propensity to buy. The insights are drawn from over 2 million sales calls we analyzed at Chorus.ai to help our customers’ sales reps have better conversations and close more deals.",
  "duration": 1409,
  "language": "eng",
  "recorded": "2018-06-05",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://il.pycon.org/2018/schedule/"
    }
  ],
  "speakers": [
    "Raphael Cohen"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/xWxAwCl2glY/maxresdefault.jpg",
  "title": "Conversation Intelligence",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xWxAwCl2glY"
    }
  ]
}
