{
  "copyright_text": null,
  "description": "Via has built the world's leading operating system for on-demand shared mobility. Think about a dynamic & smart fleet of “moniot sherut” - routing and scheduling is computed in real time to maximize the potential of each and every seat across all the vehicles on the platform. Our service provides over 1M rides a months across cities like NYC, Chicago, Washington DC, London, Amsterdam and more.\n\nWe also join efforts with transportation companies, municipalities and other partners in order to help cities transition their bus systems from rigid lines and fixed schedules to on-demand networks of dynamic shuttles.\n\nOur service is essential all over the world, and we're scaling up very fast within each location and into new locations. Each city might also require specific and unique customizations of our operating system, whether they’d be regulatory or business-related.\n\nThus, scaling up both horizontally and vertically while maintaining flexibility, reliability and continuous introduction of new capabilities raises challenges such as:\n\nHaving a different set of features for each service;\n\nDeveloping numerous setup variations;\n\nHandling Dependencies between various modules;\n\nManaging multiple application brands;\n\nAnd more....\n\nWe will demonstrate how we tackle these challenges using Python tools while keeping our system fast, efficient, stable and easy to maintain.",
  "duration": 1145,
  "language": "eng",
  "recorded": "2018-06-04",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://il.pycon.org/2018/schedule/"
    },
    {
      "label": "Talk slides",
      "url": "https://s3-eu-west-1.amazonaws.com/pyconil-data-amit/presentations/PyCon+Presentation+-+Asaf+Azar+%26+Shahar+Rodrig.pptx"
    }
  ],
  "speakers": [
    "Asaf Azar",
    "Shahar Rodrig"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/wsC2uP8bGIk/maxresdefault.jpg",
  "title": "How to scale up your morning commute with python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wsC2uP8bGIk"
    }
  ]
}
