{
  "copyright_text": null,
  "description": "telluric: interactive manipulation of Geospatial data with Jupyter and Python\n\ntelluric library is an open source library developed by Satellogic, which aims to be an one stop source (library) for manipulating geospatial data in an interactive way. The library facilitates the use and manipulation of Geo Vectors and Geo Rasters by creating an integrated and unified API on top of a combination of domain specific python libraries, such us: rasterio, Shapely, Fiona, and more. For wide compatibility, telluric library supports all known GIS raster and vector formats. telluric library was developed with Jupyter notebook in mind, in which all operations auto-generate the appropriate visualization, and presented on top of an interactive map, with no additional effort.\n\nIn this presentation we will show how to use telluric library to manipulate geospatial information and how it integrates in a Python GIS ecosystem, explain how we utilize telluric in Satellogic for diversity of tasks like: geospatial data management, coverage analysis of satellites constellation and visualization, and commenting on the plans for the future releases.",
  "duration": 1173,
  "language": "eng",
  "recorded": "2018-06-04",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://il.pycon.org/2018/schedule/"
    },
    {
      "label": "Telluric manual",
      "url": "https://telluric.readthedocs.io/en/latest/User%20Guide.html"
    },
    {
      "label": "Talk slides(Online)",
      "url": "http://nbviewer.jupyter.org/format/slides/github/satellogic/telluric-talks/blob/master/pycon-il/Talk.ipynb"
    },
    {
      "label": "Talk slides(Download)",
      "url": "https://s3-eu-west-1.amazonaws.com/pyconil-data-amit/presentations/telluric-pyconil.zip"
    }
  ],
  "speakers": [
    "Guy Doulberg"
  ],
  "tags": [
    "telluric",
    "gis"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/BhobgSkySzc/maxresdefault.jpg",
  "title": "telluric: interactive manipulation of Geospatial data",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BhobgSkySzc"
    }
  ]
}
