{
  "copyright_text": null,
  "description": "Text Analysis With SpaCy, NLTK, Gensim, Skearn, Keras and TensorFlow\n\nThe explosion in Artificial Intelligence and Machine Learning is unprecedented now - and text analysis is likely the most easily accessible and understandable part of this. And with python, it is crazy easy to do this - python has been used as a parsing langauge forever, and with the rich set of Natural Language Processing and Computational Linguistic tools, it's worth doing text analysis even if you don't want to.\n\nThe purpose of this talk is to convince the python community to do text analysis - and explain both the hows and the whys. Python has traditionally been a very good parsing language, aruguably replacing perl for all text file handling tasks. Reading files, regular expressions, writring to files, crawling on the web for textual data have all been standard ways to use python - and now with the Machine Learning and AI explosion - we have a great set of tools in python to understand all the textual data we can so easily play with.\n\nI will be briefly talking aboubt the merits, de-merits and use-cases of the most popular text processing libraries. In particular, these will be spaCy, NLTK, gensim. I will also talk about how to use traditional Machine Learning libraries for text analysis, such as scikit-learn, Keras and TensorFlow.\n\nPre-processing is the one of the most important steps of Text Analysis, and I will talk more about this - after all, garbage in, garbage out!\n\nThe final part of the talk will be about where to get your data - and how to create your own textual data as well. You could analyse anything, from your own emails and whatsapp conversations to freely available British Parliament transcripts!",
  "duration": 1718,
  "language": "eng",
  "recorded": "2018-06-05",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://il.pycon.org/2018/schedule/"
    },
    {
      "label": "Talk slides",
      "url": "https://s3-eu-west-1.amazonaws.com/pyconil-data-amit/presentations/Bhargav+Srinivasa+Desikan_text_analysis_in_python.pdf"
    }
  ],
  "speakers": [
    "Bhargav Srinivasa Desikan"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/E5YppPJCCq0/maxresdefault.jpg",
  "title": "Text Analysis With SpaCy, NLTK, Gensim, Skearn...",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=E5YppPJCCq0"
    }
  ]
}
