{
  "copyright_text": null,
  "description": "Threat Modeling is a great method to identify potential security weaknesses, and is an important part of any secure design. A threat model can help analyze how to best protect your assets, prevent attacks, harden your systems, and efficiently prioritize security investment. Regardless of programming language, threat modeling provides a far greater return than most any other security technique in the development process. Therefore, threat modeling should be an early priority in application design process. Unfortunately, it is common knowledge that building a full threat model is always heavily resource intensive, requires a full team of expensive security professionals, takes up far too much developer time, and does not scale at all.\n\nBut the common knowledge is wrong! In fact, this is not at all necessary, and should not be an excuse to avoid building a robust system. Using a value-driven approach, skilled development teams can very efficiently ensure that the features they build can protect themselves, the application, and the business value that the features were created for. Value Driven Threat Modeling offers an alternative to top-heavy, big-model-up-front threat modeling that security pros love, in favor of agility, speed, and developer independence.\n\nThis talk will describe Value Driven Threat Modeling, and show how to incorporate it into your existing agile development. We will discuss how developers can efficiently produce and leverage a threat model to improve application development, and walkthrough some example scenarios. If you want to be a good developer in 2018, you need to prepare for the threats of 2020!",
  "duration": 1364,
  "language": "eng",
  "recorded": "2018-06-04",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://il.pycon.org/2018/schedule/"
    },
    {
      "label": "Talk slides(Online)",
      "url": "https://bouncesecurity.sharepoint.com/:p:/g/ESUo-aC59CtDiuYR1zvUV9kBTgFq-9zIBI8sRZny1SOS-g?e=dV9OOL"
    },
    {
      "label": "Talk slides(Pdf)",
      "url": "https://s3-eu-west-1.amazonaws.com/pyconil-data-amit/presentations/Value+driven+threat+modeling+-+Developers.pdf"
    }
  ],
  "speakers": [
    "Avi Douglen"
  ],
  "tags": [
    "security"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Ml3HJqFJMOY/maxresdefault.jpg",
  "title": "Value Driven Threat Modeling - Security by Design",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ml3HJqFJMOY"
    }
  ]
}
