{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Real-world software engineering is collaborative, commonly involving the use of Git, GitHub, and continuous integration with Travis CI. Suitable for both full-time educators and members of industry who educate their colleagues, this presentation will explain how to use these technologies and platforms to teach interdisciplinary and introductory courses in computer programming and software engineering.\n\nThe presentation will first show how to create a GitHub organization connected to a GitHub Classroom with unlimited private repositories that contain instructor solutions and starter kits and submissions from both individual and team-based assignments. The talk will next explain how to connect GitHub repositories to continuous integration servers hosted by Travis CI, thus supporting the cloud-based execution of tests and checks.\n\nThe presentation will subsequently introduce the design and implementation of and the testing strategy for a Python program that supports the local and cloud-based checking of the source code and technical writing for a project. Designed to complement the automated checks performed by a test suite, this tool, called [GatorGrader](https://github.com/GatorEducator/gatorgrader), can verify that a submission contains the required number of comments and produces the correct number of lines of console output. It can also, for instance, ensure that a student makes the requisite number of commits to a GitHub repository and implements a program in a specified fashion.\n\nUltimately, people who attend this talk will learn more about how to use platforms like GitHub and Travis CI, open-source Python packages, and Python programming language features to effectively deliver instructional materials and assess assignment submissions.",
  "duration": 1500,
  "language": "eng",
  "recorded": "2018-10-05",
  "related_urls": [
    "https://2018.pygotham.org/talks/using-python-travis-ci-and-github-to-effectively-teach-programming/"
  ],
  "speakers": [
    "Gregory M. Kapfhammer"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/8cP1-yrYa-Q/maxresdefault.jpg",
  "title": "Using Python, Travis CI, and GitHub to Effectively Teach Programming",
  "videos": [
    {
      "type": "youtube",
      "url": "https://youtu.be/8cP1-yrYa-Q"
    }
  ]
}
