{
  "copyright_text": "Standard YouTube License",
  "description": "Many real-world processes that need to be modeled contain stochastic elements. A variety of mathematical tools is available to model simple processes analytically, However, when things get more complicated we need to fall back on to Monte Carlo simulations. SimPy is a package that uses generators to model discrete, time-based processes, such as queueing systems, financial markets and network protocols. By simulating a process or scenario a significant number of times, we can inspect possibilities of failure, expected utilization rates, targets aimed for in the healthcare industry and how changes we make in the decisions for our processes impact these performance indicators. In the talk, we use the running example of alien UFO factories, where we assume the role of factory manager and need to make decisions on hiring staff, the equipment that we need in our processing pipeline, the contracts with our customers and the actual location of our new factory. Some choices cost less money but are less efficient or introduce higher risks, and dependencies between the different parts of the process make it difficult to oversee the impact of our choices. After showcasing the scenario, we will add these concepts one by one in our SimPy model and link them to discrete event simulation theory. After the implementation, we can gather insights on the risks and the profits and make an informed decision on our factory. This talk is aimed at people interested in Monte Carlo simulation, stochastic optimization, Operations Research, statistics, UFOs or an innovative way of using Python generators.",
  "duration": 1613,
  "language": "eng",
  "recorded": "2017-10-21",
  "related_urls": [
    {
      "label": "schedule",
      "url": "http://schedule.pycon.python.ie/"
    }
  ],
  "speakers": [
    "Jan van der Vegt"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Ss13QdNU1vY/maxresdefault.jpg",
  "title": "Discrete Event Simulation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ss13QdNU1vY"
    }
  ]
}
