{
  "copyright_text": null,
  "description": "Addestramento d'emergenza alla fase di Discovery per sviluppatori frustrati - PyCon Italia 2022\n\nQuante notti avete passato a produrre codice ‘importantissimo’ poi mai andato in produzione? E la vostra idea di app del secolo che non ha mai portato a nulla? Quanti soldi buttati per produrre software mai utilizzato? Troppi. Ma non deve andare per forza così,e la chiave è in una parola: Discovery!\nCome programmatori, tutti noi abbiamo provato la frustrazione di lavorare col massimo dell’impegno su software che poi nella migliore delle ipotesi non hanno prodotto i risultati sperati, e nella peggiore non sono neanche mai andati in produzione. Giorni (e quindi soldi) buttati a realizzare cose che non andavano fatte, a sviluppare “requisiti” imposti dall’alto senza capirne il contesto. Usarci come ingranaggi in una fabbrica di funzionalità, invece che come specialisti di team che puntino a risolvere dei problemi ed avere un impatto reale sul mondo, è uno spreco senza precedenti.\nScrivere codice nel modo corretto, fare i test, impostare pipeline di Continuous Integration è solo una parte del nostro lavoro, ma se quel codice in primis non andava neanche scritto, sarà tutto inutile. Da parecchi anni ormai sono nate metodologie e strumenti che aiutano a risolvere questo problema, dal Design Thinking al Lean Startup, l’Impact Mapping o l’Opportunity Solution Tree. Non è una roba solo da Designer o Product Manager, gli sviluppatori devono essere i protagonisti di questo processo cosiddetto di Discovery anche se spesso se ne tengono alla larga. Questo addestramento è diviso in 3 mini lezioni di 10 minuti, per definire il contesto, la teoria e la pratica di questa fase, con l’obiettivo di dare gli strumenti e qualche spunto per iniziare questa piccola rivoluzione, a livello personale e di team.\n\nSpeaker: Gabriele Giaccari",
  "duration": 1939,
  "language": "ita",
  "recorded": "2022-06-03",
  "speakers": [
    "Gabriele Giaccari"
  ],
  "tags": [
    "agile",
    "best practice",
    "communication"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/rnqnxNzzJPM/maxresdefault.jpg",
  "title": "Addestramento d'emergenza alla fase di Discovery per sviluppatori frustrati",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rnqnxNzzJPM"
    }
  ]
}