{
  "copyright_text": null,
  "description": "Addestramento d’emergenza alla fase di Discovery per sviluppatori\nfrustrati - PyCon Italia 2022\n\nQuante notti avete passato a produrre codice ‘importantissimo’ poi mai\nandato in produzione? E la vostra idea di app del secolo che non ha mai\nportato a nulla? Quanti soldi buttati per produrre software mai\nutilizzato? Troppi. Ma non deve andare per forza così,e la chiave è in\nuna parola: Discovery! Come programmatori, tutti noi abbiamo provato la\nfrustrazione di lavorare col massimo dell’impegno su software che poi\nnella migliore delle ipotesi non hanno prodotto i risultati sperati, e\nnella peggiore non sono neanche mai andati in produzione. Giorni (e\nquindi soldi) buttati a realizzare cose che non andavano fatte, a\nsviluppare “requisiti” imposti dall’alto senza capirne il contesto.\nUsarci come ingranaggi in una fabbrica di funzionalità, invece che come\nspecialisti di team che puntino a risolvere dei problemi ed avere un\nimpatto reale sul mondo, è uno spreco senza precedenti. Scrivere codice\nnel modo corretto, fare i test, impostare pipeline di Continuous\nIntegration è solo una parte del nostro lavoro, ma se quel codice in\nprimis non andava neanche scritto, sarà tutto inutile. Da parecchi anni\normai sono nate metodologie e strumenti che aiutano a risolvere questo\nproblema, dal Design Thinking al Lean Startup, l’Impact Mapping o\nl’Opportunity Solution Tree. Non è una roba solo da Designer o Product\nManager, gli sviluppatori devono essere i protagonisti di questo\nprocesso cosiddetto di Discovery anche se spesso se ne tengono alla\nlarga. Questo addestramento è diviso in 3 mini lezioni di 10 minuti, per\ndefinire il contesto, la teoria e la pratica di questa fase, con\nl’obiettivo di dare gli strumenti e qualche spunto per iniziare questa\npiccola rivoluzione, a livello personale e di team.\n\nSpeaker: Gabriele Giaccari\n",
  "duration": 1939,
  "language": "ita",
  "recorded": "2022-06-03",
  "speakers": [
    "Gabriele Giaccari"
  ],
  "tags": [
    "agile",
    "best practice",
    "communication"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/rnqnxNzzJPM/maxresdefault.jpg",
  "title": "Addestramento d'emergenza alla fase di Discovery per sviluppatori frustrati",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rnqnxNzzJPM"
    }
  ]
}