{
  "copyright_text": null,
  "description": "Back to Basics: Revisiting Basics with few Tips and Tricks in\nPython3.10v! - PyCon Italia 2022\n\nThis talk is aimed at NewBie Python Programmers as well as Professional\nPython Programmers to revise Python Basics and make fundamentals strong\nfor NewBie. During this talk, I’ll be revisiting Python Basics with a\nfew Tips and Tricks and what’s new in Python3.10v. This talk is aimed at\nNewBie Python Programmers as well as Professional Python Programmers to\nrevise Python Basics and make fundamentals strong for NewBie with new\nend exciting features in Python3.10v. During this talk, I’ll be\nrevisiting Python Basics with a few Tips and Tricks. The talk is for\nlittle experienced Python 3 programmers who have written a few lines of\ncode: Python experience is required. You can consider this talk as a\nteaser of Python 3 features that you may have never used yet.\n\nAfter this talk, I hope you’ll be inspired to use these Tips and Tricks\nin Python3.10v and make your fundamentals strong.\n\nPython3.10v comes with a few new features and for that Python3\nfundamentals need to be strong, and in this talk, I’ll be covering\nImportant Basics on Python, you will learn everything about Python3.10v!\n\nPython3.10 is pretty simple to understand, but it also comes with a lot\nof different code syntax options you can use. In this talk, I’ll be\ngoing to have a look at all of them. We start with the basic syntax and\nthen move on to all the different syntaxes.\n\nSpeaker: Gaurav Pandey\n",
  "duration": 987,
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "Gaurav Pandey"
  ],
  "tags": [
    "best practice",
    "clean code",
    "debugging",
    "documentation",
    "education"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/p-EQ4atPGRg/maxresdefault.jpg",
  "title": "Back to Basics: Revisiting Basics with few Tips and Tricks in Python3.10v!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=p-EQ4atPGRg"
    }
  ]
}