{
  "copyright_text": null,
  "description": "Everything You Always Wanted to Know About Async But Were Afraid to Ask\n(cit.) - PyCon Italia 2022\n\nIn this talk, we will dig in the marvelous world of sync/async/parallel\ncomputation. And show you how to define abstract computation upfront\nlazily using Promises, deferring execution subsequently and throttling\nthe computation as you please. After this, async processing won’t have\nany secret to you I still remember when during an interview for a Junior\nData Scientist position, I was asked about async and when to use it. I\nwas buffled. And - I must say - after learning about these concepts,\nthey are not that hard. Nevertheless, still mysterious to some. In this\ntalk, after explaining some basic concepts about asynchronous processing\nand reviewing the most important Pythonic packages to be used in the\nasync context, we will gently introduce some notions of functional\nprogramming and - most of all - one of its most useful tool for async\noperations: the Promise monad. Thanks to this, we will then be able to\ncreate, compose and chain abstract computations together, therefore\ndefining what we want to do, without actually doing it yet. Acting\nlazily, its execution will rather be deferred to a second moment, where\nwe will make use of async and parallel framework to speed up and\nparallelise execution. We will also show you how to throttle the\nexecution, a need that often arises when dealing with rate-limited\nservices and/or avoid overloading external component or resources. The\ntalk will be accompanied by the help of a simple Github repo that will\nhave examples and (hopefully) useful utility functions that will allow\nyou to approach the asynchronous world more easily and seamlessly.\n\nSpeaker: Deusebio\n",
  "duration": 1796,
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "Deusebio"
  ],
  "tags": [
    "asyncio",
    "clean code",
    "functional programming"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/QOY1VVUN0IM/maxresdefault.jpg",
  "title": "Everything You Always Wanted to Know About Async But Were Afraid to Ask (cit.)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QOY1VVUN0IM"
    }
  ]
}