{
  "copyright_text": null,
  "description": "Generazione di file PDF con Transformers per affinamento dell’object\ndetection in documenti testuali - PyCon Italia 2022\n\nDe-costruire un file PDF è un task di sempre maggior interesse; questo\ntalk mostrerà come sfruttare l’informazione non strutturata dei dati per\nla generazione di PDF sintetici da utilizzare in sistemi di\napprendimento più controllabili, con l’uso di Transformers ed NLP su\ndataset ristretti di PDF. Il Portable Document Format (meglio noto come\nPDF) è il formato di file più utilizzato al mondo. All’interno di un\nfile PDF possiamo trovare un’ampia gamma di elementi diversi, non solo\nsemplice testo: elementi grafici come immagini ed algoritmi, tabelle,\ndidascalie, addirittura oggetti interattivi o firme digitali. La\ndecostruzione di un file PDF è dunque un task difficile, per l’alto\nlivello di eterogeneità dei dati e perché il formato stesso non è stato\npensato per fornire in modo strutturato la disposizione delle diverse\nentità che costituiscono le pagine dei documenti. Tuttavia, questo tipo\ndi analisi sta attirando sempre più l’interesse di ricercatori e\naziende, perché le informazioni sul layout e i contenuti dei file di\ntesto possono essere utilizzate per aumentare i dataset esistenti per\nottenere miglioramenti qualitativi nell’espletamento delle comuni\noperazioni di data mining, sfruttando le tecniche di deep learning più\ninnovative.\n\nQuesto talk, descrive un sistema che, partendo da un insieme ristretto\ndi file PDF, è in grado di generarne un numero arbitrariamente grande\nper costituire un dataset di immagini da utilizzare per addestrare reti\nneurali a svolgere le classiche operazioni di object detection e\nrecognition; per fare questo, sarà mostrata una pipeline capace di\nannotare automaticamente il contenuto di un PDF; dopodiché, sarà\nspiegato come utilizzare le annotazioni precedentemente ottenute come\ninput di una architettura a Transformers per generare layout artificiali\ndi documenti; infine, si passerà all’effettiva sintesi dei PDF: verrà\nindicato come popolare le parti testuali dei layout generati grazie a\ntecniche di NLP (Natural Language Processing), come popolare immagini,\ntabelle e formule e, infine, come utilizzare il dataset sintetico così\nottenuto.\n\nSpeaker: Lorenzo Pisaneschi\n",
  "duration": 1890,
  "language": "ita",
  "recorded": "2022-06-03",
  "speakers": [
    "Lorenzo Pisaneschi"
  ],
  "tags": [
    "big data",
    "deep learning",
    "machine learning",
    "predictions"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Zy8Co-u65Qo/maxresdefault.jpg",
  "title": "Generazione file PDF per affinamento dell'Object detection",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Zy8Co-u65Qo"
    }
  ]
}