{
  "copyright_text": null,
  "description": "Inclusive community leadership - PyCon Italia 2022\n\nWhat does an inclusive community look like and how can we be inclusive leaders within it? Community leadership can take many forms, from organizing events, sharing knowledge, to advocating for other members and connecting them to opportunities. Communities look to their leaders to set the tone of the space so it is, therefore, their responsibility to ensure a continued space that is safe for all its members to thrive. Leadership should also be sustainable so recognizing and supporting the growth of new leaders is important. My journey as a community leader began after attending a PyLadies Berlin meetup in 2018. As a career changer, my motivation was to immerse myself in a space where I could learn and meet others in a position similar to my own. Inspired by other community leaders and conversations with other members, it soon became my goal to not only nourish my own growth but also that of those around me however I could. Witnessing the change which we create within the community has shown me that responsibility also lies with the wider tech community to support its leaders, who not only add immense value to their respective communities but reach far beyond them to make the industry a better place for all. The labor we pour into the community is essential to fostering inclusive work environments as gender parity (and other forms of representation) is still severely lacking especially at a decision-making level at most tech companies. It is this bridge between community and companies that I have been reflecting on and hope to now influence. Through the lens of my experience in the PyLadies community and beyond, sharing both my insights and those gained through interactions with other members, I will reflect on what it means to be an inclusive leader and how a community can stay true to these principles while growing and evolving. This talk aims to inspire folks to take up leadership roles in their communities while also celebrating those already putting in the work.\n\nSpeaker: Jessica Greene",
  "duration": 3441,
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "Jessica Greene"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/5Oi71ji6G8c/maxresdefault.jpg",
  "title": "Inclusive community leadership",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5Oi71ji6G8c"
    }
  ]
}