{
  "copyright_text": null,
  "description": "Inclusive community leadership - PyCon Italia 2022\n\nWhat does an inclusive community look like and how can we be inclusive\nleaders within it? Community leadership can take many forms, from\norganizing events, sharing knowledge, to advocating for other members\nand connecting them to opportunities. Communities look to their leaders\nto set the tone of the space so it is, therefore, their responsibility\nto ensure a continued space that is safe for all its members to thrive.\nLeadership should also be sustainable so recognizing and supporting the\ngrowth of new leaders is important. My journey as a community leader\nbegan after attending a PyLadies Berlin meetup in 2018. As a career\nchanger, my motivation was to immerse myself in a space where I could\nlearn and meet others in a position similar to my own. Inspired by other\ncommunity leaders and conversations with other members, it soon became\nmy goal to not only nourish my own growth but also that of those around\nme however I could. Witnessing the change which we create within the\ncommunity has shown me that responsibility also lies with the wider tech\ncommunity to support its leaders, who not only add immense value to\ntheir respective communities but reach far beyond them to make the\nindustry a better place for all. The labor we pour into the community is\nessential to fostering inclusive work environments as gender parity (and\nother forms of representation) is still severely lacking especially at a\ndecision-making level at most tech companies. It is this bridge between\ncommunity and companies that I have been reflecting on and hope to now\ninfluence. Through the lens of my experience in the PyLadies community\nand beyond, sharing both my insights and those gained through\ninteractions with other members, I will reflect on what it means to be\nan inclusive leader and how a community can stay true to these\nprinciples while growing and evolving. This talk aims to inspire folks\nto take up leadership roles in their communities while also celebrating\nthose already putting in the work.\n\nSpeaker: Jessica Greene\n",
  "duration": 3441,
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "Jessica Greene"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/5Oi71ji6G8c/maxresdefault.jpg",
  "title": "Inclusive community leadership",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5Oi71ji6G8c"
    }
  ]
}