{
  "copyright_text": null,
  "description": "La Continuous Delivery è una condizione mentale - PyCon Italia 2022\n\nIn questo talk racconterò il mio percorso evolutivo da un approccio\nwaterfall a quello iterativo passando per i tanti errori commessi.\nMostrerò come abbiamo realizzato un template che aiuta nel processo di\nContinuous Delivery utilizzando Kubernetes, Docker, Python e Terraform.\nVedo la gente passare i venerdì a fare rilasci in produzione e passare\nil weekend a fare bug fixing. Vedo la gente stufa di fare sempre le\nstesse attività ripetitive e perseverare nella solita routine da\ndeveloper frustrato. Ma tutto questo si può evitare con un cambio di\nmentalità. Quello che voglio raccontare in questo talk è il mio percorso\nevolutivo da un approccio waterfall a quello iterativo passando per i\ntanti errori commessi.\n\nRacconterò come abbiamo realizzato un template che aiuta nel processo di\nContinuous Delivery, dove la parola “continuous” è quella che definisce\nbene l’importanza di questo processo. Nell’Agile Software Development,\nil rilascio del software funzionante è uno dei punti più importanti e\nquesto deve avvenire spesso. Per poter rilasciare nuove funzionalità\nperò, dovremo scrivere tutti i test necessari, eseguirli, creare una\nbuild e infine effettuare il deploy vero e proprio.\n\nNello sviluppo del software moderno la Continuous Delivery (CD) è quel\nprocesso che permette all’intero team di affrontare qualsiasi\ncambiamento, come nuove feature, bugfix o esperimenti, in un modo\nsostenibile, sicuro e rapido. In questo processo generalmente vengono\nutilizzate tra le altre cose, due pratiche per effettuare i rilasci\ncontinui: Continuous Integration (CI) e Continuous Deployment (CD).\n\nIn questo talk racconterò come, insieme ai miei colleghi, siamo arrivati\nalla costruzione di un processo automatizzato per effettuare rilasci sin\ndal primo commit utilizzando Kubernetes, Docker, Python e Terraform per\nla creazione di applicazioni web basate su Django e React.\n\nSlide:\n\nSpeaker: Raffaele Colace\n",
  "duration": 1690,
  "language": "ita",
  "recorded": "2022-06-03",
  "speakers": [
    "Raffaele Colace"
  ],
  "tags": [
    "agile",
    "best practice",
    "case study",
    "devops",
    "django"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/CxWivBmSReo/maxresdefault.jpg",
  "title": "La Continuous Delivery è una condizione mentale",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CxWivBmSReo"
    }
  ]
}