{
  "copyright_text": null,
  "description": "Linting Python The Elegant Way - PyCon Italia 2022\n\nThis talk is for those people who know basic python but are looking forward to writing better and cleaner python code. Python has always been known for its easy-to-understand syntax. This talk will empower all developers and give perspective on how can you write code in a much more elegant way.\nLinting is the automated checking of your source code for programmatic and stylistic errors. Linters analyze source code to flag programming errors, bugs, stylistic errors, and suspicious constructs. This is done by using a lint tool. Python being one of the most elegant language has got a wide variety of listing tools available that can help programmers in Code formatting and styling their code in the best suitable form. Python has got some advance listing tools like pylint and flake8. In this talk we will have a great deal of discussion around how these linters can be used and how these tools can help you find more bugs and improve your code quality. These linting tools finds problems that are typically caught by a compiler for less dynamic languages. We will also discuss about how can we manage import orders, code formatting, checking security vulnerabilities, managing dependencies etc using these tools. There are also code analysis tools that provide other insights into your code. While maybe not linters by definition, these tools are usually used side-by-side with linters. They too hope to improve the quality of the code.\nIt’s useful to have linters run against your code frequently. If automation and consistency aren’t there, it’s easy for a large team or project to lose sight of the goal and start creating lower-quality code.\n\nAttendees will be able to learn\n1. What is a linter?\n2. Famous linting solutions like pylint and flake 8\n3. Use cases like ordering imports, finding error bugs\n4. Managing dependency in python with these linter tools.\n\n\nSpeaker: Riya Bansal",
  "duration": 1563,
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "Riya Bansal"
  ],
  "tags": [
    "best practice",
    "clean code",
    "code analysis",
    "community",
    "development"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/S7LO09WId20/maxresdefault.jpg",
  "title": "Linting Python The Elegant Way",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=S7LO09WId20"
    }
  ]
}