{
  "copyright_text": null,
  "description": "Linting Python The Elegant Way - PyCon Italia 2022\n\nThis talk is for those people who know basic python but are looking\nforward to writing better and cleaner python code. Python has always\nbeen known for its easy-to-understand syntax. This talk will empower all\ndevelopers and give perspective on how can you write code in a much more\nelegant way. Linting is the automated checking of your source code for\nprogrammatic and stylistic errors. Linters analyze source code to flag\nprogramming errors, bugs, stylistic errors, and suspicious constructs.\nThis is done by using a lint tool. Python being one of the most elegant\nlanguage has got a wide variety of listing tools available that can help\nprogrammers in Code formatting and styling their code in the best\nsuitable form. Python has got some advance listing tools like pylint and\nflake8. In this talk we will have a great deal of discussion around how\nthese linters can be used and how these tools can help you find more\nbugs and improve your code quality. These linting tools finds problems\nthat are typically caught by a compiler for less dynamic languages. We\nwill also discuss about how can we manage import orders, code\nformatting, checking security vulnerabilities, managing dependencies etc\nusing these tools. There are also code analysis tools that provide other\ninsights into your code. While maybe not linters by definition, these\ntools are usually used side-by-side with linters. They too hope to\nimprove the quality of the code. It’s useful to have linters run against\nyour code frequently. If automation and consistency aren’t there, it’s\neasy for a large team or project to lose sight of the goal and start\ncreating lower-quality code.\n\nAttendees will be able to learn 1. What is a linter? 2. Famous linting\nsolutions like pylint and flake 8 3. Use cases like ordering imports,\nfinding error bugs 4. Managing dependency in python with these linter\ntools.\n\nSpeaker: Riya Bansal\n",
  "duration": 1563,
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "Riya Bansal"
  ],
  "tags": [
    "best practice",
    "clean code",
    "code analysis",
    "community",
    "development"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/S7LO09WId20/maxresdefault.jpg",
  "title": "Linting Python The Elegant Way",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=S7LO09WId20"
    }
  ]
}