{
  "copyright_text": null,
  "description": "Managing large-scale Machine Learning pipelines with MLflow and serverless computing. - PyCon Italia 2022\n\nMLOps aims to manage the machine learning (ML) lifecycle including experimentation, reproducibility, deployment, and model registry. Come to discover how in Vedrai - one of the top AI startups in Europe - we enhance and maintain ML pipelines models in production reliably and efficiently using MLOps.\nProblem: \n\nOne difficulty of employing Machine Learning (ML) within organizations is managing the model's lifecycle. Moving from experimenting to deployment in production environments is operated by different steps: Preparing and Analysing Data, Training, Deployment, Monitoring, and Governance of ML models. So, it is crucial to possess a platform to manage and organize the ML lifecycle.\n\nSolution: \n\nIn Vedrai, we combined the strength of the MLflow framework and the resilience of AWS serverless services to manage, deploy, and scale our ML models in production. MLflow is an open-source framework for tracking the entire ML lifecycle from training to deployment. Among the functions, it offers model tracking, packaging, and serving. Whereas, deploying ML applications is an infrastructure affair that needs to be scalable with minimum server management, which makes AWS serverless services a great choice.\n\nValue: \n\nMLflow enforces the model's reproducibility and robustness at the same time allowing more centralized experimentation. AWS serverless services allow training and inferencing pipelines to run without provisioning or managing servers while only paying for the time it takes to run.\n\nSummary:\n\n  - State of the art of MLOps.\n  - Record and query experiments with MLflow Tracking.\n  - Package data science code with MLflow Projects.\n  - Store ML models with MLflow Models Registry.\n  - Deploy ML models in the AWS environment.\n  - Future MLOps challenges.\n\n\nSpeaker: ilyas chaoua",
  "duration": "1818",
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "ilyas chaoua"
  ],
  "tags": [
    "Architecture",
    "Aws",
    "Bestpractice",
    "Deeplearning",
    "Devops",
    "Docker",
    "Infrastructure",
    "Machine Learning",
    "Open Source",
    "Operations",
    "Packaging",
    "Performance",
    "Scaling"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/8AkqF99tkXg/maxresdefault.jpg",
  "title": "Managing large-scale ML pipelines with MLflow and serverless computing.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8AkqF99tkXg"
    }
  ]
}