{
  "copyright_text": null,
  "description": "Modern Python: Alla scoperta delle ultime novità di (C)Python - PyCon\nItalia 2022\n\nVi siete mai chiesti se ci fosse un modo migliore di scrivere il vostro\ncodice? Una qualche feature di Python oscura di cui eravate all’oscuro?\nSì? Ebbene, insieme demistificheremo alcune delle ultime feature più\ninteressanti e più sottovalutate del vecchio serpentone: sarà uno\nspasso, promesso! Modern Python: Alla scoperta delle ultime novità di\n(C)Python\n\nPubblico Consigliato\n\nQuesta presentazione è diretta a sviluppatori Python con almeno qualche\nanno di esperienza sulle spalle e che siano interessati a rendere il\nproprio codice più leggibile, idiomatico e magari anche più *veloce*.\n\nIntroduzione Vi siete mai trovati a dover scrivere codice simile a\nquesto:\n\n.. code:: python\n\n   some_var = some_function()\n   if some_var:\n       ...    Code Here\n\ne aver pensato: *”Cavolo, quell’assegnamento sembra proprio di\ntroppo!”*? Se la risposta è sì, allora questa presentazione fa per voi!\nVi mostrerò come migliorare l’estetica, e magari anche la performance,\ndel vostro codice, mantenendo la medesima funzionalità. Imparerete\nconcetti avanzati quali i generatori asincroni, introdotti nel lontano\nPython 3.6, il mitico operatore “tricheco”, la nuova e scintillante\nistruzione ``match``, per un efficiente ed elegante pattern matching, ed\naltro ancora: Sarà una figata, promesso!\n\nAbstract\n\nImmagino già che qualcuno di voi si stia chiedendo, *”Ma, Matt, Python\n3.6? É vecchissimo! Perchè sei venuto a parlarci di una feature\nintrodotta nel 2016?”*: Okay, diciamo che ho mentito (giusto un\npochino).\n\nNon tutte le funzionalità di cui parlerò in questa presentazione sono\n*esattamente* nuove di zecca, ma ho sempre avuto la sensazione che\nalcune— specialmente i generatori asincroni— non abbiano mai ricevuto\nl’attenzione che meritavano e che siano andate piuttosto in sordina: ciò\nè stato probabilmente dovuto dal rilascio di Python 3.5 (che per\nrinfrescarvi la memoria ha finalmente standardizzato la programmazione\nasincrona, introducendo il concetto di coroutine e vari altri nuovi\noggetti), e con questa presentazione vorrei rendere loro giustizia e al\ntempo stesso far notare alcune delle (spesso ben nascoste!) trappole in\ncui si può cadere facendone uso. Giusto per dare un’assaggio degli\nargomenti che voglio trattare, ecco cosa spero impariate dalla\npresentazione: - Migliorare le performance del vostro codice,\nparallelizzando le operazioni di I/O basata su file, utilizzando un solo\nthread grazie all’aiuto dei generatori asincroni - Risparmiare prezioso\nspazio e tempo sostituendo ``typing.Union[A, B, C]`` con il suo\n(magnificamente idiomatico) equivalente ``A | B | C`` - Imparare la\nmaniera *”Pythonica”* di effettuare pattern matching grazie all’uso\ndella nuova istruzione ``match`` introdotta in Python 3.10. Potete dire\nfinalmente addio a codice del tipo\n``python  cases = {1: \"one\", 2: \"two\", 3: \"three\"}  one_two_three = cases.get(some_var, default_value)``\n- Altro ancora! Ma vi toccherà venire alla presentazione per scoprirlo\n:)\n\nSpeaker: Mattia Giambirtone\n",
  "duration": 960,
  "language": "ita",
  "recorded": "2022-06-03",
  "speakers": [
    "Mattia Giambirtone"
  ],
  "tags": [
    "abstractions",
    "best practice",
    "clean code",
    "cpython",
    "performance",
    "type hinting"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/LKpLvBfvRwE/maxresdefault.jpg",
  "title": "Modern Python: Alla scoperta delle ultime novità di (C)Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LKpLvBfvRwE"
    }
  ]
}