{
  "copyright_text": null,
  "description": "Modern Python: Alla scoperta delle ultime novità di (C)Python - PyCon Italia 2022\n\nVi siete mai chiesti se ci fosse un modo migliore di scrivere il vostro codice? Una qualche feature di Python oscura di cui eravate all'oscuro? Sì? Ebbene, insieme demistificheremo alcune delle ultime feature più interessanti e più sottovalutate del vecchio serpentone: sarà uno spasso, promesso!\n Modern Python: Alla scoperta delle ultime novità di (C)Python\n\n Pubblico Consigliato\n\nQuesta presentazione è diretta a sviluppatori Python con almeno qualche anno di esperienza sulle spalle e che siano interessati a rendere il proprio codice più leggibile, idiomatico e magari anche più _veloce_.\n\n Introduzione\nVi siete mai trovati a dover scrivere codice simile a questo:\n```python\nsome_var = some_function()\nif some_var:\n    ...    Code Here\n```\ne aver pensato: _”Cavolo, quell’assegnamento sembra proprio di troppo!”_? Se la risposta è sì, allora questa presentazione fa per voi! Vi mostrerò come migliorare l’estetica, e magari anche la performance, del vostro codice, mantenendo la medesima funzionalità. Imparerete concetti avanzati quali i generatori asincroni, introdotti nel lontano Python 3.6, il mitico operatore “tricheco”, la nuova e scintillante istruzione `match`, per un efficiente ed elegante pattern matching, ed altro ancora: Sarà una figata, promesso!\n\n Abstract\n\nImmagino già che qualcuno di voi si stia chiedendo, _”Ma, Matt, Python 3.6? É vecchissimo! Perchè sei venuto a parlarci di una feature introdotta nel 2016?”_: Okay, diciamo che ho mentito (giusto un pochino).\n\nNon tutte le funzionalità di cui parlerò in questa presentazione sono _esattamente_ nuove di zecca, ma ho sempre avuto la sensazione che alcune— specialmente i generatori asincroni— non abbiano mai ricevuto l’attenzione che meritavano e che siano andate piuttosto in sordina: ciò è stato probabilmente dovuto dal rilascio di Python 3.5 (che per rinfrescarvi la memoria ha finalmente standardizzato la programmazione asincrona, introducendo il concetto di coroutine e vari altri nuovi oggetti), e con questa presentazione vorrei rendere loro giustizia e al tempo stesso far notare alcune delle (spesso ben nascoste!) trappole in cui si può cadere facendone uso. Giusto per dare un’assaggio degli argomenti che voglio trattare, ecco cosa spero impariate dalla presentazione:\n- Migliorare le performance del vostro codice, parallelizzando le operazioni di I/O basata su file, utilizzando un solo thread grazie all’aiuto dei generatori asincroni\n- Risparmiare prezioso spazio e tempo sostituendo `typing.Union[A, B, C]` con il suo (magnificamente idiomatico) equivalente `A | B | C`\n- Imparare la maniera _”Pythonica”_ di effettuare pattern matching grazie all’uso della nuova istruzione `match` introdotta in Python 3.10. Potete dire finalmente addio a codice del tipo\n ```python\n cases = {1: \"one\", 2: \"two\", 3: \"three\"}\n one_two_three = cases.get(some_var, default_value)\n ```\n- Altro ancora! Ma vi toccherà venire alla presentazione per scoprirlo :)\n\n\nSpeaker: Mattia Giambirtone",
  "duration": "960",
  "language": "ita",
  "recorded": "2022-06-03",
  "speakers": [
    "Mattia Giambirtone"
  ],
  "tags": [
    "Abstractions",
    "Bestpractice",
    "Cleancode",
    "Cpython",
    "Performance",
    "Type Hinting"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/LKpLvBfvRwE/maxresdefault.jpg",
  "title": "Modern Python: Alla scoperta delle ultime novità di (C)Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LKpLvBfvRwE"
    }
  ]
}