{
  "copyright_text": null,
  "description": "Mutabilità e side effect non sono tuoi amici - PyCon Italia 2022\n\nLa mutabilità di classi ed oggetti in python è croce e delizia degli\nsviluppatori. L’utilizzo di operatori di modifica può generare problemi\nnella consistenza delle strutture dati. In questo talk analizzeremo il\nconcetto di mutabilità mostrando alcuni metodi per evitare side effect\nindesiderati. Python lascia agli sviluppatori un’enorme libertà di\nutilizzo quando si tratta di modificare strutture dati o classi. E’\ndunque necessario procedere in modo strutturato e rigoroso quando\nvengono effettuate delle modifiche al fine di evitare che strutture dati\nmutabili possano essere modificate in modo impropio generando dei side\neffect che si ripercuotono all’interno di tutto il codice. Questo\nproblema è di particolare importanza quando si scrivono delle pipeline\ndi machine learning. In questi casi, infatti, a mutazione di una\nstruttura dati può portare ad un errato processing dei dati che, di\nconseguenza, porterà al training di algoritmi di machine learning\nerrati. Scopo di questo talk è quello di investigare il concetto di\nmutabilità nelle strutture dati e nelle classi e di quali effetti\ndannosi essi possono generare all’interno del codice ed in particolar\nmodo in pipeline di machine learning. Verranno inoltre proposte alcune\nbuone norme (che prendono spunto dalla programmazione funzionale) utili\nper poter scrivere codice robusto e privo di effetti indesiderati dati\ndalla mutazione di eventuali strutture dati o classi.\n\nSpeaker: Claudio Stamile\n",
  "duration": 1848,
  "language": "ita",
  "recorded": "2022-06-03",
  "speakers": [
    "Claudio Stamile"
  ],
  "tags": [
    "best practice",
    "data structures",
    "functional programming"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/m0L8NIA4LAU/maxresdefault.jpg",
  "title": "Mutabilità e side effect non sono tuoi amici",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=m0L8NIA4LAU"
    }
  ]
}