{
  "copyright_text": null,
  "description": "Predictive maintenance: from data collection to ML key approaches -\nPyCon Italia 2022\n\nPredictive Maintenance (PM) prevents future system failures and helps to\nreduce the maintenance costs. Machine Learning with the use of IoT\nSensors is the most efficient approach. Come to see some case study\nsolved by Vedrai - one of the top AI startups in Europe - and how it\naddresses the topic. PROBLEM.\n\nThe world we live in today is highly dependent on the functioning of\nmachines and systems. Breakdown of machinery and tools should never come\nas a surprise. When predictive maintenance is working effectively,\nmaintenance is only performed on machines when it is required. That is,\njust before failure is likely to occur. This brings reduction of the\ndowntime and cost, maximizes component utilization and residual useful\nlife.\n\nSOLUTION.\n\nMachine learning-based PdM is one of the best-known data-based\nanalytical approaches for monitoring industrial systems to maximize\nreliability and efficiency. It is the most efficient method as it allows\nthe maintenance team to anticipate failure predictions, reduce equipment\ndowntime, increase reliability and improve performance by reducing\noperations and maintenance expenses. The talk will outline the\nmethodologies applied by Vedrai Team - one of the top AI startups in\nEurope - that allow it to overcome the most common obstacles of ML-based\nPdM.\n\nTALK OUTLINE.\n\nThe main purpose of this presentation is to show how to build and use\nPdM models in their entirety, and it will be based on the following\nsteps:\n\n1. collect OT (operational technology), IT (informational technology)\n   data and other information about manufacturing processes\n2. search patterns and detect anomalies\n3. train ML model to provide early warning notifications and diagnosis\n   of equipment problems days, weeks or months in advance of the fault\n4. present key studies that show how ML algorithms can effectively\n   estimate the maintenance plan\n\nSpeaker: KHVATOVA KRISTINA\n",
  "duration": 1794,
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "KHVATOVA KRISTINA"
  ],
  "tags": [
    "case study",
    "education",
    "iot",
    "machine learning",
    "predictions"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/NrI6AOekSKA/maxresdefault.jpg",
  "title": "Predictive maintenance: from data collection to ML key approaches",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NrI6AOekSKA"
    }
  ]
}