{
  "copyright_text": null,
  "description": "Predictive maintenance: from data collection to ML key approaches - PyCon Italia 2022\n\nPredictive Maintenance (PM) prevents future system failures and helps to reduce the maintenance costs. Machine Learning with the use of IoT Sensors is the most efficient approach. Come to see some case study solved by Vedrai - one of the top AI startups in Europe - and how it addresses the topic.\nPROBLEM.\n\nThe world we live in today is highly dependent on the functioning of machines and systems. Breakdown of machinery and tools should never come as a surprise. When predictive maintenance is working effectively, maintenance is only performed on machines when it is required. That is, just before failure is likely to occur. This brings reduction of the downtime and cost, maximizes component utilization and residual useful life.\n\nSOLUTION.\n\nMachine learning-based PdM is one of the best-known data-based analytical approaches for monitoring industrial systems to maximize reliability and efficiency. It is the most efficient method as it allows the maintenance team to anticipate failure predictions, reduce equipment downtime, increase reliability and improve performance by reducing operations and maintenance expenses. The talk will outline the methodologies applied by Vedrai Team - one of the top AI startups in Europe -  that allow it to overcome the most common obstacles of ML-based PdM.\n\nTALK OUTLINE.\n\nThe main purpose of this presentation is to show how to build and use PdM models in their entirety, and it will be  based on the following steps: \n\n1. collect OT (operational technology), IT (informational technology) data and other information about manufacturing processes\n2. search patterns and detect anomalies\n3. train ML model to provide early warning notifications and diagnosis of equipment problems days, weeks or months in advance of the fault\n4. present key studies that show how ML algorithms can effectively estimate the maintenance plan\n\n\nSpeaker: KHVATOVA KRISTINA",
  "duration": "1794",
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "KHVATOVA KRISTINA"
  ],
  "tags": [
    "Casestudy",
    "Education",
    "Internetofthings(Iot)",
    "Machine Learning",
    "Predictions"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/NrI6AOekSKA/maxresdefault.jpg",
  "title": "Predictive maintenance: from data collection to ML key approaches",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NrI6AOekSKA"
    }
  ]
}