{
  "copyright_text": null,
  "description": "Python, you can drive my car. Yes, I’m gonna be a star. - PyCon Italia\n2022\n\nWe know that our beloved Python can do everything, and today we are\nlearning how to use it to build a micro-simulation model of mobility!\nThanks to SUMO, a microscopic traffic simulation package written in C++\nand Python, we discover how to analyze vehicle, pedestrian and train\nflows very easily! In this talk I present SUMO, an open source, highly\nportable, microscopic and continuous traffic simulation package designed\nto handle large networks. Within SUMO, you can build multi-modal\ntransportation networks, including demand (flows of vehicles,\npedestrians, buses, trains) and network characteristics (traffic lights,\njunctions, bike lanes etc.), running simulations over large urban\nnetworks.\n\nWritten in C++, it comprises several functions and tools written in\nPython, as well a complete package called sumolib, a set of Python\nmodules for working with SUMO networks.\n\nWe will learn how to import a network from OpenStreetMap in one click\nthanks to a Python script, set some traffic flows and run a simulation\nwithin the SUMO-GUI, a perfect interface to see your cars, bicycles,\nbuses flowing on the network. Typical outputs that we can get and\nvisualize with Python include vehicle information data, trajectories,\nspeed, delays and emissions.\n\nIf you are a mobility passioner or a professional engineer dealing with\ntraffic problems, tired of spending tons of money on commercial\nsoftware, you should definitely give SUMO a try.\n\nPlease download the slides of the talk here:\n\nSpeaker: Fabio Lamanna\n",
  "duration": 1792,
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "Fabio Lamanna"
  ],
  "tags": [
    "open source",
    "tooling",
    "visualization"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ls27d5tgAJ0/maxresdefault.jpg",
  "title": "Python, you can drive my car. Yes, I'm gonna be a star.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ls27d5tgAJ0"
    }
  ]
}