{
  "copyright_text": null,
  "description": "Python, you can drive my car. Yes, I'm gonna be a star. - PyCon Italia 2022\n\nWe know that our beloved Python can do everything, and today we are learning how to use it to build a micro-simulation model of mobility! Thanks to SUMO, a microscopic traffic simulation package written in C++ and Python, we discover how to analyze vehicle, pedestrian and train flows very easily!\nIn this talk I present SUMO, an open source, highly portable, microscopic and continuous traffic simulation package designed to handle large networks. Within SUMO, you can build multi-modal transportation networks, including demand (flows of vehicles, pedestrians, buses, trains) and network characteristics (traffic lights, junctions, bike lanes etc.), running simulations over large urban networks.\n\nWritten in C++, it comprises several functions and tools written in Python, as well a complete package called sumolib, a set of Python modules for working with SUMO networks.\n\nWe will learn how to import a network from OpenStreetMap in one click thanks to a Python script, set some traffic flows and run a simulation within the SUMO-GUI, a perfect interface to see your cars, bicycles, buses flowing on the network. Typical outputs that we can get and visualize with Python include vehicle information data, trajectories, speed, delays and emissions.\n\nIf you are a mobility passioner or a professional engineer dealing with traffic problems, tired of spending tons of money on commercial software, you should definitely give SUMO a try.\n\nPlease download the slides of the talk here:\n\n\n\nSpeaker: Fabio Lamanna",
  "duration": 1792,
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "Fabio Lamanna"
  ],
  "tags": [
    "open source",
    "tooling",
    "visualization"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ls27d5tgAJ0/maxresdefault.jpg",
  "title": "Python, you can drive my car. Yes, I'm gonna be a star.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ls27d5tgAJ0"
    }
  ]
}