{
  "copyright_text": null,
  "description": "Soo many ingredients in the webapp kitchen! - PyCon Italia 2022\n\nFlask or FastAPI? Sql or NoSql? Pydantic or Marshmallow? Docker or K8s?\n\nBuilding a webapp is like coming up with a new recipe: you have many\ningredients available, some add sweetness, some add sourness. Not all of\nthem taste good together!\n\nAbove all, de gustibus non disputandum! Writing your first webapp, the\nparadox of choice can overwhelm you. You need to choose among several\n(micro)frameworks, choose how you persist data, how you deploy your app,\netc.\n\nHere are my personal gourmand views to those and other choices related\nto the development and deployment in production of small to mid-size web\napplications.\n\nThis talk wants to be somewhat of a tasting session for all the\ndifferent ingredients I tasted over the past two years, a talk I wish I\nhad received two years back to make more informed decisions myself. As\nsuch, the core of the talk will consist of comparing what I liked and\ndisliked of two projects I worked on: one based on Flask + Postgres\n(Sqlalchemy) + Marshmallow-sqlalchemy + static files, the other based on\nFastAPI + Mongodb (Motor) + S3 (Boto3) + Pydantic. I will review the\ndifferences of these choices, both technical and related to\ndocumentation and community.\n\nOf course, this talk does not aim to provide answers, but merely give\nthe audience a very blurry map to an extremely diverse environment where\neach one can build his own personal taste.\n\nEDIT 2022-06-10: You can find a summary and an edited versions of the\nslides used during the talk at the following link\n\nSpeaker: Jacopo Nespolo\n",
  "duration": 1872,
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "Jacopo Nespolo"
  ],
  "tags": [
    "databases",
    "microservices",
    "rest"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/EBTf-AObxag/maxresdefault.jpg",
  "title": "Soo many ingredients in the webapp kitchen!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EBTf-AObxag"
    }
  ]
}