{
  "copyright_text": null,
  "description": "Stupid Things I’ve Done With Python - PyCon Italia 2022\n\nOn every computer I’ve had for the past 20 years, I’ve created a folder\ncalled “stupid python tricks”. It’s where I put code that should never\nsee the light of day. Code that abuses features like decorators,\nmetaclasses, and dynamic typing to do terrible things.\n\nCode I’m going to teach you. I have a GitHub repository that contains a\ncompilation of all the awful code I’ve written over the years, abusing\nfeatures like metaclasses, decorators, various **dunder** methods, and\nthe mutable nature of Python’s underlying data structures.\n\nIt’s a funny way to see how Python works under the hood, but it’s also\neducational.\n\nReally!\n\nEach of the tricks is entertainingly terrible. But they’re also mostly\nself-contained ways to see what happens when you override certain\nbehaviours of the Python language. Anyone with an intermediate level of\nPython understanding should be able to follow along and learn something.\n\nI will cover:\n\n-  Replacing an imported module with a class, so attribute lookups can\n   be @properties, with *hilarious* results.\n-  Overriding the ``__sub__`` magic method to create a hyphenated,\n   fuzzy-matching version of a boolean.\n-  Using ``__getattr__`` to save time implementing all the functions in\n   the ``math`` module.\n-  Using ``__eq__`` to make things that aren’t really the same look the\n   same.\n\nThis talk is an entertaining tour of the Python Data Model, and the\nthings you can do - if you’re so inclined.\n\nSpeaker: Mark Smith\n",
  "duration": 1687,
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "Mark Smith"
  ],
  "tags": [
    "abstractions",
    "best practice",
    "teaching"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/7tdcBGUtOY8/maxresdefault.jpg",
  "title": "Stupid Things I've Done With Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7tdcBGUtOY8"
    }
  ]
}