{
  "copyright_text": null,
  "description": "Supercharge Your Shell — Command-Line Power-Ups and Dotfile Automation -\nPyCon Italia 2022\n\nWe spend hours each day in a terminal console, so let’s make the most of\nthat time by enhancing our command-line productivity. We will automate\ndotfile configuration, facilitate Python interpreter and virtual\nenvironment management, and supercharge our terminals with powerful\ncommand-line tools. We spend hours each day in a terminal console, so\nlet’s make the most of that time by enhancing our command-line\nproductivity. Together we will automate dotfile configuration,\nfacilitate Python interpreter and virtual environment management, and\nsupercharge our terminals with powerful command-line tools.\n\nManaging our shell configuration, commonly referred to collectively as\n“dotfiles”, can be an onerous task. Thankfully there are tools like\nAnsible and Chezmoi that we will use to more effectively automate\ndotfile management in versioned repositories, which we can then easily\ndeploy to both personal workstations and remote servers.\n\nGiven the pitfalls inherent in distro-packaged Python interpreters\n`1 <>`__, building and managing our own Python interpreters efficiently\nhas never been more important. Thankfully, we will use tools like ASDF\nto make this incredibly easy, as well as examine its similar benefits\nfor Node.js/NPM and *hundreds* of other languages and tools, all via\nextensible plugins. For Fish shell users, we will see how VirtualFish\nmakes it easy to create, upgrade, and activate virtual environments in\nways that have never been available before.\n\nFinally, we will explore how powerful command-line tools like Zoxide,\nBat, RipGrep-All + fzf, and others can be used to dramatically increase\nour terminal console productivity.\n\nAttendees of this talk will take home the following knowledge and\nskills:\n\n-  how to automate dotfile configuration management and deployment\n-  how to build and manage multiple Python interpreter versions\n-  how to more efficiently manage Python virtual environments\n-  how to use powerful command-line tools to increase terminal console\n   productivity\n\nSpeaker: Justin Mayer\n",
  "duration": 1686,
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "Justin Mayer"
  ],
  "tags": [
    "best practice",
    "development",
    "open source"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/W8imzQhI-WM/maxresdefault.jpg",
  "title": "Supercharge Your Shell — Command-Line Power-Ups and Dotfile Automation",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=W8imzQhI-WM"
    }
  ]
}