{
  "copyright_text": null,
  "description": "What do you want to be known for? - PyCon Italia 2022\n\nIf you feel professionally unsatisfied, struggle to make decisions, or have a burning desire to leave behind an epic legacy – this session is for you!\r\n\r\nIn this fun + interactive session you'll discover your Top 2 Personal Values that are the secret to creating impact through your work.\nYou work hard. \r\nYou are great at your job.\r\n\r\nBut hard work is not what creates FULFILLMENT. \r\n\r\nIf you feel professionally unsatisfied, struggle to make decisions, want to feel more creative, or desire to leave behind an epic legacy – this session is for you!\r\n\r\nIn this fun + interactive session you'll discover the secret to creating impact through your work. \r\n\r\nWhen you get clear about what you value – finding your purpose, choosing a direction, and making important career decisions becomes easy.\r\n\r\nIn this session you'll discover:\r\n- Your top two personal values \r\n- How to quickly make career decisions that feel right \r\n- How to use creativity to get clarity \r\n- Who you are now by modernizing your value system\r\n\r\nJoin certified coach, master workshop facilitator, community creator, and international entrepreneur Angela Parker for this unique session that will help you get clear and inspire you to take action. \r\n\r\nAlthough Angela is American she lives half the year in Trentino Italy and is a big supporter of the Python Community. \r\n\r\n\r\n\r\n\r\n\r\n\r\nOfficial Bio: Angela Parker is an international entrepreneur, CPCC Certified Coach, ICF Coach Member, and AJ&Smart Master Workshop Facilitator who teaches deep-feeling leaders & entrepreneurs how to use creativity, values, self-compassion, and radical self-care – to create deeply fulfilling work.\r\n\r\nAngela designs and facilitates impactful in-person and on-line workshops, masterminds, and experiences for leaders and teams.\r\n\r\nAngela founded the largest and longest running outdoor fitness program in Santa Monica CA. After her exit in 2018 she began coaching and offering workshop facilitation. She’s known for her empathy, intuition, directness, humor, and ability to thread the most impactful details into all her sessions.  \r\n\r\nAngela and her work has been featured on CBS, The LA Times, ESPN, MTV, ABC, The Hallmark Channel, Carson Magazine, and Self Magazine.\r\n\r\nWhen Covid possible, Angela splits her time between the Italian Alps, Los Angeles, Chicago, and Japan.\n\n\nSpeaker: Angela Parker",
  "duration": "1961",
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "Angela Parker"
  ],
  "tags": [
    "Communication",
    "Community",
    "Education",
    "Scaling",
    "Teaching"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/qxzbQCEFvn8/maxresdefault.jpg",
  "title": "What do you want to be known for?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qxzbQCEFvn8"
    }
  ]
}