{
  "copyright_text": null,
  "description": "What do you want to be known for? - PyCon Italia 2022\n\nIf you feel professionally unsatisfied, struggle to make decisions, or\nhave a burning desire to leave behind an epic legacy – this session is\nfor you!\n\nIn this fun + interactive session you’ll discover your Top 2 Personal\nValues that are the secret to creating impact through your work. You\nwork hard. You are great at your job.\n\nBut hard work is not what creates FULFILLMENT.\n\nIf you feel professionally unsatisfied, struggle to make decisions, want\nto feel more creative, or desire to leave behind an epic legacy – this\nsession is for you!\n\nIn this fun + interactive session you’ll discover the secret to creating\nimpact through your work.\n\nWhen you get clear about what you value – finding your purpose, choosing\na direction, and making important career decisions becomes easy.\n\nIn this session you’ll discover: - Your top two personal values - How to\nquickly make career decisions that feel right - How to use creativity to\nget clarity - Who you are now by modernizing your value system\n\nJoin certified coach, master workshop facilitator, community creator,\nand international entrepreneur Angela Parker for this unique session\nthat will help you get clear and inspire you to take action.\n\nAlthough Angela is American she lives half the year in Trentino Italy\nand is a big supporter of the Python Community.\n\nOfficial Bio: Angela Parker is an international entrepreneur, CPCC\nCertified Coach, ICF Coach Member, and AJ&Smart Master Workshop\nFacilitator who teaches deep-feeling leaders & entrepreneurs how to use\ncreativity, values, self-compassion, and radical self-care – to create\ndeeply fulfilling work.\n\nAngela designs and facilitates impactful in-person and on-line\nworkshops, masterminds, and experiences for leaders and teams.\n\nAngela founded the largest and longest running outdoor fitness program\nin Santa Monica CA. After her exit in 2018 she began coaching and\noffering workshop facilitation. She’s known for her empathy, intuition,\ndirectness, humor, and ability to thread the most impactful details into\nall her sessions.\n\nAngela and her work has been featured on CBS, The LA Times, ESPN, MTV,\nABC, The Hallmark Channel, Carson Magazine, and Self Magazine.\n\nWhen Covid possible, Angela splits her time between the Italian Alps,\nLos Angeles, Chicago, and Japan.\n\nSpeaker: Angela Parker\n",
  "duration": 1961,
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "Angela Parker"
  ],
  "tags": [
    "communication",
    "community",
    "education",
    "scaling",
    "teaching"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/qxzbQCEFvn8/maxresdefault.jpg",
  "title": "What do you want to be known for?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qxzbQCEFvn8"
    }
  ]
}