{
  "copyright_text": null,
  "description": "Write Any Python Program in One Line and Only Using Lambdas! - PyCon\nItalia 2022\n\nAny program can be written in just one statement and only using lambda.\n\nSounds weird? The first claim will bring us into what functional\nprogramming is (+ map, functools…); the second one will dig into λ\ncalculus.\n\nBut why? You will learn the power of λ and how to be concise: a better\npythonist! This talk will cover:\n\n-  Recursion! Recursion enables to write simple and concise python code.\n   We will bring many examples of recursion, how to make it fast with\n   memoizing and what tail call optimization is.\n\n-  Mutable vs Immutable objects! Since FP uses a completely immutable\n   approach, this might be the right time to learn about tuples,\n   frozendicts, and all immutable data structures.\n\n-  Higher order functions! You can pass functions as arguments and\n   return them in functions. There are many functions in python that use\n   this feature: sort, min, max, map, filter etc.\n\n-  Functools! Functools is the standard python library containing many\n   useful functional tools. The library functions will be all explained\n   properly, such as partial and reduce, often used in FP.\n\n-  Lambda calculus! λ calculus is the first functional language! In\n   fact, a λ calculus interpreter could be written using exclusively the\n   lambda statement (no loops, numbers, standard functions, libraries,\n   anything).\n\nSpeaker: Niccolò «Veggero» Venerandi\n",
  "duration": 1860,
  "language": "eng",
  "recorded": "2022-06-03",
  "speakers": [
    "Niccolò «Veggero» Venerandi"
  ],
  "tags": [
    "functional programming"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/0by86nMo7OI/maxresdefault.jpg",
  "title": "Write Any Python Program in One Line and Only Using Lambdas!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0by86nMo7OI"
    }
  ]
}