{
    "title": "A Vulnerable Tale About Burnout",
    "description": "This vulnerable tale is a personal journey through the unpredictable world of burnout and depression. It could have been easily predicted because Julia was \"doing it all\". Yet, it was totally unexpected because she assumed her mental health was strong and stable; she could handle anything. Until she couldn’t and everything became unbearable. She made the impossible and necessary decision to stop working in order to recover, setting out on what became four months of self-discovery. Julia will talk about what led her to this state, what it looked like, and how she was able to get the necessary help to feel strong enough to not only go back to work, but to shift career paths all together: a hopeful and positive outcome that arose out of dark times. Julia will talk about key takeaways that allow her to maintain a healthier balance at work and in life, especially in this all-remote pandemic reality.\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/s-Prplf-GUY/hqdefault.jpg",
    "duration": 2237,
    "speakers": [
        "Julia Simon"
    ],
    "language": "eng",
    "recorded": "2022-03-22",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=s-Prplf-GUY"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/a-vulnerable-tale-about-burnout"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}