{
    "title": "All The Things You Can Do In AWS Once You Know Python",
    "description": "Python is a great first language to learn, but how do you jump from print(\"Hello, World!\") to actually building things in AWS? In this session, I’ll present a winning workflow for Python Newbies (hatchlings?) who are ready to move past the basics, and want to explore everything they can build in AWS. We’ll cover a range of topics from serverless compute and serverless API hosting, through to AI/ML, IoT and everything in between!\n\n\nAudiences from different software/tech backgrounds will get value out of this session regardless of their career stage, as I'll discuss how to make the leap to AWS yourself, but also how to help guide any staff you manage towards this leap as well.\n\n\nJoin me for an interactive and informative session, where I’ll share lots of tips, tricks and helpful resources to make your journey to AWS with Python much easier!\n\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/UBTfTwSh2y8/hqdefault.jpg",
    "duration": 2483,
    "speakers": [
        "Brook Jamieson"
    ],
    "language": "eng",
    "recorded": "2022-03-24",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=UBTfTwSh2y8"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/all-the-things-you-can-do-in-aws-once-you-know-python"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}