{
    "title": "An Imposter is Among Us (pretty sure it’s me…): Fighting Imposter Syndrome",
    "description": "Learning about Imposter Syndrome for the first time was like hearing someone describe my entire life. There was a TERM for what I was feeling! A term for not feeling good enough, a definition for those times when you feel like you don’t belong where you are. What no one ever explained to me was how do you keep these feelings from impeding your success? Are there methods to help combat feeling like a failure? Come with me on a journey to identify the target, find tools that work for you, and then use your knowledge to help others.\n\nIdentify the Target\nWhat is Imposter Syndrome and who does it effect? There can be many ways that Imposter Syndrome manifests. In fact, some of you may suffer from a symptom of imposter syndrome and not even realize it. These symptoms, recognized or not, can then create behaviors that demean individual talents and efforts in order to protect you. Recognizing these harmful behaviors and thought patterns can help create a better atmosphere both for the individual and for the team.\n\nFind the Tools\nNow that we can identify some elements of Imposter Syndrome, we need to find tools and methods to help keep the feelings at bay. Are there methods that can help you recognize when you or someone else is experiencing these types of feelings? Ways to create a better atmosphere to help teammate who may be struggling? Find strategies and tricks to keep Imposter Syndrome from impeding success, both in your daily life and in your career.\n\nUsing your Powers for Good (Or Evil, I don’t judge)\nNow that we know what we are dealing with, how can we use this knowledge to better our personal lives and the lives of our team? Can we identify some of the behaviors we engage in that may be a trigger for others suffering with Imposter Syndrome? What does it look like, when we come together as a community to create a safe area where no one feels out of place.\n\n #PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/O57dRR4eS6c/hqdefault.jpg",
    "duration": 2572,
    "speakers": [
        "Elizabeth Gray"
    ],
    "language": "eng",
    "recorded": "2022-03-21",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=O57dRR4eS6c"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/an-imposter-is-among-us-pretty-sure-it2019s-me-fighting-imposter-syndrome"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}