{
    "title": "Choose Your Own (QA) Adventure",
    "description": "Every organisation needs quality processes in place to ensure the software it produces is maintainable and satisfies customer needs. But what to do when your organisation doesn’t have, or can’t have, a dedicated QA team? You’re in luck. This talk covers everything you’ll need to know to not only adopt quality processes within your development teams, but to create an organisational culture conducive to releasing reliable, maintainable, and consistently high quality software.\n\nI’m a former QE now working as a developer. I’ve been responsible for making quality process recommendations that have now been adopted across my organisation. This talk covers a combination of quality engineering skills engineers may not have developed yet, as well as processes like TDD and code review that contribute to quality while also being more traditionally in the purview of developers. This talk uses Total Quality Management (TQM) as a model for software quality processes.\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/3l7flw-2YRU/hqdefault.jpg",
    "duration": 1967,
    "speakers": [
        "Dana Scheider"
    ],
    "language": "eng",
    "recorded": "2022-03-22",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=3l7flw-2YRU"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/choose-your-own-qa-adventure"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}