{
    "title": "Communication is Just as Important as Code",
    "description": "The idea of a lone developer coding in their basement without social interaction is a thing of the past. These days, technical solutions are often developed by cross-functional teams whose participants have a range of technical experience. Now, more than ever, good communication skills are an essential part of being a software developer.\n\nIn this talk, Scott will share immediately actionable communication principles that will help you get buy-in for your ideas, reduce conflict and tension, increase productivity, be liked and respected. If you’re looking to take your career to the next level, this is one talk you won’t want to miss.\n\n“Communication is just as Important as Code” is one of our core values at Corgibytes, a software dev shop exclusively focused on modernizing existing software applications.\n\nAt Corgibytes, we eliminate the binary belief that people are “technical” or “non-technical.” Everyone is expected to be both. Folks who come from a computer science background participate in sales calls and help with blog posts, and everyone, no matter their role, is expected to learn how to code.\n\nTo preserve a culture of autonomy, motivate our members to do their best work and to enable fluid communication, we have thought extensively about optimizing the balance between asynchronous communication, routine synchronous communication, and even developed our own framework to reduce context switching that allows people the most scheduling flexibility.\n\n #PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/2CpcccS5FSg/hqdefault.jpg",
    "duration": 2460,
    "speakers": [
        "M. Scott Ford"
    ],
    "language": "eng",
    "recorded": "2022-03-24",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=2CpcccS5FSg"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/communication-is-just-as-important-as-code"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022",
        "Keynote"
    ]
}