{
    "title": "East Meets West When Translating Django Apps",
    "description": "Translating a web app can seem like a daunting challenge. Thankfully, though, Django provides a bunch of features out of the box that handle the mechanics of picking languages and substituting strings. In this talk, we’ll show how easy it is to provide translations for both new apps and existing ones. For example code, I’ll show Django apps I developed for small businesses operating both in the USA and in China.\n\nWe’ll cover:\n\n* Settings and structure for languages\n* URL routing and language detection\n* Providing translations in message files\n* Areas in the app to insert translation strings (particularly overlooked areas)\n* As a bonus, we’ll also look at translating the Django admin site!\n\nAfter this talk, audience members will be able to translate their Django apps without hitting common snags, helping to bring the world together just a bit more.\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/uRGMAvz6Hhk/hqdefault.jpg",
    "duration": 2693,
    "speakers": [
        "Andrew Knight"
    ],
    "language": "eng",
    "recorded": "2022-03-24",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=uRGMAvz6Hhk"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/east-meets-west-when-translating-django-apps"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}