{
    "title": "How’s Your Computer-side Manner?",
    "description": "Countless studies have found direct connections between a person’s communication skills and their professional success. In today’s world, most of your professional contacts only know you virtually. What does your computer-side manner say about you? Is it helping or hindering your professional success?\n\nFrom an organizational standpoint, communication barriers cost the average organization $62.4 million per year in lost productivity. Is it possible your employees’ written and verbal communication skills are holding them back from being more successful, not to mention impacting your organization’s productivity and, thus, the bottom line?\n\nJoin renowned communications expert Dr. Ali Atkison as she explores the nature of EI in professional communication. But this is not your mom’s EI—EI in this case stands for empathy and inquiry, your two best friends when it comes to impactful communication.\n\nIn this session you’ll learn brain-based tactics for achieving impactful communication, which is communication that accomplishes what you want it to, and that allows you to stand out as the professional you need to be to achieve success\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/wzuF7dlYguo/hqdefault.jpg",
    "duration": 2266,
    "speakers": [
        "Ali Atkison"
    ],
    "language": "eng",
    "recorded": "2022-03-24",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=wzuF7dlYguo"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/how2019s-your-computer-side-manner"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}