{
    "title": "Instant Self-Contained Development Environments for Everyone",
    "description": "It has become increasingly difficult & time consuming to start working on a new codebase, especially in a polyglot microservice world. Using several patterns & developer containers we can create an amazing developer experience that will allow anyone to instantly deep-dive into coding on any machine.\n\nThis talk will introduce the concept of a self-contained repository - a repository that contains all relevant information for workstation/dependency configuration, build, debug, CI/CD, secrets (encrypted), docs and more that reside in the repository. We’ll explore the idea of a development container and how we can use free OSS technologies (like Git Docker & Docker Compose, Kubernetes, GPG, VSCode, Tilt…) to create a stable development environment that works out-of-the-box and provides all the power, speed and capabilities of modern development & cloud native tooling. Live code examples will be showcased as part of this talk.\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/DDv6wMJuIIY/hqdefault.jpg",
    "duration": 2383,
    "speakers": [
        "Yshay Yaacobi"
    ],
    "language": "eng",
    "recorded": "2022-03-21",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=DDv6wMJuIIY"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/instant-self-contained-development-environments-for-everyone"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}