{
    "title": "Make Your Software Architecture Sexy with Domain Driven Design",
    "description": "Domain Driven Design (DDD) has a huge set of tools, which could be used to design your perfect architecture - loosely coupled and highly cohesive. Anastasiia has been using DDD for a few years and created her own way to design a new architecture for a product, a feature, redesign, refactoring and also for exploring existing products, their ecosystem and their functionality. In this talk attendees will learn on a real-world example:\n\n* how to start with Eventstorming to explore the user journey\n* how to move forward and explore the ecosystem of the product/software/feature/service\n* how to finalise a new architecture with C4 diagrams\n\nBut despite all the attempts to create a new perfect architecture, it could be affected by the team and organisation structure. Conway’s Law says: “Any organisation that designs a system will produce a design whose structure is a copy of the organisation’s communication structure”. Anastasiia experienced this so many times in different teams and organisations, that in the past few years she started applying Team Topologies together with DDD. This worked pretty well and as a bonus Anastasiia will go through the hidden icebergs of this approach as well.\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/TIOW-IsRfj0/hqdefault.jpg",
    "duration": 1653,
    "speakers": [
        "Anastasiia Tymoshchuk"
    ],
    "language": "eng",
    "recorded": "2022-03-24",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=TIOW-IsRfj0"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/make-your-software-architecture-sexy-with-domain-driven-design"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}