{
    "title": "Playwright Comes to Python",
    "description": "Hi! My name is Andrey Lushnikov. I’m a Principal Engineer at Microsoft, former Chrome DevTools engineer and Chrome Puppeteer technical lead with over 11 years of experience in software engineering. Today, I’m a member of the Playwright core team. Playwright was first released in 2020 and has been dominating JavaScript cross-browser testing ever since. Now, Playwright comes to Python!\n\n* Chrome, Firefox & Safari\n* Windows, Linux & MacOS\n* Unmatched functionality\n* Beautiful built-in tooling\n* Free & Open Source\n\nToo good? Come see yourself!\n\nIn this talk, we’ll spend an imaginary month with Playwright for Python. On day 1, we’ll set up reliable, cross-browser, end-to-end tests using Playwright for Python in less than 60 seconds. On day 3, we’ll learn how to easily author end-to-end tests using Playwright codegen feature. On day 7, we’ll debug our first test using Playwright Inspector. On day 30, we’ll use Playwright Tracing to analyze a test that fails exclusively on CI.\n\nDuring this time, we’ll also learn about the framework’s unique APIs and capabilities.\n\nBy the end of the journey, you’ll be comfortable to start using Playwright for Python!\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/1trJUveYRUk/hqdefault.jpg",
    "duration": 1848,
    "speakers": [
        "Andrey Lushnikov & Max Schmitt"
    ],
    "language": "eng",
    "recorded": "2022-03-21",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=1trJUveYRUk"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/playwright-comes-to-python"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}