{
    "title": "Quaive - How to Grow a Complex Software Suite for the Long Run",
    "description": "The central theme of this talk is: time. How do you architect a software product to get better and better in the long run?\n\nThere are simple answers to that question. And then there's reality.\n\nIf you're building a complex software product, different pieces of your stack evolve at different speeds. Yesteryear's frontend paradigm may already be oldskool, before your backend is feature-complete enough to ship.\n\nThen there's the market, where the rubber meets the road, which has its own rhythms and slow evolution. Your whole stack may be oldskool, before the market is ready to adopt your product at scale.\n\nThe product that is now Quaive, started 10 years ago, building on foundations that reach much further back in time. We somehow managed to not drown in technical debt. Even better: our product development is picking up pace currently.\n\nIn this talk I will explain success factors, and highlight risks that need to be managed. We'll spend time on product vision, technical architecture, design system, team dynamics, and market dynamics.\n\nHow do you strike the right balance, between new feature development and refactoring technical debt? How do you combine open source ethics and community involvement, with establishing a sustainable business model?\n\nYou will hopefully walk away with some new insights into wicked problem solving.\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/53Q5XGxIHj8/hqdefault.jpg",
    "duration": 1987,
    "speakers": [
        "Guido Stevens"
    ],
    "language": "eng",
    "recorded": "2022-03-24",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=53Q5XGxIHj8"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/quaive-how-to-grow-a-complex-software-suite-for-the-long-run"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}