{
    "title": "Securing Django Applications",
    "description": "Django is the most popular Python-based web framework used for creating web applications. The web applications are vulnerable for various reasons including a) configuration settings of the web applications, b) lack of implementation of security best practices and secure coding, and c) lack of awareness of secure first web applications among developers. The vulnerable web applications put the data of the customers at greater risk and the compromised code can lead to problems beyond control. It is very important to develop secure web applications to protect customer data and code to mitigate the risk.\n\nIn this talk, we will focus on two aspects. First, performing penetration testing on Django web applications to identify vulnerabilities and scanning for Open Web Application Security Project (OWASP) Top 10 risks. Second, strategies and configuration settings for making the source code and Django applications secure. We will also discuss the Djangohunter tool to identify incorrectly configured Django applications that are exposing sensitive information.\n\nOutline\n\n1) Security aspects of Django web applications (03 minutes)\n\n2) Penetration testing of Django web applications (07 Minutes)\n\n3) Overview of OWASP Top 10 risks (10 Minutes)\n\n4) Djangohunter tool demonstration (06 Minutes)\n\n5) Strategies and configuration settings to make Django Application secure (10 Minutes)\n\n6) Conclusion and Questions (04 Minutes)\n\n #PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/mE3pDCIQ3gw/hqdefault.jpg",
    "duration": 1897,
    "speakers": [
        "Gajendra Deshpande"
    ],
    "language": "eng",
    "recorded": "2022-03-21",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=mE3pDCIQ3gw"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/securing-django-applications"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}