{
    "title": "Ship More, Script Less with Paketo Buildpacks",
    "description": "Buildpacks, which appeared on the scene circa 2011, completely transformed the developer experience across the globe! First popularized by Heroku, they made single-click (or single-command) deployment a reality and appeared like magic. Several barriers to entry to using Heroku/Buildpacks - such as pricing, hosting, etc. - were solved by the use of Cloud Foundry, which prompted users to make use of a parallel standard for Buildpacks. With the mainstream adoption of containers, the build experience has transformed entirely. Consequently, the Buildpacks’ internals have also changed to allow the export of containers. After several years, the Buildpacks communities at Heroku and Cloud Foundry have converged over an open standard termed the Cloud Native Buildpacks specification. Implementations of this specification is available from Heroku, Paketo, Google, and several others.\n\nIn this talk, I aim to demonstrate the lifecycle and utility of Paketo Buildpacks, especially when using Python applications. By using Paketo (Cloud Native Buildpacks), this experience is greatly simplified for developers. The build-and-deploy phase is greatly simplified for all applications and services. Developers can essentially cut out all the noise that arises in the form of “config hell” while focusing solely on solving the core business problems.\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/a4W6ZuVcbDo/hqdefault.jpg",
    "duration": 2399,
    "speakers": [
        "Ram Iyengar"
    ],
    "language": "eng",
    "recorded": "2022-03-24",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=a4W6ZuVcbDo"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/ship-more-script-less-with-paketo-buildpacks"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}