{
    "title": "Technical Communities at an Enterprise Scale",
    "description": "Bring technical people together and technical communities will form organically. It is then a matter of sustaining and fostering this collaboration to support their being successful. This ensures strong technical alignment and empowers the communities to bring forth changes to current workflows and establish best practices.\n\nWithin Bloomberg, we call our technical communities Guilds. Since medieval times, the term ‘Guild’ has described a collection of experts who come together to solve challenges and share tricks of their craft. In this talk, we will share how Bloomberg’s Guilds program achieves this by encouraging “communities of interest” to form around specific technologies and related technical topics, and to advance their adoption within the company – with a particular focus on the activities of the Python Guild.\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/jduKlmkwJEA/hqdefault.jpg",
    "duration": 2465,
    "speakers": [
        "Marianna Polatoglou & Monica Ho"
    ],
    "language": "eng",
    "recorded": "2022-03-24",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=jduKlmkwJEA"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/technical-communities-at-an-enterprise-scale"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}