{
    "title": "The 10,000 Steps of Open Source Project Health",
    "description": "Human health is complex - it’s not something we can buy; it’s something we have to earn! This exact approach goes for open source projects and their communities. A truly dedicated and loyal fanbase cannot be bought; it has to be nurtured. But what do we mean when we call a community and the open source project \"healthy\"? This question is what we are trying to answer at Facebook!\n\n\nIn this talk, we will look at the approach that Facebook Open Source team takes to measure the current state of Facebook open source projects, and how we use these metrics to prioritize and to direct our DevRel focus. Ultimately, we aim to show how by looking at information about your open source communities, your team can concentrate on the quality of the projects instead of only the quantity of repositories that you make public.\n\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/ltIy6OwBB5o/hqdefault.jpg",
    "duration": 1082,
    "speakers": [
        "Dmitry Vinnik"
    ],
    "language": "eng",
    "recorded": "2022-03-23",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=ltIy6OwBB5o"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/the-10-000-steps-of-open-source-project-health"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}