{
    "title": "Tutorial: Practical Intro Blockchain for Python Developers",
    "description": "Are you curious about blockchain development and interested in trying it out?\n\nOutline\n* The first part of this talk will cover all the basic elements of the inner workings of blockchain. To demonstrate this, we will be building a blockchain from scratch in Python.\nNext, we will cover how to connect with, retrieve, and store information with a test blockchain using web3.py and related libraries.\n* Finally, we will talk about some of the specifics for how to build applications on the blockchain and build a few apps to demonstrate how everything fits together.\n\nAt the end of this talk, you will leave with:\n* An understanding of all the basics of how blockchains work.\n* Knowing how to run a local, test Ethereum blockchain.\n* A basic knowledge of web3.py and how build Python applications on the blockchain.\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/QeCaHkFGcYw/hqdefault.jpg",
    "duration": 9452,
    "speakers": [
        "Gwendolyn Faraday"
    ],
    "language": "eng",
    "recorded": "2022-03-24",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=QeCaHkFGcYw"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "Fhttps://2022.pythonwebconf.com/tutorials/practical-blockchain-for-python-developers"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022",
        "tutorial"
    ]
}