{
    "title": "Using Chaos Toolkit to Determine Resiliency for Your Web App",
    "description": "Introduction\nChaos engineering is the process through which one can conduct a series of experiments in order to build confidence in a system’s capability to withstand unexpected behavior.\n\nObjective\nThe objective of this talk is to help developers working on Python-based web apps to learn about how they can use a simple toolkit to carry out such chaos experiments. The Chaos toolkit (https://chaostoolkit.org/) would help Python developers to customize their experiments as per their project requirements. This can be further automated leveraging CI/CD and Cloud technologies to be able to maintain resiliency in production apps.\n\nProblem statement\nMore often than not developers face a lot of issues when scaling their applications or when certain unpredictable situations occur. Using the Chaos toolkit developers can determine the resiliency of their application under a chaos situation. In addition, developers can create custom experiments that could be automated to identify failures before they become outages. The session will demonstrate how to achieve a better resiliency using the Chaos toolkit for existing web applications.\n\nTakeaways\nKey takeaways from this sessions:\n* Understanding important concepts of Chaos engineering\n* Learn what is meant by steady state hypothesis and create experiments for your Python based web app\n* Automating the process through CI/CD\n\nDemo solution highlights\nFollowing are the highlights:\n* Demonstrating how to setup your first experiment using Chaos toolkit\n* Defining steady-state-hypothesis, probes and controls\n* Running the experiment under various chaos conditions\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/_oO4zju8M0E/hqdefault.jpg",
    "duration": 1512,
    "speakers": [
        "Karan Balkar"
    ],
    "language": "eng",
    "recorded": "2022-03-24",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=_oO4zju8M0E"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/using-chaos-toolkit-to-determine-resiliency-for-your-web-app"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}