{
    "title": "Using Open Earth Observations for Measuring Economic Indicators",
    "description": "The alarming speed with which the COVID19 global pandemic spread across the world and the subsequent quarantine & work-from-home (WFH) measures initiated by various governments has created an unprecedented situation. There has been a sharp decline in economic activity and the global GDP is projected to contract by 3% (IMF projections April 2020). That is equivalent to $3tn of lost economic output & precious jobs. World Bank believes that the pandemic will also push the poorer section of the society into extreme poverty. However, the pandemic has also given us an opportunity to observe the impact - EO/ Satellite data is being used to quantify the impact on the global economy. We discuss the various methods with which economic activity can be measured. As an example, we will also illustrate how, NO2 data can be extracted from multi-spectral satellite imagery, and highlight changes in pollution levels across major industrial belts.\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/3twOb2bkShI/hqdefault.jpg",
    "duration": 2241,
    "speakers": [
        "Aakash Gupta"
    ],
    "language": "eng",
    "recorded": "2022-03-23",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=3twOb2bkShI"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/using-open-earth-observations-for-measuring-economic-indicators"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}