{
    "title": "What's Your Type? A Real World Use Case for Python Type Hints",
    "description": "Type hints for python have been available since Python 3.5, but it’s rare to see the Python type system used in the wild. As a dynamic language, it’s easy to gain the habit of allowing Python programs to “fail fast” and handle type and syntax errors at runtime.\n\nHowever, when using Python for infrastructure as code, this can start to create a difficult and painful feedback loop for code that is heavily iterated upon.\n\nIn this talk, we’ll take a look at how the type system dramatically can improve an infrastructure as code programs, and see how it can improve the feedback loop. Finally, we’ll examine some of the strong and weak parts of the Python type system against other popular languages and make a case for improvements that could benefit the wider python community.\n\n#PWC2022 attracted nearly 375 attendees from 36 countries and 21 time zones making it the biggest and best year yet. The highly engaging format featured 90 speakers, 6 tracks (including 80 talks and 4 tutorials) and took place virtually on March 21-25, 2022 on LoudSwarm by Six Feet Up.\n\nMore information about the conference can be found at: https://2022.pythonwebconf.com",
    "thumbnail_url": "https://i.ytimg.com/vi/YFjIit9lLmg/hqdefault.jpg",
    "duration": 2180,
    "speakers": [
        "Lee Briggs"
    ],
    "language": "eng",
    "recorded": "2022-03-24",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=YFjIit9lLmg"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2022.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2022.pythonwebconf.com/presentations/whats-your-type-a-real-world-use-case-for-python-type-hints"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2022"
    ]
}