{
  "description": "ØMQ ou zeromq est une une boite à outils réseau extrêmement légère, flexible et performante permettant à des acteurs distribués d'échanger un grand nombre de messages en utilisant des mécanismes de transport variés (in-process, inter-process, TCP, multicast). A la base conçue et optimisée pour le backend d'un système de trading en ligne, cette bibliothèque est aujourd'hui une solution générique et multi-langage et elle est utilisée par un large spectre d'applications: ipyparallel utilise zeromq pour la communication entre ses composants, les notebooks Jupyter l'utilisent pour s'entretenir avec les différents kernels, et de nombreux (micro)services web l'utilisent pour l'échange de messages et du RPC au sein de leur backend, comme entre autres chez Spotify (python, Zeromq, protobuf et gevent). A l'institut ChemTech (Haute Ecole d'Ingénierie et d'Architecture de Fribourg), on utilise cette technologie pour la communication en temps réel entre microservices qui monitorent, analysent, optimisent et contrôlent une halle de production chimique. Cette présentation propose de vous introduire aux patterns d'utilisation pythoniques de zeromq qui ont beaucoup évolués depuis Python 3.4 et l'arrivée de asyncio, aux possibilités de cette bibliothèque en terme d'architectures de communication et de sécurité, et de faire un état des lieux des forces, faiblesses et alternatives.\n",
  "recorded": "2016-10-15",
  "language": "fra",
  "duration": 2812280,
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.fr/2016/pages/programme.html"
    },
    {
      "label": "talk slides",
      "url": "https://pycon.fr/2016/videos/communiquer-avec-omq-patterns-dutilisation-api-asynchrone-et-securite.html"
    }
  ],
  "speakers": [
    "Thierry Chappuis"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/5jsnbwimrp4/maxresdefault.jpg",
  "title": "Communiquer avec ØMQ: patterns d'utilisation, API asynchrone et sécurité",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5jsnbwimrp4"
    },
    {
      "type": "mkv",
      "url": "https://dl.afpy.org/pycon-fr-16/Communiquer%20avec%20%C3%98MQ%3A%20patterns%20d%27utilisation%2C%20API%20asynchrone%20et%20s%C3%A9curit%C3%A9.mkv",
      "size": 358870232
    }
  ]
}
