{
  "description": "We all might know what push notifications are, having been a popular feature of mobile platforms for years. However, it is a recent adoption in the web platform and the features are constantly evolving. By the end of this talk, we’ll have an understanding of what real-time web push notifications are, how do they work, and how can we make the best use of it, including news features like payload encryption and ttl headers.\nWeb push is a permission based technology that notifies a user of new messages or events even when they’re not actively using the application. Push notifications are a hit among all the social media websites, like Facebook, Instagram, Twitter, and it’s not hard to see why. Besides that, they are also very popular in cloud based data management, e-commerce websites, e-mail services, sports and auctions, and the list could go on. In this talk, we’ll see a little behind-the-scences working of this technology, starting from the handling the user’s subscription by the Push API, generating a push message when some action is triggered, to handling of the message by the Service Worker API, and finally dealing with the notification display using the Notification API.\n",
  "recorded": "2016-10-16",
  "language": "eng",
  "duration": 1404480,
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.fr/2016/pages/programme.html"
    },
    {
      "label": "talk slides",
      "url": "https://pycon.fr/2016/videos/webpush-notification-what-why-how.html"
    }
  ],
  "speakers": [
    "Ipsha Bhidonia"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/b_pcUYeT1jE/maxresdefault.jpg",
  "title": "WebPush notifications What? Why? How?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=b_pcUYeT1jE"
    },
    {
      "type": "webm",
      "url": "https://dl.afpy.org/pycon-fr-16/Webpush%20notification%20What%3F%20Why%3F%20How%3F.webm",
      "size": 188174270
    }
  ]
}
