{
  "description": "Discover how to bridge the gap between traditional machine learning and the rapidly evolving world of AI with skorch. This package integrates the Hugging Face ecosystem while adhering to the familiar scikit-learn API. We will explore fine-turing of pre-trained models, creating our own tokenizers, accelerating model training, and leveraging Large Language Models.\n\nThe machine learning world is evolving quickly, AI is talked about everywhere, with the Hugging Face ecosystem being in the midst of it. For traditional machine learning users, especially coming from scikit-learn, keeping up can be quite overwhelming. With the help of the skorch package, it is possible to marry the best of both worlds. It allows you to integrate with many of the Hugging Face features while conforming to the sklearn API.\n\nIn this talk, I'll give a brief introduction to skorch. Then we will learn how to use it to tap into the Hugging Face ecosystem, benefiting from: using pre-trained models and fine-tuning them, working with tokenizers as if they were sklearn transformers, accelerating model training, and even using Large Language Models as zero-shot classifiers. I'll discuss some benefits and drawbacks of this approach.\n\nThis talk should be of interest to you if you're coming from the scikit-learn world and are interested in the latest deep learning developments. Familiarity with scikit-learn and a little bit of PyTorch knowledge is recommended.\n\nBio:\nBenjamin Bossan\nI worked as a Data Scientist and Head of Data Science for a couple of ears, now I'm Machine Learning Engineer at Hugging Face. I'm also a maintainer of the skorch package (https://github.com/skorch-dev/skorch).\n\n\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1422,
  "language": "eng",
  "recorded": "2023-09-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://amsterdam2023.pydata.org/cfp/schedule/"
    },
    {
      "label": "https://github.com/skorch-dev/skorch",
      "url": "https://github.com/skorch-dev/skorch"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Benjamin Bossan"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/y_n7BjDCS-M/maxresdefault.jpg",
  "title": "Extend your scikit-learn workflow with Hugging Face and skorch",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=y_n7BjDCS-M"
    }
  ]
}
