{
  "description": "Survival analysis was initially introduced to handle the data analysis required in use cases revolving death and treatment in health care. Due to its merit, this method has spread to many other domains for analyzing and modeling the data where the outcome is the time until an event of interest occurs. Domains such as finance, economy, sociology and engineering.\n\nThis talk aims at unraveling the potential of survival analysis with examples from different domains. A taxonomy of the existing descriptive and predictive analytics algorithms in survival analysis are demonstrated. The concept of some candidate algorithms from each group are explained in detail, along with an example and implementation guideline using the right open source framework.\n\nThis talk aims at introducing the tools and techniques within the survival analysis domain for analyzing the time until an event of interest occurs. Examples of such event are rehospitalization after being discharged from hospital (healthcare), device needing maintenance after (re)commissioning (manufacturing), finding a job after unemployment (economy), an asset being sold after listing for sale (real-estate/finance), getting rearrested after being released from prison (criminology/sociology), and many other examples.\n\nThe potential of survival analysis tools, in both descriptive and predictive analytics, are hidden to the data science community. As a result of this, such problems are often formulated as classification or regression, where this also comes with its own caveats and pitfalls.\n\nThe aim of the talk is to simplify methods and algorithms in survival analysis with some shallow mathematical focus and starts by raising awareness about survival analysis and its potential and applications for the general audience. The descriptive and predictive algorithms within survival analysis address the data scientists with basic statistics and machine learning background, as the main audience of the talk.\n\nIntroduction to Survival Analysis\nApplications in different domains\nFormulating Survival Analysis Problem\nTaxonomy of Descriptive & Predictive Methods with python packages\nOverview of Descriptive Methods\n- Kaplan-Meier [3 slide]\n- Nelson-Aalen & Weibull [half slide]\nOverview of Predictive Methods\n- Cox Proportional Hazard [3 slide]\n- Survival Tree & Forrest [1 slide]\n- Deep Survival Analysis [1 slide]\nConclusion\nAt the end of the talk, the audience becomes aware of what survival analysis can do and which algorithms, with their corresponding python package, are the low hanging fruit in a data scientist toolbox. In addition, the audience will gain a structured overview on the topic so that any need for further knowledge acquisition could be independently followed in the future.\n\nBio:\nDanial Senejohnny\nI am a data scientist with a background in applied mathematics (systems & control). In my career as data scientist, I have experienced different sectors, i.e. manufacturing, cybersecurity, healthcare, and finance. Currently, I am contributing to data-driven solutions that improve our clients’ experience and satisfaction within ABN AMRO.\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1386,
  "language": "eng",
  "recorded": "2023-09-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://amsterdam2023.pydata.org/cfp/schedule/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Danial Senejohnny"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/I33h5-GmHSM/maxresdefault.jpg",
  "title": "Survival Analysis: a deep dive",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=I33h5-GmHSM"
    }
  ]
}
