{
  "description": "Optimizing machine learning models using regular metrics is a common practice in the industry. However, aligning model optimization with business metrics is closely tied to the objectives of the business and is highly valued by product managers and other stakeholders. This talk delves into the process of training machine learning models based on business metrics in order to enhance economic outcomes. With a primary focus on data scientists and machine learning practitioners, this talk explores techniques, methodologies, and real-world applications that harness the power of business metrics to propel machine learning models and foster business success. We will present a specific case study that demonstrates how we utilized business metrics at Booking.com that brought significant impact on model performance on business outcomes. Specifically, we will discuss our approaches to leveraging business metrics for hyperparameter tuning and reducing model complexity, which instill greater confidence within our team when deploying improved models to production.\n\nDescription\nThis talk aims to equip data scientists and machine learning practitioners with the knowledge and tools to train machine learning models on business metrics effectively. We will delve into the process of hyperparameter tuning, algorithm selection, and model evaluation specifically tailored for optimizing economic outcomes. A real-world use case at Booking.com will demonstrate the transformative power of this approach.\n\nOutline\n- Introduction to training machine learning models on machine learning metrics versus business metrics\n- Overview of the significance of leveraging business metrics to improve machine learning models' performance on business metrics\n- Introduction to machine learning algorithms suitable for modeling business metrics to drive economic optimizations\n- Metrics and evaluation, and training techniques specific to assessing the business impact of machine learning models\n- Showcasing practical use case at Booking.com where training models on business metrics has led to significant improvements in economic outcomes\n\nCentral Focus\nTraining machine learning models on business metrics present a powerful methodology for optimizing economic outcomes. By incorporating relevant business data and metrics into the modeling process, data scientists and machine learning practitioners can drive substantial improvements in economic performance. This talk will provide attendees with the necessary insights and techniques to apply this approach successfully.\n\nKey Takeaways\n- Understanding the importance of training machine learning models on business metrics for economic optimizations\n- Familiarity with machine learning algorithms suitable for modeling business metrics and driving economic outcomes\n- Strategies for evaluating and quantifying the economic impact of machine learning models\nReal-world inspiration and practical insights for applying this approach to boost economic outcomes\n\nWe aim to deliver an informative and practical talk that caters to data scientists and machine learning practitioners. Attendees will gain actionable insights, methodologies, and real-world examples to effectively train machine learning models on business metrics, leading to enhanced economic outcomes.\n\nBio:\nFelipe Moraes\nI am a machine learning scientist at Booking.com working on personalized discounts under budget constraints.\nI have a PhD in Computer Science from the Delft University of Technology. During my PhD, I interned as an applied scientist at Amazon Alexa Shopping, where I worked on finding proxies for what customers find relevant when comparing products during their search shopping journey in order to empower Amazon recommendation systems. Before that I obtained a BSc and MSc in Computer Science from the Federal University of Minas Gerais, visited research labs at NYU and the University of Quebec, and worked as a software engineer intern in a news recommendation system start up.\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1284,
  "language": "eng",
  "recorded": "2023-09-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://amsterdam2023.pydata.org/cfp/schedule/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/XUFS-jVpKIc/maxresdefault.jpg",
  "title": "Enhancing Economic Outcomes: Leveraging Business Metrics for Machine Learning Model Optimization",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XUFS-jVpKIc"
    }
  ]
}
