{
  "description": "With the rise of data privacy concerns around AI in the EU, how can we innovate using AI capabilities despite regulations around consumer data? What tools and features are available to help us build AI in regulated industries? This talk will discuss how we can leverage diverse datasets to build better AI models without ever having to touch the datasets by using a Python library called Flower.\n\nIn this talk, we’ll review the importance of data privacy concerns, particularly in the EU, and address how we can build AI using sensitive data. We'll discuss a few machine learning techniques (classical, distributed and federated learning), and show how federated learning can help us train AI models without ever touching the sensitive data.\n\nThen, we'll evaluate a few main open source Python packages that help engineers get started with federated learning and why Flower is a valuable option to consider for your next project. We'll review the core features of Flower; most notably, it's ease of use.\n\nAfter that, we’ll jump into a demo and show how, with minimal code, a Python engineer can orchestrate a training job with multiple data sources using federated learning. We’ll walk through different parameters that give engineers the power to control and fine tune the server without the hassle of knowing infrastructure or cloud architecture.\n\nBy the end of this talk, you’ll be able to:\n\nUnderstand the role of federated learning in a landscape with increasing regulation around AI, particularly in the EU with the proposed Artificial Intelligence Act\nDifferentiate between federated learning and classical machine learning\nDesign your project so that it is in compliance with current and future legislation passed on how to use personal data\nBuild and fine tune a server that hosts the model weights for a model trained without seeing personal data\nUnderstand options available to increase the privacy around the data that is used to train the model\nThere will be a link to a Github repo at the end of the talk that contains all the code used in the demo in order to help you get started with your first federated learning project.\n\nBio:\nKrishi Sharma\nKrishi Sharma is a software developer at KUNGFU.AI where she builds software applications that power machine learning models and deliver data for a broad range of services. As a former data scientist and machine learning engineer, she is passionate about building tools that ease the infrastructure dependencies and reduce potential technical debt around handling data. She helped build and maintains an internal Python tool, Potluck, which allows machine learning engineers the ability to bootstrap a containerized, production ready application with data pipelining templates so that her team can focus on the data and metrics without squandering too much time finagling with deployment and software\n\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1487,
  "language": "eng",
  "recorded": "2023-09-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://amsterdam2023.pydata.org/cfp/schedule/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Krishi Sharma"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/8njnK_nexEw/maxresdefault.jpg",
  "title": "Innovation in the Age of Regulation: Federated Learning with Flower",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8njnK_nexEw"
    }
  ]
}
