{
  "description": "Every news consumer has needs and in order to build a true bond with your customer it is vital to meet these, sometimes, diverse needs. To achieve this, first of all, it is important to identify the overarching needs of users; the reason why they read news. The BBC conducted research to determine these needs and identified six distinct categories: Update me, Keep me on trend, Give me perspective, Educate me, Divert me, and Inspire me. Their research showed that an equal distribution of content across these user needs will lead to higher customer engagement and loyalty. To apply this concept within DPG Media, we started building our own user needs model. Through various iterations of text labelling, text preparation, model building, fine-tuning and evaluation, we have arrived at a BERT model that is capable of determining the associated user needs based solely on the article text.\n\nWe would like to take the audience through all the steps that we have taken to get to the point where we are right now. During this process we had to find solutions to many obstacles and we are happy to share these lessons with the audience. Furthermore, we want to discuss all the tools and techniques that we used in order to arrive at the current phase.\n\nThe focus of the talk is on preparing the datasets and building the models, so a background in data science, engineering and/or machine learning is usefull.\n\nThe time breakdown will be the following:\nMinutes 0-5: introducing the topic and explaining why it is important\nMinutes 5-10: discussing the tools that we used and prior decisions we made\nMinutes 10-20: going through the labelling process and different models we build\nMinutes 20-25: sharing results and lessons learnt\nMinutes 25-30: giving insights into next steps and future applications\n\nBios:\nJurriaan Nagelkerke\nData Scientist with 15+ years experience in getting value out of data for various companies in different branches. Love to apply the right ML/ AI techniques to answer business questions and actually make a difference. Aside from hands on consultant i'm also trainer in various ML techniques. Last few years strong focus on textual data / NLP and transformer models / LLMs.\n\nVincent Smeets\nHi, my name is Vincent Smeets. I am one of the data scientists within the Data And Customer Analytics department at DPG Media. I am responsible for generating insights from structured and semi-structured data to support decision making within the B2C Marketing organisation. In my freetime I love skateboarding, tennis and running.\n\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1335,
  "language": "eng",
  "recorded": "2023-09-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://amsterdam2023.pydata.org/cfp/schedule/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Jurriaan Nagelkerke",
    "Vincent Smeets"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/hLbYLP1XCfI/maxresdefault.jpg",
  "title": "Revealing the true motives of news readers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hLbYLP1XCfI"
    }
  ]
}
