{
  "description": "The Difference-in-Differences (DiD) methodology is a popular causal inference method utilized by leading tech firms such as Microsoft Research, LinkedIn, Meta, and Uber. Yet recent studies suggest that traditional DiD methods may have significant limitations when treatment timings differ. An effective alternative is the implementation of the staggered DiD design. We exemplify this by investigating an interesting question in the music industry: Does featuring a song in TV shows influence its popularity, and are there specific factors that could moderate this impact?\n\nDifference-in-differences (DiD) is a causal inference method frequently used in empirical research in industry and academia. However, standard DiD has limitations when interventions occur at different times or affect varying groups. This talk will highlight the application of the Staggered DiD method, a more nuanced approach that addresses these limitations, in the context of the music industry. We will try to answer the question of how music features in TV shows affect music popularity and how this effect might change for different types of music using the staggered DiD method. Attendees will gain an understanding of causal inference through observational studies and specifically how the new DiD methods are used through an interesting and original case study.\n\nThe talk will be structured as follows:\n\nIntro to the case (e.g., background on music features on TV, dataset)\nExplanation of the DiD approach and its limitations.\nIntroduction to the Staggered DiD method.\nApplication of staggered DiD for the case study from the music industry\nConclusions\nQ&A\nTarget Audience: The talk would be beneficial for data scientists, researchers, and practitioners interested in causal inference, marketing analytics, and quasi-experimental design. Attendees should have a basic understanding of statistical methods used in data science.\n\nKey Takeaways:\n\nUnderstanding of the DiD approach and its limitations in the context of analyses with observational data.\nInsights into the Staggered DiD method and its application.\nPractical knowledge about executing and evaluating DiD studies effectively.\n\nBio:\nNazli M. Alagoz\nI am a quantitative researcher and data scientist with a strong background in marketing, economics, and econometrics. My focus is on using data-driven approaches to tackle complex business challenges, uncover valuable insights, and drive impactful decisions. As a Ph.D. candidate in quantitative marketing, I specialize in causal inference, machine learning, and experimental design to address cutting-edge research questions.\n\n\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1278,
  "language": "eng",
  "recorded": "2023-09-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://amsterdam2023.pydata.org/cfp/schedule/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Nali M. Alagöz"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/rkP4TK1SPVQ/maxresdefault.jpg",
  "title": "Staggered Difference-in-Differences in Practice: Causal Insights from the Music Industry",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rkP4TK1SPVQ"
    }
  ]
}
