{
  "description": "The customers of Picnic use images and texts of products to decide if they like our products, so why not include those data streams in our Temporal Fusion Transformers that we use for Product Demand Forecasting?\n\nJoin us for a thrilling journey through convolutional, graph-based, and transformer-based architectures. Learn about methods to turn images, texts, and geographical information into features for other applications as we did for product demand forecasting. Discover how Picnic Technologies uses state-of-the-art multimodal approaches for demand forecasting to prevent food waste and keep our customers happy!\n\nEver wondered how we keep your favorite brand of potato chips in stock, while that exotic sauce is forever \"currently unavailable\"? We'll reveal the secrets behind these mysteries in our talk on how we are using recent advancements in visual, textual, and contextual information processing techniques to optimize our Product Demand Forecasting. Because everybody loves looking at pictures of groceries but prefers having them available and on their doorstep (delivered for free).\n\nWe begin by shedding light on traditional product demand forecasting - the 'old potatoes' of the industry - and its limitations, like the notorious cold start problem and category dynamics.\n\nOur talk is a must-watch for data scientists, product managers, supply chain wizards, and anyone who has ever been curious about the new innovations in number-crunching that gets your favorite snack from the factory to your front door. If you're in the e-commerce or retail industries, this talk will be as essential as oatmilk and bread in a shopping list. Don’t worry if words like multimodal, temporal, and fusion sound intimidating; They will be explained in a way that is informative and entertaining if you have seen them before but also if you have not.\n\nWe promise it’s not all graphs and matrices – expect an unexpected rollercoaster ride through the aisle of our digital store. With each turn, you'll discover how our multimodal method uses product images, textual descriptions, and additional contextual information to predict if potatoes will overtake pasta in popularity next month. We'll show you the ‘cart’ loads of data behind these predictions, putting a fun spin on the world of groceries.\n\nIn the grand finale, we’ll take you behind the scenes of our model's showdown with traditional methods. Spoiler alert: our method doesn’t just predict demand; it leaves the traditional methods looking like overripe bananas in the back of the fridge (which is a bad state for bananas to be in).\n\nThe main takeaway from our talk - besides a craving for potatoes - will be an understanding of multimodal demand forecasting and how all these different types of data are becoming easier and easier to use for real-world business value. By the end of our talk, you'll be filled with ideas (and the sudden need to do groceries with Picnic, you are our target audience: Loving reliability, good products and you have busy jobs), inspired by the potential of multimodal machine learning in forecasting. So, whether you're a data scientist, product manager, or a curious shopper, come along for an enjoyable trip through the world of groceries and demand forecasting!\n\nPrepare your shopping list and join us. Just remember, our model may predict the demand for potatoes, but it's still up to you to remember the dip!\n\nBio:\nMaarten Sukel\nMaarten is a Data Scientist working at Picnic Technologies working mostly on Demand Forecasting and running machine learning at scale. Meanwhile at the University of Amsterdam, he works on research into the use of multimodal approaches for a range of applications.\n\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1165,
  "language": "eng",
  "recorded": "2023-09-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://amsterdam2023.pydata.org/cfp/schedule/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Maarten Sukel"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ZZLQ1KJLRYE/maxresdefault.jpg",
  "title": "Multimodal Product Demand Forecasting: From pixels on your screen to a meal on your plate",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZZLQ1KJLRYE"
    }
  ]
}
