{
  "description": "Last year, the pandas community adopted a new process for making significant changes to the library: the Pandas Enhancement Proposals, aka PDEPs (similar to Python's PEPs and numpy's NEPs, ..). In the meantime, several of those proposals have been proposed and discussed, and some already accepted, shaping up the pandas roadmap (https://pandas.pydata.org/about/roadmap.html).\n\nThe goal of this talk is to introduce you to this new process, and give an overview of a few of the proposed PDEPs. This way, you will learn about some of the behavioural changes you can expect as a pandas user in the near future.\n\nOver the many years of development, pandas has grown (or kept since the early days) quite some corner cases and inconsistencies. Some of the proposed PDEPs are an attempt to tackle those? For example, one accepted proposal is to ban any (up)casting in \"setitem-like\" operations, avoiding surprising data type changes. There is also a proposal to stop providing the inplace option for many methods, because even though the name might imply otherwise, those operations were not actually done in-place. Another major change that is under way is a change to the copy and view semantics of operations in pandas (related to the well-known (or hated) SettingWithCopyWarning). This is already available as an experimental opt-in to test and use the new behaviour, and will probably be a highlight of pandas 3.0.\n\nBio:\nJoris Van den Bossche\nI am a core contributor to Pandas and Apache Arrow, and maintainer of GeoPandas. I did a PhD at Ghent University and VITO in air quality research and worked at the Paris-Saclay Center for Data Science. Currently, I work at Voltron Data, contributing to Apache Arrow, and am a freelance teacher of python (pandas) at Ghent University.\n\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1608,
  "language": "eng",
  "recorded": "2023-09-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://amsterdam2023.pydata.org/cfp/schedule/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://pandas.pydata.org/about/roadmap.html",
      "url": "https://pandas.pydata.org/about/roadmap.html"
    }
  ],
  "speakers": [
    "Joris Van den Bossche"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/z47QwqDUKTo/maxresdefault.jpg",
  "title": "What the PDEP? An overview of some upcoming pandas changes",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=z47QwqDUKTo"
    }
  ]
}
