{
  "description": "What can we learn from engineering, the history of machine learning, fantasy books, the early 1990s internet, and art history about how to be successful engineers in the modern-day data landscape ? We’ll learn together in this talk.\n\nBios:\nVicki Boykis\nVicki Boykis works on end-to-end ML applications. Her interests include the intersection of information retrieval and large language models, applying engineering best practices to machine learning, and Nutella. She works at Duo Security and she lives in Philadelphia with her family. Her favorite hobby was making terrible jokes on Twitter when it was still good. She recently wrote a deep dive on embeddings and put together Normconf, celebrating normcore workflows in ML.\n\n===\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2276,
  "language": "eng",
  "recorded": "2023-09-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://amsterdam2023.pydata.org/cfp/schedule/"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    }
  ],
  "speakers": [
    "Vicki Boykis"
  ],
  "tags": [
    "Keynote"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/icGHT7MiaFY/maxresdefault.jpg",
  "title": "Build and keep your context window",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=icGHT7MiaFY"
    }
  ]
}
