{
    "description": "Optimizar el código para mejorar el rendimiento requiere experiencia y un esfuerzo manual considerable. Debido a esta barrera, la mayoría del software permanece sin optimizar, lo que da lugar a las aplicaciones lentas que comúnmente experimentamos. En esta charla, veremos cómo las herramientas modernas impulsadas por IA pueden ahora optimizar continuamente el código Python de formas que antes estaban limitadas a programadores expertos.\n\nEn esta charla, exploraremos los pasos que los desarrolladores de aplicaciones siguen al optimizar su código y analizaremos cómo cada uno de estos pasos puede ser automatizado. En particular: • Cómo los Modelos de Lenguaje de Gran Escala pueden generar optimizaciones efectivas para el código. • Cómo el nuevo código generado se verifica exhaustivamente para garantizar que sea funcionalmente correcto. • Cómo automatizar las pruebas de rendimiento para asegurarse de que las optimizaciones realmente mejoren el rendimiento.\n\nA través de demostraciones en vivo de optimización de código con Codeflash, mostraremos las capacidades de este enfoque. Presentaremos varias categorías de optimizaciones posibles analizando código integrado en proyectos populares de código abierto, como Pydantic. Finalmente, veremos cómo podemos comenzar a optimizar automáticamente nuestro código Python existente y futuro con estas herramientas. Esto permite a los desarrolladores centrarse en escribir nuevas funcionalidades, mientras que los optimizadores impulsados por IA determinan la implementación más eficiente en Python.",
    "duration": 1805,
    "language": "eng",
    "recorded": "2025-05-16",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/schedule/presentation/66/"
        }
    ],
    "speakers": [
        "Kevin Rodriguez"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/RsRj02ldeFU/hqdefault.jpg",
    "title": "Automatizando el Rendimiento de Código Python",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=RsRj02ldeFU"
        }
    ]
}
