{
    "description": "Food Insecurity is a major challenge that is ravaging the entire world especially Africa where Agriculture faces critical challenges in productivity, sustainability, and environmental deprivation. This is due to so many factors ranging from climate change to socio-economic factors. To combat this menace, there is need for a robust and scalable system like IoT for weather monitoring and informed decision making for both the policy makers and the farmers to be able to mitigate these challenges. Python, with its rich ecosystem, serves as a bridge between the IoT devices and machine learning, assisting in resolving these challenges and improving decision making in agriculture. This talk explores the use of Python in delivering sustainable agriculture practices. We will look at how data is collected using Python from such IoT devices as soil, weather, and crop sensors. With the help of the Pandas and NumPy and SciPy libraries, we will also show how the collected information is cleaned up and analyzed for further decision making. The session also emphasizes connecting machine learning solutions via TensorFlow, PyTorch, and scikit-learn toward enhancing agriculture. Such examples include estimating when and how much irrigation to apply, potential pest control measures needed, and when and how much pest control measures will be accomplished. Attendees will learn the mechanics of building complete pipelines beginning from IoT data collection to final deployment of machine learning models in cloud or edge devices. Other concerns which we will tackle include the quality of data, compatibility of devices, policies on expansion, and the solutions to these problems. This talk is ideal for researchers, developers, and practitioners interested in leveraging Python to transform agriculture. By the end, attendees will understand how Python can drive innovation, sustainability, and resilience in this critical sector.",
    "duration": 1867,
    "language": "eng",
    "recorded": "2025-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/schedule/presentation/47/"
        }
    ],
    "speakers": [
        "Iyinoluwa Moyosola Oyelade",
        "Alowolodu Olufunso Dayo"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/LF39_oyJtj0/hqdefault.jpg",
    "title": "Bridging IoT and Machine Learning with Python for Sustainable Agriculture",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=LF39_oyJtj0"
        }
    ]
}
