{
    "description": "Da lo mismo si trabajas como dev o haciendo ciencia de datos: crear buenas presentaciones es un aspecto clave para dar a conocer lo que haces. Una buena presentación nos permite mostrar la relevancia de nuestro trabajo de una forma clara y convincente, y destacar el valor de nuestras contribuciones técnicas. En este contexto, un elemento fundamental de cualquier presentación es un set de slides que se destaque. En esta charla presentaremos 10 simples reglas para crear slides en formato HTML usando Python y Quarto, un sistema de publicación técnico y científico de código abierto. La audiencia se llevará sugerencias concretas sobre cómo mejorar sus próximo set de slides y el código para implementarlas.\n\n¿Por qué Quarto? Quarto es una excelente herramienta para crear slides sobre contenido técnico porque permite integrar código, datos y texto en un solo archivo. A lo largo de la presentación nos enfocaremos en la creación de slides en formato HTML, ya que este tiene características que lo hacen particularmente útil para presentar contenido técnico. Por ejemplo, ofrece opciones flexibles para mostrar y ocultar código y para ajustar la cantidad de información mostrada, lo que nos permite crear \"capas\" de contenido. Así, es posible presentar ideas claves para una audiencia no técnica y al mismo tiempo incluir código que se muestra solo si es necesario. Incluso, gracias al poder de WebAssembly + pyodide, es posible hacer que aparezca un intérprete de Python directamente en nuestra presentación, para poder hacer una demostración de algo en el momento, si es necesario. Todas estas opciones nos permiten crear presentaciones adaptables a públicos con distintos niveles de experiencia o conocimiento técnico.",
    "duration": 1709,
    "language": "eng",
    "recorded": "2025-05-16",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/schedule/presentation/62/"
        }
    ],
    "speakers": [
        "Riva Quiroga"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/xE9AUygcovE/hqdefault.jpg",
    "title": "Cómo llevar tus presentaciones técnicas al siguiente nivel con Python + Quarto",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=xE9AUygcovE"
        }
    ]
}
