{
    "description": "Como programadores, pasamos mucho tiempo tecleando, pero a menudo pasamos por alto cómo el diseño de nuestros teclados afecta nuestra comodidad y productividad. En esta charla, exploraremos los teclados personalizados y cómo Python puede ayudarnos a crear nuestras propias experiencias de typing.\n\nComenzaremos analizando la historia del diseño de teclados y las limitaciones de las distribuciones estándar como el QWERTY. Luego, hablaremos de las ventajas de distribuciones alternativas, como diseños ortolineales y split/divididos, que pueden ayudar a reducir la tensión y mejorar la velocidad de escritura.\n\nA continuación, revisaremos cómo diseñar el PCB (placa de circuito impreso) de un teclado personalizado y aprenderemos a utilizar herramientas de Python como GDSFactory. Aprenderás a colocar las teclas según la forma de tus manos y a crear una distribución que se enfoque en las teclas que más utilizas en tus lenguajes de programación preferidos.\n\nUna vez que tengamos el diseño del PCB, pasaremos a la construcción de nuestro teclado personalizado. Cubriremos los aspectos básicos del ensamblaje para convertir nuestro diseño en un dispositivo real. Finalmente, hablaremos sobre cómo adaptarnos a nuestra nueva distribución de teclado. Veremos herramientas en línea y scripts de Python para analizar nuestros hábitos de mecanografía, ayudándonos a identificar nuestras teclas más comunes y a monitorear nuestro progreso mientras reentrenamos nuestros dedos.\n\nNo se requiere experiencia previa en construcción de teclados o diseño de PCB; solo trae tu curiosidad y ganas de crear una experiencia de escritura personalizada. Al final de esta charla, sabrás cuestionar el diseño de tu teclado actual y quizá te animes a construir y mejorar tu propio teclado personalizado usando Python.",
    "duration": 1433,
    "language": "eng",
    "recorded": "2025-05-16",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/schedule/presentation/10/"
        }
    ],
    "speakers": [
        "Carlos A Aranibar"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/tjGHvj2rsbc/hqdefault.jpg",
    "title": "Diseñando y Construyendo Teclados Personalizados con Python",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=tjGHvj2rsbc"
        }
    ]
}
