{
    "description": "Note: This video contains discussion and images about personal experiences with cancer treatment.\n\nIn the world of library development, achieving version 2.0 often takes years, if it's achieved at all. Surprisingly, nearly 90% of packages published to PyPI using semantic versioning have a major release number of less than two. What makes reaching this milestone so elusive?\n\nIf we applied software versioning to our lives, what version would we give ourselves? Perhaps in our formative years as students, we'd be a part of a 0.x series, and as we establish careers and become self-sufficient, we might progress to a 1.x scheme. But do we settle there?\n\nJust like software libraries, our lives require maintenance, and despite our best intentions, hacks and workarounds inevitably infiltrate our routines. As these multiply and compound, our health can suffer. Do we wait for disaster to strike? Or, can we take a proactive approach in not only addressing problem areas but also striving for more?\n\nTogether, we'll explore certain risks to our wellbeing inherent to our profession as software developers: sedentary lifestyles, long work hours, and social isolation, and how we can plan and design our next major release for success.\n\n\"Finding 2.0\" is an invitation to reimagine what's possible across life areas. Whether facing health struggles, burnout, or feeling stuck in a rut, this talk provides practical insights and actionable steps for rewriting the code of your life and embracing a future of health and fulfillment.",
    "duration": 1814,
    "language": "eng",
    "recorded": "2025-05-17",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/schedule/presentation/158/"
        }
    ],
    "speakers": [
        "Marc Gibbons"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/BKzv4uP8s-k/hqdefault.jpg",
    "title": "Finding 2.0",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=BKzv4uP8s-k"
        }
    ]
}
