{
    "description": "En esta charla, contaremos la experiencia de subirse al ‘tren Python’ que prometía ser una tecnología en expansión allá por el 2015, cuando comenzamos a utilizar este lenguaje para la implementación de soluciones basadas en procesamiento de imágenes de video y satelitales para aplicaciones científicas en casos reales. Desde ese entonces, junto con su ecosistema compuesto por bibliotecas en constante actualización, Python continúa revolucionando el monitoreo ambiental en Latinoamérica. Con aplicaciones como el análisis de imágenes satelitales para evaluar los cambios de uso y cobertura de suelo hasta la detección de aumento o disminución de humedales o la presencia de cianobacterias en lagos, ríos o embalses, esta herramienta ha permitido implementar soluciones accesibles y escalables frente a desafíos como el cambio climático, la gestión de recursos hídricos y la conservación de ecosistemas. Compartiremos casos de estudio exitosos y herramientas clave, mostrando cómo la comunidad puede contribuir al cuidado ambiental y la sostenibilidad ambiental en la región. Python es más que un lenguaje de programación, es una interacción continua entre documentación, desarrolladores y la comunidad que pone a disposición infinidad de herramientas para que cualquier persona con una idea para cuidar el planeta pueda generar su aporte y divulgarlo globalmente, algo que resultaba difícil de imaginar en nuestros comienzos.",
    "duration": 2170,
    "language": "eng",
    "recorded": "2025-05-16",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/schedule/presentation/67/"
        }
    ],
    "speakers": [
        "Natalia V. Revollo",
        "Carlos E. Berger"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/WyaXjwRMPWo/hqdefault.jpg",
    "title": "GeoMonitoreo con Python: Soluciones Innovadoras para los Desafíos de Latinoamérica",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=WyaXjwRMPWo"
        }
    ]
}
