{
    "description": "Meta's Commitment to the Python Community: Empowering Innovation and Collaboration\n\nAt Meta, we're dedicated to advancing the Python ecosystem through open-source contributions and community engagement. Our mission is to improve the tooling and runtime, making the language more efficient, scalable, and accessible for developers worldwide.\n\nIntroducing Pyrefly: A Scalable Type Checker for a Unified IDE Experience\n\nWe're excited to introduce Pyrefly, a new type checker designed with scalability in mind. Built from the ground up using Rust, Pyrefly provides a faster and more efficient type checking experience, enabling developers to write better code with confidence. With Pyrefly, we aim to deliver a unified IDE experience power type hints and code navigation on a new type checking engine.\n\nUnlocking Better Performance with Free-Threaded Python\n\nIn collaboration with the Python community, we've been working on making free-threaded Python (No-GIL) available in Python 3.13. This significant milestone allows developers to take full advantage of modern multi-core processors directly from Python. More recently, our efforts have focused on improving the single-threaded performance of the free threading build, ensuring that Python remains a top choice for developers seeking high-performance capabilities.",
    "duration": 3925,
    "language": "eng",
    "recorded": "2025-05-15",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/schedule/presentation/118/"
        }
    ],
    "speakers": [
        "Sam Gross",
        "Neil Mitchell"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/ZTSZ1OCUaeQ/hqdefault.jpg",
    "title": "High-Performance Python: Faster Type Checking and Free Threaded Execution (Sponsor: Meta)",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=ZTSZ1OCUaeQ"
        }
    ]
}
