{
    "description": "According to the World Health Organization (WHO), an estimated 1.3 billion people (1 in 6 individuals) experience a disability, and nearly 2.2 billion people (1 in 5 individuals) have vision impairment. Improving the accessibility of visualizations will enable more people to participate in and engage with our data analyses.\n\nIn this talk, we’ll discuss some principles and best practices for creating more accessible data visualizations. It will include tips for individuals who create visualizations, as well as guidelines for the developers of visualization software to help ensure your tools can help downstream designers and developers create more accessible visualizations.\n\nSpecifically, we will cover:\n\nWhat makes data visualizations inaccessible? We will cover accessibility fundamentals like color contrast, alternative text descriptions, keyboard navigation support, screen reader compatibility, and more, with specific examples and demonstrations.\nAre Python data visualization tools accessible? We will teach how to analyze the visualization landscape and discuss how tool developers can begin and prioritize improvements.\nHow accessible is my visualization? We will demonstrate how to conduct accessibility audits for data visualization tools by performing and documenting two accessibility evaluation tests live.\n\nThis talk will use examples from our ongoing work to improve the accessibility of Bokeh, a Python library for creating interactive data visualizations for web browsers. We hope this talk enables you to take the first few steps in making your next data visualization and your visualization tools, more accessible.",
    "duration": 1970,
    "language": "eng",
    "recorded": "2025-05-16",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/schedule/presentation/43/"
        }
    ],
    "speakers": [
        "Pavithra Eswaramoorthy",
        "Frank Elavsky"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/WZMo6QG1j98/hqdefault.jpg",
    "title": "Inclusive Data for 1.3 Billion: Designing Accessible Visualizations",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=WZMo6QG1j98"
        }
    ]
}
