{
    "description": "Note: This video contains strong language that may offend some viewers. The opinions and perspectives within this video should not be considered official stances of the Python Software Foundation.\n\nCory Doctorow (craphound.com) is a science fiction author, activist and journalist. He is the author of many books, most recently PICKS AND SHOVELS and THE BEZZLE (followups to RED TEAM BLUES) and THE LOST CAUSE, a solarpunk science fiction novel of hope amidst the climate emergency. His most recent nonfiction book is THE INTERNET CON: HOW TO SEIZE THE MEANS OF COMPUTATION, a Big Tech disassembly manual. Other recent books include RED TEAM BLUES, a science fiction crime thriller; CHOKEPOINT CAPITALISM, nonfiction about monopoly and creative labor markets; the LITTLE BROTHER series for young adults; IN REAL LIFE, a graphic novel; and the picture book POESY THE MONSTER SLAYER.\n\nHe maintains a daily blog at Pluralistic.net. He works for the Electronic Frontier Foundation, is a MIT Media Lab Research Affiliate, is a Visiting Professor of Computer Science at Open University, a Visiting Professor of Practice at the University of North Carolina’s School of Library and Information Science and co-founded the UK Open Rights Group. Born in Toronto, Canada, he now lives in Los Angeles. In 2020, he was inducted into the Canadian Science Fiction and Fantasy Hall of Fame. In 2022, he earned the Sir Arthur Clarke Imagination in Service to Society Awardee for lifetime achievement. In 2024, the Media Ecology Association awarded him the Neil Postman Award for Career Achievement in Public Intellectual Activity. York University (Canada) made him an Honourary Doctor of Laws; and the Open University (UK) made him an Honourary Doctor of Computer Science.",
    "duration": 2107,
    "language": "eng",
    "recorded": "2025-05-16",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/about/keynote-speakers/#cory-doctorow"
        }
    ],
    "speakers": [
        "Cory Doctorow"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/ydVmzg_SJLw/hqdefault.jpg",
    "title": "Keynote Speaker - Cory Doctorow",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=ydVmzg_SJLw"
        }
    ]
}
