{
    "description": "El quechua, hablado por más de 2.8 millones de personas en Bolivia, es uno de los idiomas indígenas más importantes del país. Sin embargo, enfrenta serias amenazas debido a la modernización y la globalización. Esta charla explora cómo las técnicas de Procesamiento de Lenguaje Natural (NLP) pueden ser una herramienta crucial para la revitalización y preservación del quechua, asegurando su uso en el ámbito digital y su transmisión a futuras generaciones.\nContenido principal:\n\n    Contexto y relevancia: En Bolivia, el 21% de la población habla quechua, lo que lo convierte en un idioma vital para la cultura del país. Sin embargo, el uso del quechua está en declive, especialmente entre los jóvenes.\n\n    Datos lingüísticos en quechua: Existen pocos recursos digitales y corpus disponibles en quechua, lo que dificulta la creación de tecnologías lingüísticas. Sin embargo, algunos esfuerzos están comenzando a surgir en la comunidad.\n\n    Desafíos técnicos: Los modelos preentrenados para lenguas de bajo recurso como el quechua siguen siendo un reto debido a la falta de datos estructurados y herramientas de procesamiento.\n    Impacto social y cultural: La preservación del quechua a través de tecnologías NLP puede tener un impacto significativo en comunidades bolivianas, promoviendo el acceso a la información en su lengua materna y mejorando la visibilidad de su cultura.\n\nObjetivo:\n\nInspirar a la comunidad de Python y NLP a participar en proyectos que utilicen la tecnología para revitalizar el quechua en Bolivia, un idioma con una rica herencia cultural que necesita urgentemente soluciones digitales para su preservación y expansión.",
    "duration": 1836,
    "language": "eng",
    "recorded": "2025-05-17",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/schedule/presentation/59/"
        }
    ],
    "speakers": [
        "Carla Marcela Florida Román"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/rE5Ct1vVYPQ/hqdefault.jpg",
    "title": "NLP para la preservación del lenguaje indígena Quechua",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=rE5Ct1vVYPQ"
        }
    ]
}
