{
    "description": "En un mundo donde necesitamos garantizar la calidad de nuestro producto, automatizar pruebas para poder seguir flujos de trabajo en ambientes ágiles es fundamental.\n\nEn esta charla de 30 minutos, te invito a conocer el universo de Playwright combinado con el poder de Python, la cual es una herramienta con mucha proyección en el mercado.\n\nComenzaremos explorando los fundamentos de Playwright, desvelando por qué lo hace tan único, cómo podemos instalarlo y automatizar de manera sencilla un caso de prueba de la mano con PyTest.\n\nExploraremos juntos las opciones que nos da Playwright para la posibilidad de ejecutar nuestras pruebas en múltiples navegadores, tomar capturas de pantalla, video y emular vistas móviles para probar diseños responsivos.\n\nPero no terminaremos ahí, exploraremos cómo potenciar tus scripts de prueba con el patrón de diseño \"Page Object Model\", una práctica que mejora la mantenibilidad del código y facilita la colaboración en los equipos de desarrollo. Además, cómo podemos consumir información por medio de los \"fixtures\" facilitados por PyTest.\n\nYa seas un ingeniero de QA o un desarrollador buscando mejorar la calidad de tus proyectos, esta charla te proporcionará herramientas prácticas y conocimientos esenciales para agregar pruebas E2E eficientes en tu flujo de desarrollo.",
    "duration": 1534,
    "language": "eng",
    "recorded": "2025-05-17",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/schedule/presentation/94/"
        }
    ],
    "speakers": [
        "Joan Alejandro Esquivel Montero"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/G7SzmAO_JbA/hqdefault.jpg",
    "title": "Pruebas E2E automatizadas con Playwright y Python",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=G7SzmAO_JbA"
        }
    ]
}
