{
    "description": "The Python ecosystem thrives on innovation, adaptability, versatility and a thriving open-source community. Python’s reach continues to evolve, fueled today by custom silicon, variations within CPU architecture families, AI accelerators, and diverse use cases. The Wheel format and packaging tools should adapt and evolve to better support the Python community.\n\nWe’ll review the most potent challenges in the Python packaging ecosystem, and present our roadmap for adapting the Wheel format to enable native support for specialized hardware, the use of non-default Python package indexes, and managing diverse compute backends, all while maintaining the accessibility and simplicity Python is known for.We'll issue a call to action from the open source community, supported by important libraries such as PyTorch, JAX, Scikit-learn, etc. This is a unified roadmap for the future of Python packaging, and present published and draft PEPs.\nDescription\n\nManaging software stacks in complex compute environments is difficult. Often the standard wheel tags aren’t sufficient to describe your exact compute environment. These are common problems for many users, are often difficult to remedy, and even more difficult to make reproducible, easy to use, and composable.\n\nWe propose to “Re-Invent the Wheel” and have founded the “Wheel Next” interest group as an open source collaboration among different users, companies, packages, and maintainers that are working together on solutions to these difficult problems. We are actively publishing PEPs that extend the Wheel format, metadata, packaging tooling, and PyPI standards, and contribute to projects that help with various aspects of the problem space, including installers and indexes.\n\nIn addition, we’ll give a call to action for everyone interested in joining the initiative and helping us evolve and build the packaging ecosystem the Python world needs today and in the future.",
    "duration": 1889,
    "language": "eng",
    "recorded": "2025-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/schedule/presentation/100/"
        }
    ],
    "speakers": [
        "Jonathan Dekhtiar",
        "Barry Warsaw"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/1Oki8vAWb1Q/hqdefault.jpg",
    "title": "Reinventing the Wheel: A Community-Driven Roadmap for Python Packaging",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=1Oki8vAWb1Q"
        }
    ]
}
