{
    "description": "Geoff Hing is a data reporter for The Marshall Project. He has worked as part of investigative, data and news applications teams in a number of newsrooms. At The Arizona Republic, Geoff covered demographic change in the state and contributed data reporting to enterprise projects on water use and prison labor. At APM Reports, he covered voting rights and analyzed police use-of-force data and records as part of a team investigating the efficacy of Tasers. And while at The Chicago Tribune, Geoff helped analyze and visualize police accountability and shooting data.\n\nTom Meagher is an investigative data journalist and a senior editor at The Marshall Project, the nonprofit newsroom covering the criminal justice system in the United States. For more than a decade, Tom has used Python, Django, pandas and other libraries in his reporting, including stories on long delays plaguing executions and how prison officers evade accountability for abusing incarcerated people in their custody. As an editor he oversees The Marshall Project's coverage of prisons, jails and the death penalty. Before joining The Marshall Project, he led an interactive team for the Digital First Media newspaper chain and was the data editor at the Star-Ledger in Newark, N.J.. He got his start in journalism covering night cops for a small daily paper in Kansas.",
    "duration": 2598,
    "language": "eng",
    "recorded": "2025-05-18",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/about/keynote-speakers#the-marshal-project"
        }
    ],
    "speakers": [
        "Geoff Hing",
        "Tom Meagher"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/qog-dGVhSBI/hqdefault.jpg",
    "title": "Keynote - The Marshall Project",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=qog-dGVhSBI"
        }
    ]
}
