{
    "description": "Depending on who you ask, 15-20% of the world's population has some form of disability. Despite this, the vast majority of software isn't fully accessible. Building truly accessible systems starts with asking questions. What does it mean to be disabled? How do we know whether people can use our website? And what if our users have access issues that we don't know about?\n\nMany of these core concepts are covered by the Web Content Accessibility Guidelines, which are the governing standard for web accessibility. However, some scenarios require us to dig a little deeper. We'll look at situations where you might need to think beyond the guidelines, and some of the resources and tools that you can use to help you do so.\n\nFinally, we'll learn how to meet a variety of different accessibility requirements by breaking down a series of real-world case studies. We'll take a magnifying glass to a household name's user interfaces, travel back in time to the GeoCities era, apply some concepts from government press conferences to online content delivery, hack a life-saving medical device, and attempt to navigate technical events (and stairs). By the end of the talk, you should understand why it's important to evaluate the accessibility of your software, what goes wrong when assessments don't happen, and how to apply these lessons to design systems that work for everyone.",
    "duration": 2731,
    "language": "eng",
    "recorded": "2025-05-16",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/schedule/presentation/130/"
        }
    ],
    "speakers": [
        "Dawn Cooper"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/JcwpExu6LWI/hqdefault.jpg",
    "title": "This Talk Has Been Disabled",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=JcwpExu6LWI"
        }
    ]
}
