{
    "description": "Entre 1942 y 1964, el Programa Bracero llevó a más de 4.5 millones de trabajadores mexicanos a los Estados Unidos para hacer frente a la escasez de mano de obra. Sin embargo, las experiencias personales de estos trabajadores a menudo permanecen en la sombra, aunque sus relatos capturan historias de trabajo incansable, migración, discriminación y resiliencia. Honrar estas narrativas requiere no solo un reconocimiento histórico, sino también un método para descubrir y analizar sistemáticamente sus relatos matizados. Aprovechando la minería de texto y el procesamiento de lenguaje natural mediante bibliotecas de Python como beautiful soup, Sentence Transformers y BERTopic, esta charla tiene como objetivo destacar los temas, luchas y resiliencia que definen las experiencias de braceros.\n\nEsta sesión explorará cómo estas bibliotecas de Python pueden utilizarse para realizar un análisis sistemático de grandes cuerpos de texto, revelando temas recurrentes y el sentimiento en historias orales y entrevistas. Profundizaremos en técnicas basadas en código para el modelado de temas, la extracción de palabras clave y el análisis de sentimiento que dan vida a las historias de los Braceros. Al examinar cómo Python puede facilitar la comprensión del lenguaje del trabajo, la migración y las dificultades, esta charla demostrará cómo la ciencia de datos puede desempeñar un papel en la valoración de narrativas culturales e históricas. Al hacerlo, esta presentación también busca mostrar el potencial de Python para unir los campos de las humanidades digitales, la etnografía y la tecnología, allanando el camino hacia una mayor comprensión y reconocimiento de las voces subrepresentadas en la historia compartida de trabajo y migración entre México y Estados Unidos.",
    "duration": 1734,
    "language": "eng",
    "recorded": "2025-05-17",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://us.pycon.org/2025/"
        },
        {
            "label": "Presentation Webpage",
            "url": "https://us.pycon.org/2025/schedule/presentation/15/"
        }
    ],
    "speakers": [
        "Rodrigo Silva Ferreira"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/JiS23xPAACc/hqdefault.jpg",
    "title": "Un Enfoque Pythonico para Minería de Textos de Historias de Trabajo Arduo, Migración y Resiliencia",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=JiS23xPAACc"
        }
    ]
}
