{
  "alias": "video/1642/human-as-a-second-language-succeeding-with-the-n",
  "category": "PyCon AU 2012",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "The Natural Language Toolkit (NLTK) suite offers powerful tools for\nnatural language processing and analysis. Like many other code\nlibraries, it enables programmers to achieve results when working with\ndata they may not be an expert in the handling of - in this case, human\nlanguage. The NLTK is particularly valuable as human language skills are\nin general something programmers can get along without, and therefore\nthey are likely to be ill- equipped with the tools to most effectively\nwork with language data. However, while NLTK provides programmers with a\nway to work with all the relevant parts of language without needing to\nrely on their own grammar skills, there are many concepts in the field\nof natural language processing that require basic comprehension of\nnatural language operation, which may make knowing where to start\nworking with the NLTK difficult for the average programmer.\n\nThis presentation will demonstrate some of the NLTK's powerful and\nimpressive features, while covering the concepts that will enable any\nprogrammer to work cool tricks on natural language. The application of\nthe NLTK to a very basic artificial intelligence will be shown.\n",
  "duration": null,
  "id": 1642,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-08-21",
  "slug": "human-as-a-second-language-succeeding-with-the-n",
  "speakers": [
    "Elyse Maria Glina"
  ],
  "summary": "The Natural Language Toolkit (NLTK) suite offers powerful tools for\nnatural language processing and analysis. Like many other code\nlibraries, it enables programmers to achieve results when working with\ndata they may not be an expert\n",
  "tags": [
    "nltk"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/GynvZHDdUgA/hqdefault.jpg",
  "title": "Human as a Second Language: Succeeding with the Natural Language Toolkit",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GynvZHDdUgA"
    }
  ]
}
