{
  "alias": "video/1625/path-dependent-development-why-on-earth-are-you",
  "category": "PyCon AU 2012",
  "copyright_text": "https://www.youtube.com/t/terms",
  "description": "The PulpDist project uses SQL Alchemy as part of a custom JSON\nvalidator. This could be seen as an unusual choice, so it's worth\nexploring the way this approach came to be adopted.\n\nPracticing iterative development means coping with the inevitable\ntension between \"doing the simplest thing that could possibly work\" to\nmeet immediate project requirements and avoiding \"reinventing the wheel\"\nin order to take full advantage of existing software components.\n\nThis means that iterative software designs are inevitably path\ndependent: decisions made in early iterations can shape later aspects of\na project in unexpected ways. These early influences may even predate\nthe project itself, instead being a consequence of wider organisational\npolicies and the personal preferences and abilities of key developers.\n\nUnderstanding some of these factors can help with understanding why:\n\n-  \"good enough\" is usually a better target than \"perfect\"\n-  \"Not Invented Here\" syndrome is not always the villain it is\n   frequently made out to be\n-  the need to extensively rewrite existing components is not always a\n   sign of past failure\n\n",
  "duration": null,
  "id": 1625,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2012-08-22",
  "slug": "path-dependent-development-why-on-earth-are-you",
  "speakers": [
    "Nick Coghlan"
  ],
  "summary": "The PulpDist project uses SQL Alchemy as part of a custom JSON\nvalidator. This could be seen as an unusual choice, so it's worth\nexploring the way this approach came to be adopted. Practicing iterative\ndevelopment means coping with the tension between \"doing the simplest\nthing that could possibly work\" to meet immediate project requirements\nand avoiding \"reinventing the wheel\".\n",
  "tags": [
    "pulpdist"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/PYw2K0_ZZ0w/hqdefault.jpg",
  "title": "Path Dependent Development: Why on Earth are you using SQL Alchemy as a JSON validator?",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PYw2K0_ZZ0w"
    }
  ]
}
