{
  "description": "There's a lot of data on the web and in your desktop apps, but accessing it can involve a lot of tedious typing and clicking. This talk is an introduction to the Selenium and PyAutoGUI modules, with live demos straight from the interactive shell. Al Sweigart explains web scraping techniques and programmatically controlling the keyboard and mouse to automate these tasks for you.\n​\nAbstract\nThe internet and personal computer are central tools in many jobs, including professions outside of engineering. This makes web scraping and GUI automation are relevant to not just developers and QA testers, but academics, organizers, and office workers. This talk is an introduction to Selenium and PyAutoGUI modules. and programatically controlling your browser and desktop applications from Python.\n\nWeb scraping and GUI automation frameworks have an intimidating reputation for a steep learning curve. While they do have many sophisticated features, the basics that most folks will ever need can be covered in a single presentation.\n\nThis presentation has multiple live demos to showcase these modules straight from the interactive shell.\n\nThe content from this talk is derived from Automate the Boring Stuff with Python, a beginner's Python book freely available under a Creative Commons license at https://automatetheboringstuff.com\n\n**Bio:** \nAl Sweigart is a software developer and the author of Automate the Boring Stuff with Python, Invent Your Own Computer Games with Python, Making Games with Python & Pygame, and Hacking Secret Ciphers with Python. These books are freely available under a Creative Commons license at https://inventwithpython.com. Al enjoys haunting coffee shops, writing educational materials, cat whispering, and making useful software. He lives in San Francisco.\n\nhttps://speakerdeck.com/pybay2016/al-sweigart-automating-your-browser-and-desktop-apps",
  "recorded": "2016-08-21",
  "speakers": [
    "Al Sweigart"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/dZLyfbSQPXI/hqdefault.jpg",
  "title": "Automating Your Browser and Desktop Apps",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dZLyfbSQPXI"
    }
  ]
}
