{
  "description": "Have you ever wonder how to write beautiful documentation with minimal effort? Did the tools get in your way in the process? This talk offers practical examples of leveraging simple text and docstrings to create stunning browsable documentation while making sure your code works as designed.\n​\nAbstract\nDocumentation is a fundamental organizational tool. Not only it help us to understand our programs, documentation can help us to develop and test our code iteratively.\n\nFormats and tools like reStructuredText and Sphinx had made a positive lasting impact in our Python community as we can now easily write splendid documentation with little effort. In turn, the documentation can be auto-tested and taken straight from our source code avoiding redundancy.\n\nThis talk highlights the benefits of using simple text for writing programs and documentation, teaching the basics of reStructuredText, Sphinx, docstrings and doctests. We will be modeling the early stages of developing an application, following best practices, verifying program correctness and learning how to create beautiful documentation.\n\n**Bio:** \nDaniel Mizyrycki has been programming in Python for over a decade in industry (GreenBusinessCA, Amazon, Docker) and educational (CCSF, RCSD) environments. Previously, he used assembly, C, perl, bash, founded the first Argentinean Linux User Group (1993) and consulted for early Argentinean ISPs. He loves Python's community being a PSF Contributing Member at SFPython, PyLadies, Baypiggies, PyCon and authoring sphinxserve and loadconfig. Today, he teaches Python to hundreds of Cisco engineers.\n\nhttps://speakerdeck.com/pybay2016/daniel-mizyrycki-beautiful-documentation-oriented-programming",
  "recorded": "2016-08-20",
  "speakers": [
    "Daniel Mizyrycki"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/3QNYgLIOK4Q/hqdefault.jpg",
  "title": "Beautiful Documentation Oriented Programming",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3QNYgLIOK4Q"
    }
  ]
}
