{
  "description": "There are several unanswered questions in deploying huge schema or logic changes: How do you modify systems with zero downtime or service interruption? How do you optimize online data migrations to allow for fallbacks? Any changes in schema or code in dynamic systems may cause existing users to experience downtime. The talk focuses on strategies to ensure backwards compatibility and prevent breaking data integrity.\n​\nAbstract\nIn an ideal scenario, feature development is easy. Just replace the old code with new code, and you’re done. This is, in fact, true for a system in state of inertia. However, in a dynamic system, with constantly moving pieces of business logic, this presents a hard problem. There are several unanswered questions while deploying huge schema or logic changes: How do you make code and schema changes with zero downtime or service interruption? How do you optimize online migrations of data to allow for fallbacks? Any changes in schema or code in dynamic systems may cause existing users to experience downtime. The talk focuses on strategies to ensure backwards compatibility and prevent breaking data integrity.\n\n**Bio:**\nTrisha works as a Software Engineer at Affirm, a take on modern banking started by Max Levchin. At Affirm, Trisha has worked on several projects including the creation of the underlying financial system, architecture of systems for underwriting data processing, and several other product features. She graduated from the University of Pennsylvania studying Computer Science.\n\nhttps://speakerdeck.com/pybay2016/trisha-kothari-data-in-a-dynamic-system-strategies-for-backwards-compatibility/edit",
  "duration": 1669,
  "language": "eng",
  "recorded": "2016-08-21",
  "speakers": [
    "Trisha Kothari"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/yE8dJ2yC0Ms/hqdefault.jpg",
  "title": "Data in a dynamic system: Strategies for backwards compatibility",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yE8dJ2yC0Ms"
    }
  ]
}
