{
  "description": "Image acquisition and processing have become a standard method for qualifying and quantifying experimental measurements in many fields of science and engineering. Python provides many computational tools that can be used to perform image processing. In this talk, we will walk through the most common workflow in image processing along with examples.\n​\nAbstract\nImage acquisition and processing have become a standard method for qualifying and quantifying experimental measurements in many fields of science and engineering. Python offers the following advantage: simpler syntax, powerful libraries and modules that focuses on increasing the productivity and most importantly it is free and open-source.\n\nWe will learn image processing through a simple and common workflow. We will read a high-resolution image of a mice. We will filter the image to reduce noise and improve the quality of the image. We will then segment the image, so that we obtain only the bones. We will clean up the over-segmented regions using morphological operations. We will perform measurements on the segmented image. Finally, we will discuss the workflow with a Python code.\n\n**Bio:** \nRavi Chityala is a Senior Engineer at Elekta Inc. He has more than 12 years of experience in image processing and scientific computing. He is also a part time instructor at the UCSC Extension, San Jose, CA, where he teaches advanced Python to programmers. He uses Python for web development, scientific prototyping and computing and as a glue to automate process. He is the co-author of the book, \"Image Processing and Acquisition using Python\" published by CRC Press.\n\nhttps://speakerdeck.com/pybay2016/ravi-chityala-image-processing-using-python",
  "duration": 3496,
  "language": "eng",
  "recorded": "2016-08-21",
  "speakers": [
    "Ravi Chityala"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/5Z0KopTeizk/hqdefault.jpg",
  "title": "Image processing using Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5Z0KopTeizk"
    }
  ]
}
