{
  "description": "Bokeh (http://bokeh.pydata.org/en/latest) provides a compelling open-source platform for creating interactive data visualization applications in the browser. This talk will demonstrate Bokeh's newest capabilities: the second generation Bokeh server, APIs for streaming data, new hooks for user-extensibility (e.g. to easily leverage JavaScript 3D plot libraries), new features for GIS, and more.\n​\nAbstract\nWith support from the DARPA XDATA Initiative, commercial engagements, and contributions from over 150 community members, the Bokeh visualization library (http://bokeh.pydata.org) has grown into a large, successful open source project with heavy interest and following on GitHub (https://github.com/bokeh/bokeh). The principal goals of Bokeh are to provide capability to developers and domain experts: easily create and share interactive, versatile, and powerful visualizations that extract insight from data sets that may be remote, large, or streaming. Bokeh provides a platform for anyone to create interactive data and visualization applications in the browser for themselves, their colleagues, or for a wider audience.\n\nThis talk will give a quick overview of recent developments, and demonstrate some of the newest capabilities of Bokeh including:\n\n* Bokeh applications and the second generation Bokeh server (that is more performant, better documented, and much simpler to use and deploy)\n* APIs for streaming data (both in the notebook and Bokeh applications)\n* The ability to extend Bokeh with your own custom functionality (for example to create 3D plots or network graphs)\n* Recent GIS features such as support for GeoJSON and tiled map data sources\n* The new Datashader library that can be used together with Bokeh to visualize billions of data points.\n\nFinally the talk will discuss near-term plans for the project, it's governance, and community development.\n\nhttps://speakerdeck.com/pybay2016/bryan-van-de-ven-interactive-data-visualization-applications-for-the-browser-with-bokeh",
  "recorded": "2016-08-20",
  "speakers": [
    "Bryan Van de Ven"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/xqwCxuEBpxk/hqdefault.jpg",
  "title": "Interactive Data Visualization Applications for the Browser w/ Bokeh",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xqwCxuEBpxk"
    }
  ]
}
