{
  "description": "Airbnb developed Caravel to provide all employees with interactive access to data while minimizing friction. Caravel's main goal is to make it easy to slice, dice and visualize data. It empowers each and everyone to perform analytics at the speed of thought.\n​\nAbstract\nTopics include:\n* Intuitively visualizing datasets while filtering, pivoting, and changing views\n* Creating and sharing simple dashboards\n* Caravel's rich set of visualizations\n* Caravel's extensible, high-granularity security/permission model allowing intricate rules on who can access individual features and the dataset\n* Caravel's enterprise-ready authentication with integration with major authentication providers (database, OpenID, LDAP, OAuth, and REMOTE_USER through Flask AppBuilder)\n* Caravel's simple semantic layer, allowing users to control how data sources are displayed in the UI by defining which fields should show up in which drop-down and which aggregation and function metrics are made available to the user\n* Caravel’s deep integration with Druid\n* Caravel’s integration with most RDBMS through SQLAlchemy\n* How Javascript/Node/D3/React can cohabit and work well along with Python/Pypi/Flask\n\nBio\nMaxime Beauchemin works at Airbnb as part of the Data Tools team, developing open source products that reduce friction that help generating insight from data. He is the creator and a leading maintainer of Apache Airflow [incubating] (a workflow engine) and Caravel (a data visualization platform). Before Airbnb, Maxime worked at Facebook on computation frameworks around engagement and growth analytics, at Yahoo! on social properties analytics, and at Ubisoft as a data warehouse architect.\n\nhttps://speakerdeck.com/pybay/2016-maxime-beauchemin-caravel-a-data-visualization-exploration-and-dashboarding-platform",
  "duration": 3236,
  "language": "eng",
  "recorded": "2016-08-20",
  "speakers": [
    "Maxime Beauchemin"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Wt1xH41gXhs/hqdefault.jpg",
  "title": "Caravel - A data visualization",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Wt1xH41gXhs"
    }
  ]
}
