{
  "description": "If you are a Pythonista, an educator, STEM supporter, love free software and a parent then you should attend this talk. This talk brings home the importance of brining STEM and computing education to the K-12 school children early and in a timely manner.\n​\nAbstract\nPython is a language that makes learning programming easy and can set the foundation for our children to go on and take STEM coursework or use their knowledge of computing in other subject areas when its time for graduate school. Our school system currently has a gap in their curriculum when it comes to computing and learning how to code. pykids is a voluntary organization that is aiming to fill that gap by providing easy to use learning resources. pykids is also encouraging classroom learning by creating a space for local meetups and volunteer classes that run through the curriculum.\n\nThe pykids set up today includes the following:\n- A blog/website where students/instructors register and share ideas\n- A jupyter server that allows running notebooks on the fly\n- Downloadable Notebooks created for K3-High School students (WIP)\n- Teaching material for K-3 students\n- Volunteers\n\nAll a student needs is a laptop and an internet connection to start learning Python!\n\nBio\nMeenal Pant is a mom, long time programmer and yes a Pythonista!. She has worked in both the industry and academic /research institutes and therefore is keen to “build a bond” between technology and education. She is a poster presenter and speaker (education summit/lightening talks) in the past few PyCons - the most recent being PyCon2016. She is actively involved in the STEM education via her workplace and also personally in her kid’s schools.\n\nhttps://speakerdeck.com/pybay2016/meenal-pant-one-pykid-at-a-time",
  "duration": 1792,
  "language": "eng",
  "recorded": "2016-08-20",
  "speakers": [
    "Meenal Pant"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/-i0jrVGur10/hqdefault.jpg",
  "title": "One Pykid at a time",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-i0jrVGur10"
    }
  ]
}
