{
  "description": "There's a growing crowd of Python users who don't consider themselves beginners anymore. However some users at this stage discover odd behavior that's hard to explain. Why doesn't code behave like it should? Why doesn't \"correct\" code execute correctly? We'll focus on Python's object & memory model, addressing these issues directly. Let's empower attendees to not create these bugs to begin with!\n​\nAbstract\nIn \"Python 101,\" you learned basic Python syntax. In \"Python 102\" (or equivalent in experience), you went further, exploring Python more deeply -- creating/using classes, decorators, files, other standard library or 3rd-party modules/packages -- and graduated from being purely a beginner. Because Python has been around the block for quite awhile now, there is a continuously growing number of \"Python 103\" programmers out there. Many are no longer new to the language, however, they have run into various issues, bugs, or odd behavior in their code that is difficult to explain. It's time to take a closer look. This is an interactive best practices talk, focusing on how Python objects, references, and the memory model work as well as thinking about performance. Knowing more about how the interpreter works under the covers, including the relationship between data objects and memory management, will make you a much more effective Python programmer, and the (main) goal with the knowledge imparted in this talk is to empower developers to not (inadvertently) create certain classes of bugs in their code to begin with! All you need to bring is the desire to learn more about the interpreter to take your Python skills to the next level.\n\n**Bio:** \nWesley J Chun is the author of the bestselling Core Python titles and the Python Fundamentals Live Lessons companion video. He is coauthor of Python Web Development with Django (withdjango.com), and has written for Linux Journal, CNET, and InformIT. Wesley is an architect and Developer Advocate at Google.\n\nhttps://speakerdeck.com/pybay2016/wesley-chun-python-103-memory-model-and-best-practices",
  "duration": 2287,
  "language": "eng",
  "recorded": "2016-08-20",
  "speakers": [
    "Wesley J. Chun"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/SiXyyOA6RZg/hqdefault.jpg",
  "title": "Python 103: Memory Model & Best Practices",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SiXyyOA6RZg"
    }
  ]
}
