{
  "copyright_text": "Standard YouTube License",
  "description": "PyconAR 2016 - Bahía Blanca\n\nVinculando la medicina y la ingeniería mediante Python por Nicolas Quiroz\n\nAudience level: Principiante\n\nDescripción\n\nMe gustaría contarles mi experiencia sobre cómo logramos vincular las disciplinas de ingeniería, medicina y programación (Python). Donde desarrollamos una Red Neuronal Artificial que fue validada contra un paper publicado previamente por dos investigadores importantes en el campo de la neurociencia, además lo presentamos en formato en unos de los Congresos de Sociedad Argentina de Neurociencias.\n\nResumen\n\nMi nombre es Nicolas Quiroz, soy Ingeniero Biomédico y desde el 2007 trabajo en el área de Investigación del Hospital Italiano de Buenos Aires (ICBME). Nos orientamos siempre hacia las Neurociencias. Con mucho esfuerzo con el Ing. Javier Cuneo pudimos publicar un paper a nivel internacional (The computational influence of neurogenesis in the processing of spatial information in the dentate gyrus, http://www.nature.com/articles/srep00735) sobre un modelo matemático del Giro Dentado, una estructura importante del cerebro. En el año 2013, llega a nuestro equipo un médico (Julián) con ganas de programar Redes Neuronales Artificiales y allí empezó un nuevo desafío de armar una RNA con Python (no a gran escala y con la complejidad como la anterior, pero fue un lindo desafío). Por eso me gustaría participar y contarles mi experiencia sobre cómo logramos vincular las disciplinas de ingeniería, medicina y programación (usando Python).\n\nComo final de la historia desarrollamos un modelo que fué validado contra un paper publicado previamente por dos investigadores reconocidos (Weisz & Argibay, Cognition 2009, 112, 229–240 \"A putative role for neurogenesis in computational terms: Inferences from a hippocampal model\"). Este modelo fué presentado en formato póster en unos de los Congresos de Sociedad Argentina de Neurociencias. Actualmente Julián está en el FLENI continuando su orientación en salud, pero no falta momento que nos juntemos e imaginemos miles de cosas que podemos programar con Python.",
  "duration": 1560,
  "language": "spa",
  "recorded": "2016-11-25",
  "related_urls": [
    "http://www.nature.com/articles/srep00735"
  ],
  "speakers": [
    "Nicolas Quiroz"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/MkroG6GvRus/maxresdefault.jpg",
  "title": "Vinculando la medicina y la ingeniería mediante Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MkroG6GvRus"
    }
  ]
}
