{
  "copyright_text": "Standard YouTube License",
  "description": "PyconAR 2016 - Bahía Blanca\n\nMeetup: Defendiendo nuestros derechos humanos en la era digital: el rol del cifrado por Jeannette Torrez y Leandro Ucciferri\n\nAudience level: Intermedia\n\nDescripción\n\nEn este taller exploraremos cuál es el vínculo entre los derechos humanos y el cifrado desde distintos ejes: su importancia para la protección y promoción de los derechos (a la privacidad, la libertad de expresión, de pensamiento, de reunión y asociación); cuáles son los conflictos actuales entre el cifrado para la protección de nuestras comunicaciones y dispositivos y la necesidad del Estado de investigar el delito; qué podemos hacer para cambiar la situación actual del cifrado como una herramienta de \"lujo\" a la cual pocas personas pueden acceder; por qué es importante que la comunidad técnica se involucre en estos debates; la importancia de que todos los ciudadanos protejan sus comunicaciones y dispositivos. Poner en común cuales son los desafíos que atraviesa la comunidad técnica en la implementación de tecnologías que pueden poner en riesgo derechos fundamentales de los ciudadanos.\n\nEl formato del taller es sencillo y pretende ser una conversación en la cual les pediremos a los participantes que nos puedan brindar su visión acerca de los ejes planteados. Para garantizar una mejor participación de los asistentes, en el encuentro utilizaremos las reglas de Chatham House. La regla dispone que las personas que asisten a un seminario/taller/encuentro pueden discutir los resultados del seminario en el mundo exterior, pero no pueden discutir quién asistió o identificar lo que dijo un individuo específico. El objetivo es facilitar la discusión franca y honesta sobre temas de interés.\n\nResumen\n\nHoy en día, más de tres mil millones de personas en todo el mundo tienen acceso a Internet. Las empresas, hospitales y agencias gubernamentales almacenan nuestra información en bases de datos y computadoras conectadas a Internet. Los dispositivos que usamos todos los días -smartphones y computadoras, pero también cada vez más automóviles, relojes, televisores, tostadoras, lavarropas, hornos (dentro del mundo del Internet of Things)- almacenan y transmiten información personal. Este inmenso flujo de datos, desde emails y mensajes, hasta los sitios web que visitamos, a la información de nuestras tarjetas de crédito y registros de salud, pueden ser objeto de robo y espionaje, ya sea de criminales tratando de robar o extraer dinero, o los gobiernos y empresas espiar a sus ciudadanos y usuarios. Frente a esto, el cifrado es un medio esencial para proteger nuestra información personal, con el objetivo de garantizar que la información sólo puede ser accedida por su propietario o destinatario.\n\nEl formato del taller será mas bien descontracturado, en el cual buscaremos la participación activa de todos los asistentes para integrarlos al debate y poder arribar a conclusiones sobre las cuales podamos seguir trabajando desde nuestros roles individuales (tanto personales como profesionales) y colectivos. La idea es poder debatir y que haya un intercambio fluído de opiniones y argumentos.\n\nSe ofrecerán snacks y bebidas.\n\nhttps://adcdigital.org.ar/evento/pyconar-2016/",
  "duration": 4718,
  "language": "spa",
  "recorded": "2016-11-25",
  "related_urls": [
    "https://adcdigital.org.ar/evento/pyconar-2016/"
  ],
  "speakers": [
    "Jeannette Torrez",
    "Leandro Ucciferri"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/tUWiouEDlGE/maxresdefault.jpg",
  "title": "Meetup: Defendiendo nuestros derechos humanos en la era digital: el rol del cifrado",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tUWiouEDlGE"
    }
  ]
}
