{
  "copyright_text": "Standard YouTube License",
  "description": "PyconAR 2016 - Bahía Blanca\n\nModding de Video Juegos con Python y Blender por Sebastian Brachi\n\nAudience level: Principiante\n\nDescripción\n\nJugar no es lo único que se puede hacer con los video juegos. Desde los primeros juegos, artistas y programadores exploran su funcionamiento interno para crear nuevas experiencias. En esta charla, Python se usa junto con la 3d suite open source Blender para modificar juegos, mostrando lo sencillo que puede ser, qué habilidades se necesitan y por qué Python es una gran herramienta para este uso.\n\nResumen\n\nHacer modding de video juegos consiste en cambiar el comportamiento o aspecto de un juego, sin importar si fue creado con esa funcionalidad en mente o no. Mucha gente alrededor del mundo como artistas, programadores e investigadores comparten la pasión de crear nuevas y únicas experiencias en los juegos que les gustan. No es necesario ser un desarrollador de video juegos para modificarlos, sólo tener algo de tiempo, algunas pocas herramientas y el deseo de explorar juegos en formas pocas convencionales. Python es el lenguaje de scripting usado por Blender, la suite 3d open source. Con una API extensa, se pueden desarrollar addons para automatizar trabajos, crear simulaciones, extender la funcionalidad de Blender y mucho más. Con unas pocas líneas de código es posible crear objetos en 3d. En esta charla se va a ver como importar modelos 3d en Blender y como exportarlos de vuelta a algún juego, incluyendo modificaciones hechas dentro de Blender. Esto permitiría, por ejemplo, mezclar personajes de distintos juegos en uno solo.\n\nQue vamos a ver\n\n* Qué es Blender y qué significa '3d suite open source'\n* Integración de Blender con Python: UI, API, sistema de addons\n* Ejemplos de moddings copados\n* Qué se necesita para modificar video juegos usando Python\n\nQué vas a aprender\n\n* Crear scripts simples para dibujar modelos 3d en Blender usando Python\n* Estructuras de datos básicas usadas en video juegos\n* Formas simples y avanzadas de parsear data binaria",
  "duration": 2982,
  "language": "spa",
  "recorded": "2016-11-25",
  "related_urls": [],
  "speakers": [
    "Sebastian Brachi"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/FangeZyB1s0/maxresdefault.jpg",
  "title": "Modding de Video Juegos con Python y Blender",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FangeZyB1s0"
    }
  ]
}
