{
  "copyright_text": "Standard YouTube License",
  "description": "PyconAR 2016 - Bahía Blanca\n\nArgentina en Python: comunidad, sueños, viajes y aprendizaje por Manuel Kaufmann\n\nAudience level: Principiante\n\nDescripción\n\n¿Alguna vez soñaste con viajar y trabajar? ¿en dejarlo todo y perseguir tu sueño? ¿o llevar la programación a los lugares más recónditos? En esta charla hablaré sobre la experiencia de llevar Python a más de 100 ciudades en 8 países de Latinoamérica durante los últimos 3 años. Pequeñas historias, éxitos y fracasos, eventos realizados y la gran comunidad Python serán los tópicos de esta charla.\n\nResumen\n\n\"Argentina en Python\" nace a fines de 2013 y se pone en marcha a principios de 2014 con diferentes viajes en el territorio Argentino en búsqueda de experiencia y desafíos que afrontar para encontrar el aprendizaje y finalmente llevarlo de lleno. A principios de 2015 dejamos la Argentina para cruzar a Paraguay y comenzar una odisea que aún no termina: Uruguay, Bolivia, Perú, Chile, Ecuador, República Dominicana y España son algunos de los países que hemos visitado en estos años.\n\nEn nuestro sitio web, https://argentinaenpython.com/, se puede encontrar muchísima información sobre los más de 30 eventos que hemos realizado en este tiempo incluyendo una galería de fotos extensa que muestra la dinámica de cada evento.\n\n¡Le enseñamos a programar hasta al mejor amigo del hombre!",
  "duration": 3011,
  "language": "spa",
  "recorded": "2016-11-25",
  "related_urls": [
    "https://argentinaenpython.com/,"
  ],
  "speakers": [
    "Manuel Kaufmann"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ozUi7aUSjIU/maxresdefault.jpg",
  "title": "Argentina en Python: comunidad, sueños, viajes y aprendizaje",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ozUi7aUSjIU"
    }
  ]
}
