{
  "copyright_text": "Standard YouTube License",
  "description": "PyconAR 2016 - Bahía Blanca\n\nIntroducción a programación paralela con PyOpenCL por Celia Cintas\n\nAudience level: Principiante\n\nDescripción\n\nSe mostrará cómo crear soluciones paralelas e independientes al hardware (CPUs, DSP, FPGAs y GPUs) utilizando PyOpenCL. Veremos una breve introducción a conceptos básicos: arquitecturas, tipos de memoria y modelos de ejecución. Luego implementaremos el pipeline básico de una aplicación con PyOpenCL y resolveremos problemas desde simples operaciones con matrices hasta proc. de imágenes.\n\nResumen\n\nOpenCL es un estándar abierto y libre para la programación paralela de propósito general sobre CPU, GPU entre otros. OpenCL nos permite desarrollar código rápido y eficiente para una serie de aplicaciones con diferentes comportamientos: control intensivo (búsqueda y clasificación), volúmenes de datos (procesamiento de imágenes, simulación y modelado, y la minería de datos), cálculo intensivo (métodos iterativos, métodos numéricos y modelamiento financiero). OpenCL abstrae el código de cuestiones específicas del hardware, permitiendo que nuestros programas se ejecuten sobre una gran variedad de dispositivos. PyOpenCL es un entorno de programación Python, que reduce la cantidad de código C a solo la implementación de los kernels, dejando el resto de nuestro código (la parte de host) en Python, sin renunciar a la eficiencia ni la velocidad y manteniendo la independencia del hardware.\n\nEstructura de la charla\n\n* Qué es programación paralela?\n* Qué es OpenCL? Cuales son sus componentes?\n* Arquitectura abstracta de OpenCL\n* Tipos de memoria en OpenCL\n* Modelo de ejecución OpenCL\n* Introducción a PyOpenCL (hands-on código en ipynb)\n* Plataforma, Contextos, Colas, Kernel y programas.\n* Buffers\n* Ejemplos de operaciones de matrices, procesamiento de imágenes y fractales.\n",
  "duration": 2292,
  "language": "spa",
  "recorded": "2016-11-25",
  "related_urls": [],
  "speakers": [
    "Celia Cintas"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/nz0eBPJlezg/maxresdefault.jpg",
  "title": "Introducción a programación paralela con PyOpenCL",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nz0eBPJlezg"
    }
  ]
}
