{
  "copyright_text": "Standard YouTube License",
  "description": "PyconAR 2016 - Bahía Blanca\n\nimport pybr12: experiencias de inclusión en la última PyCon Brazil por Fernando Masanori Ashikaga, Paola Katherine\n\nAudience level: Principiante\n\nDescripción\n\nPyLadies en el Brazil, como un de los fatores para tener 42% de mujeres speaker's, en la ultima PyCon Implementamos el Código de Conduta, como explicado en https://www.coc-handbook.com/ Acertos y errores, en la práctica, do ponto de vista de un miembro del time de respuesta. Explicación del Manifesto Pybr12: sticker con los principios de inclusión de la conferencia 2016\n\nResumen\n\n* Contexto de PyLadies en el Brazil: historico, localidades, desarrollo\n* Descripcion particular de PyLadies San Pablo: hace un año de existencia apenas, yo he dado el primero taller, dados y peculiaridades\n* Preliminares de la PyCon Brazil: el Forun Internacional del Software Libre (FISL) donde hube un track solo de mujeres speaker's organizado pelas PyLadies\n* En FISL hubo una chica de doze años entre los speaker's, Larissa Oliva\n* Es la primera experiencia de crowfunding para cobrir los gastos de las chicas (translado, alojamiento), pues muchas eran estudiantes apenas\n* Inicialmente no habia muchas submissiones de mujeres para la PyCon Brazil\n* En las listas internas de discussion de PyLadies se empeza un movimento de brainstorming, surgen muchas ideas para temas de posibles charlas\n* Se empezan las submissiones y una otra campaña de crowfunding, a que se suman tres empresas comos sponsors\n* En la lista de discusión brasileña se llega a un consenso que no es suficiente tener un Código de Conduta, se decide implementarlo como explicado em https://www.coc-handbook.com/\n* Yo he participado en el time de respuesta, relato de los acertos y errores, en la condución del Código de Conduta. Fueron siete las ocorrências. \n* Talleres para iniciantes junto con los sprints.\n* Experiencias compartidas de los organizadores de las PyCon's anterores (una forma de inclusión de los mayores).\n* Explicación del Manifesto Pybr12: sticker con los principios de inclusión de la conferencia 2016. Distribuido a todos los participantes. Manifesto abajo:\n* Respetar a las personas. Las diferencias hacen mejor comunidad mejor. Sea paciente (con los demás, con el diferente, con principiantes). Todos somos diferentes. Todos somos maravillosos. (PyCon Japón). Abraze las causas que usted cree. Ayudar a quienes tienen dificultades. Proteger a las personas que están en necesidad. Personas - Tecnología.\n* Django Girls en la PyCon: intercambio con Anitas, una iniciativa local que logro aumentar la diversidad de las chicas (hube participación de muchas chicas de humanas y biológicas).\n\nSlides\n\nhttp://ar.pycon.org/proposals/document/15/10467b62-28c9-4603-b3ae-6a299cd14835.pdf",
  "duration": 2258,
  "language": "spa",
  "recorded": "2016-11-25",
  "related_urls": [
    "https://www.coc-handbook.com/",
    "http://ar.pycon.org/proposals/document/15/10467b62-28c9-4603-b3ae-6a299cd14835.pdf"
  ],
  "speakers": [
    "Fernando Masanori Ashikaga",
    "Paola Katherine"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ekBHdG0dSgM/maxresdefault.jpg",
  "title": "import pybr12: experiencias de inclusión en la última PyCon Brazil",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ekBHdG0dSgM"
    }
  ]
}
