{
  "copyright_text": "Standard YouTube License",
  "description": "PyconAR 2016 - Bahía Blanca\n\nProcesamiento del Lenguaje Natural en el Congreso de la Nación por Ignacio Heredia, Martin Elias Costa\n\nAudience level: Intermedia\n\nDescripción\n\nEn esta charla contaremos cómo implementamos una herramienta en Python que permite categorizar de forma sugerida (mediante aprendizaje automático), y reconocer temáticas repetidas (mediante procesamiento del lenguaje natural) aplicado al manejo de información de los informes mensuales que envía el Congreso Nacional al Poder Ejecutivo.\n\nResumen\n\nEl Congreso de la Nación envía cada mes un pedido de informe al Poder Ejecutivo Nacional con 1.000 preguntas. Estas deben ser organizadas y categorizadas para recolectar toda la información relevante, repartida entre todas las dependencias del Estado.\n\nAl no estar estructurada, el manejo de este tipo de información es costoso y consume mucho esfuerzo humano. Hay que identificar manualmente temáticas y asignar áreas responsables que se encarguen de redactar las respuestas.\n\nLas técnicas actuales del procesamiento del lenguaje natural (NLP) y aprendizaje automático (machine learning) permiten agilizar estos procesos y lograr una mejor dinámica al momento de generar los informes.\n\nEn esta charla contaremos cómo implementamos una herramienta en Python que permite categorizar de forma sugerida (mediante aprendizaje automático), y reconocer temáticas repetidas (mediante procesamiento del lenguaje natural).\n\nSlides\n\nhttps://github.com/datosgobar/presentacion-nlp-congreso-nacion",
  "duration": 2244,
  "language": "spa",
  "recorded": "2016-11-25",
  "related_urls": [
    "https://github.com/datosgobar/presentacion-nlp-congreso-nacion"
  ],
  "speakers": [
    "Ignacio Heredia",
    "Martin Elias Costa"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/_sTXgCJKZWY/maxresdefault.jpg",
  "title": "Procesamiento del Lenguaje Natural en el Congreso de la Nación",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_sTXgCJKZWY"
    }
  ]
}
