{
  "copyright_text": "Standard YouTube License",
  "description": "PyconAR 2016 - Bahía Blanca\n\n\"Psycoanálisis\" de Sistemas por Javier Derderyan\n\nAudience level: Intermedia\n\nDescripción\n\nEl Psicoanálisis y la Programación parecen ir por 2 vías distintas. Hasta que vemos la principal la herramienta que las 2 disciplinas utilizan: El Lenguaje.\n\nEn esta charla daré una introducción básica a lo que con del Psicoanálisis que podemos utilizar en el día a día, y que no solamente nos ayuda a mejorar el \"código\", sino que apunta a el origen de todo problema -y solución-: el sujeto.\n\nResumen\n\nMás de 100 años de investigación psicoanalítica sobre la mente humana han ayudado a comprender mucho mejor los procesos psíquicos que determinan a lo que conocemos como \"sujeto\".\n\nY ese \"sujeto\", uno de los objetos de estudio del psicoanálisis, es el mismo que cada día se sienta frente a la pantalla para escribir código.\n\nQué herramientas nos aporta el Psicoanálisis a los programadores? Como las utilizamos cada día? Que aportan más alla de lo que hacemos frente a la pantalla?\n\nQue automatismos y Estructuras Psíquicas determinan sobre lo que hacemos cada día?\n\nY, lo más importante: como utilizar a favor nuestro eso mismo que todo los días nos usa a nosotros?\n\nSlides\n\nhttp://ar.pycon.org/proposals/document/4/06517e83-4897-411d-a07b-b8d189ab199b.pdf",
  "duration": 2718,
  "language": "spa",
  "recorded": "2016-11-25",
  "related_urls": [
    "http://ar.pycon.org/proposals/document/4/06517e83-4897-411d-a07b-b8d189ab199b.pdf"
  ],
  "speakers": [
    "Javier Derderyan"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/OABGiW3I_9s/maxresdefault.jpg",
  "title": "\"Psycoanálisis\" de Sistemas",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OABGiW3I_9s"
    }
  ]
}
