{
  "copyright_text": "Standard YouTube License",
  "description": "PyconAR 2016 - Bahía Blanca\n\nPoniéndonos un poco mas serio con Kivy por Sofia Martin y Ariel Farkas\n\nAudience level: Intermedia\n\nDescripción\n\nKivy es un framework para crear apliocaciones para computadoras y móviles. Hace poco tiempo empecé a trabajar con este framework, si bien nunca había programado para móviles ya que no podía hacerlo en Python, no fue difícil el comienzo de su utilización. A medida que la app iba requiriendo características más avanzadas fui experimentando inconvenientes.\n\nResumen\n\nEl desarrollo de aplicaciones móviles genera la necesidad del manejo de características diferentes a las propias de la programación para computadoras. Dado que el lenguaje nativo para aplicaciones para Android es Java, al utilizar un framework en Python surgen algunas dificultades complejas de resolver. La programación utilizando Kivy requiere además de la programación en Python, un tipo de archivo donde se describen los componentes de la aplicación, denominados widgets. Dichos objetos tienen caracterísitcas propias que facilita su programación para el funcionamiento, dado que separa el código del lenguaje Python de la estructura necesaria para armar la app. Este formato de archivos se denomina como lenguaje kv, el cual es propio de este framework.\n\nConexión entre archivos Python y kv\n\nPara llevar a cabo la modificación de los widgets, se debe acceder al objeto propio que lo representa, este acceso se puede realizar de varias maneras, descripción de la organización en los archivos kv.\n\nUtilizanción de widgets\n\nDescripción de varios widgets propios de Kivy utilizados detallando sus facilidades y dificultades encontradas en el desarrollo de aplicaciones.\n\nRecuperación de la app al minimizarse\n\nManejo de las aplciaciones para ser recuperadas luego de ser minimizadas y su relación con Android.\n\nConexión entre dos dispositivos por red\n\nDescripción de una librería utilizada para la sincronización a través de la red entre dos dispositivos móviles.",
  "duration": 3046,
  "language": "spa",
  "recorded": "2016-11-25",
  "related_urls": [],
  "speakers": [
    "Sofia Martin",
    "Ariel Farkas"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/IPV613aPt-0/maxresdefault.jpg",
  "title": "Poniéndonos un poco mas serio con Kivy",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=IPV613aPt-0"
    }
  ]
}
