{
  "copyright_text": "Standard YouTube License",
  "description": "PyconAR 2016 - Bahía Blanca\n\nCompartiendo memoria eficientemente con proxies por Claudio Freire\n\nAudience level: Avanzada\n\nDescripción\n¿Cuántas tuviste que escalar, con multiprocessing, o tu framework favorito? ¿Notaste que los requisitos de memoria se te iban a las nubes? Presentaré una lib recién salida de la panadería, sharedbuffers, y las técnicas y conceptos detrás de la misma. Cómo crear segmentos de memoria compartida, cómo usarlos para compartir objetos y estructuras complejas, e incluso que no entran en memoria.\n\nResumen\nLa charla intenta exponer dos cosas:\n\nPor un lado, técnicas interesantes para compartir memoria de forma eficiente en Python, algo que suele ser complejo con las herramientas normalmente a disposición de los desarrolladores.\nPor otro lado, expone una librería que hice a tal efecto, sharedbuffers, con el objetivo de hacer la tarea más sencilla para el próximo que intente.\nSe van a cubrir conceptos de alto nivel, aptos para usuarios intermedios, como es el uso de la librería, pero para poder sacar el provecho máximo a la charla, en particular la segunda parte en que se exponen los detalles de la implementación, es necesario tener conocimientos más avanzados. Así que la estoy marcando como una charla avanzada.\nY sí, no tengo ni idea si se dice librería o biblioteca. Pero se instala en /usr/lib así que yo le digo librería :-p\nEl flujo de la charla está planeado a grandes rasgos como sigue:\n\nMotivación 4'\nEl cache que no entra en memoria 7 veces\nCuando el costo de serialización se vuelve prohibitivo\nTransición de un cache a un bundle compartido\n\nEjemplo rápido 3'\nBase de user agents de 30GB\n\nLa técnica por arriba 12'\nCompartiendo un buffer de bytes mediante archivos mapeados 2'\nEmbebiendo objetos simples en el buffer 5'     Definición de schemas 2'     Manipulación sin deserialización con proxies 3'\nComplejizando los objetos 5'     Colecciones 1'     Estructuras jerárquicas 2'     Estructuras cíclicas 2'\nLa técnica a bajo nivel 16'\nEstructura en memoria de un objeto 4'     Atributos con tipos estáticos     Wrappers con RTTI para atributos con tipo dinámico\nSecuencias lineales 4'\nMapeos 8'     El hash table compacto 5'     Características de performance 3'\nLogrando que vaya rápido 6'\nCython magic 3'\nReuso de proxies, transmutación de tipos 3'\nEl futuro 4'\nCompatibilidad/chequeo de schemas 1'\nProxies transparentes transmutando mixins 1'\nEstructuras mutables y lockless 2'\nPreguntas\n\nSlides:\nSlides de la charla, en formato pdf\nSlides de la charla, en formato libreoffice",
  "duration": 2501,
  "language": "spa",
  "recorded": "2016-12-17",
  "related_urls": [],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/8zfagJjvFyo/maxresdefault.jpg",
  "title": "Compartiendo memoria eficientemente con proxies",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8zfagJjvFyo"
    }
  ]
}
