{
  "description": "Cecilia Tivir, Carina Matimbe\n\nhttps://2018.za.pycon.org/talks/35-bring-django-girls-workshop-to-mozambique/\n\nIn Mozambique, as well as in other African countries, ICT is still seen as being exclusively for boys. Social norms do not teach women to choose coding or others ICT areas.\r\n\r\nBringing Django Girls Workshop to Maputo was meant to teach girls more than how to code and create amazing blogs, we also wanted to use it as a platform to create opportunities that would empower them and promoting the diversity in technology.\r\n\r\nToday we have started to hold small and informal meetings to teach girls and boys how to program in python. Some of the girls who have participated in Django Girls Maputo workshops have continued to learn more  and develop their skills. We hope to have more girls learn how to code in python so they can also share their experiences.\r\n\r\nOur talk will cover the importance of how bringing Django Girls community to our girls in Mozambique  and how powerful  it was, is and it will be to bring them to demonstrate their abilities, skills and belief in their capabilities.\r\n\r\nThe message we intend to cover to the audience is that Django Girls is not only for a some women, but it's for all women that we can reach, so that we can encouraging more women to strive for programming careers benefits the tech community at large and also is a way to give them tools and show them the way that they can empower themselves and  contribute in technological development, so that better the societies they are situated in.\r\n\r\nOne of the most amazing feedbacks that we got was: \"In this event it is possible to realize that anyone is capable of developing technological tools. Django Girls has come to say that women are capable of programming, coding and creating technological solutions\".\n\npyconza2018\n\npython",
  "duration": 2299,
  "language": "eng",
  "recorded": "2018-10-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2018.za.pycon.org/"
    },
    {
      "label": "https://2018.za.pycon.org/talks/35-bring-django-girls-workshop-to-mozambique/",
      "url": "https://2018.za.pycon.org/talks/35-bring-django-girls-workshop-to-mozambique/"
    }
  ],
  "speakers": [
    "Cecilia Tivir",
    "Carina Matimbe"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/q7wzAZlpdnM/maxresdefault.webp",
  "title": "Bring Django Girls Workshop to Mozambique.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=q7wzAZlpdnM"
    }
  ]
}
