{
  "description": "Diana Pholo\n\nhttps://2018.za.pycon.org/talks/45-python-as-a-tool-for-e-health-systems/\n\nE-health has proven to have many benefits including reduced errors in medical diagnosis.\nA number of machine learning (ML) techniques have been applied in medical diagnosis, each\nhaving its benefits and disadvantages.\nWith its powerful pre-built libraries, Python is great for implementing machine learning in the medical field, where many people do not have an Artificial Intelligence background.\n\nThis talk will focus on applying ML on medical datasets using Scikit-learn, a Python module that comes packed with various machine learning algorithms. It will be structured as follows:\n\n‹ul›\n    ‹li›An introduction to e-health.‹/li›\n    ‹li›Types of medical data.‹/li›\n    ‹li›Some Benchmark algorithms used in medical diagnosis: Decision trees, K-Nearest Neighbours, Naive Bayes and Support Vector Machines.‹/li›\n    ‹li›How to implement benchmark algorithms using Scikit-learn.‹/li›\n    ‹li›Performance evaluation metrics used in e-health.‹/li›\n‹/ul›\n\nThis talk is aimed at people interested in real-life applications of machine learning using Python. Although centered around ML in medicine, the acquired skills can be extended to other fields.\n\nAbout the speaker: Diana Pholo is a PhD student and lecturer  in the department of Computer Systems Engineering, at the Tshwane University of Technology.\n\npyconza2018\n\npython",
  "duration": 2094,
  "language": "eng",
  "recorded": "2018-10-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2018.za.pycon.org/"
    },
    {
      "label": "https://2018.za.pycon.org/talks/45-python-as-a-tool-for-e-health-systems/",
      "url": "https://2018.za.pycon.org/talks/45-python-as-a-tool-for-e-health-systems/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "DianaPholo",
    "pyconza",
    "pyconza2018",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/CmVK87fkh2U/maxresdefault.webp",
  "title": "Python as a tool for e-health systems",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CmVK87fkh2U"
    }
  ]
}
