{
  "description": "Helge Reikeras\n\nhttps://2018.za.pycon.org/talks/30-the-developers-guide-to-data-science/\n\nThe myth of data science holds that you need an army of machine learning PHDs to be able to implement anything impactful with data science. In this talk I will attempt to dispel this myth and show how software developers can skip getting the machine learning PHD and start building awesome software with Data Science and Machine Learning today.\n\nI believe developers are well situated to implement data science projects as they possess the understanding of how the product works, how users like to interact with the product and their opinions are already valued within the business.\n\nTo help developers level up their data science skills, I’ll discuss the core concepts behind the most prevalent methods in data science, how the data science process works, how to think like a data scientist, which frameworks and programming languages to choose (surprise Python!) and how to measure and communicate the value-add of data science projects to the business.\n\n‹em›About the speaker: Helge Reikeras is a Data Scientist at Offerzen with over 6 years experience in practical data science and has also worked as a software developer at various points in his career.\n‹/em›\n\npyconza2018\n\npython",
  "duration": 2402,
  "language": "eng",
  "recorded": "2018-10-11",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2018.za.pycon.org/"
    },
    {
      "label": "https://2018.za.pycon.org/talks/30-the-developers-guide-to-data-science/",
      "url": "https://2018.za.pycon.org/talks/30-the-developers-guide-to-data-science/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "HelgeReikeras",
    "pyconza",
    "pyconza2018",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/Krgp7A21-Y4/maxresdefault.webp",
  "title": "The Developer's Guide to Data Science",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Krgp7A21-Y4"
    }
  ]
}
