{
    "description": "### Django: A Framework for perfectionists with deadlines\n1. Batteries included: Security, Authentication, Authorization, Administration, robust and mature ORM, etc.\n2. Opinionated: Django defines the right path for doing things with it. And this open doors for building extensions.\n3. Strong Community: Open source packages, events, meetups, active development of the main framework\n\n### Django's performance issue is a thing. We need to be careful with:\n1. Avoiding N+1s\n2. Caching\n3. Database indexes\n4. Data denormalization\n5. Running operations in the background\n\n### Why running operations in the background?\n* Each Django process loads the framework core\n* It's expensive to have too many processes\n* Requests hold one Django process each while being processed\n* Requests should be processed quickly so we don't hold a process for too long\n* We need to give feedback to the user quickly, so they can move forward with other operations\n\n### What is Celery?\nAsynchronous task queue or job queue which is based on distributed message passing\n\n### Why Celery?\n1. Distributed: It separates async tasks execution from your application\n2. Fast: Celery has a very small boilerplate and executes tasks REALLY fast\n3. Integrated: You can write Celery tasks within your application, with access to models, services, functions, classes, etc\n\n### Celery 💘 Django\n1. Documentation: We have dedicated docs for integrating them both\n2. Django Settings: You can configure Celery from Django settings, not extra boilerplate\n3. Django within tasks: Access to Django ORM and other tools on Celery tasks\n4. Community: There are packages for enhancing the integration\n\n### How does it look like?\nReal world example\n\n### What async tasks can be used for?\n* Delegate long lasting jobs\n* Execute remote API calls\n* Prepare and cache values\n* Spread bulk database insertions over time\n* Execute recurring jobs\n\n### How does it work under the hood:\n1. Django uses Celery client to queue a message on the Broker\n2. Celery watches the Broker queue\n3. Celery marks a task as started so other workers don't pick it\n4. Celery marks a task as succeeded\n5. Celery send the result to the Results Backend\n6. Django may read the result from the Results Backend or not\n**Disclaimer:** these steps may vary depending on your configuration.\n\n\n### Tough love 💔: As in every good love story, it isn't always rainbows and butterflies.\n* All connections between a service and the other may fail\n* Concurrency becomes your enemy\n* Failures may be harder to handle as they aren't sync anymore\n* Issues that only happens in production\n* Tasks that never finish\n* Infinite retries\n* Conflicting operations\n* Task runs more than once\n* Unbalanced queues\n* Periodic tasks that are queues again before the previous one starts\n* Outdated data\n\n### We're going to focus on these four problems:\n1. Outdated data\n3. Error feedback\n2. Duplicate runs\n4. Conflicting ops\n\n### Outdated data\n* Sending complex data as parameters to a Celery task may result in conflicts because we cannot ensure the data doesn't change between the task being schedule and its execution.\n* We must, as much as possible, pass ids and retrieve the most up-to-date data in the scope of the task.\n\n### Duplicate runs\n* Depending of your Celery setup and task configuration, it may not be guaranteed that the task runs only once:\n- Multiple workers may pick the same task at the same time\n- A task may be interrupted and requeued\n\n* So we have to ensure:\n  - Atomicity\n  - Idempotence\n\n### Complex feedback loops for errors\n* User may receive a success message from the request but the whole operation may still fail.\n* We need to develop flows that take this possibility into consideration and give the user a feedback of this error.\n* We may also need to undo successful operations run by the web service.\n\n### Conflicting operations\n* While a task haven't still run another operation is triggered by the user. This operation conflicts with the one that is still pending.\n* Consider the following use cases:\n1. User can add notes\n2. User can delete a note\n3. User can bulk create copies of a note\n\n#### Example of problematic interaction: \n1. User creates a Note\n2. User creates 10 copies of the note, this runs in a background task\n3. User deletes the original note before the task to copy the 10 notes runs\n4. Task runs, but the original note isn't available anymore so it cannot be copied\n\n#### There are many solutions to this:\n* Implementing soft delete on the note so it's available even after delete\n* Canceling pending tasks before deleting\n* Locking notes with pending operations\n\n### Couples therapy pt1 (or some tips that help the relationship to flow)\n* Will retry tasks? use exponential backoffs\n* Tasks shouldn't raise exceptions: handle all of them and send reports\n* Monitoring is essential, celery-flower can help\n* ALWAYS_EAGER makes your tasks synchronous and can help on debugging and development\n* RDB is a remote debugger, it can help debug celery tasks\n\n### Couples therapy pt2 (knowing the boundaries of the relationship)\n* Celery is excellent for asynchronous tasks and for doing simple jobs. For complex workflows it may not be very reliable, there are open issues for that, and many complaints of lost tasks and unpredictable behaviors.\n* Long running tasks may be problematic. Ideally split the task into smaller ones or use a different tool.\n* Monitoring tools are very limited. You may need to implement some monitoring yourself. Ex.: queues heartbeat.",
    "language": "eng",
    "recorded": "2024-09-25",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2024.djangocon.us"
        },
        {
            "label": "Talk Webpage",
            "url": "https://2024.djangocon.us/talks/django-celery-a-love-story-of-async-proportions/"
        }
    ],
    "speakers": [
        "Hugo Bessa"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/NCXtXDn4ppk/maxresdefault.jpg",
    "title": "Django & Celery: A love story of async proportions",
    "videos": [
        {
            "type": "youtube",
            "url": "https://youtu.be/NCXtXDn4ppk"
        }
    ]
}
