{
    "description": "The talk will provide an overview of the available Python related geospatial tools that can be used to analyze location data highlighting the possibilities and the potential of this attendees will be able to grasp what tools they can use to access particular location data.\nAmong the available python geospatial tools we will discuss the main and most used in accessing location data types raster and vector, we will have a look at how these base tools can be used to access the types and their benefits.\nWe will then dive into one of the tools called QGIS and use it as an exemplar of how we can now interact, analyze, and visualize geospatial data in Python. A step-by-step guide on how to import and use QGIS features in Python.\nQGIS is a freely downloadable open-source GIS software suite that contains a desktop option, mobile, and web components. QGIS version 3.14 was released with a Temporal Controller an interesting feature that allows immersive and creative visualization of time-based geospatial data.\nThen we will see how QGIS can be used inside Django as a package. Showing how to achieve a link between the two tools. \nAt the end of the talk attendees should expect to have a comprehensive understanding of different Python geospatial tools, whether you are a developer or a professional learning new ways of technology, this talk will equip you with the knowledge on the right geospatial tools.",
    "language": "eng",
    "recorded": "2024-09-23",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2024.djangocon.us"
        },
        {
            "label": "Talk Webpage",
            "url": "https://2024.djangocon.us/talks/open-source-python-tools-to-visualize-and-analyse-geospatial-data/"
        }
    ],
    "speakers": [
        "Samweli Mwakisambwe"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/p6ioi-dWtpc/maxresdefault.jpg",
    "title": "Open-source Python tools to visualize and analyse geospatial data.",
    "videos": [
        {
            "type": "youtube",
            "url": "https://youtu.be/p6ioi-dWtpc"
        }
    ]
}
