{
    "description": "Lacey Henschel will moderate a panel discussion on the history and future of communities within the Django community.\nWe'll explore how mentoring, community involvement, and support networks are important in keeping Django resilient. By highlighting the work of groups like Django Girls, PyLadies, Djangonaut Space, and Black Python Devs, we’ll see how these initiatives not only foster personal growth but also play a vital role in keeping the Django community strong and sustainable for the long term.\n\nWe’ll discuss:\n\n- Panelists' unique journeys in the Django community\n- The role of mentorship, sponsorship, and advocacy in these communities and in Django's future\n- Successes and challenges in building supportive, sustainable communities\n- How the Django community can keep investing in long-term success\n\nOur panelists include:\n- **Lacey Henschel**, moderator, former Django Girls contributor and organizer\n- **Keanya Phelps**, Django Girls organizer and participant, mentor in Djangonaut Space\n- **Afi Maame Dufie**, involved in Django Girls, PyLadies, and Black Python Devs\n- **Sarah Boyce**, Django Fellow, co-founder and mentor in Djangonaut Space\n- **Carlton Gibson**, former Django Fellow, mentor in Djangonaut Space, mentor and coordinator of Django's efforts in Google Summer of Code, and Django Girls coach and advisory board member.\n- **Velda Kiara**, DEFNA director, former [AnitaB.org](http://anitab.org/) Kenya Community Lead, former Open Source Community Africa Nairobi organizer and contributor, participant in Djangonaut Space, and current contributor and leader of Black Python Devs\n\nJoin us as we reflect, explore, and hopefully inspire even more excitement and support for our broader Django communities.",
    "language": "eng",
    "recorded": "2024-09-25",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2024.djangocon.us"
        },
        {
            "label": "Talk Webpage",
            "url": "https://2024.djangocon.us/talks/panel-discussion-mentoring-django/"
        }
    ],
    "speakers": [
        "Lacey Henschel"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/SzrgDmMBipo/maxresdefault.jpg",
    "title": "Panel Discussion: Open, friendly, and welcoming: on the history and future of mentoring in Django",
    "videos": [
        {
            "type": "youtube",
            "url": "https://youtu.be/SzrgDmMBipo"
        }
    ]
}
