{
  "description": "PyData\nWebsite: www.pydata.org\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nThe proposed presentation offers a comprehensive exploration of the fundamental principles of Quantum Machine Learning (QML), focusing on its practical applications, current challenges, and future prospects. Throughout the talk, we will address the following key issues:\n\nIntroduction to Quantum Computing: We will define the concept of quantum computing and illustrate its utility and potential. We will explore whether the time has come to use this technology and the challenges and opportunities within the realm of quantum technology.\nProgramming and Operations Basics: We will explain how to program a quantum computer and discuss the Python libraries available to facilitate the approach to this innovative technology.\nFundamentals of Quantum Machine Learning: We will delve into the advantages offered by Quantum Machine Learning compared to classical machine learning, highlighting the peculiarities that characterize this emerging discipline.\nQuantum Computers and Libraries: We will analyze the tools available to Python users for experimenting with quantum computers and how to integrate them into the learning and development process.\nApproach to the Topic: We will provide practical advice on how to approach this subject, illustrating effective ways to start learning and using Quantum Machine Learning.\nThe target audience consists of professionals, students, and machine learning enthusiasts interested in exploring the potential of QML, without necessarily possessing an in-depth knowledge of quantum physics. Our goal is to offer a comprehensive and accessible overview of this fascinating interdisciplinary field, encouraging involvement and active learning in this innovative sector.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1930,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2024/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/5mi11iUqsIM/maxresdefault.jpg",
  "title": "Andrea Melloncelli - Quantum Artificial Intelligence | PyData London 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5mi11iUqsIM"
    }
  ]
}
