{
  "description": "PyData\nWebsite: www.pydata.org\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nThe Togolese Ministry of Health distributes contraceptives to women across the country every year. The Ministry employs two different types of interventions (open days at district health clinics, and mobile clinics that travel to remote regions), implemented multiple times in a year and in different districts, to achieve an annual target of the number of women reached (i.e. coverage). However, the two types of intervention have varying costs and varying efficacy in reaching women in different districts. This makes planning and budgeting for the interventions while also achieving a desired coverage extremely challenging for the Ministry. In this talk, we will explore how this problem may be tackled using linear programming to optimize how the two interventions are implemented across districts and at multiple timepoints annually. We analyze historical data and leverage optimization models to tailor implementation of the two interventions to ensure cost-effectiveness while meeting coverage targets. We also discuss different variants of the optimization model to introduce flexibility and customization for managing resources, the assumptions involved, and their utility in improving intervention planning. Attendees will gain insight into the technical complexities of implementing linear optimization models, the challenges involved in using them for decision-making, and its potential to help efficiently allocate scarce resources. Suitable for data professionals interested in implementing data-driven solutions to improve resource allocations under specific constraints. No prior knowledge required.\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1536,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2024/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/2wakeYj7ad4/maxresdefault.jpg",
  "title": "Carlos Samey - Linear Programming for Resource Allocation | PyData London 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2wakeYj7ad4"
    }
  ]
}
