{
  "description": "Dr. Adam Hill : Mastering Data Flow: Empower Your Projects with Prefect's Pipeline Magic | PyData London 2024\n\nEmbark on a transformative journey into the realm of data engineering with our 90-minute workshop dedicated to Prefect 2. In this hands-on session, participants will learn the ins and outs of building robust data pipelines using the latest features and enhancements of Prefect 2. From data ingestion to advanced analytics, attendees will gain hands-on experience and practical insights to elevate their data engineering skills.\n\nJoin us for an engaging workshop where we'll dive deep into the world of data engineering with Prefect 2.19. Throughout the session, participants will explore the following key topics:\n\nOverview of Prefect and its core features\nUnderstanding the Prefect ecosystem and its integration with popular data science tools\nSetting up a Prefect environment: Installation, configuration, and project setup\nBuilding Data Pipelines:\n- Data ingestion: Fetching data from various sources including RSS feeds, APIs, and databases\n- Data transformation and manipulation using Prefect tasks and flows\n- Data storage and persistence: Storing processed data into local databases such as MongoDB or SQL\n- Integrating machine learning models for advanced data processing and analysis within Prefect workflows\n\nAdvanced Techniques and Best Practices:\n- Implementing error handling and retry strategies for fault tolerance and reliability\n- Sending real-time alerts and notifications based on pipeline analysis using Prefect's notification features\n- Exploring Prefect's advanced features such as parallel execution, versioning, and dependency management\n\nWorkshop Materials and Requirements:\nParticipants will have access to workshop materials, including code examples, instructions, and sample datasets, which will be provided in advance via GitHub. To ensure seamless participation, attendees are required to have Docker installed on their machines as we'll be running services locally through Docker or utilising free cloud services for certain components.\n\nBy the end of the workshop, attendees will have gained a comprehensive understanding of Prefect 2 and its capabilities, empowering them to design, execute, and optimise data pipelines efficiently in real-world scenarios.\n\nWe invite you to join us on this exciting journey of mastering data flows with Prefect!\n\nTo prepare for the workshop check out the github repo here: https://github.com/Cadarn/PyData-Prefect-Workshop/tree/main - we will update it nearer to the tutorial but there are some preparatory steps that will make things smoother on the day.\nTo participate fully in this workshop you will need the following:\n1. A Python environment (I will be using Python 3.12 but everything should work with a recent version of Python)\n2. A local install of Docker; we will use Docker to run some additional services locally\n- Pull a copy of the PostgreSQL v13 image\n- Pull a copy of python:3.11-slim image\n3. Create an account on Upstash, https://upstash.com/ - you will only need the free tier\n- You will need to create a free Kafka cluster\n4. Create an account on MongoDB Atlas, https://www.mongodb.com/cloud/atlas/register - we will be using the free tier again\n\n===\n\nWebsite: www.pydata.org\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 5102,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2024/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://www.mongodb.com/cloud/atlas/register",
      "url": "https://www.mongodb.com/cloud/atlas/register"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    },
    {
      "label": "https://github.com/Cadarn/PyData-Prefect-Workshop/tree/main",
      "url": "https://github.com/Cadarn/PyData-Prefect-Workshop/tree/main"
    },
    {
      "label": "https://upstash.com/",
      "url": "https://upstash.com/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/yIDBsHwTaa8/maxresdefault.jpg",
  "title": "Dr. Adam Hill - Empower Your Projects with Prefect's Pipeline Magic | PyData London 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yIDBsHwTaa8"
    }
  ]
}
