{
  "description": "Uplift Modeling: How to Enhance Customer Targeting in Marketing with \n\nCausal inference has traditionally been used in the field of marketing. Uplift modeling is one of the major techniques of customer analytics and it helps companies to identify customers with the highest marketing effect when targeted.\nIn recent years, algorithms combining causal inference and machine learning have been a hot topic. CausalML is a good Python package developed by Uber and it provides a suite of uplift modeling and causal inference methods.\nIn this talk, I will show the key concepts of causal inference with machine learning, their application in marketing science (Uplift modeling), their demonstration using CausalML, and practical tips.\n\nAgenda:\n\nWhat is Causal Inference?\nWhat is Causal Inference with Machine Learning (Causal Machine Learning)?\nCommon mistakes in measuring effectiveness in Marketing\nUse Case #1 : Measuring Treatment Effects\nUse Case #2 : Uplift Modeling\nDemo using CausalML\nQ&A\nKey Takeaways:\n- You will understand the key concepts and major approaches of Causal Inference with Machine Learning.\n- You will learn how to build Uplift Modeling using CausalML.\n\nTarget Audience:\n- Data analysts and data scientists who are interested in marketing science or customer analytics.\n- Data analysts, data scientists, data engineers, software developers, or other IT specialists who want to collaborate with marketing teams more effectively.\n- Marketers or executives who want to improve customer segmentation and targeting accuracy\n\nSlide :\nhttps://docs.google.com/presentation/d/1EMWZb-0QgiytdiL2a3IgsJjbcq1s3MiuTXewzDEfH18/edit#slide=id.g291fdbf3396_0_6\n\nDemo Code :\nhttps://github.com/takechanman1228/Effective-Uplift-Modeling\n\nPyData\nWebsite: www.pydata.org\nLinkedIn: https://www.linkedin.com/company/pydata-global\nTwitter: https://twitter.com/PyData\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 2250,
  "language": "eng",
  "recorded": "2024-06-14",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/london2024/"
    },
    {
      "label": "https://www.linkedin.com/company/pydata-global",
      "url": "https://www.linkedin.com/company/pydata-global"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/takechanman1228/Effective-Uplift-Modeling",
      "url": "https://github.com/takechanman1228/Effective-Uplift-Modeling"
    },
    {
      "label": "https://docs.google.com/presentation/d/1EMWZb-0QgiytdiL2a3IgsJjbcq1s3MiuTXewzDEfH18/edit#slide=id.g291fdbf3396_0_6",
      "url": "https://docs.google.com/presentation/d/1EMWZb-0QgiytdiL2a3IgsJjbcq1s3MiuTXewzDEfH18/edit#slide=id.g291fdbf3396_0_6"
    },
    {
      "label": "https://twitter.com/PyData",
      "url": "https://twitter.com/PyData"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/GH7xOPCIfIQ/maxresdefault.jpg",
  "title": "Hajime Takeda- How to Enhance Customer Targeting in Marketing - Pydata London 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GH7xOPCIfIQ"
    }
  ]
}
