{"whiteboard": "ia scrape", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon ZA 2014", "speakers": ["Vinod Kurup"], "title": "Reaching Beyond the Web", "quality_notes": "", "video_flv_length": null, "recorded": "2014-10-03", "video_mp4_length": null, "description": "Using RapidSMS to power democracy in Libya.\nAs web developers, we often think of the web as being a ubiquitous resource, available to everyone. The truth is that there are still large groups of people who have either limited or no web access. In addition, there are people who have excellent web access, yet still prefer to use simpler tools to connect to others. How can we reach these groups of people? While not perfectly ubiquitous, SMS technology is much more widespread, especially in areas that don't have great internet connectivity. It's also ubiquitous in the sense that people who have excellent internet access still use SMS frequently.\nThe government of Libya recently implemented a voter registration system and chose to use SMS as the implementation technology, largely because of these reasons. In this talk, I will explain how we used RapidSMS, a Django-based SMS framework, to build this groundbreaking voter registration system. We will discuss the basics of the RapidSMS framework, and show concrete examples from our Libyan project. I will mostly describe concepts at a high level, though familiarity with Python code may help you understand the details.\nIf you truly want your tools to reach everyone, adding SMS connectivity will spread the power of your web apps.", "video_mp4_url": "http://archive.org/download/pyconza2014-reaching-beyond-the-web/14%20A%20Reaching%20Beyond%20the%20Web-.mp4", "tags": ["pyconza", "pyconza2014"], "copyright_text": "http://creativecommons.org/licenses/by/3.0/", "related_urls": [], "video_flv_download_only": false, "source_url": "http://archive.org/details/pyconza2014-reaching-beyond-the-web", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "http://archive.org/download/pyconza2014-reaching-beyond-the-web/14%20A%20Reaching%20Beyond%20the%20Web-.ogv", "language": "English", "video_webm_length": null, "summary": "The government of Libya recently implemented a voter registration system and chose to use SMS as the implementation technology, In this talk, I will explain how we used RapidSMS, a Django-based SMS framework, to build this groundbreaking voter registration system.", "thumbnail_url": "http://archive.org/download/pyconza2014-reaching-beyond-the-web/pyconza2014-reaching-beyond-the-web.thumbs/14%20A%20Reaching%20Beyond%20the%20Web-_000450.jpg", "video_flv_url": ""}