{
  "id": 3827, 
  "category": "PyCon ZA 2014", 
  "slug": "the-elephant-in-the-web-application", 
  "title": "The elephant in the web application", 
  "summary": "Developing a web application today is an unnecessarily cumbersome and error prone task. It is time for web frameworks to evolve and become more like graphical user interface (GUI) frameworks", 
  "description": "In this talk, I'd like to convince you that developing a web application today is an unnecessarily cumbersome and error prone task. It is time for web frameworks to evolve and become more like graphical user interface (GUI) frameworks: these provide abstractions called \"windows\" or \"widgets\" that let a programmer write an application using terms that describe what is being built, with less (if any) focus on the underlying technologies needed to accomplish drawing these items on a screen.\nA web application programmer (in contrast to a GUI programmer) needs to know quite a few different technologies and a fair bit of effort is required to orchestrate these tools into achieving an end result: a template language, HTML, HTTP, CSS, JavaScript, etc. Reusing something substantial is especially difficult, which means in a sizeable web application the same dragons need to be fought several times over. If a programmer has to constantly deal with all this subject matter, it takes focus away from what actually needs to be built: the application itself.\nWhy are we putting up with having to know HTML and similar low-level technologies? Is it an elephant in the room? Something we pretend not to see, yet we accept the burden of having to work around it?\nI will show you what it takes to build a web application; what repetitive tasks there are and what a programmer needs to be aware of. I hope to convince you that there's a better way, and that what was perhaps an idealistic dream a decade ago can now be done - not only by our own fully-featured Python web framework (Reahl), but also by a small number of others beyond the realm of Python.", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/", 
  "thumbnail_url": "http://archive.org/download/pyconza2014-elephant-in-the-web-app/pyconza2014-elephant-in-the-web-app.thumbs/2%20A%20The%20elephant%20in%20the%20web%20application-_001410.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://archive.org/download/pyconza2014-elephant-in-the-web-app/2%20A%20The%20elephant%20in%20the%20web%20application-.mp4", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "http://archive.org/download/pyconza2014-elephant-in-the-web-app/2%20A%20The%20elephant%20in%20the%20web%20application-.ogv", 
      "length": null, 
      "type": "ogv"
    }
  ], 
  "source_url": "http://archive.org/details/pyconza2014-elephant-in-the-web-app", 
  "tags": [
    "pyconza", 
    "pyconza2014"
  ], 
  "speakers": [
    "Iwan Vosloo"
  ], 
  "recorded": "2014-10-02"
}