{
  "id": 3842, 
  "category": "PyCon ZA 2014", 
  "slug": "using-python-in-blender", 
  "title": "Using Python in Blender", 
  "summary": "Python is such a beautiful language, and is used as a scripting language in many open source graphical applications. By using the power of Python within Blender, we can easily automate so many things, and make long tedious tasks seem like child's play.", 
  "description": "Python is such a beautiful language, and is used as a scripting language in many open source graphical applications. By using the power of Python within Blender, we can easily automate so many things, and make long tedious tasks seem like child's play.\nIn this talk I wanted to share a few real world examples where I used Python to do something that would otherwise be impossible (Or just take too long!)\nAt first, we will take a quick look at the API, and how to get started. Here we will look at where you can find what you are looking for, and how it all comes together. This wont be too in-depth, but just enough to give you a taste. We will play with the console a bit and see how to wield the mighty sword that is Python.\nAnd then, we will look at some scripts. These are a few of the scripts that I wrote while I was working on some random things. This will cover some things such as: Adding new mesh objects, updating object coordinates, changing special properties (such as modifers), and setting keyframes all from the console.\nThis talk is for anyone interested in seeing just how to leverage the power of Python in Blender. You need not have any experience with Blender since this will be mostly focussed on the Python side of things, so I wont be covering parts of Blender such as rendering, modeling etc.", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/", 
  "thumbnail_url": "http://archive.org/download/pyconza2014-python-in-blender/pyconza2014-python-in-blender.thumbs/5%20a%20Using%20Python%20in%20Blender-_000450.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://archive.org/download/pyconza2014-python-in-blender/5%20a%20Using%20Python%20in%20Blender-.mp4", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "http://archive.org/download/pyconza2014-python-in-blender/5%20a%20Using%20Python%20in%20Blender-.ogv", 
      "length": null, 
      "type": "ogv"
    }
  ], 
  "source_url": "http://archive.org/details/pyconza2014-python-in-blender", 
  "tags": [
    "pyconza", 
    "pyconza2014"
  ], 
  "speakers": [
    "Albert Nel"
  ], 
  "recorded": "2014-10-02"
}