{"whiteboard": "ia scrape", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon ZA 2014", "speakers": ["Peter Lubell-Doughtie"], "title": "Writing Python Code to Decide an Election", "quality_notes": "", "video_flv_length": null, "recorded": "2014-10-02", "video_mp4_length": null, "description": "This is not something we could get wrong. We combined agile development with best practices in testing and QA to build an open source tally system that was well tested, accurate, and easy to use. We will describe a success story of iterative behavior/test-driven-development under extreme conditions. Did the structure of the data change the day before the election? Yes. Did we have the tests to ensure that our implementation changes would not compromise the system's integrity? Yes, and they didn't.\nThis talk provides a narrative to both Software Engineers and Tech/Product Managers describing why best practices are essential for any organization and any project of any size. We will provide the audience with:\n1. Real world examples they can implement in their own workflow and organizations, 2. Insight into what succeeded (quick iteration with prioritization) and what was challenging (nothing being static), 3. Anecdotes and coherent arguments they can take back to their organization to advocate for best practices.", "video_mp4_url": "http://archive.org/download/pyconza2014-code-to-decide-election/1%20Writing%20Python%20Code%20to%20Decide%20an%20Election-.mp4", "tags": ["pyconza", "pyconza2014"], "copyright_text": "http://creativecommons.org/licenses/by/3.0/", "related_urls": [], "video_flv_download_only": false, "source_url": "http://archive.org/details/pyconza2014-code-to-decide-election", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "http://archive.org/download/pyconza2014-code-to-decide-election/1%20Writing%20Python%20Code%20to%20Decide%20an%20Election-.ogv", "language": "English", "video_webm_length": null, "summary": "Earlier this year Ona was given three weeks to write the software that will tally votes in the Libyan elections and decide who wins and who loses. This is not something we could get wrong.", "thumbnail_url": "http://archive.org/download/pyconza2014-code-to-decide-election/pyconza2014-code-to-decide-election.thumbs/1%20Writing%20Python%20Code%20to%20Decide%20an%20Election-_002250.jpg", "video_flv_url": ""}