{
  "id": 1408, 
  "category": "DjangoCon 2012", 
  "slug": "boosting-teamwork-with-vagrant", 
  "title": "Boosting teamwork with Vagrant", 
  "summary": "In this talk I will present Vagrant, a free open-source tool facilitating the\nmanipulation of virtualized environments, and how it may benefit the\ndevelopment of Django applications. This talk is aimed at Django developers of\nall levels who are interested in getting an overview of the great\npossibilities Vagrant offers to support teamwork and quality assurance.\n\n", 
  "description": "In this talk I will present Vagrant, a free open-source tool facilitating the\nmanipulation of virtualized environments, and how it may benefit the\ndevelopment of Django applications. This talk is aimed at Django developers of\nall levels who are interested in getting an overview of the great\npossibilities Vagrant offers to support teamwork and quality assurance.\n\nOne major benefit of using Vagrant is with on-boarding. Previously, when new\ndevelopers joined a project, it could take hours or days for them to correctly\nset up their development environment and install all the projects'\ndependencies (the correct version of Python, the virtualenv, the database\nserver, the caching engine, etc.). With Vagrant, combined with provisioning\ntools like Chef or Puppet, it is now possible to easily create a virtual\nmachine with all the right dependencies properly pre-installed and pre-\nconfigured to allow anyone to be fully operational and ready to contribute to\nthe project in a matter of minutes.\n\nAnother major benefit of Vagrant is that it gives the opportunity to create a\nworking environment for all developers that closely matches that of the\nproduction server. This in turn allows to anticipate potential issues when new\ncode and resources eventually get deployed live.\n\nIn this talk, I will present some key functionalities and workflows around the\nuse of Vagrant: - installing Vagrant and Virtualbox. - creating a new virtual\nmachine. - provisioning a virtual machine with basic requirements. - sharing\nvirtual machine specifications with team members.\n\nThis talk will include a brief introduction to Chef and Puppet. It will also\ninclude multiple practical tricks like accessing the VM's database server from\nthe host's machine, setting up useful shell aliases or automatically\nactivating the virtualenv when launching the VM.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution license (reuse allowed", 
  "thumbnail_url": "http://i.ytimg.com/vi/DsYVx-mh3NE/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=DsYVx-mh3NE", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=DsYVx-mh3NE", 
  "tags": [
    "django", 
    "vagrant"
  ], 
  "speakers": [
    "Julien Phalip"
  ], 
  "recorded": "2012-09-06"
}