{"whiteboard": "needs editing", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "DjangoCon 2012", "speakers": ["Brian Moloney", "Joe Jasinski"], "title": "Under the Microscope: Evaluating Existing Django Code When Onboarding a New Client", "quality_notes": "", "video_flv_length": null, "recorded": "2012-09-06", "video_mp4_length": null, "description": "Taking over someone else’s code is an exercise fraught with peril. However,\nwith the growing popularity of Django, more and more organizations are seeking\ncompanies and individuals to take over their Django website and support their\nexisting Django codebase. This talk will describe the standardized process\nImaginary Landscape has developed to evaluate existing code as part of their\nnew client onboarding process.\n\nCovered topics:\n\n  * Introduction/Overview\n\n  * Top reasons why clients are looking to change vendor\n\n  * Initial assessment\n\n>     * What questions to ask before looking at the code.\n\n  * Where to start when looking at code? \n\n>     * Traversing the code tree to get a feel for how the code is structured\n\n>     * Trying to determine how the previous developer thinks\n\n  * Detailed code review including checklist\n\n>     * Things to look for when evaluating code: Version control, \"Standard\"\nsite layout, Settings file, hardcoding, Virtualenv, south, etc.\n\n  * Examples (names have been changed to protect the imperfect)\n\n>     * The good: the kinds of coding and configuration techniques that seem\nto be consistent among well-thought-out projects.\n\n>     * The bad: examples of code and configuration that make onboarding and\nmaintenance difficult.\n\n  * Final thoughts\n\n>     * What you can do as a developer taking over a project.\n\n>     * What you can do as a developer hoping to make great code that others\nmay someday see.\n\n>     * Exercise your right to say no, it’s your reputation on the line\n\n  * Q&A\n\n", "video_mp4_url": null, "tags": ["django"], "copyright_text": "Creative Commons Attribution license (reuse allowed", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=-hma3mlcrD8", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "As a Web development firm that specializes in Django, we receive many\ninquiries from organizations looking for assistance with their existing Django\nwebsites. This session will describe our process for evaluating existing\ncodebases and deployment structures. The goal is to provide a framework for\nevaluating other people's code and understand the scrutiny your code may\nsomeday endure.\n\n", "thumbnail_url": "http://i.ytimg.com/vi/-hma3mlcrD8/hqdefault.jpg", "video_flv_url": null}