{
  "id": 1385, 
  "category": "DjangoCon 2012", 
  "slug": "why-the-django-community-sucks", 
  "title": "Why the Django Community Sucks", 
  "summary": "Continuing in the tradition of self-deprecation that has made DjangoCon\nfamous, a relative newcomer will outline what the Django community can learn\nfrom the world of social activism.\n\n", 
  "description": "In 2010, Eric Florenzano ignited a fever following his lightfooted and\nlighthearted placement of a mirror in front of the hardest of the hardcore in\nthe django community with his presentation, “Why Django Sucks, and How We can\nFix It.” Then, a year later, at DjangCon 2011, Steve Holden grasped the self-\ncritique baton with an even steeper challenge, making a claim that he\ndescribed as “the most outrageous thing you can say” - that the Django\ndocumentation sucked.\n\nThe Django documentation, already widely considered the best in its class, has\nresponded to the critique and continues to improve daily.\n\nAlso widely viewed as a top strength of Django is its community. While Django\nenjoys one of the most thoughtful, patient, and responsive communities in the\nworld of open source web frameworks, it has a special opportunity for learning\nin Washington, D.C., where many of the most successful and voracious non-\nprofit advocacy organizations call home.\n\nThis presentation will examine some of their tactics and compare them with\nthose employed by the Django community. Among the topics covered will be\nmobilization of new troops, building and listening to diverse coalitions, and\nidentifying and reaching out to under-represented populations.\n\nThe presenter comes from a decade of experience in non-profit social justice\nactivism. Having been a Django user for 3.5 years and involved in the\ncommunity for 2, will be at only his second DjangoCon.. Freshly imported, he\nhas the perspective of a passionate newcomer rather a seasoned veteran.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Creative Commons Attribution license (reuse allowed", 
  "thumbnail_url": "http://i.ytimg.com/vi/NrkopXN9sQg/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=NrkopXN9sQg", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=NrkopXN9sQg", 
  "tags": [
    "django"
  ], 
  "speakers": [
    "Justin Myles Holmes"
  ], 
  "recorded": "2012-09-05"
}