{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "In the last ten years scientists working on computational problems\ninvolving proteins and other small molecules have largely moved to using\npython when developing simulation and data analysis tools allowing for a\nfast prototyping and development of new ideas. One big challenge is\ndealing with the compatibility of different tools and using these to\ncreate very complex adaptive, yet robust workflows in order to be able\nto guide cutting edge experiments e.g. predicting how well a small drug\nlike molecule can bind to a protein that could serve as a target for a\nnew drug. The talk will give a gentle introduction to what kind of\npython related tools are available in the field of computational\nmolecular biology, how they are used, and what kind of complex workflows\nscientist have to solve. I will then introduce BioSimSpace an open\nsource python library and flagship project of the CCPBioSim consortium\nin the UK, which provides a common API to avoid having to learn many\nindividual tools facing compatibility and dependency challenges allowing\nscientists to focus on the scientific question at hand and not solving\nprogramming challenges. BioSimSpace allows fast and interoperable\nbuilding of workflow components (nodes) for bimolecular problems, which\ncan easily be used on a variety of different computational resources. In\nparticular I will introduce the cloud facilities available for fast\nprototyping using a Jupyter notebook interface.\n",
  "duration": 1843,
  "language": "eng",
  "recorded": "2018-07-25",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "Antonia Mey"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/NoTQLb0oN-4/maxresdefault.jpg",
  "title": "How is python used in biomolecular sciences?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NoTQLb0oN-4"
    }
  ]
}
