{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "The clock is ticking on Python 2.7, with support to be dropped in\nJanuary 2020. With major dependencies such as Django, NumPy and pandas\nmoving to Python 3 only, the time has come for even big established\ncodebases to consider upgrading. Many organisations are still postponing\nfor various reasons; we will attempt to demonstrate that with a bit of\nplanning and perseverance, and the assistance of some handy tools, we\ncan embrace the future!\n\nThis session will provide a first-hand perspective on how we upgraded a\nlarge (~65,000 lines of python code) 8-year-old Django project with\nmultiple external dependencies from Python 2.7 to Python 3.6.\n\nWe will briefly discuss the benefits of upgrading to Python 3, and\narchitectural considerations. The session will primarily focus on the\npracticalities of upgrading the code itself. We will not try to provide\na single “best” solution for upgrading to Python 3, but rather will\nintroduce some of the available tools, provide an insight into how we\nused them, and their advantages and disadvantages from our experience.\nWe will discuss preparatory steps and approaches, strategies for dealing\nwith external dependencies, and “gotchas” that we encountered during the\nprocess.\n\nThe aim of this session is to provide an example of how a Python 3\nupgrade on an established commercial product can be successfully\ncompleted, and to furnish audience members with a set of tools and\nstrategies to help them with their own projects.\n\nPrerequisites: basic knowledge of Python.\n",
  "duration": 1756,
  "language": "eng",
  "recorded": "2018-07-25",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "Becky Smith"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/h5tmNkyNAKs/maxresdefault.jpg",
  "title": "Python 2 is dead! Drag your old code into the modern age.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=h5tmNkyNAKs"
    }
  ]
}
