{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Poor surface air quality has a range of implications for human health\nand the economy. Without concerted mitigation efforts, trends in\nurbanisation and aspirations for progressive economic growth will result\nin poorer levels of air quality. Analysing and interpreting the incoming\ndata streams from heterogeneous air quality measurement stations is\ncritical for tackling the problem and for developing early warning\nsystems. I am using Python to develop a set of online analysis tools\n(ukatmos.org) to enable the public to quickly and easily plot air\nquality data in many ways, effectively freeing up information that is\nalready publicly available but in awkward formats and often involves\ndevelopment of code. We anticipate these tools will also support data\nscience classes at school, and can speed up scientific research by\nminimizing effort in repeating analyses.\n\nThis talk will cover how the tools integrate numerous Python libraries\n(e.g. Pandas and NumPy), the Django web framework, the Plot.ly tools for\ncreating interactive graphs, and SQL to address the large data volumes.\nDeveloping these Python tools in an adaptive and scalable way allows it\nto grow as more data become available, e.g. satellite observations.\nAdaptability also includes evolving user requirements. This project will\nalso be developed into a Python library allowing the user to easily use\nthe online analysis tools from an offline Python environment.\n",
  "duration": 1712,
  "language": "eng",
  "recorded": "2018-07-27",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "Douglas Finch"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/bDvgZ_Yn_FM/maxresdefault.jpg",
  "title": "Air Quality & Python: Developing Online Analysis Tools",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bDvgZ_Yn_FM"
    }
  ]
}
