{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "The analysis of text data in social media is gaining more and more\nimportance every day. The need for companies to know what people think\nand want is key to invest money in providing customers what they want.\nThe first approach to text analysis was mainly statistical, but adding\nlinguistic information has been proven to work well for improving the\nresults.\n\nOne of the problems that you need to address when analyzing social media\nis time. People are constantly exchanging information, users write\ncomments every day about what they think of a product, what they do or\nthe places they visit. It is difficult to keep track of everything that\nhappens. Moreover, information is sometimes expressed in short\nsentences, keywords, or isolated ideas, such as in Tweets. Language is\nusually unstructured because it is composed of isolated ideas, or\nwithout context.\n\nI will talk about the problem of text analysis in social media. I will\nalso explain briefly Naïve Bayes classifiers, and how you can easily\ntake advantage of them to analyse sentiment in social media, and I will\nuse an example to show how linguistic information can help improve the\nresults. I will also evaluate the pros and cons of supervised vs\nunsupervised learning.\n\nFinally, I will introduce opinion lexicons, both dictionary based and\ncorpus- based, and how lexicons can be used in semi-supervised learning\nand supervised learning. If I have time left, I will explain about other\nuse cases of text analysis.\n",
  "duration": 1827,
  "language": "eng",
  "recorded": "2018-07-25",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "Eulalia Veny"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/-S2sVhZ92PU/maxresdefault.jpg",
  "title": "Recipe for text analysis in social media:",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-S2sVhZ92PU"
    }
  ]
}
