{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "A recent but quite common observation in industry is that although there\nis an overall high adoption of data science, many companies struggle to\nget it into production. Huge teams of well-payed data scientists often\npresent one fancy model after the other to their managers but their\nproof of concepts never manifest into something business relevant. The\nfrustration grows on both sides, managers and data scientists.\n\nIn my talk I elaborate on the many reasons why data science to\nproduction is such a hard nut to crack. I start with a taxonomy of data\nuse cases in order to easier assess technical requirements. Based\nthereon, my focus lies on overcoming the two-language-problem which is\nPython/R loved by data scientists vs. the enterprise-established\nJava/Scala. From my project experiences I present three different\nsolutions, namely 1) migrating to a single language, 2) reimplementation\nand 3) usage of a framework. The advantages and disadvantages of each\napproach is presented and general advices based on the introduced\ntaxonomy is given.\n\nAdditionally, my talk also addresses organisational as well as problems\nin quality assurance and deployment. Best practices and further\nreferences are presented on a high-level in order to cover all facets of\ndata science to production.\n\nWith my talk I hope to convey the message that breakdowns on the road\nfrom data science to production are rather the rule than the exception,\nso you are not alone. At the end of my talk, you will have a better\nunderstanding of why your team and you are struggling and what to do\nabout it.\n",
  "duration": 2970,
  "language": "eng",
  "recorded": "2018-07-25",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "Florian Wilhelm"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ItcMqTR7Cds/maxresdefault.jpg",
  "title": "Bridging the Gap: from Data Science to Production",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ItcMqTR7Cds"
    }
  ]
}
