{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Let’s face it. Sometimes our code just isn’t working how we expect it to\nwork. When this happens, we fall back to our trusty tools to help us\ndebug: pdb, the logging module, or even simple print statements. But\nsometimes that just isn’t enough, we still can’t figure out why our code\nis broken. We need something more.\n\nThere are a number of fantastic libraries in python for creating data\nvisualizations. These libraries are commonly used for analyzing and\nvisualizing large sets of data, but don’t see as much usage when it\ncomes to helping us write and debug our code.\n\nWhat if we could combine the two? What if we could leverage data\nvisualization tools to understand what our program is doing? Sometimes,\nby seeing a visual representation of what our code is doing, it becomes\nmuch easier to understand why our code is not working. We don’t need to\ncreate publication quality graphs and charts, we just need to generate\nquick, one-off visualizations to understand what our code is doing. What\nwe want is the “data visualization” equivalent to print() statements.\n\nTo help illustrate this point, I will walk through some of the hardest\nbugs I’ve had to track down while working on projects such as the AWS\nCLI and boto3, the AWS SDK for Python. For each bug, I’ll show you how I\nwas able to leverage data visualization techniques to troubleshoot and\nfix these bugs. Come learn how to debug more efficiently by leveraging\ndata visualization.\n",
  "duration": 1811,
  "language": "eng",
  "recorded": "2018-07-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "James Saryerwinnie"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/qx7cumg6EEE/maxresdefault.jpg",
  "title": "Debugging Your Code with Data Visualization",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qx7cumg6EEE"
    }
  ]
}
