{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Python is very often recommended as the language of choice in a\nprogramming education. I can see at least two cases when it’s a thing: -\nintroduction to programming - regardless an age and any previous\neducational experience, - data science - it’s just a standard… and\nactually both - you can teach a future data scientists starting by\nteaching Python.\n\nDuring this talk, I would like to briefly present you what Open Source\nPython educational materials do we have there and how those are and can\nbe used to teach Python and data science. PyLadies, Django Girls, Django\nCarrots, Python Software Foundation creates many very available\nmaterials. From the data science side, you have Open Source materials\ncreated by kaggle, Minerva, Github repos, and many other organizations\nand individuals.\n\nDuring this talk you will learn: - where to find an Open Source Python\nand data science tutorials and educational materials - how does the\nPython community can support your learning process - why learning data\nscience with Python is a good idea.\n\nI’m also interested in learning your educational experience with an Open\nSource materials and Python community supporting your learning\nexperience. If you would like to share a link or your educational story,\nplease feel free to send me an email on kamila@stepniowski.com. If I\nwill find it interesting for the audience and if you will give me your\npermission to share it, I might use it in the talk.\n",
  "duration": 2559,
  "language": "eng",
  "recorded": "2018-07-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "Kamila Stepniowska"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ZlTTUxu6D4M/maxresdefault.jpg",
  "title": "How can you use Open Source materials to learn Python & data science?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZlTTUxu6D4M"
    }
  ]
}
