{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Ever wonder what mocks, fakes, dummies stubs or spies are? Or what the\ndifferences are between them and when one should be used instead of\nanother? We will take a deep look into these concepts, what they mean\nand examples on how to use/create them in Python.\n\nIn this talk, we will quickly explore the reasons for using mock and how\nit works, quickly jumping into the different concepts of testing doubles\nand how they can be used in Python. The talk will include as part of the\nexamples from some features in mock coming in Python 3.7 that might\nchange how usual mocking is performed. The talk builds on the writings\nof Gerard Meszaros and Martin Fowler about testing doubles, focusing on\nhow to apply them to Python.\n\nThis session, which will review test isolation concepts and the\nunittest.mock module, is structured in a way that both beginners and\nintermediate developers will learn from it. A basic knowledge of testing\nis recommended. Intermediate developers will leave the room with a clear\nunderstanding of the tools - further than just using simple mocks - to\nsuccessfully fake dependencies. Multiple “not so well known” features of\nunittest.mock will be presented so we can shape those objects to behave\nfunctionally different. Unittest.mock is an extremely useful library\nwhich is commonly underused, this talk aims to bring clarity into\nstubbing in general and into medium/advanced mock features to ease and\nremove pain when users work with it.\n\nOutline:\n\n- Intro (1’)\n- Why doubles are important (1’)\n- Main qualities of a double (2’)\n- Overview of unittest.mock (5’)\n- Testing doubles (15’)\n  - Doubles (1’)\n  - Stubs (2’)\n  - Spies (3’)\n  - Mocks (5’)\n  - Fakes (2’)\n- Wrap up, conclusion and pointers (2’)\n- Q&A (Expected 5’)",
  "duration": 1526,
  "language": "eng",
  "recorded": "2018-07-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "Mario Corchero"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/1xysL9Bk8m8/maxresdefault.jpg",
  "title": "Mocks, fakes, dummies, stubs and spies: Successfully isolating the snake",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1xysL9Bk8m8"
    }
  ]
}
