{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "What exactly *are* functions? Let’s talk about functions, methods,\ncallables and closures - what they are, what you can give them, what\nthey can give you, what you can do with them … and what’s inside.\n\nYou probably think you already know everything about functions, but you\nprobably don’t!\n\n**Input & Output**: How do you get things in and out of functions? I’ll\ncover parameters and the myriad of ways they can be specified, provided\nand accessed - including helpful hints to avoid common mistakes! I’ll\ncover return values, briefly, along with variable scopes and exceptions.\n\n**Closures** : What are they, how do they work and how they can affect\nmemory usage.\n\n**Methods** : How does a method differ from a function, when are they\nmade, how do they work (where does ``self`` come from?) and how to\naccess the function inside every method.\n\n****magic**** :Make your own callables from any object!\n\n**Introspection** : Using modern Python techniques, what can you find\nout about a function, and what can you do with that information?\n\n**Bytecode** : What happens if you open up a function and look at its\ninsides? Can you change it and put it back together again? (Spoiler:\nYes, you can.)\n\nBy the end of this talk, I guarantee\\* you’ll know more about callables\nthan when you walked in, along with techniques both practical and so\nextreme your colleagues will never let you merge them to master.\n\n(\\*This guarantee is legally non-binding and cannot be redeemed in any\nway.)\n",
  "duration": 1841,
  "language": "eng",
  "recorded": "2018-07-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "Mark Smith"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/vIkpCOY-yGs/maxresdefault.jpg",
  "title": "More Than You Ever Wanted To Know About Python Functions",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vIkpCOY-yGs"
    }
  ]
}
