{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "As teams and projects grow, code review becomes increasingly important\nto support the maintainability of complex codebases. In this talk, I’ll\ncover guidelines for writing consistent python code beyond pep8, how to\nlook out for common python gotchas, and what python tools are available\nto automate various parts of the review process. Most importantly, I’ll\ncover the human aspect of code reviews - how we can be better at\napproaching reviews with empathy and understanding from the perspective\nof both a reviewer and a submitter. Following these successful code\nreview practices will lead to happier teams and healthier code bases.\n\nThis talk is useful for python developers with any amount of experience.\nNo prerequisite knowledge is necessary. - For those who are just\nstarting out, it will be a great general overview. - Intermediate\ndevelopers may not know about the wide variety of tooling that’s\navailable. - Advanced developers will learn techniques for performing\ncode reviews with empathy.\n\nThis talk will enable you to have better code reviews on your teams at\nwork, and a better approach to code reviews in open source projects.\nYou’ll leave with 3 main takeaways: 1. Code Reviews are most effective\nwhen conducted with empathy. If you do reviews with growth and learning\nin mind, they become tools for sharing knowledge instead of an\nopportunity to bruise egos or show off esoteric knowledge. 2. Python has\npowerful tooling available for code reviews such as pep8 as a style\nguide, pylint as a linter, coverage.py to identify test coverage, and\nvulture to identify dead code. 3. That python style guides beyond pep8\nhave clear benefits in terms of producing more consistent code that’s\neasier to review and easier to maintain.\n",
  "duration": 2419,
  "language": "eng",
  "recorded": "2018-07-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "Nina Zakharenko"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/6L3ZVLtSeo8/maxresdefault.jpg",
  "title": "Code Review Skills for Pythonistas",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6L3ZVLtSeo8"
    }
  ]
}
