{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Python users should be familiar with the concept of Python Enhancement\nProposals (PEPs), the way that the Python language evolves over time. In\na similar fashion, the Jupyter project has Jupyter Enhancement Proposals\n(JEPs). This talk with cover the proposer first-hand experience when\nsubmiting JEP 23 - Add Template as Metatada enhancement proposal from\nit’s beginning, during EuroPython 2017, up to its current status. We\nwill, in addition, present efforts made as part of the OpenDreamKit\nproject to perform Jupyter notebooks conversions using custom metadata,\ntemplates, and exporters, in a programmatic way.\n\nOutline\n\n0:00 - 0:05 Who are we? We are impostors! 0:05 - 0:10 Our previous\nexperience with Jupyter Notebook. We will talk about the time that\nSoftware Carpentry used Jupyter Notebook for their lesson creation and\nOpenDreamKit Jupyter notebook programmatic notebooks conversion. 0:10 -\n0:15 You are not alone. We will talk how the idea for the Jupyter\nEnhancement Proposals (JEPs) borned at EuroPython 2017 Help Desk 0:15 -\n0:20 Writing our first Jupyter Enhancement Proposals. We will cover our\nsteps to create the pull request required by the Jupyter Project. 0:20 -\n0:25 What is the current status of the Jupyter Enhancement Proposals? We\nwill cover any progress from the time of this talk proposal submission\nand the date of it presentation. 0:25 - 0:30 Time for questions\n",
  "duration": 1286,
  "language": "eng",
  "recorded": "2018-07-25",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "Raniere Silva",
    "Tania Sanchez Monroy"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/G_OFsgPhtB0/maxresdefault.jpg",
  "title": "A Jupyter Enhancement Proposal Story",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=G_OFsgPhtB0"
    }
  ]
}
