{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "In this talk, I will give an insight into what it means to maintain a\npopular project for me personally, what it involves and what we as a\ncommunity can do to help out and finally why I think it’s an important\ndiscussion to have.\n\nCookiecutter is a command-line utility that creates projects from\ntemplates. It is free and open-source software distributed under the\nterms of a permissive BSD-3 license. With around 180 individual\ncontributors, more than 1000 public templates on GitHub alone, and\nmultiple talks at conferences, it is fair to say that there is a small\ncommunity around it.\n\nBut who are the people behind the project and what is it that they are\ndoing?\n\nIt’s been three years since I was granted the commit bit by the core\nteam. I have learned a lot about FOSS communities and also about myself.\nAt times I struggle with balancing my day job as a full-time Software\nEngineer and maintaining Cookiecutter and other FOSS projects in my\nspare time. By now I’m OK with not responding to issues immediately and\nclosing pull requests. However it took me quite a while to get to this\npoint.\n\nMaintaining FOSS projects can be incredibly rewarding and fun, but it\ncan also be quite frustrating. It involves so much more than writing\ncode or merging PRs, and yet sometimes it feels like that’s what most\npeople think. The goal of this talk is to start a conversation around\nthis topic and hear what other EuroPython attendees think about it and\ntheir challenges as contributors or maintainers.\n",
  "duration": 2460,
  "language": "eng",
  "recorded": "2018-07-27",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "Raphael Pierzina"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/3pokUifUyWM/maxresdefault.jpg",
  "title": "The Challenges of Maintaining a Popular Open-Source Project",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3pokUifUyWM"
    }
  ]
}
