{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Increasingly, our apps are used not by humans but by other apps - via\ntheir APIs. Thus it is increasingly important that your APIs are\nwell-designed and easy to consume for other developers.\n\nAdding a few API endpoints to your application for internal consumption\nis easy. Creating APIs that other developers will love to use is a much\nharder problem. You’ll need to think about solving variety of topics\nsuch as versioning, authentication, response structure, documentation\nand more. There are existing good practices for each of them, but often\ndevelopers who haven’t done a lot of API work aren’t familiar with them.\n\nMy talk will show how to find reasonable solutions for those problems. I\nwill talk about importance and intricacies of good documentation and why\nauto- generating it from your code is useful. I’ll show how to make use\nof familiarity by using standards such as JSON API and show benefits\nbrought by its standardized response structure that makes lives of\n3rd-party developers easier.\n\nAuthentication will be discussed, including introduction to OAuth2. I’ll\ntalk about when OAuth2 is a good choice and when not, as well as dig\ninto some trickier parts of it. We’ll then move on to versioning and how\nyou can change your API without breaking all existing apps. Finally\nwe’ll wrap it all up by looking at some major APIs that are using the\nsame principles.\n",
  "duration": 2610,
  "language": "eng",
  "recorded": "2018-07-27",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "Rivo Laks"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/HB1ngQ7j1FA/maxresdefault.jpg",
  "title": "Creating Solid APIs",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HB1ngQ7j1FA"
    }
  ]
}
