{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "We all know the internet can be a scary place. In this talk I’ll focus\non two ways I’ve found it positively terrifying. First, digging into\ntracking technologies, I have learned about the breadth and depth of\nways our online activity is monitored, stored, and repackaged. Second,\nwhen starting out to learn a new skill, the tidal wave of information\navailable online can be overwhelming.\n\nUsing the PyData stack to explore and visualize different data sources,\nincluding a new dataset from Mozilla, we’ll examine some of the many\ntypes of online tracking. My goal is to leave the audience with:\n\n1) A sense of the breadth of tools in the PyData toolbox that can be\n   applied to a real-world analysis 2) An understanding of a few methods\n   of online tracking so they can be more informed internet citizens\n\nIn particular, now that the EU’s General Data Protection Regulation\n(GDPR) has come into force, we can explore the data in light of EU\ncitizens’ new rights, and the new responsibilities of companies\nworldwide.\n\nAlong the way, I’ll also talk about becoming a software engineer, then a\nbuilder of data science tools, and my new journey into data science.\nBeing self-taught can be, lonely, scary, and full of embarrassing\npitfalls. I’ll share some stories about my learning journey, and the\npeople and resources that have supported me.\n",
  "duration": 1847,
  "language": "eng",
  "recorded": "2018-07-26",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "Sarah Bird"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/3zWHdyrGlDc/maxresdefault.jpg",
  "title": "The Web is Terrifying! Using the PyData stack to spy on the spies.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3zWHdyrGlDc"
    }
  ]
}
