{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "We will have a quick tour of the many ways Python gives us to handle\nDOCX, XLSX, PPTX, and PDF and automate some boring office tasks.\n\nMany things are more interesting than office file formats like DOCX,\nXLSX, PPTX, and PDF. Still, while working with office formats does not\nseem to be the most fun, it is useful. But we can do better than just\nuseful. With the Python and some great libraries, it is possible to have\nPython do much of the work you would have to do otherwise:\n\n-  Create and modify PDF files.\n-  Create Powerpoints presentations from scripts.\n-  Create Excel files, from simple tables to charts and reports.\n-  Combine information in Word documents.\n\nIn this talk, we will have a look at a usual working day for Bob and\nAnn, two fictional office works. Both Bob and Ann work office jobs, but\nwhile Bob does all of his work by hand, but Ann knows Python. We will\nlook at different tasks that Bob wants to do, such as preparing an Excel\nreport, building a Powerpoint presentation, or rearranging a PDF. Then,\nwe will look how Ann use Python and some exciting libraries to automate\nthese task.\n\nDuring the talk, we will use Bob and Ann to consider different task\nrelated to office file formats. We will then look at the Python\nlibraries that are available. Then, using this library, we will see how\nan otherwise boring task can be automated. The goal of the task is to\nshowcase the libraries to Python offers to work with standard office\nformats and provide you with a starting point for your own office\nautomation.\n\nAfter this talk, you will know how to automate at least some of your\ndaily office tasks. You may also be bored because Python is doing so\nmuch of your work for you. If you know basic Python programming, you\nwill be right at home. There will be some use of Pandas, but it is not\nrequired.\n",
  "duration": 1701,
  "language": "eng",
  "recorded": "2018-07-27",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2018.europython.eu/p3/schedule/ep2018/"
    }
  ],
  "speakers": [
    "Stefan Baerisch"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/azbOfFipzws/maxresdefault.jpg",
  "title": "The Boring Python Office Talk - Automate Powerpoint, Excel, and PDF with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=azbOfFipzws"
    }
  ]
}
