{
  "copyright_text": "CC BY-NC-SA 4.0",
  "description": "Any symbiotic relationship among very different creatures has unique challenges, but can result in something even more powerful than the sum of its parts. Combining Python with Apache Flink, particularly for Machine Learning, has its complications, but can also produce an incredibly fast, portable, scalable, and highly flexible data pipeline.\r\n\r\nThis talk covers the structure and technical features of a Python-Flink pipeline. It also goes over getting started, and more importantly - addressing the common mistakes and hurdles of building one. This includes which features to use and how to leverage the strengths of each framework based on your specific use case. For instance, when would you use regular Python, and when would you want to use PyFlink? Are there cases where you would NOT want to use some of the abstraction or automation tools available for these frameworks?\r\n\r\nAttendees will get out of this talk an introduction to working with Apache Flink with Python, and pragmatic tips and tricks for a smoother, faster, more enjoyable (because this should be fun!) dive into this symbiotic relationship.\r\n\r\nThis talk is geared towards those who are new to Flink but is applicable to anyone with beginner to advanced Python experience.\n\nhttps://pretalx.com/pycascades-2021/talk/V8JNGK/\n\nAfter three amazing in-person conferences, this time we're moving PyCascades online.\r\n\r\nPyCascades is a regional PyCon in the Pacific Northwest, celebrating the west coast Python developer and user community. Our organizing team includes members of the Vancouver, Seattle, and Portland Python user groups.\r\n\r\nVideos are released as CC BY-NC-SA 4.0.\n\nProduced by Next Day Video Australia: https://nextdayvideo.com.au\n\n#pycascades #pycon #python #conference\n\nSat Feb 20 15:35:00 2021 at Interactive Track",
  "duration": 1496,
  "language": "eng",
  "recorded": "2021-02-20",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2021.pycascades.com/program/schedule/"
    },
    {
      "label": "https://nextdayvideo.com.au",
      "url": "https://nextdayvideo.com.au"
    },
    {
      "label": "https://pretalx.com/pycascades-2021/talk/V8JNGK/",
      "url": "https://pretalx.com/pycascades-2021/talk/V8JNGK/"
    }
  ],
  "speakers": [
    "Caito Scherr"
  ],
  "tags": [
    "#pycascades#pycon#python#conference",
    "pycascades",
    "pycascades2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/WwvpsqyWsc4/maxresdefault.webp",
  "title": "\"Building a Python Data Pipeline with Apache Flink\" - Caito Scherr (PyCascades 2021)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WwvpsqyWsc4"
    }
  ]
}
