{
  "copyright_text": "CC BY-NC-SA 4.0",
  "description": "Jay Miller\n\nhttps://pretalx.com/pycascades-2021/talk/SF3GVK/\n\nAfter discovering that many major cities in the United States have open data projects that allow for a level of transparency. I was happy to discover that my own city had data available but quickly realized that the data had many issues that would make it difficult to analyze as-is.\r\n\r\nIn this talk, I will show how I was able to consolidate \"Calls for Service\" to the San Diego Police Department since 2015. This was done by importing the city-provided CSV files into Pandas DataFrames and making modifications to standardize data.\r\n\r\nI will also convert approximate location data to a geo_point using Public geoJSON data and the filter capabilities in Elasticsearch.\r\n\r\nLastly, I will show how you can bulk upload the data into and out of Elasticsearch via eland so that it can be visualized in Kibana or a public graphing platform and how I automated this process to check for updates.\n\nAfter three amazing in-person conferences, this time we're moving PyCascades online.\r\n\r\nPyCascades is a regional PyCon in the Pacific Northwest, celebrating the west coast Python developer and user community. Our organizing team includes members of the Vancouver, Seattle, and Portland Python user groups.\r\n\r\nVideos are released as CC BY-NC-SA 4.0.\n\nProduced by Next Day Video Australia: https://nextdayvideo.com.au\n\n#pycascades #pycon #python #conference\n\nSat Feb 20 11:45:00 2021 at Prerecorded Talks",
  "duration": 1794,
  "language": "eng",
  "recorded": "2021-02-20",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2021.pycascades.com/program/schedule/"
    },
    {
      "label": "https://pretalx.com/pycascades-2021/talk/SF3GVK/",
      "url": "https://pretalx.com/pycascades-2021/talk/SF3GVK/"
    },
    {
      "label": "https://nextdayvideo.com.au",
      "url": "https://nextdayvideo.com.au"
    }
  ],
  "speakers": [
    "Jay Miller"
  ],
  "tags": [
    "#pycascades#pycon#python#conference",
    "pycascades",
    "pycascades2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/qaude9nlyiU/maxresdefault.webp",
  "title": "\"Enhancing Civics Data with Elasticsearch, pandas and Eland\" - Jay Miller (PyCascades 2021)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=qaude9nlyiU"
    }
  ]
}
