{
  "copyright_text": "CC BY-NC-SA 4.0",
  "description": "Technical books are one of the most popular ways to learn and improve your Python skills. Join us in this interactive session as we hear from three popular authors about their experiences publishing a book from start to finish. We’ll be joined by Al Sweigart, who’s most popular book Automate the Boring Stuff with Python has been met with rave reviews, April Speight, author of Bite-Size Python and Harry Percival who authored Test Driven Development with Python. They’ll clue you in on what the process is like from start to finish, tips on how to get started if you’d like to write your own book, and warn you of unexpected pitfalls.\n\nhttps://pretalx.com/pycascades-2021/talk/QCRVPL/\n\nAfter three amazing in-person conferences, this time we're moving PyCascades online.\r\n\r\nPyCascades is a regional PyCon in the Pacific Northwest, celebrating the west coast Python developer and user community. Our organizing team includes members of the Vancouver, Seattle, and Portland Python user groups.\r\n\r\nVideos are released as CC BY-NC-SA 4.0.\n\nProduced by Next Day Video Australia: https://nextdayvideo.com.au\n\n#pycascades #pycon #python #conference\n\nSat Feb 20 10:25:00 2021 at Interactive Track",
  "duration": 3171,
  "language": "eng",
  "recorded": "2021-02-20",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2021.pycascades.com/program/schedule/"
    },
    {
      "label": "https://pretalx.com/pycascades-2021/talk/QCRVPL/",
      "url": "https://pretalx.com/pycascades-2021/talk/QCRVPL/"
    },
    {
      "label": "https://nextdayvideo.com.au",
      "url": "https://nextdayvideo.com.au"
    }
  ],
  "speakers": [
    "Al Sweigart",
    "April Speight",
    "Ashia Zawaduk",
    "Harry Percival"
  ],
  "tags": [
    "#pycascades#pycon#python#conference",
    "pycascades",
    "pycascades2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/fksfxGsVPik/maxresdefault.webp",
  "title": "Everything You Need to Know About Writing Technical Python Books",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fksfxGsVPik"
    }
  ]
}
