{
  "copyright_text": "CC BY-NC-SA 4.0",
  "description": "As programmers, we do debugging almost every day. What are the major options for debugging, what advantages and disadvantages do they have? We’ll start the talk by giving the audience an overview of the history of debugging and existing tools so they know how to pick from them.\r\n\r\nThen, we’ll help the audience gain a deeper understanding of what debugging is really about, and talk about two pain points with existing solutions. We’ll introduce a novel approach to solve these pain points, with basic introduction to bytecode tracing so the audience can learn this useful technique.\r\n\r\nFinally, we’ll look into the future and talk about why it’s important to be more innovative. We hope that by listening to this talk, the audience can be more open-minded thinking about debugging, and programming as a whole.\r\n\r\nNo specific knowledge required, but basic experience with debugging would be helpful.\n\nhttps://pretalx.com/pycascades-2021/talk/XUAPQK/\n\nAfter three amazing in-person conferences, this time we're moving PyCascades online.\r\n\r\nPyCascades is a regional PyCon in the Pacific Northwest, celebrating the west coast Python developer and user community. Our organizing team includes members of the Vancouver, Seattle, and Portland Python user groups.\r\n\r\nVideos are released as CC BY-NC-SA 4.0.\n\nProduced by Next Day Video Australia: https://nextdayvideo.com.au\n\n#pycascades #pycon #python #conference\n\nSat Feb 20 13:55:00 2021 at Prerecorded Talks",
  "duration": 1468,
  "language": "eng",
  "recorded": "2021-02-20",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2021.pycascades.com/program/schedule/"
    },
    {
      "label": "https://pretalx.com/pycascades-2021/talk/XUAPQK/",
      "url": "https://pretalx.com/pycascades-2021/talk/XUAPQK/"
    },
    {
      "label": "https://nextdayvideo.com.au",
      "url": "https://nextdayvideo.com.au"
    }
  ],
  "speakers": [
    "laike9m"
  ],
  "tags": [
    "#pycascades#pycon#python#conference",
    "pycascades",
    "pycascades2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/eXlTVrNZ67Q/maxresdefault.webp",
  "title": "\"Let’s Rethink Debugging\" - laike9m (PyCascades 2021)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eXlTVrNZ67Q"
    }
  ]
}
