{
  "copyright_text": "CC BY-NC-SA 4.0",
  "description": "We all know Python is a great learning language and a lot of software engineers got their start into software engineering by building or modding games. The combination of these factors makes Python games an important keystone in our community, even if very few of us end up making video games as a living.\r\n\r\nIn this talk, we’ll cover some high level concepts you’ll need to understand games, like events, event loops, and state modeling. Then we’ll cover the constraints and expectations of PursuedPyBear, Python’s newest game framework. Then we’ll discuss a summary its extensibility features.\r\n\r\nAt the end, viewers should be prepared to make a game in PursuedPyBear and have a selection of resources for how to improve their knowledge and skill set with video games.\n\nAfter three amazing in-person conferences, this time we're moving PyCascades online.\r\n\r\nPyCascades is a regional PyCon in the Pacific Northwest, celebrating the west coast Python developer and user community. Our organizing team includes members of the Vancouver, Seattle, and Portland Python user groups.\r\n\r\nVideos are released as CC BY-NC-SA 4.0.\n\nProduced by Next Day Video Australia: https://nextdayvideo.com.au\n\n#pycascades #pycon #python #conference\n\nSat Feb 20 14:35:00 2021 at Prerecorded Talks",
  "duration": 1452,
  "language": "eng",
  "recorded": "2021-02-20",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2021.pycascades.com/program/schedule/"
    },
    {
      "label": "https://nextdayvideo.com.au",
      "url": "https://nextdayvideo.com.au"
    },
    {
      "label": "https://pretalx.com/pycascades-2021/talk/LVYLYD/",
      "url": "https://pretalx.com/pycascades-2021/talk/LVYLYD/"
    }
  ],
  "speakers": [
    "Piper Thunstrom"
  ],
  "tags": [
    "#pycascades#pycon#python#conference",
    "pycascades",
    "pycascades2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/G9aSupd00_k/maxresdefault.webp",
  "title": "\"Making Games With PPB\" - Piper Thunstrom (PyCascades 2021)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=G9aSupd00_k"
    }
  ]
}
