{
  "copyright_text": "CC BY-NC-SA 4.0",
  "description": "Sending a satellite to space is easier than ever before.  Cubesats -- satellites the size of a loaf of bread, or even smaller -- can be built for as little as a few thousand dollars, but are capable enough to track ships, watch for earthquakes, or even observe exoplanets.  \"Ease of launch\" does not mean \"ease of operation\", though; the satellites send a wealth of telemetry back to earth, and turning that flood of information into action is difficult.  This difficulty only increases as fleets scale in size, from one-off research projects to hundreds of satellites providing commercial services.\r\n\r\nSince beginning in 2018, the Polaris project has used Python's rich ecosystem to build a machine learning pipeline applicable to any mission.  Polaris analyzes telemetry for each satellite, automatically extracts dependencies among its components, and displays these in an interactive, browser-based 3D graph.  Spacecraft operators can navigate their graph and understand relations between their telemetry, as well as external parameters such as space weather. This gives operators another tool to monitor performance, diagnose problems, and predict satellite behaviour.\r\n\r\nAudience: This talk is aimed at a general audience of people interested in Python, machine learning or space exploration; no expertise is assumed.\n\nhttps://pretalx.com/pycascades-2021/talk/A8NQHW/\n\nAfter three amazing in-person conferences, this time we're moving PyCascades online.\r\n\r\nPyCascades is a regional PyCon in the Pacific Northwest, celebrating the west coast Python developer and user community. Our organizing team includes members of the Vancouver, Seattle, and Portland Python user groups.\r\n\r\nVideos are released as CC BY-NC-SA 4.0.\n\nProduced by Next Day Video Australia: https://nextdayvideo.com.au\n\n#pycascades #pycon #python #conference\n\nSat Feb 20 13:15:00 2021 at Prerecorded Talks",
  "duration": 1661,
  "language": "eng",
  "recorded": "2021-02-20",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://2021.pycascades.com/program/schedule/"
    },
    {
      "label": "https://pretalx.com/pycascades-2021/talk/A8NQHW/",
      "url": "https://pretalx.com/pycascades-2021/talk/A8NQHW/"
    },
    {
      "label": "https://nextdayvideo.com.au",
      "url": "https://nextdayvideo.com.au"
    }
  ],
  "speakers": [
    "Hugh Brown"
  ],
  "tags": [
    "#pycascades#pycon#python#conference",
    "pycascades",
    "pycascades2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/0jNMDqTqD2s/maxresdefault.webp",
  "title": "\"Polaris: Open Source Machine Learning for Spacecraft Operations\" - Hugh Brown (PyCascades 2021)",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0jNMDqTqD2s"
    }
  ]
}
