{
    "description": "The rise of SPAs has brought many benefits, but it has also introduced complexity and performance overheads that can be overwhelming. As Django developers, we know the power and elegance of the Django framework, and we believe it can deliver a better user experience without the need for heavy JavaScript frameworks.\n\nIn this talk, we will dive into the concepts of HTMX, a lightweight library that allows us to update parts of the HTML directly from the server, and AlpineJS, a minimal JavaScript framework for enhancing interactivity. We will explore how these tools can be integrated seamlessly with Django to create modern web apps with enhanced user experiences.\n\nAdditionally, we'll see how Django 4.2's `StreamingHttpResponse` lays the foundation for better experiences of views that require slow queries, microservice calls, or APIs.\n\n### Key points:\n1. Understanding the limitations of JavaScript-heavy SPAs:\n- Increased complexity and maintenance overhead\n- Slower initial load times and performance implications\n2. Introduction to HTMX: Learn how to leverage HTMX to update parts of the HTML directly from the server, eliminating the need for heavy JavaScript frameworks.\n3. Enhancing Interactivity with AlpineJS: Discover how to add lightweight JavaScript interactions to your Django app using AlpineJS, improving the user experience without sacrificing simplicity.\n4. Streaming HTML for Performance: Explore how to stream HTML to deliver a fast and interactive experience, even in slow network connections or large datasets.\n5. Case Study: Dive into a real-world example of a web app that leveraged streaming HTML to achieve impressive user experiences.\n\nBy the end of this talk, attendees will be inspired to leverage HTMX, AlpineJS, and streaming HTML to create modern web applications with exceptional user experiences. They will gain insights into the benefits and trade-offs of this approach compared to JavaScript-heavy SPAs and leave with practical tips and best practices for implementing these techniques in their Django projects.",
    "language": "eng",
    "recorded": "2023-10-16",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2023.djangocon.us"
        }
    ],
    "speakers": [
        "Chris May"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/kYV8K71pY64/maxresdefault.jpg",
    "title": "HTML-ivating your Django web app's experience with HTMX, AlpineJS, and streaming HTML.",
    "videos": [
        {
            "type": "youtube",
            "url": "https://youtu.be/kYV8K71pY64"
        }
    ]
}
