{
    "description": "Of all our faculties, imagination is usually considered the freest, the seat of creation.\n\nAccording to Immanuel Kant, imagination allows us to take what nature gives us, and work it up into something new, that doesn't yet exist: \"As natural physical beings we are bound by laws of nature, as moral agents by the law of practical reason, but **as imaginative creatures we are constrained by neither and thus have creative power**.\"\n\nWhat's more, as programmers, we are a special kind of imagineer. Unlike other engineers, or pharmacologists, or architects (but like writers and musicians) we get to work upon a blank page.\n\nI'm interested in what we are doing with this freedom, and I am suspicious of it.\n\nFirstly, I think that the more grandiose the pictures we describe and draw, the less they actually matter.\n\nSecondly, I think that the things we don't even realise we're doing are the ones that are really shaping our future.\n\nAnd thirdly and most importantly, I think that the marvellous new worlds we conjure up on our blank pages can always be traced back to assumptions, prejudices and desires that are active right now: the programmer's imagination isn't telling us about the future, but about *now* - and what's wrong with it.\n\nWhat do small and harmless things like Django's own success page tell us about our own thinking? *What does Django make us think?*\n\nAs well as Immanuel Kant, dinosaurs and birds, palaeoart and 1980s computer programming books, David H Ahl and Jason Lanier will be brought on stage to help make sense of what we're doing, what we *think* we're doing, the relationship between them - and what, perhaps, we *should* be doing.",
    "language": "eng",
    "recorded": "2023-10-17",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://2023.djangocon.us"
        }
    ],
    "speakers": [
        "Daniele Procida"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/uvh6yXEbHUc/maxresdefault.jpg",
    "title": "The programmer's imagination",
    "videos": [
        {
            "type": "youtube",
            "url": "https://youtu.be/uvh6yXEbHUc"
        }
    ]
}
