{
  "alias": "video/275/pycon-2010--powerful-pythonic-patterns---186",
  "category": "PyCon US 2010",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Powerful Pythonic Patterns video\n\nPresented by Alex Martelli\n\nAn extremely misguided meme is going around: that Python doesn't have,\nor need, any Design Patterns. Maybe the meme springs from not realizing\nwhat the Gang Of Four state so plainly in their historical \"Design\nPatterns\" book: which design patterns are useful DOES depend on the\nprogramming language one targets -- design is NOT independent of\nimplementation, as the epic-fail \"Waterfall\" Methodology Pattern would\nsuggest. If you examine a \"classic DP\" that's basically a workaround for\nsome other language's lack of garbage collection, or for a clumsy\nstatic-typing system, it may indeed be worthless for Python. But many\nother DPs are still perfectly useful and applicable, and indeed Python's\nstrengths as a language afford riffing on them to develop highly\nPythonic, powerful, productive variants.\n\nIn this talk, I analyze some of my favorite pattern families -- e.g.,\nTemplate Method and its variants, Dependency Injection and its ilk,\nCallback and friends -- in a highly Pythonic context. Non-pattern\nIdioms, and Patterns that aren't really Design Patterns but rather\nArchitecture or Methodology ones, also make cameo appearances.\n",
  "duration": null,
  "id": 275,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2010-02-19",
  "slug": "pycon-2010--powerful-pythonic-patterns---186",
  "speakers": [
    "Alex Martelli"
  ],
  "summary": "",
  "tags": [
    "designpatterns",
    "pycon",
    "pycon2010",
    "python-advanced"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_275___powerful-pythonic-patterns-186",
  "title": "Powerful Pythonic Patterns (#186)",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_275___powerful-pythonic-patterns-186"
    }
  ]
}
