{
  "abstract": "Abstract\n~~~~~~~~\n\nI am a backend Software Engineer at Yelp who uses Python extensively for\nbuilding Yelps infrastructure and internal tools. I also suffer from a\ngenetic disorder called Albinism which often results in limited visual\nacuity that can range from 20/120 to 20/200 in most common cases. With\nsuch a low vision it's extremely difficult to read the computer screen\nwithout the use of on-screen magnifiers. In this talk, we will see how a\nperson with adverse visual acuity can thrive and be successful in the\nfield of Software Engineering. We will address the importance and\nmeaning of accessibility for Software Engineers with partial vision and\nrecommend some best practices that are available today. We will also\ntalk about the importance of an inclusive work culture that can help\nfoster creativity and ease ramp up for a Software Engineer with a\ndisability.\n\nStructure of this talk\n~~~~~~~~~~~~~~~~~~~~~~\n\n1.  Define low vision\n2.  Demographics of low vision\n3.  Educational challenges and strategies for overcoming\n4.  Classroom accessibility\n5.  Access to reading material\n6.  Access to technology: philosophy behind using an on-screen magnifier\n    and demo\n7.  Professional challenges and strategies for overcoming\n8.  Getting Hired\n9.  Community and peer support\n10. A live demo showcasing how someone with low vision codes\n\nKey takeaways\n~~~~~~~~~~~~~\n\n1. Strong practical understanding of what low vision means in real life.\n2. Simple and pragmatic strategies to overcome fundamental limitations\n   that a person with low vision faces in a typical career path in\n   software engineering.\n3. Ways in which the tech community can support individuals with low\n   vision to be successful and efficient.\n",
  "copyright_text": null,
  "description": "We will look into a day in the life of a Software Engineer with limited\nvision to Understand their difficulties at work and how they can\novercome those difficulties to become successful in their role.\n",
  "duration": 1357,
  "language": "eng",
  "recorded": "2018-11-04",
  "related_urls": [
    {
      "label": "Group web",
      "url": "https://2018.northbaypython.org/"
    },
    {
      "label": "Group meeting schedule",
      "url": "https://2018.northbaypython.org/schedule/"
    }
  ],
  "speakers": [
    "Abrar Sheikh"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/FvlzaOrLBNw/maxresdefault.jpg",
  "title": "Guide to Software Engineering for Visually Impaired",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FvlzaOrLBNw"
    }
  ]
}
