{
  "abstract": "Recursion has an intimidating reputation for being the advanced skill of\ncoding sorcerers. But in this tutorial we look behind the curtain of\nthis formidable technique to discover the simple ideas under it.\n\nThrough live coding demos in the interactive shell, we'll answer the\nfollowing questions:\n\n-  What is recursion, and when is it a good idea and bad idea to use it?\n-  What's a stack, the call stack, and a stack overflow?\n-  What are all the confusing ways that recursion is commonly taught?\n-  Do some problems require recursion? Can recursion do anything a loop\n   can't?\n-  What is memoization, and how does functools.lru\\_cache work?\n-  How do I draw that cool-looking recursive fractal artwork with\n   Python's turtle module?\n\nBeginners will be able to follow this talk. All that is required is a\nwillingness to learn, and a willingness to have the willingness to\nlearn, and a willingness to have the willingness to have the willingness\nto learn, and... so on.\n",
  "copyright_text": null,
  "description": "Between unintelligible algorithms and beautiful fractal artwork,\nrecursion has an intimidating reputation. But the underlying ideas\nbehind it are simple. This tutorial presents a quick intro of recursive\ncode, Python's features for handling recursion, and drawing fractals\nwith the turtle module. If you've ever thought \"recursion is confusing\",\nthis tutorial is for you.\n",
  "duration": 1645,
  "language": "eng",
  "recorded": "2018-11-03",
  "related_urls": [
    {
      "label": "Group web",
      "url": "https://2018.northbaypython.org/"
    },
    {
      "label": "Group meeting schedule",
      "url": "https://2018.northbaypython.org/schedule/"
    }
  ],
  "speakers": [
    "Al Sweigart"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/AfBqVVKg4GE/maxresdefault.jpg",
  "title": "Recursion for Beginners: A Beginner's Guide to Recursion",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AfBqVVKg4GE"
    }
  ]
}
