{
  "abstract": "Jurassic Park in 3 Minutes\n\nIn this section I will do a quick and funny recap of Jurassic Park so we\ncan all be on the same page and so I can talk about dinosaurs.\n\nSoftware Engineering in Jurassic Park\n\nThis section will include further discussion of the points in the story\nthat intersect with software development. Points of discussion could\ninclude:\n\n-Vague requirements\n\n-Unrealistic Timelines\n\n-Scope Creep\n\n-Insufficient Budgeting\n\n-Insuffiecient Testing\n\nUnethical Behavior as a Form of Chaos\n\nThis section will examine the choices of Nedry and how his unethical\nbehavior was a catalyst for failures. The topic of Engineering Ethics\nwill be introduced and explored. Ethical behavior prevents certain types\nof failures (imagine a contractor is using the wrong grade of steel for\na building to cut cost). Additionally testing your work by ‘breaking\nthings on purpose’ and ‘expecting failure’ is actually a very good\napplication of engineering ethics.\n\nA Resilient Jurassic Park\n\nThe final section will speculate about what could have been if the\njurassic park software was subjected to some manufactured chaos instead\nof some dinosaurian chaos and also if Nedry had been more moral fiber.\n",
  "copyright_text": null,
  "description": "Who would believe that theme park filled with genetically engineered\ndinosaurs could have failed? Fragile software and the lead developer’s\ndeeply unethical behavior played a huge role in the downfall of this\namazing park. This talk will explore the relationship between\nengineering ethics, chaos, and building resilient systems. Expect to\nlaugh, cry, and learn to build a better park.\n",
  "duration": 1063,
  "language": "eng",
  "recorded": "2018-11-03",
  "related_urls": [
    {
      "label": "Group web",
      "url": "https://2018.northbaypython.org/"
    },
    {
      "label": "Group meeting schedule",
      "url": "https://2018.northbaypython.org/schedule/"
    }
  ],
  "speakers": [
    "Hayley Denbraver"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/1Jp6h66Yh2M/maxresdefault.jpg",
  "title": "Welcome to Jurassic Park: Where Chaos and Engineering Ethics Collide",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1Jp6h66Yh2M"
    }
  ]
}
