{
    "title": "The Zen of Python Teams: New Lessons",
    "description": "\"The Zen of Python Teams: New Lessons\" by: Adrienne Lowe\n\nThe Zen of Python, accessed by running import this, is a list of nineteen aphorisms that have guided the development of the language. It has good advice for how to organize our code, but what does it have to say about how we organize ourselves? Plenty: the Zen of Python is not only a solid set of development principles, but the other easter egg is that it’s packed with wisdom about how to build healthy teams.\n\nIn this talk I draw upon my time as a Director of happy Python-focused engineering teams to tell stories of what the Zen of Python has to teach us about communication and conflict, building inclusive teams and transparent processes, and promoting psychological safety. Come ready to reflect on and feel inspired by a new interpretation of these principles, and bring what you learn back to your meetup, study group, open source project, or team.\n\nWho and Why:\n\nThis talk is for anyone who works with other humans on Python projects in any capacity--at Meetups, study groups, on open source projects, or at work. No background knowledge or experience is required, only an interest in learning about communication and teamwork, and hearing examples from some teams that struggled, but found ways to work together, better.\n\nWhile the context of the talk is that the speaker leads Python teams, you absolutely don't have to manage or lead a development team or even be on a professional development team to learn from this talk. I hope to show how anyone can find fresh, insightful, and personal meaning in the Zen of Python to communicate more clearly, handle conflict more gracefully, document their processes more transparently, and improve their relationships.\n \nFinally, in the closing part of this talk, attendees will reflect on and develop an inspiring aphorism of their own that speaks to the team they currently work most closely with. I will suggest they share this new \"21st aphorism\" with their networks and team.\n\nRecorded at the 2020 Python Web Conference (https://2020.pythonwebconf.com)",
    "thumbnail_url": "https://i.ytimg.com/vi/3Fm01szGEPM/hqdefault.jpg",
    "duration": 2347,
    "speakers": [
        "Adrienne Lowe"
    ],
    "language": "eng",
    "recorded": "2020-06-19",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=3Fm01szGEPM"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2020.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2020.pythonwebconf.com/presentations/the-zen-of-python-teams-new-lessons.html"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2020"
    ]
}