{
    "title": "To comment or not? A data-driven look at attitudes toward code comments",
    "description": "To comment or not? A data-driven look at attitudes toward code comments\" by: Veronica Hanus\n\nEvery programmer has asked themselves “how many comments are too many?” To the newest programmers, comments may seem magical--a way of documenting without giving instructions to the computer. But commenting engages the same vulnerability as more advanced challenges (i.e. pair programming & code review) and is likely to pique the insecurity of many programmers (especially the copy-and-paste or tutorial-level programmer)!\n\nWhile most of us agree that commenting is part of writing maintainable code, it’s very difficult for someone who has not yet worked in a community-reviewed codebase to know what is good practice and not. The answers that come back often conflict each other: Code should be DRY, but well-placed comments save future devs. How can someone find the commenting style that is best for them as they learn, grow, & contribute? My survey of 170 long-time developers, Computer Science majors, bootcamp grads, & hobby programmers confirms some expectations and brings others into question. Join me for a data-based chat about the biggest pain points caused by our attitudes toward commenting and the steps we can take to encourage a growth mindset and empower programmers of all levels.\n\nRecorded at the 2020 Python Web Conference (https://2020.pythonwebconf.com)",
    "thumbnail_url": "https://i.ytimg.com/vi/qLh0D5zPrpE/hqdefault.jpg",
    "duration": 1925,
    "speakers": [
        "Veronica Hanus"
    ],
    "language": "eng",
    "recorded": "2020-06-19",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=qLh0D5zPrpE"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2020.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2020.pythonwebconf.com/presentations/web-security-101.html"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2020"
    ]
}