{
    "title": "You want to Kubernetes? You MUST know Docker!",
    "description": "\"You want to Kubernetes? You MUST know Docker!\" by: Angel Rivera\n\nAchieving velocity is the new normal in software development and release practices. DevOps teams are becoming more efficient and optimizing their ability to produce quality software consistently and faster. This velocity can be directly attributed to the adoption of DevOps and CI/CD practices and the implementation of DevOps tooling is at the core of these gains. Container orchestration platforms like Kubernetes are incredibly powerful and companies of all shapes and sizes wanting to embrace this powerful technology find it very difficult to find a starting point. Often enough this can be attributed to the lack of foundational skill sets required to succeed in their Kubernetes journey. This includes the lack of knowledge and experience with the Docker runtime and containers. \n\nHaving a deep understanding of the Docker runtime and containers is a paramount in successfully adopting and operating Kubernetes. In this talk Angel will discuss the skill sets that individuals and teams must develop prior to endeavoring in their Kubernetes initiatives. Attendees will learn about the various skill sets needed to proficiently get started with Kubernetes. Angel will also discuss the critical aspects of the Docker runtime and containers along with demonstrating how to perform critical actions within the Docker runtime. Attendees will walk away with a solid grasp of the Docker runtime and containers that will better prepare them for their DevOps and Kubernetes initiatives.\n\nRecorded at the 2020 Python Web Conference (https://2020.pythonwebconf.com)",
    "thumbnail_url": "https://i.ytimg.com/vi/GeAnaegp1Uk/hqdefault.jpg",
    "duration": 2845,
    "speakers": [
        "Angel Rivera"
    ],
    "language": "eng",
    "recorded": "2020-06-18",
    "videos": [
        {
            "type": "youtube",
            "url": "https://www.youtube.com/watch?v=GeAnaegp1Uk"
        }
    ],
    "related_urls": [
        {
            "label": "Conference schedule",
            "url": "https://2020.pythonwebconf.com/schedule"
        },
        {
            "label": "Talk announcement",
            "url": "https://2020.pythonwebconf.com/presentations/you-want-to-kubernetes-you-must-know-docker.html"
        }
    ],
    "tags": [
        "PythonWebConf",
        "PythonWebConf2020"
    ]
}