{
  "description": "*Charla: Uso eficiente de Python*\n\nCharla PyCon Chile 2023, Track Web, Domingo 26 Noviembre 2023.\n\nNelson Solano es un apasionado por las tecnologías libres y la democratización del acceso a las mismas. Ha participado como ponente en varios eventos de prestigiosas organizaciones con temáticas como Software Libre, programación, seguridad informática, nanotecnología, ente otros. Actualmente se desempeña como desarrollador Python. En esta charla, Nelson destaca la importancia de optimizar el uso de recursos, tiempo y rendimiento al programar en Python. Se abordan temas como la optimización prematura y el profiling, la elección adecuada de estructuras de datos como listas, conjuntos y diccionarios, así como la eficiencia de comprensiones de listas y generadores para manipular datos de manera más efectiva. Se resalta la ventaja de utilizar bibliotecas externas para tareas especializadas. En última instancia, se enfatiza el equilibrio entre legibilidad y optimización, alentando a los asistentes a aplicar estos conceptos para lograr un uso eficiente y efectivo de Python en sus proyectos.\n\n----\n\nPyCon Chile 2023 - https://pycon.cl/\n\nPyCon Chile es un evento gratuito organizado por la comunidad Python Chile, para promover la divulgación y enseñanza de Python. Esta conferencia busca reunir a todos los entusiastas de Python, desde principiantes hasta usuarios avanzados, para compartir distintas temáticas relacionadas al lenguaje.\n\nSi te interesa utilizar Python en áreas tan variadas como ciencia de datos, inteligencia artificial, astronomía, geología, optimización matemática o ciencias sociales, entre otras, ¡este evento te encantará!\n\n----\n\n★ ¡Únete a la comunidad PythonChile! ★\n\n• Twitter: https://twitter.com/pythonchiledev\n• Facebook: https://www.facebook.com/groups/pytho...\n• Telegram: https://t.me/pythonchile\n• Discord: https://discord.gg/dTHMfJvauS",
  "duration": 2114,
  "language": "spa",
  "recorded": "2022-11-24",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pycon.cl/2023/"
    },
    {
      "label": "https://twitter.com/pythonchiledev",
      "url": "https://twitter.com/pythonchiledev"
    },
    {
      "label": "https://www.facebook.com/groups/pytho...",
      "url": "https://www.facebook.com/groups/pytho..."
    },
    {
      "label": "https://pycon.cl/",
      "url": "https://pycon.cl/"
    },
    {
      "label": "https://t.me/pythonchile",
      "url": "https://t.me/pythonchile"
    },
    {
      "label": "https://discord.gg/dTHMfJvauS",
      "url": "https://discord.gg/dTHMfJvauS"
    }
  ],
  "speakers": [
    "Nelson Solano"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/05K14oqsLhw/maxresdefault.jpg",
  "title": "Uso eficiente de Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=05K14oqsLhw"
    }
  ]
}
