{
  "description": "*Charla (en español): Construyendo una Arquitectura de Datos Empresarial con Python.*\n\nCharla PyCon Chile 2023, Track Datos, Domingo 26 Noviembre 2023.\n\nFabio Pinto es docente investigador con énfasis en Diseño Centrado en el Usuario, Innovación y Sistemas Interactivos Digitales, con conocimientos avanzados en programación con Python para desarrollo backend y en analítica de datos con R, desde el análisis estadístico de los datos hasta el uso de herramientas como Power Bi y Tableau. En esta charla Fabio explica el concepto de business intelligence y sus ventajas para el análisis prospectivo empresarial. Con un caso real, explica las características de una arquitectura de datos empresarial y cómo podemos facilitarla usando Python.\n\n----\n\nPyCon Chile 2023 - https://pycon.cl/\n\nPyCon Chile es un evento gratuito organizado por la comunidad Python Chile, para promover la divulgación y enseñanza de Python. Esta conferencia busca reunir a todos los entusiastas de Python, desde principiantes hasta usuarios avanzados, para compartir distintas temáticas relacionadas al lenguaje.\n\nSi te interesa utilizar Python en áreas tan variadas como ciencia de datos, inteligencia artificial, astronomía, geología, optimización matemática o ciencias sociales, entre otras, ¡este evento te encantará!\n\n----\n\n★ ¡Únete a la comunidad PythonChile! ★\n\n• Twitter: https://twitter.com/pythonchiledev\n• Facebook: https://www.facebook.com/groups/pytho...\n• Telegram: https://t.me/pythonchile\n• Discord: https://discord.gg/dTHMfJvauS",
  "duration": 1982,
  "language": "spa",
  "recorded": "2022-11-24",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pycon.cl/2023/"
    },
    {
      "label": "https://twitter.com/pythonchiledev",
      "url": "https://twitter.com/pythonchiledev"
    },
    {
      "label": "https://www.facebook.com/groups/pytho...",
      "url": "https://www.facebook.com/groups/pytho..."
    },
    {
      "label": "https://pycon.cl/",
      "url": "https://pycon.cl/"
    },
    {
      "label": "https://t.me/pythonchile",
      "url": "https://t.me/pythonchile"
    },
    {
      "label": "https://discord.gg/dTHMfJvauS",
      "url": "https://discord.gg/dTHMfJvauS"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/DGG085qIpi4/maxresdefault.jpg",
  "title": "PyCon 2023 Fabio Pinto - Construyendo una Arquitectura de Datos Empresarial con Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DGG085qIpi4"
    }
  ]
}
