{
  "description": "*Charla (en español): Excelencia o rapidez en el código no lo es todo: la lucha por la adopción de una comunidad.* (Great or fast code is not enough: the fight for community adoption).\n\nCharla PyCon Chile 2023, Track Web, Domingo 26 Noviembre 2023.\n\nEn esta charla Christopher describe su experiencia personal desarrollando software científico para química computacional a lo largo de la última década, y como el movimiento hacia la usabilidad con Python está abriendo nuevas oportunidades como nunca antes. \n\nChristopher es profesor en el departamento de ingeniería mecánica de la Universidad Técnica Federico Santa María, donde participa en diversos proyectos de investigación con una fuerte componente de computación científica, y donde enseña mecánica de fluidos de manera práctica a través de python y jupyter notebooks.\n\n----\n\nPyCon Chile 2023 - https://pycon.cl/\n\nPyCon Chile es un evento gratuito organizado por la comunidad Python Chile, para promover la divulgación y enseñanza de Python. Esta conferencia busca reunir a todos los entusiastas de Python, desde principiantes hasta usuarios avanzados, para compartir distintas temáticas relacionadas al lenguaje.\n\nSi te interesa utilizar Python en áreas tan variadas como ciencia de datos, inteligencia artificial, astronomía, geología, optimización matemática o ciencias sociales, entre otras, ¡este evento te encantará!\n\n----\n\n★ ¡Únete a la comunidad PythonChile! ★\n\n• Twitter: https://twitter.com/pythonchiledev\n• Facebook: https://www.facebook.com/groups/pytho...\n• Telegram: https://t.me/pythonchile\n• Discord: https://discord.gg/dTHMfJvauS",
  "duration": 2767,
  "language": "spa",
  "recorded": "2022-11-24",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pycon.cl/2023/"
    },
    {
      "label": "https://twitter.com/pythonchiledev",
      "url": "https://twitter.com/pythonchiledev"
    },
    {
      "label": "https://www.facebook.com/groups/pytho...",
      "url": "https://www.facebook.com/groups/pytho..."
    },
    {
      "label": "https://pycon.cl/",
      "url": "https://pycon.cl/"
    },
    {
      "label": "https://t.me/pythonchile",
      "url": "https://t.me/pythonchile"
    },
    {
      "label": "https://discord.gg/dTHMfJvauS",
      "url": "https://discord.gg/dTHMfJvauS"
    }
  ],
  "speakers": [
    "Christopher Cooper"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/x4fm-m8zhhY/maxresdefault.jpg",
  "title": "Excelencia o rapidez en el código no lo es todo: la lucha por la adopción",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=x4fm-m8zhhY"
    }
  ]
}
