{
  "description": "*Charla: Heredar o no Heredar, ¡Ahí está la Composición de la Cuestión!*\n\nCharla PyCon Chile 2023, Track Web, Domingo 26 Noviembre 2023.\n\nEmiliano Martin estudió Ingeniería en Sistemas de Información en la UTN y actualmente trabaja en Mercado Libre como Technical Lead.  Es un apasionado del desarrollo de software, y le gusta estar en un constante aprendizaje de nuevas tecnologías y buenas prácticas de programación. En esta charla, Emiliano comenta por qué en muchas ocasiones aplicar la herencia puede no ser la mejor opción, o al menos por qué debemos cuestionarnos si realmente es la solución adecuada. Mediante diversos ejemplos, ilustra las ventajas de utilizar la composición en nuestros desarrollos, especialmente desde una perspectiva Pythonica que permita aprovechar la flexibilidad que provee Python.\n\n----\n\nPyCon Chile 2023 - https://pycon.cl/\n\nPyCon Chile es un evento gratuito organizado por la comunidad Python Chile, para promover la divulgación y enseñanza de Python. Esta conferencia busca reunir a todos los entusiastas de Python, desde principiantes hasta usuarios avanzados, para compartir distintas temáticas relacionadas al lenguaje.\n\nSi te interesa utilizar Python en áreas tan variadas como ciencia de datos, inteligencia artificial, astronomía, geología, optimización matemática o ciencias sociales, entre otras, ¡este evento te encantará!\n\n----\n\n★ ¡Únete a la comunidad PythonChile! ★\n\n• Twitter: https://twitter.com/pythonchiledev\n• Facebook: https://www.facebook.com/groups/pytho...\n• Telegram: https://t.me/pythonchile\n• Discord: https://discord.gg/dTHMfJvauS",
  "duration": 1938,
  "language": "spa",
  "recorded": "2022-11-24",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pycon.cl/2023/"
    },
    {
      "label": "https://twitter.com/pythonchiledev",
      "url": "https://twitter.com/pythonchiledev"
    },
    {
      "label": "https://www.facebook.com/groups/pytho...",
      "url": "https://www.facebook.com/groups/pytho..."
    },
    {
      "label": "https://pycon.cl/",
      "url": "https://pycon.cl/"
    },
    {
      "label": "https://t.me/pythonchile",
      "url": "https://t.me/pythonchile"
    },
    {
      "label": "https://discord.gg/dTHMfJvauS",
      "url": "https://discord.gg/dTHMfJvauS"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Pycon2023",
    "Python",
    "Web",
    "composición",
    "herencia"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/tOkCHgObq9Y/maxresdefault.jpg",
  "title": "PyCon Chile 2023 Emiliano Martin - Heredar o no Heredar, ¡Ahí está la Composición de la Cuestión!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tOkCHgObq9Y"
    }
  ]
}
