{
  "id": 3223, 
  "category": "Kiwi PyCon 2014", 
  "slug": "basil-making-it-easy-to-spin-up-best-practice-p", 
  "title": "basil - making it easy to spin up best practice python web frameworks", 
  "summary": "", 
  "description": "= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = \r\nGrant Paton-Simpson / Ben Denham:\r\nbasil - making it easy to spin up best practice python web frameworks\r\n= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = \r\n@ Kiwi PyCon 2014 - Sunday, 14 Sep 2014 - Track 2\r\nhttp://kiwi.pycon.org/\r\n\r\n**Audience level**\r\n\r\nIntermediate\r\n\r\n**Description**\r\n\r\nPython is a great language for web development but spinning up Python web frameworks for development is still not as easy as it could be - especially if following a particular form of best practice e.g. altering the standard folder structure. Basil addresses this pain point. Use cases include students building basic web apps and experienced devs trying out less familiar web frameworks.\r\n\r\n**Abstract**\r\n\r\nPython is a great language for web development but spinning up Python web frameworks for development is still not as easy as it could be - especially if you're trying to follow a particular form of best practice e.g. altering the standard folder structure, or separating secrets (unversioned) from settings (versioned). And even if you are familiar with one framework, it may not be as easy to spin up another one. The basil project is an attempt to address this pain point. Use cases may include a teaching session where students are learning Python by building a basic web application. Or an experienced developer wanting to try out an alternative web framework. The presentation will look at some of the challenges involved in designing basil.\r\n\r\nThe talk will cover the following topics:\r\n\r\n - standard user experience of setting up a web framework for Python (contrasted with other languages)\r\n - the user experience of basil\r\n - use cases for basil (new developers, experienced developers, teaching)\r\n - existing alternative solutions\r\n - benefits of using vagrant\r\n\r\n**Slides**\r\n\r\nhttps://speakerdeck.com/nzpug/ben-denham-basil-making-it-easy-to-spin-up-best-practice-python-web-frameworks", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC", 
  "thumbnail_url": "http://i.ytimg.com/vi/ynxQ3qF7LwY/hqdefault.jpg", 
  "duration": 1800, 
  "videos": [
    {
      "url": "http://youtu.be/ynxQ3qF7LwY", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://youtu.be/ynxQ3qF7LwY", 
  "tags": [
    "talk"
  ], 
  "speakers": [
    "Ben Denham", 
    "Grant Paton-Simpson"
  ], 
  "recorded": "2014-09-14"
}