{
  "id": 3225, 
  "category": "Kiwi PyCon 2014", 
  "slug": "exploring-the-philosophy-of-programming", 
  "title": "Exploring The Philosophy of Programming", 
  "summary": "", 
  "description": "= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = \r\nXuanyi Chew:\r\nExploring The Philosophy of Programming\r\n= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = \r\n@ Kiwi PyCon 2014 - Saturday, 13 Sep 2014 - Track 1\r\nhttp://kiwi.pycon.org/\r\n\r\n**Audience level**\r\n\r\nIntermediate\r\n\r\n**Description**\r\n\r\nOne man's journey to internalizing the phrase \"computer programs are just bits\". It's merely a phrase, but one that can be deeply appreciated if time is taken to appreciate it. Talk will roughly be about bytes, types, computation theory, language design, and some life stories.\r\n\r\n**Abstract**\r\n\r\nIt all started with a bunch of Python 3 code written in another language. What followed were explorations as to what it really means to be programming. Why are some languages easier to learn (Python)? Why is it easier to make mistakes in some languages (JavaScript)? And why are some languages totally alien (APL and its family)?\r\n\r\nWhat role does familiarity play in being productive in a language? Why are there different paradigms in programming? What about the correctness of programs? Is one paradigm more correct than others? This talk explores the history of computer science, programming and the potential for the human race.\r\n\r\nUltimately, this talk tries to answer the question: is programming for humans or for machines? And what role Python plays in it. The question on the future is left to the audience to decide.\r\n\r\n**Slides**\r\n\r\nhttps://speakerdeck.com/nzpug/xuanyi-chew-exploring-the-philosophy-of-programming", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC", 
  "thumbnail_url": "http://i.ytimg.com/vi/hUP27HAtSOc/hqdefault.jpg", 
  "duration": 1800, 
  "videos": [
    {
      "url": "http://youtu.be/hUP27HAtSOc", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://youtu.be/hUP27HAtSOc", 
  "tags": [
    "talk"
  ], 
  "speakers": [
    "Xuanyi Chew"
  ], 
  "recorded": "2014-09-13"
}