{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": 1800, "video_ogv_download_only": false, "category": "Kiwi PyCon 2014", "speakers": ["Ryan Kelly"], "title": "PyPy.js: What? How? Why?", "quality_notes": "", "video_flv_length": null, "recorded": "2014-09-14", "video_mp4_length": null, "description": "= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = \r\nRyan Kelly:\r\nPyPy.js: What? How? Why?\r\n= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = \r\n@ Kiwi PyCon 2014 - Sunday, 14 Sep 2014 - Track 1\r\nhttp://kiwi.pycon.org/\r\n\r\n**Audience level**\r\n\r\nIntermediate\r\n\r\n**Description**\r\n\r\nPyPy.js is an experiment in building a fast and compliant in-browser python interpreter, by compiling PyPy into javascript and retargeting its JIT to emit asmjs code at runtime. This talk will demonstrate the combination of technologies that make such a thing possible, the results achieved so far, and the challenges that still remain when taking python onto javascript's home turf.\r\n\r\n**Abstract**\r\n\r\nPyPy.js is an experiment in building a fast, compliant, in-browser python interpreter. By compiling the PyPy interpreter into javascript, and retargeting its JIT compiler to emit asmjs code at runtime, it is possible to run python code in the browser at speeds competitive with a native python environment. This talk will demonstrate the combination of technologies that make such a thing possible, the results that have been achieved so far, and the challenges that still remain when trying to take python onto javascript's home turf.\r\n\r\nWe'll cover: an overview of PyPy and why it's a good fit for this type of project; an introduction to asmjs and the rise of javascript as a compile target; what it looks like when you smoosh these two technologies together; a comparison with other approaches such as brython; and some concrete suggestions for how the result might be useful in practice.\r\n\r\n**Slides**\r\n\r\nhttps://speakerdeck.com/nzpug/ryan-kelly-pypy-dot-js-what-how-why", "video_mp4_url": null, "tags": ["talk"], "copyright_text": "CC", "related_urls": [], "video_flv_download_only": false, "source_url": "http://youtu.be/pt-e-X_q-dk", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://i.ytimg.com/vi/pt-e-X_q-dk/hqdefault.jpg", "video_flv_url": null}