{
  "id": 3226, 
  "category": "Kiwi PyCon 2014", 
  "slug": "python-is-slow-make-it-faster-with-c", 
  "title": "Python is slow, make it faster with C", 
  "summary": "", 
  "description": "= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = \r\nBen Shaw:\r\nPython is slow, make it faster with C\r\n= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = \r\n@ Kiwi PyCon 2014 - Saturday, 13 Sep 2014 - Track 2 \r\nhttp://kiwi.pycon.org/\r\n\r\n**Audience level**\r\n\r\nIntermediate\r\n\r\n**Description**\r\n\r\nMost people have heard that it's possible to integrate Python with C to give performance boosts to computationally heavy code, but because it seems daunting they've never given it a try. It's actually not as hard as you think. This talk covers some of the different methods of speeding up your code with C, and compares the results to those you can get from other methods, like using PyPy.\r\n\r\n**Abstract**\r\n\r\nIntroduction\r\n\r\nAs developers, we like to work with Python because it's forgiving, quick to develop for and allows our code to be very dynamic. Unfortunately the trade-off for this magic is lower performance than compiled languages. Python can be sped up by offloading heavy algorithms to compiled C, using specially built C modules utilising the C Python API, or by integrating existing C libraries with using the python ctypes module. It is also possible to speed up Python using alternative interpreters, like PyPy, which uses a JIT compiler.\r\n\r\nPure Python Implementation\r\n\r\nFirst we will take a look at a CPU bound algorithm written purely in Python, and see how it performs. The program reads data and prints results. The time it takes to run this will be considered the worst case scenario.\r\n\r\nPure C Implementation\r\n\r\nThe same program will be re-written in C, including the input and output logic, and we will compare the time it takes to run against the Python implementation. The results of the C implementation will be considered the best case scenario.\r\n\r\nCustom Python Module with C Implementation\r\n\r\nPython provides an API, C development headers and special C types, to allow the creation of a specially built bridges between Python and C code. In this example, the algorithm will be written in C, and bridged to Python with a custom Python/C module. Input and output takes place within Python, with C only performing the computation. With this method we can achieve near best-case speeds, at the cost of some additional (and sometimes complicated) C coding.\r\n\r\nBridging To C with ctypes\r\n\r\nIntroduced in Python 2.5, ctypes allows Python to integrate with pre-built C libraries without custom C code. This approach has the advantage over the custom Python/C Module of not needing to write a lot of boilerplate and bridging code in C. As with the Py/C implementation, C is used only to execute the algorithm, and Python takes care of input and output. Again, performance is close to best-case speeds, but the work to integrate with C is much less.\r\n\r\nAlternative Python Implementations\r\n\r\nPyPy uses a JIT compiler to offer impressive performance gains. The original Python code will be run through PyPy, and although the results might not be as quite as good as using compiled C, they come close, and the effort-to-gain ratio certainly makes it attractive option.\r\n\r\nConclusion\r\n\r\nEach performance boosting option has its pros and cons, and when it's so easy to just use PyPy and get good results, why would you still use C? We'll look at some example use cases for each of the methods presented and why you would choose one over the others.\r\n\r\n**Slides**\r\n\r\nhttps://speakerdeck.com/nzpug/ben-shaw-python-is-slow-make-it-faster-with-c", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC", 
  "thumbnail_url": "http://i.ytimg.com/vi/tGLSKXfx0m0/hqdefault.jpg", 
  "duration": 1800, 
  "videos": [
    {
      "url": "http://youtu.be/tGLSKXfx0m0", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://youtu.be/tGLSKXfx0m0", 
  "tags": [
    "talk"
  ], 
  "speakers": [
    "Ben Shaw"
  ], 
  "recorded": "2014-09-13"
}