{
  "id": 3224, 
  "category": "Kiwi PyCon 2014", 
  "slug": "understanding-human-language-with-python", 
  "title": "Understanding human language with Python", 
  "summary": "", 
  "description": "= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = \r\nAlyona Medelyan:\r\nUnderstanding human language with Python\r\n= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = \r\n@ Kiwi PyCon 2014 - Sunday, 14 Sep 2014 - Track 1\r\nhttp://kiwi.pycon.org/\r\n\r\n**Audience level**\r\n\r\nNovice\r\n\r\n**Description**\r\n\r\nNatural Language Processing (NLP) is an area of Computer Science that studies how computers can understand human language. This talk will explain the main principles behind NLP and introduce some key Python libraries.\r\n\r\n**Abstract**\r\n\r\nNatural Language Processing (NLP) is an area of Computer Science that studies how computers can understand human language. Thanks to NLP, one day you might have your own intelligent assistant who can understand any dialect, who can answer your questions by finding the right answers on the web, and who can help you communicate in any language through instant and accurate translation.\r\n\r\nThere are many challenges that still need to be overcome for this to happen, but in the meantime researchers have been finessing the building blocks required for NLP analysis. Some of the algorithms out there are quite powerful already. Many exist in Python and are readily available for any Pythonista to use.\r\n\r\nThis talk will explain the main principles behind NLP and introduce some key Python libraries. If you are interested in finding out more, please also attend the in-depth tutorial on Friday.\r\n\r\n**Slides**\r\n\r\nhttps://speakerdeck.com/nzpug/alyona-medelyan-understanding-human-language-with-python", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "CC", 
  "thumbnail_url": "http://i.ytimg.com/vi/vZsW-xCXfRI/hqdefault.jpg", 
  "duration": 1800, 
  "videos": [
    {
      "url": "http://youtu.be/vZsW-xCXfRI", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://youtu.be/vZsW-xCXfRI", 
  "tags": [
    "talk"
  ], 
  "speakers": [
    "Alyona Medelyan"
  ], 
  "recorded": "2014-09-14"
}