{
  "category": "",
  "slug": "confident-web-development-with-react-by-julien",
  "title": "- Confident web development with React by Julien  Phalip",
  "summary": "Confident web development with React\n\nReact has become increasingly popular over the past year and is already used in large-scale products and companies such as Facebook, Instagram, Khan Academy, Hipchat and Netflix. This rapid success can in part be explained by React's performance qualities as well as its clean, predictable development workflow. To boot, its learning curve is very short despite it introducing a pretty radically different way of approaching front-end web development. Overall, React tends to greatly appeal to Django developers as both tools share the same philosophies of elegance and practicality.\n\nReact can benefit all types of web applications, from single-page apps to more conventional websites and can easily be introduced to complement existing web architectures. While React is Javascript-based and is primarily a client-side presentation tool, it remains agnostic about the rest of the stack and works really well with backend technologies like Django.\n\nIn this talk I will present how React and Django can work together to build powerful, easier-to-maintain web applications with confidence. I will start with a brief introduction of React's key concepts: the Flux architecture, the virtual DOM, JSX and the React component life-cyle. I will then explain how React can integrate with Django-powered backends and discuss some advanced topics such as server-side rendering, isomorphic JS, animations, testing, production environments and integration with asset pipelines. Numerous code samples will illustrate the various concepts presented. By the end of this talk, members of the audience who are unfamiliar with React will have a good grasp of its functioning and of its benefits; those already familiar with React will also have learned several useful tips applicable to their Django projects.\n\nHelp us caption & translate this video!\n\nhttp://amara.org/v/HIYT/",
  "description": "",
  "quality_notes": "",
  "language": "",
  "copyright_text": "",
  "thumbnail_url": "https://i.ytimg.com/vi/ixnoL8N_dd4/maxresdefault.jpg",
  "duration": 2506,
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ixnoL8N_dd4"
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=ixnoL8N_dd4",
  "tags": [
    "Science & Technology"
  ],
  "speakers": [],
  "recorded": "2015-09-24"
}