{
  "category": "",
  "slug": "django-tales-how-django-and-its-community-can-by",
  "title": "Django Tales: How Django and Its Community Can Change Lives by Anna  Ossowski",
  "summary": "Django Tales: How Django and Its Community Can Change Lives by Anna\nOssowski\n\n\"I came for the framework but I stayed for the community.“ Many people\nmake this statement when asked \"Why Django?“. The Django community can\nchange lives and has changed many lives, including my own. I’d like to\nshare Django Tales with you, stories of inspiring women whose lives were\nchanged by learning Django and becoming involved in the community. But\nwhat is it that makes the Django community so special and awesome? What\ndo we all love about Django and its community? There is no doubt that\nthe Django community is great but we’re not done yet! There are things\nwe can improve. So what can we do better? And how can you help improve\nour community? How can you help people become part of our community? If\nyou’re curious about the answers to those questions and would love to\nhear inspiring Django Tales, then this is the right talk for you :)\n\nSome things I will talk about:\n\nThe \"Your Django Story“ interview series on the Django Girls blog\n\nWhy Django Stories?\n\nHow Django can change lives: Stories of awesome whose lives were changed\nby learning Django\n\nWhat’s awesome about the Django community?\n\nWe’re not done yet! What can we do better?\n\nHow can you help people become part of the community/make our community\nbetter?\n",
  "description": "",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "",
  "thumbnail_url": "https://i.ytimg.com/vi/JQkM_fOlb2A/maxresdefault.jpg",
  "duration": 2164,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=JQkM_fOlb2A",
      "length": 0,
      "type": "youtube"
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=JQkM_fOlb2A",
  "tags": [],
  "speakers": [
    "Anna Ossowski"
  ],
  "recorded": "2015-09-18"
}