{
  "category": "",
  "slug": "introduction-to-sphinx-read-the-docs-by-eric",
  "title": "- Introduction to Sphinx & Read the Docs by Eric Holscher",
  "summary": "Introduction to Sphinx & Read the Docs\n\nThis talk will have four parts:\n\nWhy Write Documentation\nSemantic Markup\nSphinx\nRead the Docs\nThe beginning of this talk will cover why you should write documentation. Every talk to developers about documentation I feel needs this part, because when you talk about docs people are inherently skeptical. Once people get on board that docs are important, you can cover more interesting concepts.\n\nThen we will walk through the concepts around semantic documentation writing. Similar to Semantic HTML, this allows you to mark up your documentation with metadata that gives you a lot more power and flexibility around the display and authoring of documentation.\n\nThen we’ll have a basic introduction to Sphinx. This will talk about the power that Sphinx gives you to write documentation, and examples of how to use it. We will also cover the semantic power of Sphinx, playing on the previous section to understand it in practice.\n\nThen at last we’ll cover how to host your documentation on Read the Docs. This will make your documentation beautiful with a custom theme, and allow you to host multiple versions and formats of your docs.\n\nThe talk will include a basic demo of creating a basic documentation project, and getting it hosted on Read the Docs during the talk. All of the software will be running locally, so the demo won’t require an internet connection.\n\nHelp us caption & translate this video!\n\nhttp://amara.org/v/HIYQ/",
  "description": "",
  "quality_notes": "",
  "language": "",
  "copyright_text": "",
  "thumbnail_url": "https://i.ytimg.com/vi/eWNiwMwMcr4/maxresdefault.jpg",
  "duration": 1756,
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eWNiwMwMcr4"
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=eWNiwMwMcr4",
  "tags": [
    "Science & Technology"
  ],
  "speakers": [],
  "recorded": "2015-09-24"
}