{
  "category": "",
  "slug": "the-texas-tribune-making-data-and-state-politics",
  "title": "The Texas Tribune: Making Data, and State Politics, Public by Ryan Murphy",
  "summary": "The Texas Tribune: Making Data, and State Politics, Public by Ryan Murphy\n\nThe goal of everything we do is the same – how can we produce something useful for the citizens of Texas that enable them to be better participants in their state government?\n\nOur News Apps team is responsible for the building and maintaining of editorial-focused data explorers. Django's ease of use has made it possible for us to architect both robust back-end systems for managing the government data sets that power these apps, and to build compelling interfaces to the data for our users to find their own stories.\n\nMore details on the three projects we'd discuss:\n\nThe Government Salaries Explorer is our most popular explorer. This project manages the payroll data we've collected of more than 300 thousand public employees, providing a peak behind the curtains into how tax dollars are being spent. It required a system that could standardize the many different formats a public agency may release its payroll information to us, but also remain easy to use for all members of the team so updates happen in a timely fashion.\n\nThe Texas Legislative Guide was our spin on a legislative bill tracker. Instead of placing all the focus on the bills themselves, we instead created a platform for our reporters to provide context on the many topics and issues that come up during a legislative session. While we still have the capacity for users to search for bills, the site's bigger focus is on the potential changes this session's legislation may have on the state.\n\nAnd finally, our upcoming revamp of our Public Schools Explorer will be a Django app. This project is currently in it's very early stages, but it's on track to be released by DjangoCon so there will be plenty to show by then! The challenge – how can we take Texas Education Agency data and turn it into something usable for the citizens – and parents – of Texas? We are building an interface that makes it easy to compare and districts and campuses to one another, opening up state data that has always been public but frustratingly trapped within complicated web forms and paper printouts.\n\nWhile this proposal is more focused on \"what we did with Django\" vs. \"how we did it\" – although that will be touched on as well – I believe the work we've produced is a testament to the impact we've been able to have on the state and its citizens thanks to the support of a system that works well for us.\n\nHelp us caption & translate this video!\n\nhttp://amara.org/v/HHB1/",
  "description": "",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "",
  "thumbnail_url": "https://i.ytimg.com/vi/9IsGHophknU/maxresdefault.jpg",
  "duration": 2492,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=9IsGHophknU",
      "type": "youtube",
      "length": 0
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=9IsGHophknU",
  "tags": [],
  "speakers": [],
  "recorded": "2015-09-19"
}