{
  "category": "",
  "slug": "things-that-are-tired-uggs-segways-and-you-by",
  "title": "Things That are Tired: Uggs, Segways and you!.. by Barbara Shaurette",
  "summary": "Things That are Tired: Uggs, Segways and you! Coming Back from Burnout by Barbara Shaurette\n\nWhy is burnout such a bad thing?\n\nWhen I see that question on paper, the answer seems obvious. But in nearly a decade in this community, I've seen people run themselves into the ground without realizing that they can - and should - take the time to rest. Why? Well, the short answer is that, if you don't take a break once in a while, the quality of your work suffers. But the long and more involved answer? Well, as a wise man once said,\n\n\"Life moves pretty fast. If you don't stop and look around once in a while, you could miss it.\"\nBurnout leads to exhaustion, and that leads to terrible performance. And no one wants to be known for performing terribly - we all have too much pride for that. History is full of examples of times when exhaustion led to disaster - remember the Exxon Valdez? Imagine your open source project taking a header like that. I'm actually going to get a little science-y here and cite a few studies, in particular a recent one from Washington State University that shows how sleep-deprived people have an impaired ability to take in new information.\n\nOf course, you can get plenty of sleep and still be burned out. If your waking hours are consumed with community work, your relationships can suffer, and your sanity will erode pretty quickly.\n\nAfter nearly a decade in the Python and Django communities, I've experienced periods of overwork that have made me hate everything I was doing. I have a lot of good anecdotes, stories that will probably sound familiar to everyone in the room. Luckily, I've also learned some tactics for stepping back and recovering. It can be done, and it's easier than people think. What you're going to hear from this talk is just plain common sense. But sometimes when you're mired in work with no obvious way out, you need to hear it from someone else. So I'm giving everyone permission to let go. (And no, I promise, there will be no 'Frozen' references in my slides.)\n\nBut how do you let go? And when?\n\nBurnout is pretty easy to recognize if you know what to look for. Are you staying up every night reading pull requests ... and is that your primary method of interaction with other human beings? Your user group may only meet once a month, but is that group still responsible for the bulk of your email? Do you secretly blame them for your inability to get to inbox zero? Is the only travel you're doing for conferences? Have you given up on vacations and just decided to see the world one PyCon or DjangoCon at a time?\n\nThe biggest indicator of burnout in the community is how you feel about the community around you. When you find yourself starting to cringe every time you get a new Twitter follower, it may be time to start saying no to things.\n\nThe most important piece of advice I have is to stop looking at what other people are doing. We all know that person who seems to have a hand in every project, but you can't judge your own performance by what you imagine theirs to be. You don't know how they may be scrambling behind the scenes.\n\nAnd remember that just because you're invited into a conversation doesn't mean that you have to contribute to it - sometimes listening is enough. Emails can sometimes go unanswered - so can phone calls! Think about what's most important in your life, and start directing your energy towards those things instead.\n\nDon't write so much code in your free time. Take a few nights off, go outside - there's a lot to see out there!\n\nYour collaborators WILL understand. Especially if you announce your intentions to the world. Send an email, tweet it out, let people know you need some time off. You'll be surprised how much understanding you'll get and how well people will respect your boundaries (you just need to set them).\n\nHelp us caption & translate this video!\n\nhttp://amara.org/v/HHB2/",
  "description": "",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "",
  "thumbnail_url": "https://i.ytimg.com/vi/WnCPT46tt6U/maxresdefault.jpg",
  "duration": 1288,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=WnCPT46tt6U",
      "type": "youtube",
      "length": 0
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=WnCPT46tt6U",
  "tags": [],
  "speakers": [],
  "recorded": "2015-09-19"
}