{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "CRAPPY pour \"Command and Real-time Acquisition in Parallelized PYthon\"\nest un module Python permettant de faire interagir des capteurs et des\nactionneurs. Son développement est centré sur la polyvalence: il est\nprévu pour permettre l'intégration d'un grand nombre d'éléments. Il est\ndéjà capable de gérer de nombreux dispositifs comme des caméras, moteurs\net cartes d'entrée/sorties mais il permet surtout l'ajout de nouveaux\nobjets dans le programme ou directement au sein du module de manière\nsimple. CRAPPY contient un certain nombre d'outils comme le correcteur\nPID, le générateur de signaux ou l'attente de conditions, mais il permet\nsurtout l'utilisation de fonctions Python définies par l'utilisateur. Il\na été développé par le LaMcube (anciennement Laboratoire de Mécanique de\nLille) afin de permettre la mise en place d'essais mécaniques\nmulti-instrumentés. Au sein du laboratoire, nous développons et\nutilisons CRAPPY aussi bien pour des applications simples comme le\npilotage d'un four par Raspberry Pi que sur des montages plus complexes,\npar exemple un banc de simulation de freinage de train. Nous pensons que\npar sa polyvalence, ce module a des applications bien au delà de la\nrecherche scientifique et cette présentation a pour objectif de faire\nconnaître ce module open-source et donner des exemples d'applications\nréelles avec du matériel accessible. Le code est disponible à l'adresse\nhttps://github.com/LaboratoireMecaniqueLille/crappy\n",
  "duration": 1506,
  "language": "fra",
  "recorded": "2018-10-06",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://www.pycon.fr/2018/program/"
    }
  ],
  "speakers": [
    "Victor Couty"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/KKvJFfN-3Lc/maxresdefault.jpg",
  "title": "CRAPPY: un module pour le pilotage de systèmes multi-instrumentés",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KKvJFfN-3Lc"
    }
  ]
}
