{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Depuis 20 ans l'informatique a été revolutionnée par des nouvelles\ntechnologies de virtualisation, cloud, conteneurs et maintenant\nserverless. Ces technologies aident à optimiser l'utilisation des\nservers, de faciliter le déploiement, ainsi que d'augmenter l'agilité et\nde faciliter l’innovation.\n\nServerless existe depuis une décennie mais a été propulsé sur le devant\nde la scène avec le lancement d’AWS Lambda en Nov 2014 - plutôt beta a\nl'époque. Aujourd'hui il existe un choix de plateformes et d'outils\nimpressionants de services en ligne, d'outils Open Source pour faciliter\nleur usage et des plateformes entièrement Open Source.\n\nNous allons commencer par regarder le déploiement d'un service Python\nsur AWS Lambda - car même si propriétaire il reste le leader\naujourd'hui. Puis on regardera des outils open source tel que Chalice et\nZappa spécifiquement pour déployer des fonctions Python sur Lambda et\nl'outil Serverless(.com) qui facilite le déploiement de différents\nlangages vers differentes plateformes Serverless.\n\nMais il existe aussi des plateformes entièrement Open Source telles que\nOpenFaaS, OpenWhisk, Nuclio, Kubeless, Fission, Fn… vous avez l'idée...\nil y a du choix !\n\nNous regarderons comment déployer des fonctions Python sur OpenFaaS et\nOpenWhisk.\n\nBien sûr avec plein de démos a l'appui !\n",
  "duration": 2856,
  "language": "fra",
  "recorded": "2018-10-06",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://www.pycon.fr/2018/program/"
    }
  ],
  "speakers": [
    "Michael Bright"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/CZc1E2f94qc/maxresdefault.jpg",
  "title": "Serverless Python dans le cloud ou on-premise",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CZc1E2f94qc"
    },
    {
      "type": "mp4",
      "url": "https://dl.afpy.org/pycon-fr-18/serverless-python-dans-le-cloud-ou-on-premise.mp4"
    }
  ]
}
