{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "This workshop aims at providing the attendees an experience of\nimplementing convolution neural from scratch without any big frameworks\nworking in the backend supplementing the need for computation. This\nwould give the attendees an overall understanding of what are\nConvolution Neural Networks and why do they work so exceedingly well in\nimage processing!\n\nThis session would basically focus on python and it's ecosystem and how\nwell it goes up with the current research paradigm shift that is\nhappening due to the boom in Artificial intelligence. The session would\nhelp developers to amass the importance of mathematics and the ease that\npython provides in coding it, even from scratch. This would encourage\nthe developers only to try more and more python programming for deep\nlearning. For a nascent developer, this session packs in a high\neducational reward as he will be exposed to the mathematics behind the\nmost successful algorithm of the past couple of decades.\n\nThis workshop aims to provide a look through the abstraction offered by\nbig frameworks for developers to understand why mathematics behind data\nscience is necessary yet, give them the insight into why abstraction is\na key player in deep learning.\n\nQ. What can developers expect from this workshop! Understand what are\nconvolution neural networks Why they work so well on image data? All the\ndifferent implementation of Convolution network and how they improve the\nvanilla network What are the best ways to implement convolution network\non a given data\n\nQ. What this workshop is not! Just another workshop telling you to use\nframeworks Mathematics will not be looked over. (It's important) This\nsession would provide a much-needed exposure to python programming\nlanguage and how its ecosystem helps deep learning so well.\n",
  "duration": 2776,
  "language": "eng",
  "recorded": "2018-10-06",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://www.pycon.fr/2018/program/"
    }
  ],
  "speakers": [
    "Prakhar Srivastava"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/aufdKqK6jLg/maxresdefault.jpg",
  "title": "Convolution Network in vanilla Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aufdKqK6jLg"
    }
  ]
}
