{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "`Software Heritage <https://www.softwareheritage.org>`__ is a non-profit\ninitiative whose goal is to become the most comprehensive archive of\npublicly accessible source code in the world, together with its full\ndevelopment history. The project archive already contains more than 4.5\nbillion source code files, more than 1 billion commits, coming from\nalmost a hundred million software projects. It is a modern time Great\nLibrary of Source Code, growing daily.\n\nThe Software Heritage\n`stack <https://forge.softwareheritage.org/diffusion/>`__ is entirely\nwritten in Python and supports archiving git repositories, subversion\nrepositories, mercurial repositories, Debian source packages, as well as\narbitrary archives (zip files, tarballs…) released by upstream authors.\nEverything gets stored in a common, fully deduplicated data model,\nallowing unified access to all archived content, regardless of the\noriginal means of distribution. `The archive front-\nend <https://archive.softwareheritage.org/>`__, built upon the Django\nframework, allows people to browse the contents of the archive and\ndownload snapshots of source code that may have disappeared upstream.\n\nWhile initially focused on archiving collaborative development forges\nsuch as GitHub, BitBucket, and GitLab, Software Heritage also supports\narchiving traditional software distributions, such as GNU/Linux\ndistributions, and language-specific ecosystems. As an acknowledgement\nof the importance of the Python community for us, we are proud to\nannounce the archival of PyPI into Software Heritage. This presentation\nwill give a brief overview of the Software Heritage project and then\ndrill down through the technical details of the integration with PyPI.\n",
  "duration": 3309,
  "language": "eng",
  "recorded": "2018-10-06",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://www.pycon.fr/2018/program/"
    }
  ],
  "speakers": [
    "Nicolas Dandrimont",
    "Stefano Zacchiroli"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/-UY-Veywvh8/maxresdefault.jpg",
  "title": "Software Heritage: The Great Library of (Python) Source Code",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-UY-Veywvh8"
    },
    {
      "type": "mp4",
      "url": "https://dl.afpy.org/pycon-fr-18/software-heritage-the-great-library-of-python-source-code.mp4"
    }
  ]
}
