{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Competitive programming has grown exponentially in the last decade.\nMillions of students, teachers, professionals solve problems including\ncomplex optimisations every minute. With the influx of programming\nlanguages, developers have a wide range of tools to choose from and use\nthem to solve competitive challenges. Some of the popular platforms\ninclude Codeforces, Codechef, Hackerrank, Hackerearth, Topcoder etc.\n\nIn this talk we are going to use the dataset of codes scraped from\nCodeforces from a variety of challenges. These include programs written\nby top rated coders across the world to the newbies. The platform allows\nyou to code in 26 different languages which obviously include popular\nprogramming languages like C, C++, Java, Javascript, PHP, Python etc.\nThere are a very wide range of challenges in competitive programming\nlike Sorting, Binary Search, Trees, Graphs, Dynamic Programming to name\na few. The talk will cover the visualization of the dataset among broad\nclassifications of how each programming language performs in these\nclassifications. How efficient are programming languages across\nclassifications in terms of time and memory and several others? The talk\nwould also specifically cover the ease of using Python to solve\ndifferent classes of challenges in competitive programming and the usage\nof Python over time.\n\nMajor takeaways :\n\n-  ABC of web scraping and best practices.\n-  Optimizing web scraping to scale.\n-  No-SQL databases for storing unstructured data\n-  How does Python as a language fare in competitive programming in\n   terms of\n-  efficiency and popularity?\n-  Can I pursue competitive programming using Python ONLY?\n-  An analysis of popular programming languages used for solving\n   challenges.\n",
  "duration": 1042,
  "language": "eng",
  "recorded": "2018-10-06",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://www.pycon.fr/2018/program/"
    }
  ],
  "speakers": [
    "Anuj Menta"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/sUkWa3lC0gI/maxresdefault.jpg",
  "title": "Visualising the world of competitive programming with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sUkWa3lC0gI"
    }
  ]
}
