{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Messagerie instantanée, (micro)blogage, « réseau social », forums,\npartage de fichiers, albums photos, organisation d'événements, gestion\nde tickets, gestion de patchs (« merge requests »), chiffrement de bout\nen bout sont autant de choses qu'il est possible de faire avec Salut à\nToi, un écosystème de communication libre et décentralisé qui s'appuie\nsur le protocole standard XMPP.\n\nCet outil unique en son genre est développé en Python, et fonctionne à\nla fois sur bureau, appareils mobiles (Android), web, interface console\n(« TUI »), et ligne de commande (« CLI ») grâce notamment à une\narchitecture démon/frontaux et à la popularité de ce langage de\nprogrammation qui le rend disponible là où on ne l'attend pas forcément\n(une des interfaces dynamiques web, dans le navigateur donc, est\négalement développée en Python).\n\nLa dernière version a vu l'apparition d'un cadriciel (« framework ») web\norignal, qui permet de développer des sites web en utilisant XMPP en\narrière plan, permettant de gérer facilement l'authentification et les\npermissions, les composants courants (comme les commentaires), et les\nrendant naturellement décentralisés.\n\nCette conférence va présenter le projet, son architecture, et son\nutilisation de Python, avant de faire une démonstration de certaines de\nses possibilités.\n",
  "duration": 3600,
  "language": "fra",
  "recorded": "2018-10-06",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://www.pycon.fr/2018/program/"
    }
  ],
  "speakers": [
    "Poisson Jérôme"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/LjFh_J6TdBU/maxresdefault.jpg",
  "title": "Salut à Toi: un écosystème de communication libre, standard et décentralisé",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LjFh_J6TdBU"
    }
  ]
}
