{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Contexte : J'ai commencé à faire des cartes avec les données INSEE\ndisponibles sur opendata il y a 2 semaines.\n\nJ'ai trouvé quelques outils comme qGIS, mais ayant une machine\nasthmatique, j'ai fini par construire les cartes depuis rien, juste en\nregardant les fichiers sources, et les cartes SVG et c'est facile : tout\nle monde peut y arriver.\n\nC'est si simple avec les bons outils (python + SVG + HTML + matplotlib\net une connaissance minimale en math), que ce serait bien de rendre ce\nsavoir disponible pour tous.\n\nLa plupart des difficultés techniques comme : un point est il dans un\npolygone ?\n\nQuel sont les points minimum et le maximum dans une carte ?\n\nSont résolues simplement sans classe avec un outil mal aimé de python :\nles nombres complexes.\n\n(Ceci au passage est un \"rant\" contre la classe point 2D qui est donnée\nen exemple comme la classe pour apprendre, et une réaffirmation que les\nmaths sont une abstraction plus importante que l'objet.)\n\nDans un premier temps on va prendre un fichier source, le regarder, et\ntenter naïvement de construire une carte.\n\nOn va rappeler *très* rapidement ce qu'est un nombre complexe.\n\nOn va prendre un fichier de destination et le regarder, et sans\nconnaissance du SVG tenter de le construire.\n\nEnsuite on va utiliser matplotlib pour automatiser la coloration par\ngradient.\n\nOn va y arriver.\n\nOn va aussi découvrir une méthode de résolution des problèmes de\ncontraste par \"non linéarisation\" des niveaux de couleurs (tri ordonné)\nqui marche à quasiment tous les coups (merci les OrderedDict et les\nsets).\n\nOn va utiliser un algo simple pour trouver le polygone qui contient un\npoint et le mettre en œuvre. Parler de distance et éviter en beauté le\nproblème des projections en cartographie car j'y connais rien.\n\nOn va peut être comparer avec qgis en terme de vitesse pour la\ngénération de carte SVG, et aux tutos disponibles sur internet, et se\ndire que ça vaut le coup de partager ce savoir.\n\nEnfin on va montrer que la complexité afférente à écrire un cadricel\nétant supérieure à la 100 aine de ligne de codes pour faire le travail\nsans se fatiguer, c'est peut être pas nécessaire de faire un cadriciel.\n\nEt évidemment, je vais conclure sur les quaternions, et leur utilisation\npar les riggers dans l'industrie du jeu plutôt que les matrices pour la\n3D et souligner qu'on a des modules pour les quaternions en python,\nparce qu'on a une communauté de qualité avec des scientifiques qui\ncontribuent et que sans eux, ce serait bien plus dur de faire le kakou\nen 100 lignes de codes. Remercions aussi les initiatives d'opendata sans\nlesquelles on pourrait rien faire et rendons hommage à la qualité de\ndonnées si simple que leur mise en œuvre est aisée.\n\nEt voilà comment on construit une carte de représentation de données\nsans rien y connaître en cartographie. Parce qu'il y a des gars biens\nqui partagent les données sans les \"obscurcir\" et d'autres leur code et\nqu'il y a une communauté au milieu pour mettre les savoirs en relation.\n",
  "duration": 3228,
  "language": "fra",
  "recorded": "2018-10-06",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://www.pycon.fr/2018/program/"
    }
  ],
  "speakers": [
    "Julien Tayon"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/-B5dIhaM9Lk/maxresdefault.jpg",
  "title": "La cartographie c'est simple et \"complexe\"",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-B5dIhaM9Lk"
    }
  ]
}
