{
  "description": "Regis A. James developed MAGNETRON AI, an innovative, patent-pending tool that automates at-scale generation of high-quality mentor/mentee matches at Regeneron to enable rapid, yet accurate, company-wide pairings between employees seeking skill training/growth in any domain and others specifically capable of facilitating it. Built using R, Python, LLMs, shiny, MySQL, Neo4j, JavaScript, CSS, HTML, and bash, it transforms months of manual collaborative work into days. The reticulate, bs4dash, DT, plumber API, dbplyr, and neo4r packages were particularly helpful in enabling its full-stack data science. The expert recommendation engine of the AI tool has been successfully used for training a 400-member data science community of practice, and also for larger career development mentoring cohorts for thousands of employees across the company, demonstrating its practical value and potential for wider application.\n\nTalk by Regis A. James\n\n\nSlides: https://drive.google.com/file/d/1jq-WjuFz1Lp3m6v0SYjNoW1WcCBKPMs3/view?usp=sharing\nReferenced talks: https://www.youtube.com/@datadrivendecisionmaking\n\nFull Title: Computing and recommending company-wide employee training pair decisions at scale via an AI matching and administrative workflow platform developed completely in-house",
  "duration": 1227,
  "language": "eng",
  "recorded": "2024-08-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20240804081019/https://posit.co/conference/"
    },
    {
      "label": "https://drive.google.com/file/d/1jq-WjuFz1Lp3m6v0SYjNoW1WcCBKPMs3/view?usp=sharing",
      "url": "https://drive.google.com/file/d/1jq-WjuFz1Lp3m6v0SYjNoW1WcCBKPMs3/view?usp=sharing"
    },
    {
      "label": "https://www.youtube.com/@datadrivendecisionmaking",
      "url": "https://www.youtube.com/@datadrivendecisionmaking"
    }
  ],
  "speakers": [
    "Regis A. James"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/yTp15vJezF8/maxresdefault.webp",
  "title": "Computing and recommending company-wide employee training pair decisions at scale via an AI matching and administrative workflow platform developed completely in-house",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yTp15vJezF8"
    }
  ]
}
