{
  "description": "6:45 Hadley introduces the conference. \n10:37 Hadley on Posit, PBC. Who are we, and what we do.\n20:41 Charlotte Wickham on Quarto, an open-source scientific and technical publishing system.\n31:05 George Stagg on webR, R for WebAssembly. Execute R code in your web browser. \n43:34 James Blair with the latest on Posit's partnerships with Databricks and Snowflake.\n\nPlease join us for our first Posit Conf 2024 keynote, where we’ll tell you about our mission, our products, and some of the exciting things we’ve been working on over the last year. Hadley Wickham, Chief Scientist, will talk briefly about Posit’s mission and products, before introducing the three speakers who will update you on some of the coolest projects we’ve worked on over the last year. James Blair, Senior Product Manager, will give you the latest on our partnerships with Databricks and Snowflake, and how we’re building seamless integrations that let you focus on data science instead of dealing with technical details. Charlotte Wickham, Developer Educator, will show you what’s new in Quarto, focusing on new ways to build beautiful PDFs with Typst. Finally, George Stagg, Senior Software Engineer, will tell you about the latest innovations in teaching using webR, a tool that lets you compile your R code into standalone HTML files.\n\nTalk by Hadley Wickham, James Blair, Charlotte Wickham, and George Stagg",
  "duration": 3467,
  "language": "eng",
  "recorded": "2024-08-12",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://web.archive.org/web/20240804081019/https://posit.co/conference/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "CRAN",
    "OSS",
    "blogdown",
    "coding",
    "connect",
    "data science",
    "data visualization",
    "data viz",
    "data wrangling",
    "debugging",
    "dplyr",
    "forcats",
    "ggplot",
    "ggplot2",
    "github",
    "gt",
    "interoperability",
    "lazy evaluation",
    "machine learning",
    "odbc",
    "open source",
    "package manager",
    "plumber",
    "programming education",
    "purrr",
    "python",
    "rayshader",
    "readr",
    "reticulate",
    "rmarkdown",
    "rstats",
    "rstudio",
    "serious data science",
    "server pro",
    "shiny",
    "statistics",
    "stats",
    "stringr",
    "technology",
    "tibble",
    "tidy data",
    "tidymodels",
    "tidyr",
    "tidyverse"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/s_Vh9HIeLVg/maxresdefault.jpg",
  "title": "Updates from Posit, with Hadley Wickham, Charlotte Wickham, George Stagg, and James Blair",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=s_Vh9HIeLVg"
    }
  ]
}
