{
  "description": "Sometimes you're asked to deliver something that seems impossible, but\nnecessary in a given timeframe. Sometimes it's several seemingly\nimpossible things.\n\nDeveloping the prototype for the BBC Micro:bit - a pocket sized, child\nprogrammable computer - was very much like this. It had 3 months to be\ndelivered in a form sufficiently robust and usable to be used by\nchildren in schools across the country; to be sufficiently documented to\nbe completely understood from scratch by others; and to be a\nsufficiently open and flexible design to allow any and all parts of the\nsystem to change, while retaining its core principles.\n\nThere was about 3 months to develop the entire stack from scratch. This\nincluded a microcontroller based hardware stack, through firmware, a\npython to C++ compiler (3-4 weeks), through django website, through to a\nQT (PySide) client side application, through to publication of the\ndevice as a network connected and controllable device via REST. Python\nwas involved in all layers - including at microcontroller level on a\ndevice too small to run any python interpreter.\n\nThe bulk of the development period had just one developer for hardware\nand software. For just 1 month there were 2 extra developers brought on\nboard, part time to assist.\n\nThis talk will be a detailed overview of the various subsystems, and the\nstrategies taken to deliver a complete, mass produce-able, and\nsufficiently scalable product such an aggressive timescale. The talk\ntitle is a nod to the idea that while each of the various layers is\ndoable alone in 3 months, doing all the layers simultaneously using one\ndeveloper is ... challenging.\n\nIt should be of interest to those interested in developing hardware and\nsoftware products, and especially those developing products that have\nboth a hardware and software element.",
  "duration": 1511,
  "language": "eng",
  "recorded": "2015-09-19",
  "speakers": [
    "Michael Sparks"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/dluVWXtWucA/hqdefault.jpg",
  "title": "5 impossible things before breakfast",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dluVWXtWucA"
    }
  ]
}
