{
  "description": "What's this session about? Fabric is a Python library that offers a\nsimple API to manage remote connections to distant servers and PCs via\nSSH protocol. Although it is a simple library, fabric is an extremely\npowerful tool for managing virtual machines in the cloud. Fabric can be\nused to login to virtual machines, upload files to them, install\nsoftware packages on them or download files of them. Furthermore fabric\ncan be extended to a fully-fledged (but still lightweight) configuration\nmanagement tool. Fabric can be combined with the Python cuisine library\nand Python's \"native\" capabilities like serializing objects, writing\ndata to JSON files and manipulating regular expressions. By employing\nthis capabilities almost every VM administration task can be automated.\nVMs can be connected to each other, they can authenticate with each\nother and they can communicate to each other. In short: fabric is the\n\"glue\" that holds your VM environment together. If you're involved into\nDevOps, fabric is your tool to manage the cloud. You will get to know to\ndo this in this session.\n\nOverview In this talk we will show you fabric's capability to manage and\nconfigure virtual machines in the popular Python-based cloud operating\nsystem OpenStack. Thereby we will show you how to do password-based and\npublic key authentication with fabric, remote software installation with\npackage managers, management of users and groups, management of file\npermissions, file uploads and downloads, configuration file manipulation\nwith regular expressions (Python re module), serialization with pickle\nor JSON and manage communication between VMs.\n\nAfter this session you will know \\_ How to connect to OpenStack virtual\nmachines via fabric API \\_ How to create private/public keypairs and\nauthenticate to virtual machines \\_ How to combine fabric and cuisine to\nconfigure virtual machines \\_ How to use the Fabric API to employ\npackage managers (like apt, yum, zypper, pacman) which install software\npackages on virtual machines \\_ How to add users and groups via Fabric\nto your virtual machines and set the right permissions to files and\ndirectories \\_ How to upload files to virtual machines or download files\nfrom virtual machines to your local computer \\_ How to use regular\nexpressions and configuration file templates to create custom\nconfiguration files \\_ How to serialize objects with pickle or JSON and\nuse serialization let VMs communicate to each other",
  "duration": 2005,
  "recorded": "2015-09-19",
  "speakers": [
    "Konstantin Benz"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/dil4I5tw6Ao/hqdefault.jpg",
  "title": "The Fabric that holds the cloud together",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dil4I5tw6Ao"
    }
  ]
}
