{
  "description": "Abstract: In today's mundane usage of digital services, from ecommerce\nto day- to-day email, one might imagine that we generate a considerable\namount of data. We access the internet, our phones are constantly\ngenerating information and sharing that with services, sometimes without\nus being total aware of such, and even our household appliances are\nstarting to become more and more self sufficient and connected, the so\ncalled internet of things or internet of everything. Can we start\ngetting in control of that data? What tools do we have available to\nstart getting a sense of what's the size/shape/kind of data that we\ngenerate? Where does it come from and where do we send it to? Although\nthe talk title might suggestion topics around introspection and\npsychoanalysis we are not going to get into that (not in psychological\nground at least) but we will look into in which ways could we build\nsmall sets of applications that could give us a better sense of our\ndigital footprint and content that flows at our broadband connection. We\nwill be analysing samples of email, internet traffic, webapps and mobile\napps data connections and inflows.\n\nLearning objectives: Use simple python libraries we will be looking into\nwhat we can do tap on our devices and keep track of our digital inflows\nlike scapy and httplib2 Tools available to analyse and store and this\ndata, mostly around pandas and mongodb Libraries to present and\nvisualize this information like seaborn and matplotlib Tools for\npredictive analytics like anaconda.\n\nThis is practical session where we will be discussing some of these\ngeneral aspects of the data crossing \"our pipes\" and what we can do with\nthat to learn a bit more of ourselves or which type of interactions do\nwe do in a quantifiable manner.\n\nWe will be using quantifiable and measurable traffic from several\ndifferent feeds including your facebook timeline, twitter feeds, email\nand internet traffic.",
  "duration": 2048,
  "language": "eng",
  "recorded": "2015-09-20",
  "speakers": [
    "Norberto Leite"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/1U_8bNPs2NM/hqdefault.jpg",
  "title": "Analyse Yourselves",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1U_8bNPs2NM"
    }
  ]
}
