{
  "copyright_text": "Standard YouTube License",
  "description": "After several years in the depths of high-performance computing, I returned to the web world a couple years ago and discovered that Django's awesome-to-pain ratio had tipped strongly in it's favor. I've been hooked ever since. As web lead at dotCloud for the past year, I've gotten to work on making Django deployment awesome at DotCloud in San Francisco. I'm now spending more of my time doing developer advocacy -- acting as dotCloud's \"customer-in-residence\" to ensure the company is producing a product developers love. I maintain and contribute to a number of open source projects: https://github.com/gabrielgrant\n\nIn this talk, learn how Django and Ember.js can compliment each other: how to integrate them where their functionality overlaps and reconcile the differences where their approaches contradict. Django helps quickly express a data model and handle HTTP requests, but using it alone isn't conducive to building highly-dynamic interfaces. Ember, on the other hand, is a client-side framework designed with precisely these interfaces in mind, but doesn't tackle the server-side at all. Both Django and Ember.js are large, ambitious and opinionated frameworks. This is what gives them their power over their more minimalist colleagues (Flask and Backbone.js, respectively) but because their opinions sometimes differ, it can be difficult to make them play together. In this talk, I'll briefly introduce Ember.js, compare and contrast how Django and Ember.js handle the various layers of an application, and show how to bridge between these two worlds.\n\nTopics covered:\n\n* Ember's interpretation of MVC in Django terms\n* Overlap in functionality: which pieces of each framework to keep, modify and throw away\n* Compiling Assets\n* Connecting Ember to Django with Ember-data and Django REST framework",
  "duration": 1570,
  "language": "eng",
  "recorded": "2012-09-15",
  "related_urls": [
    {
      "label": "schedule",
      "url": "https://web.archive.org/web/20121016112920/http://www.pytexas.org/chance/1/schedule/"
    },
    {
      "label": "Gabriel Grant repositories",
      "url": "https://github.com/gabrielgrant"
    },
    {
      "label": "node-ember-precompile repository",
      "url": "https://github.com/gabrielgrant/node-ember-precompile"
    },
    {
      "label": "python-pro repository",
      "url": "https://github.com/gabrielgrant/python-pro"
    }
  ],
  "speakers": [
    "Gabriel Grant"
  ],
  "tags": [
    "django",
    "ember.js"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/-Y4sDO2rKmg/maxresdefault.jpg",
  "title": "Building Rich Applications with Django and Ember.js",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-Y4sDO2rKmg"
    }
  ]
}
