{
  "description": "PyData Amsterdam 2017\n\nDeep learning is a state of the art method for many tasks, such as image classification and object detection. For researchers that have time series data, but are not an expert on deep learning, the barrier can be high to start using deep learning. We developed mcfly, an open source python library, to help machine learning novices explore the value of deep learning for time series data.\n\nIn this talk, we will explore how machine learning novices can be aided in the use of deep learning for time series classification.\n\nIn a variety of scientific fields researchers face the challenge of time series classification. For example, to classify activity types from wrist-worn accelerometer data or to classify epilepsy from electroencephalogram (EEG) data. For researchers who are new to the field of deep learning, the barrier can be high to start using deep learning. In contrast to computer vision use cases, where there are tools such as caffe that provide pre-defined models to apply on new data, it takes some knowledge to choose an architecture and hyperparameters for the model when working with time series data.\n\nWe developed mcfly, an open source python library to make time series classification with deep learning easy. It is a wrapper around Keras, a popular python library for deep learning. Mcfly provides a set of suitable architectures to start with, and performs a search over possible hyper-parameters to propose a most suitable model for the classification task provided. We will demonstrate mcfly with excerpts from (multi-channel) time series data from movement sensors that are associated with a class label, namely activity type (sleeping, walking, climbing stairs). In our example, mcfly will be used to train a deep learning model to label new data.",
  "duration": 1368,
  "recorded": "2017-04-08",
  "speakers": [
    "Dafne van Kuppevelt"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/9X_4i7zdSY8/hqdefault.jpg",
  "title": "Deep learning for time series made easy",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9X_4i7zdSY8"
    }
  ]
}
