{
    "description": "You cracked open your brand new Mac or Linux dream machine and low and\nbehold, it has Python out-of-the-box and ready to roll… Or so you think?\nMaybe you want to get started doing Python development on Windows and\nsee that you can grab Python easily from the Microsoft Store. Should\nyou?\n\nThere are simple, yet crucial, reminders that can differentiate an\nexpert developer from a hobbyist. This talk is ideal for developers who\nwant to optimize their system setups. Developers of all skill levels\noften forget about the journey — and the troubles — they had when first\ninstalling Python on their machines. Established, senior developers\nmight be able to install Python easily, but are they following the Zen\nof Python when it comes to best practices for environment settings and\nversioning?\n\nIn this talk and live demo, we’ll discuss getting started with the end\nin mind and making sure your development computer doesn’t become the\nnext superfund site (https://xkcd.com/1987/).\n\n| Developers will learn:\n| - the importance of abiding by the Zen of Python;\n| - where (and how) to install Python on your machine;\n| - three rules to follow when installing Python;\n| - proper version management with pyenv;\n| - which Python add-ons (e.g.: virtualenv, pipx, piptools, Docker) can\n  be used to make environments both repeatable and simple.\n\nAfter this presentation, developers will know the best practices needed\nto spend less time setting up and more time having fun with the code.\n",
    "language": "eng",
    "recorded": "2022-07-30",
    "related_urls": [
        {
            "label": "Conference Website",
            "url": "https://www.pyohio.org/2022/"
        }
    ],
    "speakers": [
        "Calvin Hendryx-Parker"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/qPT7X6VYqo8/maxresdefault.jpg",
    "title": "Bootstrapping Your Local Python Environment",
    "videos": [
        {
            "type": "youtube",
            "url": "https://youtu.be/qPT7X6VYqo8"
        }
    ]
}