{
  "description": "I used to teach what was called \"Information and communication technology\" in high school - but I realised that none of my colleagues in the department seemed very curious about information, communication or technology.\n\nLater, I also realised that even the people who are deeply interested in those subjects mostly don't think very much about the meaning of those words - which is a shame, because those words are hiding some intriguing things, and help shine some light on some hot topics.\n\nIn its approach to the industry’s moral and political controversies, the Python community has earned a reputation for moral earnestness. It’s not undeserved, and it may even be inescapable, but be that as it may, if we’re going to agonise, let’s agonise with insight and awareness.\n\nIn recent years (and particularly importantly for our industry) there are some words whose meaning, without our noticing, has slipped out almost from beneath our feet.\n\nSeveral of these words lie at the crux of the industry’s most significant ills; some are controversial words, like “meritocracy”, and some seem quite innocent, like “information”, \"communication\" and \"technology\", but on closer inspection they can all be found loitering around scenes of trouble.\n\nI won’t claim that we can solve any important disputes by dwelling upon words, but I will show how paying attention to the shifting or contested meanings of certain words will shed light on some of the ways in which we think about some disputes, and can suggest different ways of approaching them.\n\nI’ll discuss what they mean for our debates about (for example) inclusivity and diversity, and even what they have to show about the way in which we conduct those debates.\n\nIntrospection, in other words, can be just as powerful in natural language as it can be in Python, and once learned the techniques will find numerous useful applications.\n\nI will discuss topics including:\n\n* Ancient Athens\n* GitHub’s troublesome office rug\n* desert\n* “information” as content rather than an act\n* “communication” as a conduit rather than act\n* what technology “really” means\n* Aristotle on classes, functions and objects\n* Wittgenstein on function as meaning\n* elitism, aristocracy, meritocracy, diversity, inclusion, fairness\n\n… and numerous other interwoven matters",
  "duration": 2589,
  "recorded": "2015-10-25",
  "speakers": [
    "Daniele Procida"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/8Qt2RgXYDkw/hqdefault.jpg",
  "title": "What if those words don't mean what we think they mean?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8Qt2RgXYDkw"
    }
  ]
}
