{
  "description": "Whether you’re building a custom web application, getting started in\nmachine learning, or just want to try something new, everyone needs\ndata. And while the web offers a seemingly boundless source for custom\ndata sets, the collection of that data can present a whole host of\nobstacles. From ever-changing APIs to rate-limiting woes, from\nnightmarishly nested XML to convoluted DOM trees, working with APIs and\nweb scraping are challenging but critically useful skills for\napplication developers and data scientists alike. In this tutorial,\nwe’ll introduce RESTful APIs, RSS feeds, and web scraping in order to\nsee how different ingestion techniques impact application development.\nWe’ll explore how and when to use Python libraries such as\n``feedparser``, ``requests``, ``beautifulsoup``, and ``urllib``. And\nfinally we will present common data collection problems and how to\novercome them.\n\nWe’ll take a hands-on, directed exercise approach combined with short\npresentations to engage a range of different APIs (with and without\nauthentication), explore examples of how and why you might web scrape,\nand learn the ethical and legal considerations for both. To prepare\nattendees to create their own data ingestion scripts, the tutorial will\nwalk through a set of examples for robust and responsible data\ncollection and ingestion. This tutorial will conclude with a case study\nof `Baleen <https://pypi.python.org/pypi/baleen/0.3.3>`__, an automated\nRSS ingestion service designed to construct a production-grade text\ncorpus for NLP research and machine learning applications. Exercises\nwill be presented both as Jupyter Notebooks and Python scripts.\n",
  "duration": 12048,
  "language": "eng",
  "recorded": "2017-05-17",
  "speakers": [
    "Nicole Donnelly",
    "Tony Ojeda",
    "Will Voorhees"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/A42voDYkFZw/hqdefault.jpg",
  "title": "Fantastic Data and Where To Find Them: An introduction to APIs, RSS, and Scraping",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=A42voDYkFZw"
    }
  ]
}
