{
  "description": "Companies with an artificial-intelligence plan have a differentiating\nstrategy in the intelligence economy; however, implementing robust\nmachine-learning in production is nontrivial, often requiring a close\ncollaboration between data scientists and developers, and retooling the\nproduction stack and workflows to develop and maintain accurate models.\n\nMachine learning in production involves model application, handling\nmissing data, data artifacts, and data outside of the training\ncalibration. A rigorous evaluation framework draws upon logging to\ndetermine characteristics of model coverage, model performance,\nauditing, and run-time performance. Model coverage includes the number\nof times the model produced sensible output relative to number of times\nit is called. Model coverage is reduced if the model does not converge\nor model criteria are not met. Model performance is evaluated with a\nsuite of metrics (accuracy, AUC, FPR, TPR, RMSE, MAPE, etc.), which\nassist in determining the most appropriate model to use in the\nproduction scenario and the validity of the model training. Regularly\nperforming manual audits for spot checks is important for debugging and\nensuring the model passes sanity checks. Model performance includes run\ntimes and profiling model pieces, ensuring performance is within\nspecified requirements and refactoring otherwise.\n\nIn the AI renaissance, where ML is a critical piece of intelligent\nproducts, seamlessly integrating model evaluation into workflows is an\nimportant component of making robust products and building a satisfying\ncustomer experience. Python is a great language to build intelligent\nproducts with its abundance of ML libraries and wrappers contributed as\nopen-source software in addition to rich full-stack capabilities.\n",
  "duration": 1527,
  "recorded": "2017-05-19",
  "speakers": [
    "Jessica Lundin"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/oV-cm0Loefg/hqdefault.jpg",
  "title": "Snakes on a Hyperplane: Python Machine Learning in Production",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=oV-cm0Loefg"
    }
  ]
}
