{
  "description": "Recently, networking vendors and Silicon Valley giants have been putting\nforth a concerted effort to build standardized models for networking\ndevices. These models allow for building reusable and versatile scripts\nwith predictable, standardized data. Without such models, the wide\nvariety of inputs and outputs required by different devices and vendors\nmade scripting a tedious and challenging endeavor. The modeling language\nin use is called YANG, and a variety of standards have emerged. A vendor\nagnostic standard called OpenConfig has lately become stable enough to\nbegin programming devices with it. Using Python, YANG is surprisingly\neasy to work with, and extremely powerful applications can be written\nwith basic knowledge of JSON or XML and RPCs.\n\nThe talk will start with use-cases for programming networking devices,\nand will detail a specific, trivial, use case that will be used in the\ntalk. Next, we will discuss the ‘legacy’ way of programming devices (SSH\nand screenscraping), and highlight the challenges, such as complex\nregular expressions, slow responses, and lack of reusability between\ndevices. From there we will dive into YANG, focusing on OpenConfig\nmodels. A YANG model is essentially a template, and JSON or XML can be\nmapped to the YANG template. This makes it perfect for Pythonic\nmanipulation. In the use case there will be a GET RPC returning a YANG\nrepresentation of the box’s state in JSON, which we will search for the\nrelevant health indicator by drilling down in the JSON dictionary. A\nsimple change to the dictionary will remediate the problem, and a PATCH\nRPC merges the new configuration onto the box. Since open, standard\nmodels are in use, this script could be run on many devices across a\nnetwork to achieve the same effect with no changes needed. We will\nfinish up with the pros and cons of YANG before opening the talk for\nQ&A.\n",
  "duration": 1879,
  "language": "eng",
  "recorded": "2017-05-20",
  "speakers": [
    "Lisa N Roach"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/hKxbO4rRlpg/hqdefault.jpg",
  "title": "Exploring Network Programmability with Python and YANG",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hKxbO4rRlpg"
    }
  ]
}
