{
  "description": "Optimization can often help to make Python programs faster or use less\nmemory. Developing a strategy, establishing solid measuring and\nvisualization techniques as well as knowing about algorithmic basics and\ndatastructures are the foundation for a successful optimization. The\ntutorial will cover these topics. Examples will give you a hands-on\nexperience on how to approach efficiently.\n\nPython is a great language. But it can be slow compared to other\nlanguages for certain types of tasks. If applied appropriately,\noptimization may reduce program runtime or memory consumption\nconsiderably. But this often comes at a price. Optimization can be time\nconsuming and the optimized program may be more complicated. This, in\nturn, means more maintenance effort. How do you find out if it is\nworthwhile to optimize your program? Where should you start? This\ntutorial will help you to answer these questions. You will learn how to\nfind an optimization strategy based on quantitative and objective\ncriteria. You will experience that one's gut feeling what to optimize is\noften wrong.\n\nThe solution to this problem is: „Measure, Measure, and Measure!“. You\nwill learn how to measure program run times as well as profile CPU and\nmemory. There are great tools available. You will learn how to use some\nof them. Measuring is not easy because, by definition, as soon as you\nstart to measure, you influence your system. Keeping this impact as\nsmall as possible is important. Therefore, we will cover different\nmeasuring techniques.\n\nFurthermore, we will look at algorithmic improvements. You will see that\nthe right data structure for the job can make a big difference. Finally,\nyou will learn about different caching techniques.\n\nSoftware Requirements\n---------------------\n\nYou will need Python 2.7 or 3.5 installed on your laptop. Python 2.6 or\n3.3/3.4 should also work. Python 3.x is strongly preferred.\n\nJupyter Notebook\n~~~~~~~~~~~~~~~~\n\nI will use a Jupyter Notebook for the tutorial because it makes a very\ngood teaching tool. You are welcome to use the setup you prefer, i.e\neditor, IDE, REPL. If you also like to use a Jupyter Notebook, I\nrecommend ``conda`` for easy installation. Similarly to ``virtualenv``,\n``conda`` allows creating isolated environments but allows binary\ninstalls for all platforms.\n\nThere are two ways to install ``Jupyter`` via ``conda``:\n\n1. Use `Minconda <http://conda.pydata.org/miniconda.html>`__. This is a\n   small install and (after you installed it) you can use the command\n   ``conda`` to create an environment:\n   ``conda create -n pycon2016 python=3.5`` Now you can change into this\n   environment: ``source activate pycon2016``. The prompt should change\n   to ``(pycon2017)``. Now you can install IPython:\n   ``conda install Jupyter``.\n\n2. Install `Anaconda <http://continuum.io/downloads>`__ and you are\n   ready to go if you don't mind installing lots of packages from the\n   scientific field.\n\nWorking with ``conda`` environments\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nAfter creating a new environment, the system might still work with some\nstale settings. Even when the command ``which`` tells you that you are\nusing an executable from your environment, this might actually not be\nthe case. If you see strange behavior using a command line tool in your\nenvironment, use ``hash -r`` and try again.\n\nTools\n~~~~~\n\nYou can install these with ``pip`` (in the active ``conda``\nenvironment):\n\n-  `SnakeViz <http://jiffyclub.github.io/snakeviz/>`__\n-  `line\\_profiler <https://pypi.python.org/pypi/line_profiler/>`__\n-  `Pympler <https://pypi.python.org/pypi/Pympler>`__\n-  `memory\\_profiler <https://pypi.python.org/pypi/memory_profiler>`__\n-  `pyprof2calltree <https://github.com/pwaller/pyprof2calltree/>`__\n\nLinux\n^^^^^\n\nUsing the package manager of your OS should be the best option.\n",
  "duration": 12083,
  "language": "eng",
  "recorded": "2017-05-18",
  "speakers": [
    "Mike Müller"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/xmuEsYut9Pc/hqdefault.jpg",
  "title": "Faster Python Programs - Measure, don't Guess",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xmuEsYut9Pc"
    }
  ]
}
