{
  "description": "An exchange of views on fastAPI in practice.\n\nFastAPI is great, it helps many developers create REST APIs based on the OpenAPI standard and run them asynchronously. It has a thriving community and educational documentation.\n\nFastAPI does a great job of getting people started with APIs quickly.\n\nThis talk will point out some obstacles and dark spots that I wish we had known about before. In this talk we want to highlight solutions.\n\nFastAPI's extensive use of pydantic for data parsing, validation, transformation, and OpenAPI definition export.\n* The role of starlette in managing routes and middleware, including insights into creating custom middleware.\nA discussion on FastAPI's documentation and the importance of DocStrings for accurate documentation.\nThe application of the \"Don't Repeat Yourself\" (DRY) principle with Pydantic to create highly reusable model pools with inheritance for use in FastAPI.\n\nAlexander Hendorf is responsible for data and artificial intelligence at the boutique consultancy KÖNIGSWEG GmbH. Through his commitment as a speaker and chair of various international conferences as PyConDE & PyData Berlin, he is a proven expert in the field of data intelligence. He's been appointed Python Software Foundation and EuroPython fellow for this various contributions. He has many years of experience in the practical application, introduction and communication of data and AI-driven strategies and decision-making processes.\n\nTwitter: https://twitter.com/hendorf\nLinkedIn: https://www.linkedin.com/in/hendorf/",
  "duration": 1951,
  "language": "eng",
  "recorded": "2023-04-17",
  "related_urls": [
    {
      "label": "Talk Page",
      "url": "https://2023.pycon.de/program/GBYWCY/"
    }
  ],
  "speakers": [
    "Alexander CS Hendorf"
  ],
  "tags": [
    "fastapi",
    "pydantic",
    "rest-API",
    "starlette"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/KNeHNEs_I3k/maxresdefault.webp",
  "title": "Alexander CS Hendorf:  5 Things about fastAPI I wish we had known beforehand",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KNeHNEs_I3k"
    }
  ]
}
