{
  "description": "The Modern Data Stack has brought a lot of new buzzwords into the data engineering lexicon: \"data mesh\", \"data observability\", \"reverse ETL\", \"data lineage\", \"analytics engineering\". In this light-hearted talk we will demystify the evolving revolution that will define the future of data analytics & engineering teams.\n\nOur journey begins with the PyData Stack: pandas pipelines powering ETL workflows...clean code, tested code, data validation, perfect for in-memory workflows. As demand for self-serve analytics grows, new data sources bring more APIs to model, more code to maintain, DAG workflow orchestration tools, new nuances to capture (\"the tax team defines revenue differently\"), more dashboards, more not-quite-bugs (\"but my number says this...\").\n\nThis data maturity journey is a well-trodden path with common pitfalls & opportunities. After dashboards comes predictive modelling (\"what will happen\"), prescriptive modelling (\"what should we do?\"), perhaps eventually automated decision making. Getting there is much easier with the advent of the Python Powered Modern Data Stack.\n\nIn this talk, we will cover the shift from ETL to ELT, the open-source Modern Data Stack tools you should know, with a focus on how dbt's new Python integration is changing how data pipelines are built, run, tested & maintained. By understanding the latest trends & buzzwords, attendees will gain a deeper insight into Python's role at the core of the future of data engineering.",
  "duration": 1834,
  "language": "eng",
  "recorded": "2023-04-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.pycon.de/"
    }
  ],
  "speakers": [
    "John Sandall"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/na7yqvz5-B4/maxresdefault.jpg",
  "title": "Postmodern Architecture - The Python Powered Modern Data Stack",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=na7yqvz5-B4"
    }
  ]
}
