{
  "description": "Did you know that the Python Software Foundation Code of Conduct is turning 10 years old in 2023? It was voted in as they felt they were “unbalanced and not seeing the true spectrum of the greater community”. And thought that with time they could “advance towards a more diverse representation.”[1]\n\nWhy is that a big thing? Codes of conduct are an important part of any community, outlining the values of the community. They establish clear guidelines for acceptable behavior and help to create a safe and inclusive environment in the community. This can prevent discrimination and promote equal opportunities for all members.\n\nIn this talk, we will explore the role of code of conduct in communities, it’s history in the PSF, and discuss strategies for rethinking what it means to have and enforce a Code of Conduct. We will look at the existing challenges that the Python communities face when implementing codes of conduct and talk about possible solutions. How does it look like when it works well and when it doesn’t?\n\nAs an essential part of any open source project, reflecting on these guidelines can help to ensure that the projects are successful and sustainable in the long term. Thinking back to Python, which also turns 20 in 2023: “Python got to where it is by being open, and it’ll continue to prosper by remaining open”. It’s important we continue this mission, after all, one of the things many people love about Python is the community.\n\n[1] https://pyfound.blogspot.com/2013/06/announcing-code-of-conduct-for-use-by.html",
  "duration": 2064,
  "language": "eng",
  "recorded": "2023-04-17",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://2023.pycon.de/"
    },
    {
      "label": "https://pyfound.blogspot.com/2013/06/announcing-code-of-conduct-for-use-by.html",
      "url": "https://pyfound.blogspot.com/2013/06/announcing-code-of-conduct-for-use-by.html"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/0OXP0UegwCM/maxresdefault.jpg",
  "title": "Tereza Iofciu: Rethinking codes of conduct",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0OXP0UegwCM"
    }
  ]
}
