{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon US 2011", "speakers": ["Michael Carter"], "title": "Hookbox: All Python web-frameworks, now real-time. Batteries Included.", "quality_notes": "", "video_flv_length": null, "recorded": "2011-03-11", "video_mp4_length": null, "description": "Hookbox: All Python web-frameworks, now real-time. Batteries Included.\n\nPresented by Michael Carter\n\nLearn how to supercharge your python web applications (Django, Pylons, TG,\nGAE, Werkzeug, WSGI, etc) with real-time features! Presenceful and moderated\nchat? About 10 minutes, seriously. A real-time graph to monitor the CPU? Less\nthan five. If you pay attention for at least half of this talk, you'll leave\nconfident and ready to take advantage of WebSocket, Comet, and the world,\nthanks to Hookbox.\n\nAbstract\n\nHookbox ([http://hookbox.org](http://hookbox.org/)) is a Python and Eventlet-\nbased Comet-server/message-queue which tightly integrates with existing web\napplication infrastructure via web hooks and a REST interface; Hookbox’s\npurpose is to ease the development of real-time web applications, with an\nemphasis on tight integration with existing web technology. Put simply,\nHookbox is a web-enabled message queue.\n\nBrowers may directly connect to Hookbox, subscribe to named channels, and\npublish and receive messages on those channels in real-time. An external\napplication (typically the web application itself) may also publish messages\nto channels by means of the Hookbox REST interface. All authentication and\nauthorization is performed by an external web application via designated\n“webhook” callbacks.\n\nIn this talk we cover the broad principles of Hookbox, then examine a few\nshort examples in depth, including presenceful and moderated chat, real-time\ngraphing, and, of course, a game. The code examples are very purposefully\nbrief; the important parts of the talk deal with the interaction model between\nbrowser, web framework, and Hookbox -- everything else follows naturally and\neasily into place.\n\nThe audience need not be familiar with a particular web framework over\nanother, but they must be proficient with at least one.\n\nThough this talk is aimed at a novice level, we'll also spend some time\ntalking about the more advanced features that Hookbox provides.\n\n", "video_mp4_url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/371_hookbox-all-python-web-frameworks-now-real-time-batteries-included.mp4", "tags": ["hookbox", "pycon", "pycon2011", "realtime", "webapps"], "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", "related_urls": [], "video_flv_download_only": false, "source_url": "", "video_webm_url": null, "video_ogv_length": 158119468, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011HookboxAllPythonWebframeworksNowRealtimeBatteri858.png", "video_flv_url": null}