{
  "alias": "video/445/pycon-2011--api-design-anti-patterns",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "API Design Anti-Patterns\n\nPresented by Alex Martelli\n\nDesigning interfaces so that other code can interact with ours (whether\nour code is a library, framework, application, website...) is a very\ncommon and clearly crucial activity, but fraught with dangers -- stuff\nwe all keep doing wrong time after time. This talks shows some common\ncases of API design errors encountered in the wild, with tips on how to\navoid them when you design your next API.\n\nAbstract\n\nWhenever we write code we should always be thinking about how other code\n(whether our own, or other people's) will interact with ours (an \"API\",\nin common parlance). Indeed, the most common and terrible mistake in API\ndesign is... not doing any! -- i.e., not providing any designed,\narchitected way for other code to interact with ours. That's fortunately\nless common when \"our code\" is a library or framework;-), but, alas!,\nsadly widespread when \"our code\" is an application or website -- that's\nwhy questions about screen- scraping the web and simulating keystrokes\nand mouse gestures need be so tragically frequent all over the web.\n\nOnce past the obvious hurdle of not having any API at all, there's still\nplenty of ways we can go badly wrong in the process of designing one --\nand many of those ways fall into recognizable categories, i.e.,\npatterns. Specifically, since they're frequently observed categories of\ndefective design, they're anti-patterns -- and that's what this talk is\nin fact about (as the smartest among you could tell from the title...).\n\nI'm eminently qualified to present on this subject, since, in a lifetime\nspent mostly stumbling into software (after actually qualifying to\ndesign hardware in college, but only doing that for a few years), I've\nbeen responsible for more of my shares of API design fumbles (plus, of\ncourse, just like every other programmer, I've done my share of swearing\nat the design fumbles of other API designers). And, as novelist Richard\nBach reminds us, \"You teach best what you most need to learn\"!-)\n",
  "duration": null,
  "id": 445,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--api-design-anti-patterns",
  "speakers": [
    "Alex Martelli"
  ],
  "summary": "",
  "tags": [
    "api",
    "pycon",
    "pycon2011"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_445___api-design-anti-patterns",
  "title": "API Design anti-patterns",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_445___api-design-anti-patterns"
    }
  ]
}
