{
  "alias": "video/369/pycon-2011--greasing-the-wheels-of-exploration-wi",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "The Mars Exploration Rovers (MER), Spirit and Opportunity, have been\nroaming the surface of Mars since January of 2004 leading to many\ndiscoveries about the nature and history of our sister planet. Each\nactivity requires a complex set of coordinated activites by a team.\nEarly in the MER mission the author automated much of the task of one of\nthe positions, the Payload Uplink Lead, for 7 of the 9 cameras on each\nrover. The system, called AutoPUL, is written in Python and that has\nproven to be the excellent choice for the development and maintenance.\nIn the talk I'll describe the Mars Rover mission and the operational\nactivities and how AutoPUL and Python fullfilled those needs.\n",
  "duration": null,
  "id": 369,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--greasing-the-wheels-of-exploration-wi",
  "speakers": [
    "Michael Sims"
  ],
  "summary": "The control of the Mars Exploration Rovers (MER) requires a complex set\nof coordinated activites by a team. Early in the MER mission the author\nautomated in Python much of the task of one of the operation positions,\nthe Payload Uplink Lead, for 7 of the 9 cameras on each rover. This talk\ndescribes the MER rovers, the operation tasks and that implemented\nsystem.\n",
  "tags": [
    "casestudy",
    "mer",
    "pycon",
    "pycon2011"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_369___greasing-the-wheels-of-exploration-with-python",
  "title": "Greasing the Wheels of Exploration with Python",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_369___greasing-the-wheels-of-exploration-with-python"
    },
    {
      "length": null,
      "type": "mp4",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/369_greasing-the-wheels-of-exploration-with-python.mp4"
    }
  ]
}
