{
  "alias": "video/432/pycon-2011--the-development-of-python-and-you",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "The Development of Python and You\n\nPresented by Brian Curtin\n\nHave an inside look at what it takes to work on CPython, from getting\nsetup with the source and navigating the bug tracker, to the best\npractices for having your work accepted. We'll find, categorize, and fix\nan issue in Python to get you started. This talk is ideal for those who\nare new to open source projects or are interested in the Python\ndevelopment process.\n\nAbstract\n\nPeople from all backgrounds, users of all platforms, and developers of\nall levels are necessary in the development of Python. From writing code\nto documentation, it takes all kinds of people to make an impact. If\nyou've used Python, we need you, and what better place to get involved\nthan at PyCon?\n\n2010 saw a rise in the number of contributors to CPython, and the PSF\nstepped in to support the efforts of those wanting to get involved. Are\nyou up for the challenge? This talk dives right into what it takes to\nget involved, covering the who, what, where, when, and why of Python\ndevelopment, going through the whole process live.\n\nAfter the conference is over, stick around with the CPython crew and\nhack away!\n",
  "duration": null,
  "id": 432,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--the-development-of-python-and-you",
  "speakers": [
    "Brian Curtin"
  ],
  "summary": "",
  "tags": [
    "coredev",
    "cpython",
    "development",
    "gettinginvolved",
    "pycon",
    "pycon2011"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_432___the-development-of-python-and-you",
  "title": "The Development of Python and You",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_432___the-development-of-python-and-you"
    }
  ]
}
