{
  "alias": "video/361/pycon-2011--montreal-python----lessons-learned-fr",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "The talk will first walk the audience through the factors inherent to\nMontréal itself and how it affected other user groups before\nMontréal-Python. These groups inspired us to get a group of Python\nhackers started the presentation will show how we were able to leverage\non the success of other user groups to bring our young community\nforward.\n\nThe various stages of our growth will be presented along with insights\non how we managed to find speakers and venues at each point. The\npresentation will then go through an overview of our current activities,\nsharing in the process how effective they are in engaging the community.\nOur plans for the next few years will be presented then a summary will\nprovide advice to anyone who would like to get started organizing a\nlocal Python user group.\n",
  "duration": null,
  "id": 361,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--montreal-python----lessons-learned-fr",
  "speakers": [
    "Yannick Gingras"
  ],
  "summary": "Montréal-Python is a user-group formed in 2007. It has since then grown\ninto a thriving community with code sprint and regular meetings\nattracting over 50 attendees. This talk will present history of the\ngroup and will highlight the key factors behind its success with the\nhope to inspire others to replicate that accomplishment.\n",
  "tags": [
    "community",
    "growth",
    "pycon",
    "pycon2011",
    "usergroups"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_361___montreal-python-lessons-learned-from-bootstraping-a-python-community",
  "title": "Montreal-Python -- Lessons Learned from Bootstraping a Python Community",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_361___montreal-python-lessons-learned-from-bootstraping-a-python-community"
    }
  ]
}
