{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon US 2011", "speakers": ["Niall O'Higgins"], "title": "MongoDB + Pylons at Catch.com: Scalable Web Apps with Python and NoSQL", "quality_notes": "", "video_flv_length": null, "recorded": "2011-03-11", "video_mp4_length": null, "description": "MongoDB + Pylons at Catch.com: Scalable Web Apps with Python and NoSQL\n\nPresented by Niall O'Higgins\n\nThe Catch.com backend provides an API for publishing and querying your\npersonal data - used by many hugely popular Android, iOS and Web clients. We\nported this system to Python and MongoDB, using the Pylons Web framework. This\ntalk details our reasoning for choosing - and experiences with - these\ncutting-edge Web and NoSQL database technologies in a high-traffic, real-world\nproduction system.\n\nAbstract\n\nFaced with the limits of our initial Catch.com Java/BDB backend implemention,\nwe evaluated various alternative technologies including Amazon SimpleDB,\nMySQL, Cassandra and MongoDB. Eventually we settled on Python, Pylons and\nMongoDB.\n\nWe found Python and MongoDB gave us unique flexibility with our data model,\nallowed us to scale for increased reliability and performance and decreased\nfeature development time - and in this talk we'll describe exactly how.\n\nWhile there are many advantages, Python/Pylons and MongoDB (as a relative\nnewcomer on the database scene) certainly have issues and limitations which\nmust be taken into careful consideration for any real-world production\ndeployment.\n\nWe compare MongoDB with other database technologies such as more traditional\nRDBMS like MySQL and competing NoSQL options such as Cassandra, CouchDB and\nBDB.\n\nWe give a detailed introducton to data modeling in MongoDB - with special\nattention paid to how this differs from a traditional relational system - the\noperators provided by its rich query language and utilizing advanced features\nsuch as GeoSpatial indexing, Replica Sets, Sharding - and how to deal with\nsome of the more publicized limitations of the system (such as single-server\ndurability).\n\nWhile much of this talk will be about using MongoDB with Python, we will also\ntouch on issues surrounding production deployment of the Pylons Web framework,\nincluding how we work around the GIL to take advantage of multi-core machines.\n\n", "video_mp4_url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/399_mongodb-pylons-at-catch-com-scalable-web-apps-with-python-and-nosql.mp4", "tags": ["casestudy", "mongodb", "nosql", "pycon", "pycon2011", "pylons", "scalable"], "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", "related_urls": [], "video_flv_download_only": false, "source_url": "", "video_webm_url": null, "video_ogv_length": 138131245, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011MongoDBPylonsAtCatchcomScalableWebAppsWithPy842-535.jpg", "video_flv_url": null}