{
  "alias": "video/428/pycon-2011--genetic-programming-in-python",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Genetic Programming in Python\n\nPresented by Eric Floehr\n\nDid you know you can create and evolve programs that find solutions to\nproblems? This talk walks through how to use Genetic Algorithms and\nGenetic Programming as tools to discover solutions to hard problems,\nwhen to use GA/GP, setting up the GA/GP environment, and interpreting\nthe results. Using `pyevolve <http://pyevolve.sourceforge.net/>`__,\nwe'll walk through a real-world implementation creating a GP that\npredicts the weather.\n\nAbstract\n\nGenetic Algorithms (GA) and Genetic Programming (GP) are methods used to\nsearch for and optimize solutions in large solution spaces. GA/GP use\nconcepts borrowed from natural evolution, such as mutation, cross-over,\nselection, population, and fitness to generate solutions to problems. If\ndone well, these solutions will become better as the GA/GP runs.\n\nGA/GP has been used in problem domains as diverse as scheduling,\ndatabase index optimization, circuit board layout, mirror and lens\ndesign, game strategies, and robotic walking and swimming. They can also\nbe a lot of fun, and have been used to evolve aesthetically pleasing\nartwork, melodies, and approximating pictures or paintings using\npolygons.\n\nGA/GP is fun to play with because often-times an unexpected solution\nwill be created that will give new insight or knowledge. It might also\npresent a novel solution to a problem, one that a human may never\ngenerate. Solutions may also be inscrutable, and determining why a\nsolution works is interesting in itself.\n",
  "duration": null,
  "id": 428,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "related_urls": [
    "http://pyevolve.sourceforge.net/"
  ],
  "slug": "pycon-2011--genetic-programming-in-python",
  "speakers": [
    "Eric Floehr"
  ],
  "summary": "",
  "tags": [
    "ga",
    "geneticalgorithms",
    "geneticprogramming",
    "gp",
    "pycon",
    "pycon2011",
    "pyevolve"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_428___genetic-programming-in-python",
  "title": "Genetic Programming in Python",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_428___genetic-programming-in-python"
    }
  ]
}
