{
  "alias": "video/446/pycon-2011--state-of-pylons-turbogears-2-repoze-b",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "State of Pylons/TurboGears 2/repoze.bfg\n\nPresented by Chris McDonough, Ben Bangert, and Mark Ramm\n\nA three-for-one talk by the main developers of three popular Python web\nframeworks! We'll (very) briefly cover the state of each of our\nindividual frameworks and communities, and then we'll describe the\nresults of our efforts to work together and share code.\n\nAbstract\n\nPylons is a popular, lightweight Python web framework.\n\nTurboGears 2 is a full-stack framework built atop Pylons.\n\nrepoze.bfg is a moderately popular, lightweight Python web framework.\n\nThe main developers and community leaders of these frameworks have been\nworking together and sharing as much as possible over the course of\nroughly the last year. We'll very briefly describe to the audience the\nstates of our individual efforts, then we'll discuss how we intend to\nmove forward and share more code and effort in the year to come. The\ntalk will be more socially- oriented than technical.\n\nIt's unusual for open source code and communities to bridge minor\nperceived differences in scope and style and to start sharing code and\nideas openly. If you're a user of any of these frameworks, you'll want\nto be present for this talk.\n",
  "duration": null,
  "id": 446,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--state-of-pylons-turbogears-2-repoze-b",
  "speakers": [
    "Ben Bangert",
    "Chris McDonough",
    "Mark Ramm"
  ],
  "summary": "",
  "tags": [
    "pycon",
    "pycon2011",
    "pylons",
    "pyramid",
    "repoze.bfg",
    "turbogears"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_446___state-of-pylons-turbogears-2-repoze-bfg",
  "title": "State of Pylons/TurboGears 2/repoze.bfg",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_446___state-of-pylons-turbogears-2-repoze-bfg"
    }
  ]
}
