{
  "alias": "video/382/pycon-2011--solvcon--a-new-python-based-software-",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "SOLVCON: A New Python-Based Software Framework for Massively\nParallelized Numerical Simulations\n\nPresented by Yung-Yu Chen\n\nSOLVCON is the first Python-based software framework for high-resolution\nsimulations of multi-physics conservation laws. More than ninety\npercents of the codes are done in Python. Performance hot-spots are\noptimized by C and glued by ctypes library. SOLVCON is high-performance\nin nature and has been able to utilize 512 4-core nodes at Ohio\nSupercomputer Center.\n\nAbstract\n\nIn this decade, performance improvements of scientific computing will\nmainly come from major changes in the computing hardware. A\nwell-organized software structure is imperative to accommodate such\nchanges. Based on Python, SOLVCON (http://solvcon.net/) is designed as a\nsoftware framework to develop conservation-law solvers by segregating\nsolving kernels from various supportive functionalities. Being the\ngoverning equations for the physical world, conservation laws are\napplied everywhere in science and engineering. Although it is well known\nthat the numerical algorithms and physical models form the kernel of any\nconservation-law solver, few if not none code can cleanly separate those\ncore components from supportive functionalities. The lack of\norganization has hindered the development of legacy codes. To address\nthe issues, the supportive functionalities are internalized in the\nframework of SOLVCON. Aided by the framework, both multi- physics and\nhybrid parallelism can be implemented in an organized way. To date,\nSOLVCON has utilized up to 512 4-core nodes at Ohio Supercomputer Center\nfor high-resolution simulations of computational fluid dynamics (CFD).\nSOLVCON targets to concurrently utilize thousands of computer nodes for\nhigh- resolution simulations using over one billion mesh points.\n\nOne of the major purposes of SOLVCON is to resolve the complicated\nprogramming efforts for GPU clusters. Supercomputing is undergoing the\nthird revolution by the emerging GPU computing. To date, the fastest\nsupercomputer in the Top 500 list, Tianhe-1A, is a GPU cluster. GPU\ncomputing promises numerical analysts to reduce the time for the\nhigh-resolution simulations from months to days. In order to use GPU\ncomputing to accelerate such large-scale problems, GPU nodes must be\nnetworked together to form a GPU cluster. As such, shared-memory and\ndistributed-memory parallelization must be simultaneously utilized to\nachieve the so-called hybrid parallelism. Parallel computing is\ndifficult, and hybrid parallel computing is more difficult. By using\nPython to develop the fundamental software structure, GPU or\nmulti-threaded programming for shared- memory parallelization are locked\nin solving kernels. Complex message-passing is implemented in SOLVCON\nand isolated from solving-kernel developers. Highly optimized C and GPU\ncodes are glued into SOLVCON without loss of performance by using the\nctypes package. Othere important features of SOLVCON include:\n\n-  Pluggable multi-physics.\n-  Built-in `CESE <http://www.grc.nasa.gov/WWW/microbus/>`__ solvers.\n-  Unstructured mesh consisting of mixed elements.\n-  Interface to Message-Passing Interface (MPI) libraries.\n-  Socket communication layer: working without MPI installed.\n-  Automatic distributed-memory parallelization by domain decomposition.\n-  Parallel I/O.\n-  In situ visualization by `VTK <http://vtk.org>`__ library.\n-  Standalone writers to VTK legacy and XML file formats.\n-  Integration to supercomputer (cluster) batch systems.\n\nSOLVCON has been applied to computation fluid dynamics and computational\nmechanics. More physical solvers are being developed for various\npropagating wave problems, e.g., electromagnetic waves. By using Python\nas the foundation in SOLVCON, performance and extensibility are well\nbalanced, and computational research is being done in the most\nproductive way. In this talk, the author of SOLVCON will make an\nintroduction to the software framework by including the following\ntopics:\n\n1. Simulations of conservation laws and hybrid parallelism for\n   supercomputing.\n2. Issues in legacy codes and challenges to code for emerging\n   supercomputer hardware.\n3. Using SOLVCON in the simple way by pre-defined modules.\n4. Fixed parts in SOLVCON.\n\n   1. Distributed computing.\n   2. Multi-thread utilities.\n\n5. Customizable parts in SOLVCON.\n\n   1. Pluggable multi-physics and GPGPU computing.\n   2. Supercomputer batch system and bootstrapping.\n   3. In situ visualization.\n\n6. Conclusion.\n\nThe talk will take 30 minutes.\n",
  "duration": null,
  "id": 382,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "related_urls": [
    "http://solvcon.net/)",
    "http://vtk.org",
    "http://www.grc.nasa.gov/WWW/microbus/"
  ],
  "slug": "pycon-2011--solvcon--a-new-python-based-software-",
  "speakers": [
    "Yung-Yu Chen"
  ],
  "summary": "",
  "tags": [
    "gpgpu",
    "numericalsimulations",
    "parallelcomputing",
    "pycon",
    "pycon2011",
    "simulations",
    "solvcon"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_382___solvcon-a-new-python-based-software-framework-for-massively-parallelized-numerical-simu",
  "title": "SOLVCON: A New Python-Based Software Framework for Massively Parallelized Numerical Simulations",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_382___solvcon-a-new-python-based-software-framework-for-massively-parallelized-numerical-simu"
    },
    {
      "length": null,
      "type": "mp4",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/382_solvcon-a-new-python-based-software-framework-for-massively-parallelized-numerical-simulations.mp4"
    }
  ]
}
