{
  "alias": "video/388/pycon-2011--jython-concurrency",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Jython Concurrency\n\nPresented by Jim Baker\n\nJython is arguably the best Python implementation to target concurrent\ncode. Jython has no GIL, it leverages the Java platform to provide\nrobust support for concurrency in its runtime, and it enables access to\na set of high-level abstractions from Java. This talk will walk through\nat the extreme level pertinent Jython implementation details and a\nseries of examples, including Java integration.\n\nAbstract\n\nJython implements the Python language, but we leverage the underlying\nJava platform to provide an opionated alternative to CPython in our\nsupport of concurrency.\n\nBecause of the GIL and related infrastructure, CPython cannot use a\nmodel in which threads perform concurrent computation defined in Python\non shared objects in the same process. (Of course, there are\nworkarounds, such as multiprocessing or using C extensions.)\n\nIn contrast, there's no GIL in Jython. Jython instead embraces threads,\nprovides extensive support for managing their execution and coordination\nthrough standard Java platform functionality (java.util.concurrent), and\nthreaded code works well with Jython's implementation of standard\nmutable collection types. Lastly, the underlying JVM provides extensive\ninstrumentation as well as the ability to set a variety of parameters,\nincluding choice of GC. There are also the inevitable pitfalls that\nmight be seen in complex architectures, such as around the use of\nClassLoaders.\n\nThis talk will go into a detailed discussion of some of the interesting\nramifications of these design points and how they can be effectively\napplied to write concurrent code, as illustrated through a variety of\nshort examples.\n",
  "duration": null,
  "id": 388,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--jython-concurrency",
  "speakers": [
    "Jim Baker"
  ],
  "summary": "",
  "tags": [
    "concurrency",
    "java",
    "jython",
    "pycon",
    "pycon2011"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_388___jython-concurrency",
  "title": "Jython Concurrency",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_388___jython-concurrency"
    },
    {
      "length": null,
      "type": "mp4",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/388_jython-concurrency.mp4"
    }
  ]
}
