{
  "alias": "video/434/pycon-2011--an--biased--survey-of-the-python-web",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "An (biased) survey of the python web\n\nPresented by Mark Ramm\n\nI may be BDFL of one framework, but that's also why I pay attention to\nthe whole ecosystem. From the release of Plone 4, TurboGears 2, Django\n1.2 and Pylons 1 ,it's been an interesting year. And things like\nhtml5lib, an updated WSGI spec, and a contender for the next generation\nWSGI have all made things interesting. Come explore the wild and dynamic\njungle that I call \"the python web toolkit.\"\n\nAbstract\n\nThis talk will not teach people to use python to make websites. It's to\nteach people who already use python, that there are lots of different\ntools out there, and to help us all get some perspective on the python\nweb toolkit.\n\nIn 2005 Pycon had the great PyWebOff, and while this talk won't be about\nthrowing Twisted into a cage match with Zope3, or setting Flask up in a\nfight to the death against web.py, it will one again provide an attempt\nto survey the full landscape of the python web world, and to see how far\nwe've come in the last 5 years.\n\nWe've definitely come a long way. Django has brought over many converts\nto Python, google released app engine with python as the first supported\nlanguage, and there are quite a few sites in the top 100 using python to\nserve up dynamic content to hundreds of millions of users.\n\nBut it hasn't all been good either, there's more fragmentation than\never. We've also got more half finished libraries, and broken framework\nextensions, and abandoned projects littering up the landscape.\n",
  "duration": null,
  "id": 434,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--an--biased--survey-of-the-python-web",
  "speakers": [
    "Mark Ramm"
  ],
  "summary": "",
  "tags": [
    "pycon",
    "pycon2011",
    "web",
    "webframeworks"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_434___an-biased-survey-of-the-python-web",
  "title": "An (biased) survey of the python web",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_434___an-biased-survey-of-the-python-web"
    }
  ]
}
