{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon US 2011", "speakers": [], "title": "Panel: Python in Schools: Teaching It and Teaching With It.", "quality_notes": "", "video_flv_length": null, "recorded": "2011-03-11", "video_mp4_length": null, "description": "Panel: Python in Schools: Teaching It and Teaching With It.\n\nPanel with Joel Zachary Miller, Jeffrey Elkner, Vern Ceder, Brian C. Brumley,\nMaria Litvin\n\nEducators discuss Python as both a subject and a tool in primary and secondary\n(K12) education. Topics addressed include the distinction between teaching\nPython and teaching with Python, the benefits of Python in K12 and ways to\ndemonstrate the value of Python to administrators. Panel includes private and\npublic K12 educators and university faculty involved in instruction in the K12\nsetting.\n\nAbstract\n\nZac Miller will act as panel moderator.\n\nPanel will open with a brief introduction of the origins of the panel and self\nintroductions of panel members before addressing the following topics:\n\n  * The distinction between teaching Python and teaching with Python. \n    * Teaching Python \n    * Teaching Math with Python \n  * How does Teaching with Python complement Teaching Python? \n    * Do tensions between the two exist? \n  * What keeps Python out of schools? What can be done to encourage more schools to teach tools like Python? \n  * What is the biggest benefit teaching Python brings to your school and students? What is the biggest benefit in general, beyond your school? \n  * Can teaching Python help spark creativity in those students who have trouble exercising it? \n    * When teaching Python a creativity divide becomes readily apparent among students. Students with a high level of curiosity and creativity constantly try new things on their own, while other students are focused solely on completing the assignments for grades. How can an instructor handle this? \n    * What tangible steps can an instructor take to encourage creativity? \n  * What does the future look like for Python in K12 education, both at our own schools and in general? \n  * Audience Questions \n\nPanel Biographies:\n\nVern Ceder, Director of Technology, Canterbury School, Ft Wayne, Indiana. The\nCanterbury School has been teaching at least a little Python to every single\n8th and 9th grader in the school since 2001, as well as offering electives in\nPython, Java, C, etc. Vern also teaches Python through Northwestern's Gifted\nLearning Links program\n([http://www.ctd.northwestern.edu/gll/](http://www.ctd.northwestern.edu/gll/))\nand is the author of The Quick Python Book, 2nd ed\n([http://www.manning.com/ceder](http://www.manning.com/ceder))\n\nMaria Litvin. Maria teaches Math and Computer Science at Phillips Academy in\nAndover, MA, including \"Introduction to Discrete Mathematics and Programming\nin Python.\" She also taught Python to Boston-area high school teachers and to\nmiddle schoolers in Google's CAPE program. She's co-author of several Computer\nScience textbooks, most recently Mathematics for the Digital Age and\nProgramming in Python ([www.skylit.com/mathandpython.html](http://www.skylit.c\nom/mathandpython.html)).\n\nJeffrey Elkner, teaches computer programming and information technology at the\nGovernor's Career and Technical Academy in Arlington, Virginia. He has been\nteaching with Python since 1999, and is co-author of a free on-line textbook:\nHow to Think Like a Computer Scientist: Learning with Python. He also\nmaintains the Open Book Project\n([http://openbookproject.net](http://openbookproject.net/)), which contains\nseveral Python resources. Jeff has attended each PyCon held thus far, often\nbringing students along with him.\n\nBrian Brumley teaches Python (and lots of other stuff) to grades 6-8 at\nPorter-Gaud school in Charleston, SC. Brian is a regular presenter at state\nand regional conferences on technology and programming in schools.\n\nZac Miller is adjunct instructor in the STEM school at Gainesville State\nCollege and a faculty member at the Da Vinci Academy at South Hall Middle\nSchool in Gainesville, Georgia. Zac is currently teaching Python programming\nand Python programming for Geographic Information Systems to K12 and college-\nlevel students.\n\n", "video_mp4_url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/437_panel-python-in-schools-teaching-it-and-teaching-with-it.mp4", "tags": ["pycon", "pycon2011", "teaching"], "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", "related_urls": [], "video_flv_download_only": false, "source_url": "", "video_webm_url": null, "video_ogv_length": 214438138, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011PanelPythonInSchoolsTeachingItAndTeachingWith796.png", "video_flv_url": null}