{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon US 2011", "speakers": ["Mark Ramm"], "title": "An (biased) survey of the python web", "quality_notes": "", "video_flv_length": null, "recorded": "2011-03-11", "video_mp4_length": null, "description": "An (biased) survey of the python web\n\nPresented by Mark Ramm\n\nI may be BDFL of one framework, but that's also why I pay attention to the\nwhole ecosystem. From the release of Plone 4, TurboGears 2, Django 1.2 and\nPylons 1 ,it's been an interesting year. And things like html5lib, an updated\nWSGI spec, and a contender for the next generation WSGI have all made things\ninteresting. Come explore the wild and dynamic jungle that I call \"the python\nweb toolkit.\"\n\nAbstract\n\nThis talk will not teach people to use python to make websites. It's to teach\npeople who already use python, that there are lots of different tools out\nthere, and to help us all get some perspective on the python web toolkit.\n\nIn 2005 Pycon had the great PyWebOff, and while this talk won't be about\nthrowing Twisted into a cage match with Zope3, or setting Flask up in a fight\nto the death against web.py, it will one again provide an attempt to survey\nthe full landscape of the python web world, and to see how far we've come in\nthe last 5 years.\n\nWe've definitely come a long way. Django has brought over many converts to\nPython, google released app engine with python as the first supported\nlanguage, and there are quite a few sites in the top 100 using python to serve\nup dynamic content to hundreds of millions of users.\n\nBut it hasn't all been good either, there's more fragmentation than ever.\nWe've also got more half finished libraries, and broken framework extensions,\nand abandoned projects littering up the landscape.\n\n", "video_mp4_url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/434_an-biased-survey-of-the-python-web.mp4", "tags": ["pycon", "pycon2011", "web", "webframeworks"], "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", "related_urls": [], "video_flv_download_only": false, "source_url": "", "video_webm_url": null, "video_ogv_length": 135394179, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011AnBiasedSurveyOfThePythonWeb847.png", "video_flv_url": null}