{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon US 2011", "speakers": ["David Beazley"], "title": "Using Python 3 to Build a Cloud Computing Service for my Superboard II", "quality_notes": "", "video_flv_length": null, "recorded": "2011-03-11", "video_mp4_length": null, "description": "Using Python 3 to Build a Cloud Computing Service for my Superboard II\n\nPresented by David Beazley\n\nThe OSI Superboard II was the computer on which I first learned to program\nback in 1979. Python is why programming remains fun today. In this tale of old\nmeets new, I describe how I have used Python 3 to create a cloud computing\nservice for my still-working Superboard--a problem complicated by it only\nhaving 8Kb of RAM and 300-baud cassette tape audio ports for I/O.\n\nAbstract\n\nPython 3, what good is it? Cloud computing? Bah! In this talk, I describe how\nI have used Python 3 to build a distributed cloud-computing service for my\nSuperboard II system. Originally built in 1978, the Superboard is an obvious\ncandidate for cloud computing due to its extremely constrained memory (8Kb),\nslow processor (a 1Mhz 6502), crippled I/O (300 baud over audio), and retro\nprogramming environment (Microsoft Basic 1.0). The only question is how to do\nit?\n\nTo answer that question, this talk consist of two main parts. In the first\npart, I discuss the problem of building a communications stack between the\nSuperboard and a Mac using nothing but audio line-in/line-out ports--a problem\ninvolving a tricky I/O handling, real-time audio signal processing, and the\ncreation of a data-link layer communication protocol. In the second part, I\ndiscuss the creation of a distributed cloud-computing service and related\ntopics including messaging systems, key-value stores, map-reduce, etc.\n\nThe primary implementation language for all of this work is Python 3.\nThroughout the talk, I will mention interesting Python 3 programming idioms\nalong with pros and cons. I'll conclude by summarizing my experience trying to\nbuild a significant project entirely in Python 3.\n\n", "video_mp4_url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/443_using-python-3-to-build-a-cloud-computing-service-for-my-superboard-ii.mp4", "tags": ["pycon", "pycon2011", "soawesome", "superboard"], "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", "related_urls": [], "video_flv_download_only": false, "source_url": "", "video_webm_url": null, "video_ogv_length": 234095870, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011UsingPython3ToBuildACloudComputingServiceFor438.png", "video_flv_url": null}