{
  "alias": "video/443/pycon-2011--using-python-3-to-build-a-cloud-compu",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Using Python 3 to Build a Cloud Computing Service for my Superboard II\n\nPresented by David Beazley\n\nThe OSI Superboard II was the computer on which I first learned to\nprogram back in 1979. Python is why programming remains fun today. In\nthis tale of old meets new, I describe how I have used Python 3 to\ncreate a cloud computing service for my still-working Superboard--a\nproblem complicated by it only having 8Kb of RAM and 300-baud cassette\ntape audio ports for I/O.\n\nAbstract\n\nPython 3, what good is it? Cloud computing? Bah! In this talk, I\ndescribe how I have used Python 3 to build a distributed cloud-computing\nservice for my Superboard II system. Originally built in 1978, the\nSuperboard is an obvious candidate for cloud computing due to its\nextremely constrained memory (8Kb), slow processor (a 1Mhz 6502),\ncrippled I/O (300 baud over audio), and retro programming environment\n(Microsoft Basic 1.0). The only question is how to do it?\n\nTo answer that question, this talk consist of two main parts. In the\nfirst part, I discuss the problem of building a communications stack\nbetween the Superboard and a Mac using nothing but audio\nline-in/line-out ports--a problem involving a tricky I/O handling,\nreal-time audio signal processing, and the creation of a data-link layer\ncommunication protocol. In the second part, I discuss the creation of a\ndistributed cloud-computing service and related topics including\nmessaging systems, key-value stores, map-reduce, etc.\n\nThe primary implementation language for all of this work is Python 3.\nThroughout the talk, I will mention interesting Python 3 programming\nidioms along with pros and cons. I'll conclude by summarizing my\nexperience trying to build a significant project entirely in Python 3.\n",
  "duration": null,
  "id": 443,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--using-python-3-to-build-a-cloud-compu",
  "speakers": [
    "David Beazley"
  ],
  "summary": "",
  "tags": [
    "pycon",
    "pycon2011",
    "soawesome",
    "superboard"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_443___using-python-3-to-build-a-cloud-computing-service-for-my-superboard-ii",
  "title": "Using Python 3 to Build a Cloud Computing Service for my Superboard II",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_443___using-python-3-to-build-a-cloud-computing-service-for-my-superboard-ii"
    }
  ]
}
