{
  "alias": "video/374/pycon-2011--diversity-in-tech--improving-our-tool",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Diversity in Tech: Improving our Toolset\n\nPresented by Jennifer Leech\n\nAs communities allow more diversity, they draw from a larger talent\npool, challenge each other more, and hit a higher bar in terms of\ningenuity and work-product. However questions surrounding diversity\noften seem under- examined. What are the effects of diversity in the\ncommunity, or lack thereof? I intend to approach this topic from an\naccessible and entertaining, yet analytical perspective.\n\nAbstract\n\nLast year there was a photo of Kate Moss shown during a PyCon\npresentation which raised debate as to its appropriateness. This debate\nbrought up some interesting questions - but what I found most\ninteresting was that while it elicited strong opinions, the issue seemed\nto be somewhat unexamined. This event sparked a desire for deeper\nanalysis on this topic in a more focussed setting.\n\nIn this talk, I intend to address some of the core principles underlying\nthis debate. Discussion will include the following questions: Where does\nresponsibility lie in understanding these issues? What are the effects\nof failing to do so? What are the effects of diversity in the community,\nor lack thereof? What do we lose by being more homogenous or more\ndiverse? Gain?\n\nAs communities allow more diversity, they draw from a larger talent\npool, challenge each other more, and hit a higher bar in terms of\ningenuity and work-product. However, diversity requires awareness and\ntolerance on both the part of the dominant culture and on the part of\nthe new arrivals to smooth the inevitable rough edges.\n\nI intend to approach this topic from an accessible, inclusive and\nentertaining, yet analytical perspective. The broader intent is to raise\nthe level of understanding and community discourse on this topic. It is\nodd that diversity can so dramatically affect our lives and communities\nand yet be unexamined, particularly in a community so highly intelligent\nand educated as that which populates the tech industry.\n",
  "duration": null,
  "id": 374,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--diversity-in-tech--improving-our-tool",
  "speakers": [
    "Jennifer Leech"
  ],
  "summary": "",
  "tags": [
    "diversity",
    "pycon",
    "pycon2011"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_374___diversity-in-tech-improving-our-toolset",
  "title": "Diversity in Tech: Improving our Toolset",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_374___diversity-in-tech-improving-our-toolset"
    }
  ]
}
