{
  "alias": "video/444/pycon-2011--serious-business--python-is-not-just-",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Serious Business: Python is not just for Engineering\n\nPresented by Zach Steindler\n\nBuilding a great business is quite different from building a great\nproduct, but by measuring Key Performance Indicators (things like cash\nflow, if users keep coming back, etc.) you can make sure your business\nis on the right track. In this talk I'll cover common KPI in the tech\nbusiness and show you how we automate collecting and presenting KPI at\nOlark.\n\nAbstract\n\nAs a hacker-turned-founder, you quickly realize there's more to building\na great business than just building a great product. The easiest way to\nknow your business is on the right track is to measure Key Performance\nIndicators (KPIs): things like cash flow, what parts of the product is\nused the most, if your users keep coming back, if users are experiencing\nproblems... and many, many others. How are you supposed to keep track of\nit all without getting lost in a sea of noise?\n\nWith Python, of course! In this talk I'll cover the most common KPIs\ntechnology businesses track and show you how we used Python at Olark to\nautomatically collect and present KPIs to the team. This has made it\nmuch easier to quickly answer business questions and help us know we're\non the right track.\n\nSo if you're a Python hacker who would like to learn more about how to\nengineer a business, or if you're a business person who's just starting\nto learn Python, come learn how Python isn't just for engineering.\n",
  "duration": null,
  "id": 444,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--serious-business--python-is-not-just-",
  "speakers": [
    "Zach Steindler"
  ],
  "summary": "",
  "tags": [
    "business",
    "kpi",
    "pycon",
    "pycon2011"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_444___serious-business-python-is-not-just-for-engineering",
  "title": "Serious Business: Python is not just for Engineering",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_444___serious-business-python-is-not-just-for-engineering"
    }
  ]
}
