{
  "alias": "video/424/pycon-2011--backup-is-hard--let--39-s-go-shopping",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Backup Is Hard; Let's Go Shopping\n\nPresented by Gary Bernhardt\n\nWe'll fly through the most clever bits of BitBacker, an online backup\napp developed as a startup for three years and eventually abandoned.\nHighlights: a hacked-up httplib/asyncore HTTP client; a real-life,\nHATEOAS-respecting RESTful API, and an encryption scheme that can\nquickly diff a file system against the server while leaking no\ninformation – not even file timestamps.\n\nAbstract\n\nThis is the story of a solution to a huge problem: fast, secure online\nbackup. A single client generates a hundred gigabytes, millions of data\nchunks, and thousands of file system snapshots. To appreciate the\nproblem's scale, consider that a Python array holding content hashes for\n1,000,000 files consumes 100 MB of memory. File hashes are only a\nportion of the required per- file metadata, and that's only one for\nsnapshot of thousands.\n\nWe'll tour the hard parts of this system with no apology for their\ndifficulty. The httplib/asyncore hybrid monster that served millions of\nparallel requests, transparently retrying on failures and timeouts, with\nonly 300 lines of python. The RESTful API – fully respecting hypertext,\nwith every request safely repeatable, even POSTs, and not a single\nhard-coded URL in the client. The encryption scheme that leaked nothing\n– not even modification times – but could quickly diff local file\nsystems against the server. And, that one time that a client\naccidentally requested a 4.76 megabyte URL in production.\n",
  "duration": null,
  "id": 424,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--backup-is-hard--let--39-s-go-shopping",
  "speakers": [
    "Gary Bernhardt"
  ],
  "summary": "",
  "tags": [
    "backup",
    "bigdata",
    "bitbacker",
    "pycon",
    "pycon2011"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_424___backup-is-hard-let-s-go-shopping",
  "title": "Backup Is Hard; Let's Go Shopping",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_424___backup-is-hard-let-s-go-shopping"
    },
    {
      "length": null,
      "type": "mp4",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/424_backup-is-hard-let-s-go-shopping.mp4"
    }
  ]
}
