{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon US 2011", "speakers": ["Michael D. Healy"], "title": "Linguistics of Twitter", "quality_notes": "", "video_flv_length": null, "recorded": "2011-03-11", "video_mp4_length": null, "description": "Contrary to expectations, the prevalence of television did not cause every\nAmerican to speak in a common standard dialect. Rather, smaller sub-regional\ndialects are merging into stronger regional dialects with the largest change\nin spoken English since the 1750's taking place in the Northern Cities Vowel\nShift.\n\nSocial Media is widely considered a conversational media, users often leaning\non their dialect which to express themselves.\n\nTaking a recent tweet for example:\n\n    \n    '_andBeautyKills: – after tonight, don’t leave your boy roun’ me, umma #true playa fareal.'\n\nThis tweet presents a problem for traditional natural language processing\nparadigm:\n\n  * Do they build out an extensive reg ex to solve this? \n  * Even Worse, do they reject it because of non-Standard English? \n  * How do they respond such that communication is effective? \n\nCurrently under development with Python using the Natural Language Toolkit are\nthe tools and methodologies to process, understand and respond to\ncommunication that falls outside Standard American English. This talk will\nfocus on the status of existing tools, where development stands, challenges\nfor traditional tools and potential opportunities for exploration.\n\nWhile limited to American English, any participant who is studying natural\nlanguage processing of any language is welcome and sure to learn. The\ntechniques could be applied to languages around the world for which the\nmotivated programmer is knowledgeable about.\n\n", "video_mp4_url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/363_linguistics-of-twitter.mp4", "tags": ["nltk", "pycon", "pycon2011", "twitter"], "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", "related_urls": [], "video_flv_download_only": false, "source_url": "", "video_webm_url": null, "video_ogv_length": 157725186, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "Dialectical changes in America are influencing expression online. This talk\nwill discuss a current project which is using the Natural Language Toolkit to\ndevelop up to date reference materials to measure and monitor online natural\nlanguage.\n\n", "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011LinguisticsOfTwitter909.png", "video_flv_url": null}