{
  "alias": "video/390/pycon-2011--django--pitfalls-i-encountered-and-ho",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Django: Pitfalls I Encountered and How to Avoid Them\n\nPresented by Luke Sneeringer\n\nAre you starting a moderate to large sized Django project? Do you need\nto plan ahead and build an application that will react to unanticipated\nneeds? This talk covers some techniques and pitfalls I encountered in\nwriting my first reasonably large Django site, and what I did\ndifferently the second time I started a project.\n\nAbstract\n--------\n\nWhen working on a company product, especially one where developers don't\nalways have full control over the scope and needs of the application,\nit's important to plan ahead for unanticipated needs.\n\nThis talk will cover simple tricks and methods that are a small amount\nof work up front, but can save you lots of time later.\n\nPyCon Talk Outline\n------------------\n\n#. Introduction (5m)\n\n   -  Me!\n\n#. Making Mistakes\n\n   -  It happens. \"Code quality can be measured by the number of WTFs\n      per minute in the code review.\"\n   -  When dealing with a big, expansive framework like Django,\n      sometimes you just don't know that something is there. Good docs\n      don't completely solve this...there's always going to be the thing\n      you don't find. Similarly, sometimes you don't realize how to\n      leverage something that you do know about until much later.\n\n      My regrets with my current project aren't sweeping architectural issues. I did most of the big stuff right. My regrets are mostly small things that, because it was my first big project, there was this piece or that piece that I didn't see or didn't fully appreciate, and so now I have little blocks of code that are tougher to maintain than they need to be. End of the world? No. Worth thinking through for next time? Yes.\n\n#. Some trivial things (10m)\n\n   -  Preface: Yeah, some of these are dumb.\n   -  Beginning at the beginning: Project Setup\n\n      -  I had sys.path pointing to the directory above the project root, like the tutorial does. I wish I hadn't done that.\n      -  Need to run two instances on the same box that don't share the actual codebase (e.g. a staging server)? You still can, but it's more awkward. Better to set sys.path at your project root.\n   -  Dude, where's my Media class?\n\n      -  How did I do it? First I had a magic template variable. Then I\n          copied Form.Media\n      -  Then, on a later project, I realized a block works just fine.\n   -  My boss wants \\_\\_\\_\\_ available on every page!\n   \n      -  How did I do it? I had a method we called everywhere that took\n         arbitrary keyword arguments...\n      -  Oh, there's TEMPLATE\\_CONTEXT\\_PROCESSORS...\n\n         -  ...if you manually use RequestContext every time! So, just do\n            that. Always. Even if you don't need it.\n         -  I want .select\\_related('something') every time!\n         -  ...so I typed it! A lot.\n         -  Oh, that can be done by overriding def queryset on the manager\n            class? That's easier to maintain...\n            \n            -  ...but make sure you set the flag to use it on related fields!\n   -  We need sample data for so-and-so, such-and-such...\n   \n      -  Disclaimer: This one actually isn't mine; my boss did it. But,\n         it's amusing, and worth mentioning.\n      -  We needed sample data so my boss could preview themes...so he set\n         up a second database, put in fake data, and hard-coded it in the\n         app-wide (not server-specific) settings.py.\n\n         -  Copied the entire DB structure...at the time. But it changes.\n         -  Oh, and the unit testing framework didn't appreciate it,\n            either.\n\n      -  Fixtures are the right way (and sooner or later I'll get this\n         fixed...it's still there).\n    \n         -  (space reserved for my stumbling upon something else silly, and\n            hopefully humorous, that I did wrong)\n\n   - How to avoid missing trivial things?\n    \n      -  Read the documentation. Over and over.\n      -  Become familiar with the Django code.\n    \n#. A non-trivial thing: Forms (10m)\n\n   -  Django forms can do anything...given sufficient shenanigans.\n      Always do it the Django forms way; your life will be easier.\n   -  Forms and ModelForms are static, and I needed dynamic choices on a\n      form...\n\n      -  ...so I just ditched newforms\n      -  But wait, this is Python. A trivial function that calls the\n         metaclass can solve this problem!\n    \n         -  This looks complicated, but it's not. Walk through how to do\n            it.\n         -  It's quite maintainable, and you get all the other bells and\n            whistles.\n   -\n\n#. Questions? (5m)\n\n",
  "duration": null,
  "id": 390,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--django--pitfalls-i-encountered-and-ho",
  "speakers": [
    "Luke Sneeringer"
  ],
  "summary": "",
  "tags": [
    "pycon",
    "pycon2011"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_390___django-pitfalls-i-encountered-and-how-to-avoid-them",
  "title": "Django: Pitfalls I Encountered and How to Avoid Them",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_390___django-pitfalls-i-encountered-and-how-to-avoid-them"
    },
    {
      "length": null,
      "type": "mp4",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/390_django-pitfalls-i-encountered-and-how-to-avoid-them.mp4"
    }
  ]
}
