{
  "alias": "video/410/pycon-2011--ten-years-of-twisted",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Ten Years of Twisted\n\nGlyph Lefkowitz\n\nThe Twisted event-driven networking engine is well-known in the Python\ncommunity. However, only a few of its features are widely understood.\nThis talk will be a brief conceptual introduction to Twisted, followed\nby a survey of its features, their status, and how development has been\nproceeding over the years, with a special focus on the last two years of\nsponsored development.\n\nAbstract\n\nThis talk will begin with a brief introduction to Twisted architectural\nconcepts; a description of the event loop, connections, and timers. It\nwill then segue into the many different features that Twisted offers,\nincluding command-line tools for running an out-of-the-box\nzero-configuration HTTP server, DNS server, IRC server, and SMTP server.\nThis will also present the relative maturity and stability of each of\nthese areas of the code, with a special emphasis on what level of\nexpertise a developer should have before attempting to use them.\nFinally, I will describe some of the features that have been added to\nTwisted along the way, including some new and exciting developments that\nhave been happening recently.\n",
  "duration": null,
  "id": 410,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--ten-years-of-twisted",
  "speakers": [],
  "summary": "",
  "tags": [
    "pycon",
    "pycon2011",
    "twisted"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_410___ten-years-of-twisted",
  "title": "Ten Years of Twisted",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_410___ten-years-of-twisted"
    },
    {
      "length": null,
      "type": "mp4",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/410_ten-years-of-twisted.mp4"
    }
  ]
}
