{
  "alias": "video/425/pycon-2011--how-to-kill-a-patent-with-python",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "How to kill a patent with Python\n\nPresented by Van Lindberg\n\nFinding the right piece of \"prior art\" - technical documentation that\ndescribed a patented piece of technology before the patent was filed -\nis like finding a needle in a very big haystack. This session will talk\nabout how I am making that process faster and more accurate through the\nuse of natural language processing, graph theory, machine learning, and\nlots of Python.\n\nAbstract\n\nFrom my work consulting on a number of patent cases, I am frequently\nasked to find \"prior art\" - patents and publications that describe a\ntechnology before a certain date. The problem is that the indexing\nmechanisms for patents and publications are not as good as they could\nbe, making good prior art searching more of an art than a science. When\nI decided to do better, I reached for Python.\n\n-  Part I (5 mins): The USPTO as a data source.\\* The full-text of each\n   patent is available from the USPTO (and now from Google.) What does\n   this data look like? How can it be harvested and normalized to create\n   data structures that we can work with?\n-  Part II (15 mins, in two parts):\\* Once the patents have been cleaned\n   and normalized, they can be turned into data structures that we can\n   use to evaluate their relationship to other documents. This is done\n   in two ways - by modeling each patent as a document vector and a\n   graph node.\n-  Part IIA (7 mins): Patents as document vectors.\\* Once we have a\n   patent as a data structure, we can treat the patent as a vector in an\n   n-dimensional space. In moving from a document into a vector space,\n   we will touch on normalization, stemming, TF/IDF, Latent Semantic\n   Indexing (LSI) and Latent Dirichlet Allocation (LDA).\n-  Part IIB (7 mins): Patents as technology graphs.\\* This will show\n   building graph structures using the connections between patents -\n   both the built-in connections in the patents themselves as well as\n   the connections discovered while working with the patents as vectors.\n   We apply some social network analysis to partition the patent graph\n   and find other documents in the same technology space.\n-  Part III (5 mins): What have we built?\\* Now that we have done all\n   this analysis, we can see some interesting things about the patent\n   database as a whole. How does the patent database act as a map to the\n   world of technology? And how has this helped with the original\n   problem - finding better prior art?\n\n",
  "duration": null,
  "id": 425,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--how-to-kill-a-patent-with-python",
  "speakers": [
    "Van Lindberg"
  ],
  "summary": "",
  "tags": [
    "casestudy",
    "patents",
    "pycon",
    "pycon2011"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_425___how-to-kill-a-patent-with-python",
  "title": "How to kill a patent with Python",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_425___how-to-kill-a-patent-with-python"
    },
    {
      "length": null,
      "type": "mp4",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/425_how-to-kill-a-patent-with-python.mp4"
    }
  ]
}
