{
  "alias": "video/363/pycon-2011--linguistics-of-twitter",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Contrary to expectations, the prevalence of television did not cause\nevery American to speak in a common standard dialect. Rather, smaller\nsub-regional dialects are merging into stronger regional dialects with\nthe largest change in spoken English since the 1750's taking place in\nthe Northern Cities Vowel Shift.\n\nSocial Media is widely considered a conversational media, users often\nleaning on their dialect which to express themselves.\n\nTaking a recent tweet for example:\n\n::\n\n    '_andBeautyKills: – after tonight, don’t leave your boy roun’ me, umma #true playa fareal.'\n\nThis tweet presents a problem for traditional natural language\nprocessing paradigm:\n\n-  Do they build out an extensive reg ex to solve this?\n-  Even Worse, do they reject it because of non-Standard English?\n-  How do they respond such that communication is effective?\n\nCurrently under development with Python using the Natural Language\nToolkit are the tools and methodologies to process, understand and\nrespond to communication that falls outside Standard American English.\nThis talk will focus on the status of existing tools, where development\nstands, challenges for traditional tools and potential opportunities for\nexploration.\n\nWhile limited to American English, any participant who is studying\nnatural language processing of any language is welcome and sure to\nlearn. The techniques could be applied to languages around the world for\nwhich the motivated programmer is knowledgeable about.\n",
  "duration": null,
  "id": 363,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--linguistics-of-twitter",
  "speakers": [
    "Michael D. Healy"
  ],
  "summary": "Dialectical changes in America are influencing expression online. This\ntalk will discuss a current project which is using the Natural Language\nToolkit to develop up to date reference materials to measure and monitor\nonline natural language.\n",
  "tags": [
    "nltk",
    "pycon",
    "pycon2011",
    "twitter"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_363___linguistics-of-twitter",
  "title": "Linguistics of Twitter",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_363___linguistics-of-twitter"
    },
    {
      "length": null,
      "type": "mp4",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/363_linguistics-of-twitter.mp4"
    }
  ]
}
