{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon US 2011", "speakers": ["Zach Steindler"], "title": "Serious Business: Python is not just for Engineering", "quality_notes": "", "video_flv_length": null, "recorded": "2011-03-11", "video_mp4_length": null, "description": "Serious Business: Python is not just for Engineering\n\nPresented by Zach Steindler\n\nBuilding a great business is quite different from building a great product,\nbut by measuring Key Performance Indicators (things like cash flow, if users\nkeep coming back, etc.) you can make sure your business is on the right track.\nIn this talk I'll cover common KPI in the tech business and show you how we\nautomate collecting and presenting KPI at Olark.\n\nAbstract\n\nAs a hacker-turned-founder, you quickly realize there's more to building a\ngreat business than just building a great product. The easiest way to know\nyour business is on the right track is to measure Key Performance Indicators\n(KPIs): things like cash flow, what parts of the product is used the most, if\nyour users keep coming back, if users are experiencing problems... and many,\nmany others. How are you supposed to keep track of it all without getting lost\nin a sea of noise?\n\nWith Python, of course! In this talk I'll cover the most common KPIs\ntechnology businesses track and show you how we used Python at Olark to\nautomatically collect and present KPIs to the team. This has made it much\neasier to quickly answer business questions and help us know we're on the\nright track.\n\nSo if you're a Python hacker who would like to learn more about how to\nengineer a business, or if you're a business person who's just starting to\nlearn Python, come learn how Python isn't just for engineering.\n\n", "video_mp4_url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/444_serious-business-python-is-not-just-for-engineering.mp4", "tags": ["business", "kpi", "pycon", "pycon2011"], "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", "related_urls": [], "video_flv_download_only": false, "source_url": "", "video_webm_url": null, "video_ogv_length": 83735655, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011SeriousBusinessPythonIsNotJustForEngineering609.png", "video_flv_url": null}