{
  "alias": "video/427/pycon-2011--why-is-python-slow-and-how-pypy-can-h",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Why is Python slow and how PyPy can help?\n\nPresented by Maciej Fijalkowski and Alex Gaynor\n\nPyPy is a virtual machine for Python, featuring an advanced just in time\ncompiler, which can deliver exceptional performance. This talk is going\nto be a deep dive into what exactly makes Python such a hard language to\noptimize, how PyPy is organized, and what optimizations our JIT can do\n(and what it can't do) for your code.\n\nAbstract\n\nThe talk will detail how a python interpreter works internally and why\nsome operations are costly. We'll go through several python features,\nhow they work, why they're slow in CPython and how we're fixing it.\n\nThe list of mentioned features is not exhaustive, however we will try to\nfocus at least on the following:\n\n-  Dynamic language - In Python code we have no known types, like a\n   statically typed language. Even operations like \"a + b\" can do\n   anything, unless we know more about the code, and the types it is\n   operating on.\n\n-  Frame introspection - Frame objects need to be allocated for every\n   function call, and all local variables are stored on the frame, and\n   must be accessible from further down the call stack.\n\nPyPy uses a novel approach called \"virtualizables\" which makes it\npossible to avoid frame allocation in most common cases.\n\n-  Object model - All user defined Python objects have a dictionary\n   which stores their attributes, as does every type. When Python does\n   an attribute lookup this requires at least two dictionary lookups.\n\nIn PyPy we use an approach similar to the one used by V8 with hidden\nclasses (except more PyPy specific) called map dictionaries and other\noptimizations.\n\n-  FFI calls - Calling C from Python is costly and hard to optimize. In\n   PyPy we expose C APIs to Python code via ctypes. This part explains\n   how we can optimize ctypes calls.\n\n-  array module - Users of CPython's array module probably know it can\n   save them quite a bit of memory, however it's also slower than using\n   a list, due to the overhead of boxing and unboxing on every\n   operations. Here we will tie everything together and describe how the\n   array module is much faster with PyPy's JIT, combining our\n   optimizations to: unbox values, remove the dynamicism within traces,\n   and deliver great performance.\n\n\n",
  "duration": null,
  "id": 427,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--why-is-python-slow-and-how-pypy-can-h",
  "speakers": [
    "Alex Gaynor",
    "Maciej Fijalkowski"
  ],
  "summary": "",
  "tags": [
    "jit",
    "pycon",
    "pycon2011",
    "pypy",
    "vm"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_427___why-is-python-slow-and-how-pypy-can-help",
  "title": "Why is Python slow and how PyPy can help?",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_427___why-is-python-slow-and-how-pypy-can-help"
    },
    {
      "length": null,
      "type": "mp4",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/427_why-is-python-slow-and-how-pypy-can-help.mp4"
    }
  ]
}
