{
  "alias": "video/365/pycon-2011--htsql---an-insanely-good-wsgi---rest-",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "The HTSQL processor is a high-level URI-based query language for\nrelational databases such as SQLite, PostgreSQL or MySQL. Since it's\nwritten in Python, it is easy to integrate and generates immediate value\nas the core of your application's custom reporting engine. HTSQL is like\nthe Django or SQLAlchemy ORMs in that it generates SQL, but unlike an\nORM in that its design center is completely different -- it was created\nfor hard core reporting and not object to relational mapping. Hence, it\nis a wonderful complement to existing WSGI- based applications to easily\ncreate dashboards, complex reports. We use HTSQL as a REST reporting\ninterface for data integration and ad-hoc queries.\n\nThis talk will have two parts. In the first part we'll give a brief\noverview of the rationale and design of the query language. In the\nsecond part, we'll show how to hook the HTSQL processor into your WSGI\napplication and how to make custom commands, such as a simple calendar\noutput from a table containing a date column.\n\nThe talk will be presented by Clark Evans, HTSQL was developed by Kyrylo\nSimonov. The main HTSQL site is http://htsql.org and the code is at\n`http://bitbucket.org/prometheus/htsql <http://bitbucket.org/promet%20heus/htsql>`__.\nIt'll be similar to previous talks, such as\nhttp://htsql.org/talks/20101103.html.\n",
  "duration": null,
  "id": 365,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "related_urls": [
    "http://bitbucket.org/promet%20heus/htsql",
    "http://bitbucket.org/prometheus/htsql",
    "http://htsql.org",
    "http://htsql.org/talks/20101103.html."
  ],
  "slug": "pycon-2011--htsql---an-insanely-good-wsgi---rest-",
  "speakers": [
    "Clark C. Evans"
  ],
  "summary": "HTSQL is a URI-based high-level query language for relational databases;\nit is written in the Python language. HTSQL is a wonderful complement\nexisting WSGI- based applications, making it trivial to create\ninteractive dashboards, complex reports. We use HTSQL as a REST query\ninterface for data integration and ad-hoc reporting by technical users\nor ``accidental programmers``.\n",
  "tags": [
    "htsql",
    "pycon",
    "pycon2011"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_365___htsql-an-insanely-good-wsgi-rest-interface-to-your-favorite-database",
  "title": "HTSQL - an insanely good WSGI / REST interface to your favorite database",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_365___htsql-an-insanely-good-wsgi-rest-interface-to-your-favorite-database"
    }
  ]
}
