{
  "alias": "video/371/pycon-2011--hookbox--all-python-web-frameworks--n",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Hookbox: All Python web-frameworks, now real-time. Batteries Included.\n\nPresented by Michael Carter\n\nLearn how to supercharge your python web applications (Django, Pylons,\nTG, GAE, Werkzeug, WSGI, etc) with real-time features! Presenceful and\nmoderated chat? About 10 minutes, seriously. A real-time graph to\nmonitor the CPU? Less than five. If you pay attention for at least half\nof this talk, you'll leave confident and ready to take advantage of\nWebSocket, Comet, and the world, thanks to Hookbox.\n\nAbstract\n\nHookbox (`http://hookbox.org <http://hookbox.org/>`__) is a Python and\nEventlet- based Comet-server/message-queue which tightly integrates with\nexisting web application infrastructure via web hooks and a REST\ninterface; Hookbox’s purpose is to ease the development of real-time web\napplications, with an emphasis on tight integration with existing web\ntechnology. Put simply, Hookbox is a web-enabled message queue.\n\nBrowers may directly connect to Hookbox, subscribe to named channels,\nand publish and receive messages on those channels in real-time. An\nexternal application (typically the web application itself) may also\npublish messages to channels by means of the Hookbox REST interface. All\nauthentication and authorization is performed by an external web\napplication via designated “webhook” callbacks.\n\nIn this talk we cover the broad principles of Hookbox, then examine a\nfew short examples in depth, including presenceful and moderated chat,\nreal-time graphing, and, of course, a game. The code examples are very\npurposefully brief; the important parts of the talk deal with the\ninteraction model between browser, web framework, and Hookbox --\neverything else follows naturally and easily into place.\n\nThe audience need not be familiar with a particular web framework over\nanother, but they must be proficient with at least one.\n\nThough this talk is aimed at a novice level, we'll also spend some time\ntalking about the more advanced features that Hookbox provides.\n",
  "duration": null,
  "id": 371,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "related_urls": [
    "http://hookbox.org",
    "http://hookbox.org/"
  ],
  "slug": "pycon-2011--hookbox--all-python-web-frameworks--n",
  "speakers": [
    "Michael Carter"
  ],
  "summary": "",
  "tags": [
    "hookbox",
    "pycon",
    "pycon2011",
    "realtime",
    "webapps"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_371___hookbox-all-python-web-frameworks-now-real-time-batteries-included",
  "title": "Hookbox: All Python web-frameworks, now real-time. Batteries Included.",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_371___hookbox-all-python-web-frameworks-now-real-time-batteries-included"
    }
  ]
}
