{
  "alias": "video/366/pycon-2011--api-design--lessons-learned",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Share the lessons learned from a decade of core Python development, what\nworked and what didn't. Look at the development process and thinking\nbehind some of Python's successful APIs and ones that leave something to\nbe desired. Learn general principles for designing a good API for public\nconsumption.\n\nHear the story and principles behind the design of Python's \"in\"\noperator, the development of deques, and the evolution of the set API.\n\nExamine the principles and story behind the development of the named\ntuple API. Learn about unforeseen use cases and a bug that made it to\nproduction.\n\nDiscuss the decimal module's API challenge -- adhering to a published\nstandard. Talk about the Queue module's framework style and how the API\nwas refactored.\n\nDiscuss what we've learned about naming functions and methods. Look at\nthe i-naming convention in itertools, camelcase oddities, the proposed\nItalian name for enumerate, and vaguely named methods like\nassertItemsEqual.\n\nLearn about Guido's ideas on when to add flags to method signatures.\nRecap his thoughts on the problems with the percent formatting operator.\nThen hear Raymond's advice on packaging, hierarchies, and nested name\nspaces.\n\nSee how to use documentation to mitigate API problems using examples\nfrom regular expressions, decimal, tokenize, sorting.\n",
  "duration": null,
  "id": 366,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "slug": "pycon-2011--api-design--lessons-learned",
  "speakers": [
    "Raymond Hettinger"
  ],
  "summary": "API lessons learned from a decade of core Python development.\n",
  "tags": [
    "api",
    "apidesign",
    "cpython",
    "pycon",
    "pycon2011"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_366___api-design-lessons-learned",
  "title": "API Design: Lessons Learned",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_366___api-design-lessons-learned"
    },
    {
      "length": null,
      "type": "mp4",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/366_api-design-lessons-learned.mp4"
    }
  ]
}
