{
  "alias": "video/437/pycon-2011--panel--python-in-schools--teaching-it",
  "category": "PyCon US 2011",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "Panel: Python in Schools: Teaching It and Teaching With It.\n\nPanel with Joel Zachary Miller, Jeffrey Elkner, Vern Ceder, Brian C.\nBrumley, Maria Litvin\n\nEducators discuss Python as both a subject and a tool in primary and\nsecondary (K12) education. Topics addressed include the distinction\nbetween teaching Python and teaching with Python, the benefits of Python\nin K12 and ways to demonstrate the value of Python to administrators.\nPanel includes private and public K12 educators and university faculty\ninvolved in instruction in the K12 setting.\n\nAbstract\n\nZac Miller will act as panel moderator.\n\nPanel will open with a brief introduction of the origins of the panel\nand self introductions of panel members before addressing the following\ntopics:\n\n-  The distinction between teaching Python and teaching with Python.\n\n   -  Teaching Python\n   -  Teaching Math with Python\n\n-  How does Teaching with Python complement Teaching Python?\n\n   -  Do tensions between the two exist?\n\n-  What keeps Python out of schools? What can be done to encourage more\n   schools to teach tools like Python?\n-  What is the biggest benefit teaching Python brings to your school and\n   students? What is the biggest benefit in general, beyond your school?\n-  Can teaching Python help spark creativity in those students who have\n   trouble exercising it?\n\n   -  When teaching Python a creativity divide becomes readily apparent\n      among students. Students with a high level of curiosity and\n      creativity constantly try new things on their own, while other\n      students are focused solely on completing the assignments for\n      grades. How can an instructor handle this?\n   -  What tangible steps can an instructor take to encourage\n      creativity?\n\n-  What does the future look like for Python in K12 education, both at\n   our own schools and in general?\n-  Audience Questions\n\nPanel Biographies:\n\nVern Ceder, Director of Technology, Canterbury School, Ft Wayne,\nIndiana. The Canterbury School has been teaching at least a little\nPython to every single 8th and 9th grader in the school since 2001, as\nwell as offering electives in Python, Java, C, etc. Vern also teaches\nPython through Northwestern's Gifted Learning Links program\n(http://www.ctd.northwestern.edu/gll/) and is the author of The Quick\nPython Book, 2nd ed (http://www.manning.com/ceder)\n\nMaria Litvin. Maria teaches Math and Computer Science at Phillips\nAcademy in Andover, MA, including \"Introduction to Discrete Mathematics\nand Programming in Python.\" She also taught Python to Boston-area high\nschool teachers and to middle schoolers in Google's CAPE program. She's\nco-author of several Computer Science textbooks, most recently\nMathematics for the Digital Age and Programming in Python\n(`www.skylit.com/mathandpython.html <http://www.skylit.c%20om/mathandpython.html>`__).\n\nJeffrey Elkner, teaches computer programming and information technology\nat the Governor's Career and Technical Academy in Arlington, Virginia.\nHe has been teaching with Python since 1999, and is co-author of a free\non-line textbook: How to Think Like a Computer Scientist: Learning with\nPython. He also maintains the Open Book Project\n(`http://openbookproject.net <http://openbookproject.net/>`__), which\ncontains several Python resources. Jeff has attended each PyCon held\nthus far, often bringing students along with him.\n\nBrian Brumley teaches Python (and lots of other stuff) to grades 6-8 at\nPorter-Gaud school in Charleston, SC. Brian is a regular presenter at\nstate and regional conferences on technology and programming in schools.\n\nZac Miller is adjunct instructor in the STEM school at Gainesville State\nCollege and a faculty member at the Da Vinci Academy at South Hall\nMiddle School in Gainesville, Georgia. Zac is currently teaching Python\nprogramming and Python programming for Geographic Information Systems to\nK12 and college- level students.\n",
  "duration": null,
  "id": 437,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2011-03-11",
  "related_urls": [
    "http://openbookproject.net",
    "http://openbookproject.net/",
    "http://www.ctd.northwestern.edu/gll/)",
    "http://www.manning.com/ceder)",
    "http://www.skylit.c%20om/mathandpython.html"
  ],
  "slug": "pycon-2011--panel--python-in-schools--teaching-it",
  "speakers": [],
  "summary": "",
  "tags": [
    "pycon",
    "pycon2011",
    "teaching"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_437___panel-python-in-schools-teaching-it-and-teaching-with-it",
  "title": "Panel: Python in Schools: Teaching It and Teaching With It.",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_437___panel-python-in-schools-teaching-it-and-teaching-with-it"
    },
    {
      "length": null,
      "type": "mp4",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/437_panel-python-in-schools-teaching-it-and-teaching-with-it.mp4"
    }
  ]
}
