{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon US 2011", "speakers": ["Wesley J. Chun"], "title": "Running Django Apps on Google App Engine", "quality_notes": "", "video_flv_length": null, "recorded": "2011-03-11", "video_mp4_length": null, "description": "Running Django Apps on Google App Engine\n\nPresented by wesley chun\n\nIn the past, Django users couldn't run apps unmodified on Google App Engine.\nSome tools helped with integration but required you to change your data\nmodels. Django-nonrel removes this requirement letting you run native Django\napps on App Engine with only config changes if you bear in mind its\nrestrictions like no JOINs. In this talk, we'll discuss Django-nonrel &\nporting App Engine apps to Django.\n\nAbstract\n\nPreviously, Django users could not get their apps to run unmodified on Google\nApp Engine, the cloud application-hosting platform. Older tools like \"the\nHelper\" and \"the Patch\" required a change to the data models as well as\nperhaps integrating additional tools into the application source tree. The\ncreators of the Patch realized how cumbersome this is and created a\nreplacement for all of these older tools.\n\nDjango-nonrel allows users to run pure Django apps on App Engine with only\nminor configuration changes. It basically enables Django's ORM to operate on\ntop of non-relational databases (in addition to preserving its ability to\nsupport standard relational DBs), one of which is Google App Engine's\nDatastore. (MongoDB is another.)\n\nWhat this means that current Django users can now use their existing knowledge\nto write apps for App Engine as long as they keep App Engine restrictions in\nmind, e.g., no JOINs. Projects written in this manner will work without any\nmodifications other than changing the configuration settings. On the other\nside, App Engine developers now have an alternative to the '\"webapp\" framework\nthat comes with its SDK. You can now leverage the power of a full web\nframework like Django and still enjoy the flexibility and scalability of App\nEngine. In this talk, we'll discuss Django-nonrel, and how to port App Engine\napps from webapp to pure Django to run on App Engine using Django-nonrel.\n\n", "video_mp4_url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2011/386_running-django-apps-on-google-app-engine.mp4", "tags": ["django-nonrel", "gae", "googleappengine", "pycon", "pycon2011"], "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0", "related_urls": [], "video_flv_download_only": false, "source_url": "", "video_webm_url": "", "video_ogv_length": 187347634, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "http://a.images.blip.tv/Pycon-PyCon2011RunningDjangoAppsOnGoogleAppEngine570.png", "video_flv_url": null}