{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": 1683, "video_ogv_download_only": false, "category": "Kiwi PyCon 2015", "speakers": ["Fraser Tweedale"], "title": "Integrating Python Apps with Centralised Identity Management Systems", "quality_notes": "", "video_flv_length": null, "recorded": "2015-09-05", "video_mp4_length": null, "description": "Most Python web developers are familiar with authentication and\r\nauthorisation on the open web, but the requirements and technologies\r\nused inside companies and large organisations are different:\r\n\r\n* Identities and groups are probably stored in an external identity\r\nmanagement system's directory rather than in an application's\r\ndatabase tables.\r\n\r\n* Authorisation decisions will be based on group membership and\r\npolicies that are defined outside the application.\r\n\r\n* Users may be expected or required to use a *single sign-on*\r\ntechnology such as Kerberos or SAML to authenticate to\r\napplications.\r\n\r\nThis talk will familiarise the audience with these technologies and\r\ndemonstrate how Python web applications can be integrated with an\r\nidentity management system to meet business requirements while\r\nproviding a positive user experience.  Particular technologies\r\ncovered will include:\r\n\r\n* [FreeIPA](https://www.freeipa.org): an open-source identity\r\nmanagement solution, for defining users, groups and authorisation\r\npolicies\r\n\r\n* [mod_auth_gssapi](https://github.com/modauthgssapi/mod_auth_gssapi) /\r\nmod_auth_kerb: Apache modules for Kerberos authentication\r\n\r\n* [mod_lookup_identity](http://www.adelton.com/apache/mod_lookup_identity/): Apache\r\nmodule to retrieve user information from a directory\r\n\r\nThe talk will conclude with discussion about upcoming Kerberos\r\nfeatures, techniques for dealing with multiple authentication\r\nmethods, and progress in making identity management integration\r\neasier for Python (and in particular, Django) developers.\r\n\r\nPeople developing or deploying Python web applications in business\r\nenvironments or for large open source projects with centralised\r\nidentity management will get the most out of this talk.", "video_mp4_url": "", "tags": [], "copyright_text": "CC BY-SA", "related_urls": [], "video_flv_download_only": false, "source_url": "http://youtu.be/YwWC7DOC3tE", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/YwWC7DOC3tE/hqdefault.jpg", "video_flv_url": null}