{
  "alias": "video/3858/python-in-classrooms",
  "category": "Kiwi PyCon 2015",
  "copyright_text": "CC BY-SA",
  "description": "Python as a language has had great success in being accessible to\naspiring programmers of much younger ages than most contemporary\nlanguages, and the skill set attained from learning to program may\ninclude basic problem solving, mathematics and even literacy. We have\nconducted several workshops with diverse groups of primary school\nchildren in years 4 to 6, attempting to teach elementary programming\nskills using Python. The goals of the workshops were to promote numeracy\nand literacy in Tasmanian schools, where there may be lower rates of\ncompetency in these areas. We wanted to do this through the use of a\nformal, syntax-dependent language, which could have benefits related to\nnatural language skills and literacy. To engage our students we\nconstructed exercises in different topics, that lead to children being\nable to modify a small, simple and modular game using PyGame for Python\n2.7. In some of these exercises, the students created elementary\nprograms to answer simple math questions and participated in group\nexercises to make modifications to one version of the game (adding\ncharacters, dialogue and interactions) before being able to modify their\nown version. In these sessions we found participants to engage well with\nthe source material despite being reasonably advanced, with teaching\nstaff making comparisons between accurate python syntax and\ngrammatically correct English.\n",
  "duration": 1646,
  "id": 3858,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-09-05",
  "slug": "python-in-classrooms",
  "speakers": [
    "Eloise \"Ducky\" Macdonald-Meyer",
    "Martin Henschke"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/cKcL7-IxEwg/hqdefault.jpg",
  "title": "Python in Classrooms",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "http://youtu.be/cKcL7-IxEwg"
    }
  ]
}
