{
  "alias": "video/3073/data-oriented-programming",
  "category": "PyData Berlin 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "Computers have traditionally been thought as tools for performing\ncomputations with numbers. Of course, its name in English has a lot to\ndo with this conception, but in other languages, like the french\n'ordinateur' (which express concepts more like sorting or classifying),\none can clearly see the other side of the coin: computers can also be\nused to extract (usually new) information from data. Storage, reduction,\nclassification, selection, sorting, grouping, among others, are typical\noperations in this 'alternate' goal of computers, and although carrying\nout all these tasks does imply doing a lot of computations, it also\nrequires thinking about the computer as a different entity than the view\noffered by the traditional von Neumann architecture (basically a CPU\nwith memory). In fact, when it is about programming the data handling\nefficiently, the most interesting part of a computer is the so-called\nhierarchical storage, where the different levels of caches in CPUs, the\nRAM memory, the SSD layers (there are several in the market already),\nthe mechanical disks and finally, the network, are pretty much more\nimportant than the ALUs (arithmetic and logical units) in CPUs. In data\nhandling, techniques like data deduplication and compression become\ncritical when speaking about dealing with extremely large datasets.\nMoreover, distributed environments are useful mainly because of its\nincreased storage capacities and I/O bandwidth, rather than for their\naggregated computing throughput. During my talk I will describe several\nprogramming paradigms that should be taken in account when programming\ndata oriented applications and that are usually different than those\nrequired for achieving pure computational throughput. But specially, and\nin a surprising turnaround, how the amazing amount of computational\npower in modern CPUs can also be useful for data handling as well.\n",
  "duration": null,
  "id": 3073,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-26",
  "slug": "data-oriented-programming",
  "speakers": [
    "Francesc Alted"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/KhJSg_rSzj8/hqdefault.jpg",
  "title": "Data Oriented Programming",
  "videos": [
    {
      "type": "mp4",
      "url": "http://video.ep14.c3voc.de/20260.mp4"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KhJSg_rSzj8"
    }
  ]
}
