{
  "alias": "video/3077/quantified-self-analyzing-the-big-data-of-our-da",
  "category": "PyData Berlin 2014",
  "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
  "description": "Applications for self tracking that collect, analyze, or publish\npersonal and medical data are getting more popular. This includes either\na broad variety of medical and healthcare apps in the fields of\ntelemedicine, remote care, treatment, or interaction with patients, and\na huge increasing number of self tracking apps that aims to acquire data\nform from people’s daily life. The Quantified Self movement goes far\nbeyond collecting or generating medical data. It aims in gathering data\nof all kinds of activities, habits, or relations that could help to\nunderstand and improve one’s behavior, health, or well-being. Both,\nhealth apps as well as Quantified Self apps use either just the\nsmartphone as data source (e.g., questionnaires, manual data input,\nsmartphone sensors) or external devices and sensors such as ‘classical’\nmedical devices (e.g,. blood pressure meters) or wearable devices (e.g.,\nwristbands or eye glasses). The data can be used to get insights into\nthe medical condition or one’s personal life and behavior. This talk\nwill provide an overview of the various data sources and data formats\nthat are relevant for self tracking as well as strategies and examples\nfor analyzing that data with Python. The talk will cover:\n\nAccessing local and distributed sources for the heterogeneous Quantified\nSelf data. That includes local data files generated by smartphone apps\nand web applications as well as data stored on cloud resources via APIs\n(e.g., data that is stored by vendors of self tracking hardware or data\nof social media channels, weather data, traffic data etc.)\n\nHomogenizing the data. Especially, covering typical problems of\nheterogeneous Quantified Self data, such as missing data or different\nand non-standard data formatting.\n\nAnalyzing and visualizing the data. Depending on the questions one has,\nthe data can be analyzed with statistical methods or correlations. For\nexample, to get insight into one's personal physical activities, steps\ndata form activity trackers can be correlated to location data and\nweather information. The talk covers how to conduct this and other data\nanalysis tasks with tools such as pandas and how to visualize the\nresults.\n\nThe examples in this talk will be shown as interactive IPython sessions.\n",
  "duration": null,
  "id": 3077,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2014-07-26",
  "slug": "quantified-self-analyzing-the-big-data-of-our-da",
  "speakers": [
    "Andreas Schreiber"
  ],
  "summary": "",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/tSyQ36Zbkc0/hqdefault.jpg",
  "title": "Quantified Self: Analyzing the Big Data of our Daily Life",
  "videos": [
    {
      "type": "mp4",
      "url": "http://video.ep14.c3voc.de/20231.mp4"
    },
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tSyQ36Zbkc0"
    }
  ]
}
