{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": 3400, "video_ogv_download_only": false, "category": "PyCon Italia 2015", "speakers": ["Maurizio Branca"], "title": "Automatizzare i deploy di applicazioni Django con Ansible", "quality_notes": "", "video_flv_length": null, "recorded": "2015-05-30", "video_mp4_length": null, "description": "Il talk descrive come con Ansible sia possibile effettuare deploy frequenti ed affidabili di applicazioni web basate su Django.\nIl deploy di un applicazione web richiede di effettuare una serie di operazioni nella corretta sequenza. Effettuando le operazioni in modo manuale la probabilità di commettere errori aumenta all’aumentare di progetti portati avanti in parallelo o al verificarsi di situazioni di pressione e stanchezza.\nAnche in assenza di errori ci si può trovare a spendere il proprio tempo poco efficacemente ed in modo tedioso, ripetetendo più e più volte sempre delle semplici operazioni manuali.\nViene descritto cosa sia Ansible, quali sono i suoi elementi/componenti costitutivi (Playbook, Play, Inventory, Task, Module). Viene sottolineata la necessità di uno standard di progetto e di un workflow uniforme per operarvi in modo efficace. Per rendere accessibili le operazioni di deploy anche ai membri non specializzati del team viene proposto l’utilizzo di un chat bot.\nL’uso di Ansible permette di automatizzare operazioni altrimenti manuali, ripetitive ed error prone. In particolare il processo di deploy rimane ben descritto e sempre aggionato come Play di Ansible e non affidato alla mente di operatori o documentazione a rischio obsolescenza.\n", "video_mp4_url": null, "tags": [], "copyright_text": "", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=yRaL3IkBwNs", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "Italian", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/yRaL3IkBwNs/maxresdefault.jpg", "video_flv_url": null}