{
  "id": 3588,
  "category": "PyCon Italia 2015",
  "slug": "automatizzare-i-deploy-di-applicazioni-django-con",
  "title": "Automatizzare i deploy di applicazioni Django con Ansible",
  "alias": "video/3588/automatizzare-i-deploy-di-applicazioni-django-con",
  "summary": "",
  "description": "Il talk descrive come con Ansible sia possibile effettuare deploy\nfrequenti ed affidabili di applicazioni web basate su Django. Il deploy\ndi un applicazione web richiede di effettuare una serie di operazioni\nnella corretta sequenza. Effettuando le operazioni in modo manuale la\nprobabilità di commettere errori aumenta all’aumentare di progetti\nportati avanti in parallelo o al verificarsi di situazioni di pressione\ne stanchezza. Anche in assenza di errori ci si può trovare a spendere il\nproprio tempo poco efficacemente ed in modo tedioso, ripetetendo più e\npiù volte sempre delle semplici operazioni manuali. Viene descritto cosa\nsia Ansible, quali sono i suoi elementi/componenti costitutivi\n(Playbook, Play, Inventory, Task, Module). Viene sottolineata la\nnecessità di uno standard di progetto e di un workflow uniforme per\noperarvi in modo efficace. Per rendere accessibili le operazioni di\ndeploy anche ai membri non specializzati del team viene proposto\nl’utilizzo di un chat bot. L’uso di Ansible permette di automatizzare\noperazioni altrimenti manuali, ripetitive ed error prone. In particolare\nil processo di deploy rimane ben descritto e sempre aggionato come Play\ndi Ansible e non affidato alla mente di operatori o documentazione a\nrischio obsolescenza.\n",
  "quality_notes": "",
  "language": "Italian",
  "copyright_text": "",
  "thumbnail_url": "https://i.ytimg.com/vi/yRaL3IkBwNs/maxresdefault.jpg",
  "duration": 3400,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=yRaL3IkBwNs",
      "type": "youtube",
      "length": 0
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=yRaL3IkBwNs",
  "tags": [],
  "speakers": [
    "Maurizio Branca"
  ],
  "recorded": "2015-05-30"
}