{
  "id": 3579,
  "category": "PyCon Italia 2015",
  "slug": "baking-beaker-perche-sessioni-e-caching-possono",
  "title": "Baking Beaker perchè sessioni e caching possono ancora convivere",
  "summary": "",
  "description": "Beaker è probabilmente la più diffusa soluzione cross-framework per la\ngestione delle sessioni e della cache nell’ambito web. Nato nel 2005\ndagli autori di SQLAlchemy e Pylons è stato sempre mantenuto al fianco\ndel framework Pylons. Dopo la fine di Pylons a favore di Pyramid il suo\nfuturo è diventato incerto e, per quanto sia ancora oggi molto usato al\nfianco di Bottle, Flask, TurboGears e spesso anche Pyramid, alcuni dei\nlimiti dovuti all’incompatibilità con Python3 ed alcune scelte\narchitetturali hanno portato gli utenti ad avvicinarsi a soluzioni\nalternative. Nel 2015 la manutenzione di Beaker è stata passata da Ben\nBangert al team di TurboGears che ha riscritto tutta la compatibilità\ncon Python3 rendendo Beaker un progetto nativo Python3 e risolto alcuni\ndei bugs di più lunga data. Il talk mira a mostrare l’esperienza e le\nproblematiche venute alla luce nei quasi 10 anni di vita del framework\ned illustrare come si intende ridare forza al progetto risolvendo alcuni\ndei limiti architetturali pricinpali e quali sono state le scelte\n“sbagliate”. Lo scopo è diffondere quali possono essere le problematiche\ne le false supposizioni che esistono nell’ambito del caching e della\ngestione delle sessioni facendo tesoro delle esperienze fatte dal\nprogetto Beaker nel corso della sua vita.\n",
  "quality_notes": "",
  "language": "Italian",
  "copyright_text": "",
  "thumbnail_url": "https://i.ytimg.com/vi/xi2y-4Uxwek/maxresdefault.jpg",
  "duration": 2131,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=xi2y-4Uxwek",
      "type": "youtube",
      "length": 0
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=xi2y-4Uxwek",
  "tags": [],
  "speakers": [
    "Alessandro Molina"
  ],
  "recorded": "2015-05-30"
}