{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": 2131, "video_ogv_download_only": false, "category": "PyCon Italia 2015", "speakers": ["Alessandro Molina"], "title": "Baking Beaker perchè sessioni e caching possono ancora convivere", "quality_notes": "", "video_flv_length": null, "recorded": "2015-05-30", "video_mp4_length": null, "description": "Beaker è probabilmente la più diffusa soluzione cross-framework per la gestione delle sessioni e della cache nell’ambito web.\nNato nel 2005 dagli autori di SQLAlchemy e Pylons è stato sempre mantenuto al fianco del framework Pylons. Dopo la fine di Pylons a favore di Pyramid il suo futuro è diventato incerto e, per quanto sia ancora oggi molto usato al fianco di Bottle, Flask, TurboGears e spesso anche Pyramid, alcuni dei limiti dovuti all’incompatibilità con Python3 ed alcune scelte architetturali hanno portato gli utenti ad avvicinarsi a soluzioni alternative.\nNel 2015 la manutenzione di Beaker è stata passata da Ben Bangert al team di TurboGears che ha riscritto tutta la compatibilità con Python3 rendendo Beaker un progetto nativo Python3 e risolto alcuni dei bugs di più lunga data.\nIl talk mira a mostrare l’esperienza e le problematiche venute alla luce nei quasi 10 anni di vita del framework ed illustrare come si intende ridare forza al progetto risolvendo alcuni dei limiti architetturali pricinpali e quali sono state le scelte “sbagliate”.\nLo scopo è diffondere quali possono essere le problematiche e le false supposizioni che esistono nell’ambito del caching e della gestione delle sessioni facendo tesoro delle esperienze fatte dal progetto Beaker nel corso della sua vita.\n", "video_mp4_url": null, "tags": [], "copyright_text": "", "related_urls": [], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=xi2y-4Uxwek", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "Italian", "video_webm_length": null, "summary": "", "thumbnail_url": "https://i.ytimg.com/vi/xi2y-4Uxwek/maxresdefault.jpg", "video_flv_url": null}