{
  "id": 3619, 
  "category": "PyCon Italia 2015", 
  "slug": "controllo-di-un-dispositivo-per-la-riabilitazione", 
  "title": "Controllo di un dispositivo per la riabilitazione dell’arto superiore", 
  "summary": "", 
  "description": "Le moderne pratiche di neuroriabilitazione possono beneficiare di dispositivi robotici, progettati e realizzati per assistere il paziente e il personale medico durante la fase di recupero funzionale e cognitivo. Essi possono alleviare lo sforzo fisico del fisioterapista durante la terapia, rendere i pazienti parzialmente indipendenti durante gli esercizi, ottimizzare la disponibilità dei terapisti durante sessioni parallele di riabilitazione e rendere oggettiva la valutazione delle capacità motorie. Alcune cliniche hanno la possibilità di acquistare dispositivi costosi e complessi, ma questi stessi aspetti li rendono non adatti ad essere installati nella maggior parte dei centri di riabilitazione e presso le case dei pazienti. Per questi motivi è stato realizzato LINarm, un dispositivo robotico a basso costo dedicato alla riabilitazione dell’arto superiore. Esso sfrutta la tecnica FDM di stampa 3D per la realizzazione di alcuni componenti meccanici, un peculiare schema meccanico a rigidezza variabile ed un microcontrollore Arduino interfacciato ad un PC Linux-based per una soluzione di controllo flessibile ed economica.\nIl talk sarà relativo alla descrizione dell’architettura di controllo sviluppata, focalizzandosi sull’interfaccia utente realizzata in Python. Essa integra un layer per la comunicazione bidirezionale con la scheda Arduino, funzionalità di plot real-time 2D e 3D per il monitoraggio del dispositivo e per il feedback visivo, comandi grafici per un controllo interattivo e la possibilità di programmare esercizi di training riaiblitativo attraverso script Python. \nI requisiti richiesti sono un minimo background di conoscenza relativa al linguaggio Python ed alla piattaforma Arduino, oltre ad una discreta passione per i dispositivi elettromeccanici.\n", 
  "quality_notes": "", 
  "language": "Italian", 
  "copyright_text": "", 
  "thumbnail_url": "https://i.ytimg.com/vi/_rJ9M078yJs/maxresdefault.jpg", 
  "duration": 1689, 
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=_rJ9M078yJs", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=_rJ9M078yJs", 
  "tags": [], 
  "speakers": [
    "Matteo Malosio"
  ], 
  "recorded": "2015-05-29"
}