{
  "id": 3626, 
  "category": "PyCon Italia 2015", 
  "slug": "v-eras-14-a-virtual-reality-mars-exploration-mis", 
  "title": "V-ERAS-14: A Virtual Reality Mars Exploration Mission (in English)", 
  "summary": "This presentation reports on the outcomes of the V-ERAS-14 Mission while focusing on the integral role played by the Python language in supporting the project infrastructure.", 
  "description": "The European MaRs Analogue Station for Advanced Technologies Integration (ERAS) is a program spearheaded by the Italian Mars Society (IMS), whose main goal is to provide an effective test bed for field operation studies in preparation for human missions to Mars.\nPreliminarily to its construction, IMS has started the development of an immersive Virtual Reality (VR) simulation of the ERAS Station (V-ERAS).\nThe initial V-ERAS setup has been based on the following key elements:\n - ERAS Station simulation using an appropriate game engine supporting a virtual reality headset\n - Full body tracking\n - Integration of an omnidirectional treadmill\n - Support for the crew members’ health monitoring\n - Multiplayer Support\nSince the beginning, Python has been one of the key technologies that allowed us to develop the system, also thanks to a team of international students that participated with the IMS to Google Summer of Code.\nIn December 2014, four virtual astronauts have conducted a sustained program of immersive virtual reality simulations during the first week-long V-ERAS Mission (V-ERAS-14).\nThe presentation will report on the outcomes of the V-ERAS-14 Mission while fusing on the \ntransversal role played by the Python language in supporting the project infrastructure.\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "", 
  "thumbnail_url": "https://i.ytimg.com/vi/I5e__EoRpnM/maxresdefault.jpg", 
  "duration": 2656, 
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=I5e__EoRpnM", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "https://www.youtube.com/watch?v=I5e__EoRpnM", 
  "tags": [], 
  "speakers": [
    "Ezio Melotti", 
    "Franco Carbognani"
  ], 
  "recorded": "2015-05-29"
}