{
  "description": "Carina C. Zona\n\nhttps://2017.northbaypython.org\n\n2FA Mind\r\n\r\n2-Factor Authentication (2FA) empowers people to better protect their online accounts. With daily revelations of mass data breaches, habitual use of 2FA has become vital for anyone whose accounts have access to private or confidential information.\r\n\r\nNevertheless, the vast majority of ordinary people still aren't using it! There are myths that 2FA is difficult to set up and use, or is only needed by high profile people who are personally targeted. Often users hold back because they perceive 2FA as difficult, complicated, or stressful. Already put off by ever-more-convoluted rules for picking a password, many people expect setting up 2FA to be even more daunting.\r\n\r\nThe great news is, we can fix this! Newer 2FA methods are making logging in quicker, simpler, and far more secure for users. Meanwhile, 2FA libraries have become widely available in Python and other major programming languages.\r\n\r\nTo kick off wider adoption of 2FA, we need a fresh mindset about it. Because in fact there's little that’s novel about 2FA. Each of us already has had years of everyday experience with the core concepts and mindset that are 2FA's foundation.\r\n\r\nTogether, we can build momentum for broad access to the security wins of 2FA. In this session, you'll discover the simple concepts at the heart of 2FA. You’ll learn about some common 2FA implementation approaches, and you’ll come away with a list of actions any of us—no matter what skill level—can take right now to help make the world a safer place for at least one vulnerable person.\n\nAbout North Bay Python\r\n\r\nA single-track conference north of the Golden Gate, focused on community, collaboration, and all things Python.\r\n\r\nNorth Bay Python is a two-day, single-track Python conference held at the Mystic Theatre in Historic Downtown Petaluma, California, over the weekend of December 2 & 3, 2017.\r\n\r\nWe're a nonprofit conference for professionals, enthusiasts and students alike. We're focused on inclusion, accessibility, diversity, and affordability. Most importantly, we're planning a great lineup of talks from all over the Python ecosystem, with plenty of time to meet new people and develop new ideas.\r\n\r\nOur venue, the Mystic Theatre in Downtown Petaluma, is a beautiful example of an early 1900s Vaudeville theatre. You can find over 50 different food and drink options a short walk away, and the nearest hotel is only a block away.\n\nA Python conference north of the Golden Gate\r\n\r\n\r\nNorth Bay Python is a single-track conference with a carefully curated set of talks representing the diverse Python community and their different areas of interest.\r\n\r\nIf a topic is less to your interest, or you've met some people you really want to sit down and chat with, we'll have plenty of areas away from the main theatre to catch up and chat.\r\n\r\nOur goal is to keep prices as low as possible. That means we won't be catering lunch. Instead, you can look forward to extra-long lunch breaks you can use to explore all of the great food options around the venue.",
  "recorded": "2017-12-03",
  "speakers": ["Carina C Zona"],
  "thumbnail_url": "https://i.ytimg.com/vi/WHyzM6pYmyQ/hqdefault.jpg",
  "title": "2FA Mind",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WHyzM6pYmyQ"
    }
  ]
}
