{
  "description": "Accessibility is a huge topic that is often acknowledged as important...by the people who already care about it. This talk is meant to help the entire audience start thinking about accessibility and realize how easy it is to at least put some accessibility into a site (or avoid adding blatantly inaccessible content).\n\nAccording to the U.S. Census Bureau, around 19% of Americans have a disability, which is a large potential audience for any site. Many companies also fall under accessibility laws they might not even be aware cover their products, with lawsuits becoming more prevalent in recent years, and showing a good faith effort to improve your products’ accessibility can help keep your company out of hot water. Accessible web development also tends to lead to better UX and a happier user base. And, another plus: It will save devs time and frustration when they’re working with the code, since good HTML is enforced.\n\nThis talk will start with a broad introduction to accessibility, how to break different concerns down into categories for consideration, and touch on the US laws and recent legal outcomes around accessibility. The second part will go through examples of good and bad accessibility and what to look out for, as well as ways to improve accessibility (including \"easy wins\" that they could implement quickly to drastically improve their sites). The final section will include resources for finding accessibility standards and also browser extensions and the like for people to check on their own.\n\nThe audience will be expected to have working knowledge of the internet, webpages, and using webpages.",
  "recorded": "2017-12-03",
  "related_urls": [
    {
      "label": "Event web",
      "url": "https://2017.northbaypython.org/schedule/presentation/3/"
    },
    {
      "label": "Slides",
      "url": "https://docs.google.com/presentation/d/1k8vyf2QKYhvbpoqUnRTiE70NPm1ubEG5JPlgkKRCFec/present#slide=id.g24b4da9203_0_68"
    }
  ],
  "speakers": [
    "Lindsey Dragun"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ys7cy7njkvA/hqdefault.jpg",
  "title": "Accessibility Matters: Creating a Better Web",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ys7cy7njkvA"
    }
  ]
}
