{
  "description": "Henry Chen\n\nhttps://2017.northbaypython.org/schedule/presentation/13/\n\n# Background\r\n\r\n* Why async? CPU bound vs IO bound processes.\r\n* Concurrency is not the same as multithreading\r\n* Single threaded concurrency\r\n\r\n# Generators - already in Python 2 !\r\n\r\n* Generator - a function you can pause!\r\n* How to implement async with generators and event loop in Python 2\r\n* Real working code - a Python version of the JavaScript setTimeout function\r\n\r\n# What is new in Python 3 ?\r\n\r\n* async/await - really generators in disguise!\r\n* asyncio library - ready made event loop and IO functions\r\n* new syntax and new library are independent - you can mix and match old and new!\n\nAbout North Bay Python\r\n\r\nA single-track conference north of the Golden Gate, focused on community, collaboration, and all things Python.\r\n\r\nNorth Bay Python is a two-day, single-track Python conference held at the Mystic Theatre in Historic Downtown Petaluma, California, over the weekend of December 2 & 3, 2017.\r\n\r\nWe're a nonprofit conference for professionals, enthusiasts and students alike. We're focused on inclusion, accessibility, diversity, and affordability. Most importantly, we're planning a great lineup of talks from all over the Python ecosystem, with plenty of time to meet new people and develop new ideas.\r\n\r\nOur venue, the Mystic Theatre in Downtown Petaluma, is a beautiful example of an early 1900s Vaudeville theatre. You can find over 50 different food and drink options a short walk away, and the nearest hotel is only a block away.\n\nA Python conference north of the Golden Gate\r\n\r\n\r\nNorth Bay Python is a single-track conference with a carefully curated set of talks representing the diverse Python community and their different areas of interest.\r\n\r\nIf a topic is less to your interest, or you've met some people you really want to sit down and chat with, we'll have plenty of areas away from the main theatre to catch up and chat.\r\n\r\nOur goal is to keep prices as low as possible. That means we won't be catering lunch. Instead, you can look forward to extra-long lunch breaks you can use to explore all of the great food options around the venue.",
  "recorded": "2017-12-03",
  "speakers": ["Henry Chen"],
  "thumbnail_url": "https://i.ytimg.com/vi/jJzHMu2H6cw/hqdefault.jpg",
  "title": "Async for the Python 2 Programmer",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jJzHMu2H6cw"
    }
  ]
}
