{
  "description": "Christopher Swenson\n\nhttps://2017.northbaypython.org/schedule/presentation/10/\n\nThe oldest known Colossal Cave source code we have is from 1977 and written for the then 11-year-old PDP-10 in a variant of FORTRAN IV that is now completely defunct and was specific to the PDP-10.\r\n\r\nWe'll talk briefly about a history of video games, FORTRAN, and the PDP machines that led to this, and explain how the quirks of this machine were baked into its variant of FORTRAN IV. We'll look at some ancient PDP manuals to discover the secrets you need to know to read this amazing source code.\r\n\r\nWe'll delve into how one goes about writing a simple interpreter in Python to run this FORTRAN IV code as-is: translating strings, implementing its odd arithmetic and conditional statements, reading in data from our \"tape\" drive, how we get input and send output using our \"teletype\".\r\n\r\nIf you want a demo of this game playing right now, it is running on Heroku and accessible via SMS. Just text anything to +1 (669) 238-3683 (\"669 ADVENT3\") to start a game. Send RESET to restart the game. Case doesn't matter when sending commands. It identifies you based on your phone number and will remember your game indefinitely. (We'll also talk about how we achieved this in Heroku.)\n\nAbout North Bay Python\r\n\r\nA single-track conference north of the Golden Gate, focused on community, collaboration, and all things Python.\r\n\r\nNorth Bay Python is a two-day, single-track Python conference held at the Mystic Theatre in Historic Downtown Petaluma, California, over the weekend of December 2 & 3, 2017.\r\n\r\nWe're a nonprofit conference for professionals, enthusiasts and students alike. We're focused on inclusion, accessibility, diversity, and affordability. Most importantly, we're planning a great lineup of talks from all over the Python ecosystem, with plenty of time to meet new people and develop new ideas.\r\n\r\nOur venue, the Mystic Theatre in Downtown Petaluma, is a beautiful example of an early 1900s Vaudeville theatre. You can find over 50 different food and drink options a short walk away, and the nearest hotel is only a block away.\n\nA Python conference north of the Golden Gate\r\n\r\n\r\nNorth Bay Python is a single-track conference with a carefully curated set of talks representing the diverse Python community and their different areas of interest.\r\n\r\nIf a topic is less to your interest, or you've met some people you really want to sit down and chat with, we'll have plenty of areas away from the main theatre to catch up and chat.\r\n\r\nOur goal is to keep prices as low as possible. That means we won't be catering lunch. Instead, you can look forward to extra-long lunch breaks you can use to explore all of the great food options around the venue.",
  "recorded": "2017-12-02",
  "speakers": ["Christopher Swenson"],
  "thumbnail_url": "https://i.ytimg.com/vi/PbdpW-yAeQo/hqdefault.jpg",
  "title": "Colossal Cave Adventure in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PbdpW-yAeQo"
    }
  ]
}
