{
  "description": "Kelsey Karin Hawley\n\nhttps://2017.northbaypython.org/schedule/presentation/9/\n\nThis talk will cover 3 different learning styles that I have experienced and observed for where to go after finishing a beginner tutorial (like CodeAcademy).\r\n\r\n**Learning through practice or exercise based learning.**  This section would focus on websites useful for building up skills and comfort in a language (resources like HackerRank, Project Euler, etc).  It would also provide resources for getting feedback on code, like exercism.io\r\n\r\n**Learning through others or vicariously.** This section would focus on tips for finding open source projects that can be read through.  This would discuss reading through another's code, how to look up concepts or libraries that are new, and how to work on existing bugs.  This might also give tips on breaking another's code to better understand how it works and how it could be improved.\r\n\r\n**Project based Learning.** This section would focus on tips for managing a project based approach - not biting off more than you can chew, breaking an idea down into managable pieces, and not getting discouraged.  This would also cover tools like Stack Overflow and language communities that can be used when a person gets stuck on a bug or needs ideas on how to solve a problem.\r\n\r\n**Get Connected.**  This section would discuss various groups and communities (PyLadies, meetups, etc) that can be used for networking and growing knowledge.  I will also discuss finding a mentor, either at your current place of work, or from within a community group.  As a mentor, I'll talk about things to look for in a mentor and what a mentee can hope to gain from that relationship.\r\n\r\nTo summarize, I'll reiterate the three different learning styles while reinforcing there is no right or wrong way to brige the gap between Hello World and building a web app.  I'll also summarize the various resources along the way (HackerRank, PyLadies, mentorship).\n\nAbout North Bay Python\r\n\r\nA single-track conference north of the Golden Gate, focused on community, collaboration, and all things Python.\r\n\r\nNorth Bay Python is a two-day, single-track Python conference held at the Mystic Theatre in Historic Downtown Petaluma, California, over the weekend of December 2 & 3, 2017.\r\n\r\nWe're a nonprofit conference for professionals, enthusiasts and students alike. We're focused on inclusion, accessibility, diversity, and affordability. Most importantly, we're planning a great lineup of talks from all over the Python ecosystem, with plenty of time to meet new people and develop new ideas.\r\n\r\nOur venue, the Mystic Theatre in Downtown Petaluma, is a beautiful example of an early 1900s Vaudeville theatre. You can find over 50 different food and drink options a short walk away, and the nearest hotel is only a block away.\n\nA Python conference north of the Golden Gate\r\n\r\n\r\nNorth Bay Python is a single-track conference with a carefully curated set of talks representing the diverse Python community and their different areas of interest.\r\n\r\nIf a topic is less to your interest, or you've met some people you really want to sit down and chat with, we'll have plenty of areas away from the main theatre to catch up and chat.\r\n\r\nOur goal is to keep prices as low as possible. That means we won't be catering lunch. Instead, you can look forward to extra-long lunch breaks you can use to explore all of the great food options around the venue.",
  "recorded": "2017-12-02",
  "speakers": ["Kelsey Karin Hawley"],
  "thumbnail_url": "https://i.ytimg.com/vi/5unbeTDbjuE/hqdefault.jpg",
  "title": "I Finished the Beginner Tutorial, Now What?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5unbeTDbjuE"
    }
  ]
}
