{
  "description": "Ernest W. Durbin III\n\nhttps://2017.northbaypython.org/schedule/presentation/5/\n\nFrom it's origins in the early days as a metadata server to the current trove of hosted packages, PyPI has grown into a critical part of the Python Communities Infrastructure.\r\n\r\nOriginally conceived and implemented in 2002 as a simple set of metadata, the codebase that backs PyPI has been pushed well beyond it's limits. While some may call it \"legacy\" software, I choose to view it like one may view a classic car that still sees it's time on the road.\r\n\r\nThis talk will present some of the challenges common to keeping a Vintage Car on the road as well as their counter parts when dealing with Vintage Software and take a look at the approaches that have worked well to keep PyPI up and running as a full rewrite is underway.\r\n\r\nAlso covered will be an overview of the history of PyPI as a whole, as well as what the future holds and how you (yes you!) can contribute.\r\n\r\nTechnical Topics covered include:\r\n\r\n- External caching, Content Delivery Networks\r\n- Internal caching, to speed up common or repetitive requests which just can't be cached in the CDN\r\n- Metrics, Metrics, Metrics! Not just for monitoring! Keep track of what features just aren't worth supporting any longer or what methods are prime for optimization\r\n- Dealing with issues related to scaling even when major refactors or changes aren't feasible.\r\n- Increasing reliability\r\n\r\nThe desired outcome for attendees of this talk is a sense of how to approach a Vintage codebase that must remain up and running even as it's predecessor may be in progress. Big rewrites can take time! Don't feel defeated sustaining an old project, it is what your users need!\r\n\r\nNovice attendees may find the history and high level concepts interesting, but Intermediate attendees should get the most out of this talk. Specifically some of the technical bits will make the most sense and be most applicable if you've ever worked on a medium to large production web service.\n\nAbout North Bay Python\r\n\r\nA single-track conference north of the Golden Gate, focused on community, collaboration, and all things Python.\r\n\r\nNorth Bay Python is a two-day, single-track Python conference held at the Mystic Theatre in Historic Downtown Petaluma, California, over the weekend of December 2 & 3, 2017.\r\n\r\nWe're a nonprofit conference for professionals, enthusiasts and students alike. We're focused on inclusion, accessibility, diversity, and affordability. Most importantly, we're planning a great lineup of talks from all over the Python ecosystem, with plenty of time to meet new people and develop new ideas.\r\n\r\nOur venue, the Mystic Theatre in Downtown Petaluma, is a beautiful example of an early 1900s Vaudeville theatre. You can find over 50 different food and drink options a short walk away, and the nearest hotel is only a block away.\n\nA Python conference north of the Golden Gate\r\n\r\n\r\nNorth Bay Python is a single-track conference with a carefully curated set of talks representing the diverse Python community and their different areas of interest.\r\n\r\nIf a topic is less to your interest, or you've met some people you really want to sit down and chat with, we'll have plenty of areas away from the main theatre to catch up and chat.\r\n\r\nOur goal is to keep prices as low as possible. That means we won't be catering lunch. Instead, you can look forward to extra-long lunch breaks you can use to explore all of the great food options around the venue.",
  "recorded": "2017-12-03",
  "speakers": ["Ernest W. Durbin III"],
  "thumbnail_url": "https://i.ytimg.com/vi/xyPd4WOR_ng/hqdefault.jpg",
  "title": "Running Vintage Software: PyPI's Aging Codebase.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xyPd4WOR_ng"
    }
  ]
}
