{
  "abstract": "Are you a newbie in NLP? Have you recently been intrigued by the hype of deep learning? Do you want to get your hands dirty? This talk is for you! I will teach you the basic ideas of NLP, basic building blocks of deep learning, and how to assemble them into a piece of workable code in Python.",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Natural Language Processing (NLP) is a challenging subfield of Artificial Intelligence, in which human's ability to understand and produce language is imitated. With the advent of deep learning in mid-2000s, many NLP tasks previously done in traditional statistical methods have gained significant accuracy improvement, thanks to its powerful feature extraction.\nThis talk will go into the basic ideas of natural language processing, some building blocks of neural networks for deep learning, and how to assemble them into a piece of runnable code for various NLP tasks. PyTorch will be used as the main gear, because we can easily cope with both static and dynamic network architectures while maintaining the code readability. The speaker kindly assumes the audience to have some knowledge in Python (intermediate: especially classes and objects), university calculus (basic), and linguistics (very basic).\n\n\n\n--------\n\nPrachya Boonkwan is a computational linguist and a computer scientist with 16-years experience in natural language processing using Python. He received B.Eng. (honors) and M.Eng. degrees in Computer Engineering from Kasetsart University in 2002 and 2005, respectively. He received a Ph.D. degree in Informatics (specializing in natural language processing) from the University of Edinburgh, UK, in 2014. Since 2005, he has been working as a researcher for Language and Semantic Technology Lab at NECTEC, Thailand. His topics of interest include: grammar induction, statistical parsing, statistical machine translation, natural language processing, machine learning, and formal syntax.",
  "duration": 2742,
  "language": "eng",
  "recorded": "2018-06-16",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://th.pycon.org/en/schedule/"
    }
  ],
  "speakers": [
    "Prachya Boonkwan"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/H7LQmrw7GhE/maxresdefault.jpg",
  "title": "A Beginner's Guide to Deep Natural Language Processing with PyTorch",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=H7LQmrw7GhE"
    }
  ]
}
