{
  "abstract": "Jupyter notebooks are great to prototype ideas, but aren’t shippable product. Learn how a JS developer with limited python experience solved this problem. See how to use python to work closely with product/UI designers, shape a reproducible product workflow and solve a user problem.",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Jupyter notebooks are great to prototype ideas, but aren’t shippable product (to real users). To bridge the gap between this (a notebook) and a successful product, you must own the user experience and work with product design and feature planning.\nSometimes you must go on an adventure back to being a junior, get some new tech off the shelf and work your way back to familiar territory. Learn how a JS developer with limited python experience worked through tooling and workflow planning choices to iterate to victory.\nSee how you can use python to work closely with product/UI designers to shape a reproducible product workflow and solve a user problem.\nIdeal audience: People with any level of python experience who want to see how it can fit into the wider picture of product development in the trenches of a startup.\n\n\n\n--------\n\nI'm the Chief Javascript Cowboy (aka Engineering Lead for Frontend) at Stitched, a startup combining graph theory, natural language processing and machine learning to improve understanding and allocation of people and projects in large companies. We're based in London, UK, but I'm from New Zealand!",
  "duration": 1592,
  "language": "eng",
  "recorded": "2018-06-17",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://th.pycon.org/en/schedule/"
    }
  ],
  "speakers": [
    "Richard Washer"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/cBP-oP0Xjzs/maxresdefault.jpg",
  "title": "A JS developer tries python, escapes from Jupyter to build a product",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cBP-oP0Xjzs"
    }
  ]
}
