{
  "abstract": "In this session, I will talk about how we can use Flask with Flask RESTplus to create robust, performant, well-documented and user-friendly APIs. I have used this technology on numerous projects during a continuous learning span of 3 years, and I will be sharing all I have learned during this talk.",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "I have been using Flask with Flask RESTplus to create REST API based backend projects for around 3 years now. For those who don't know, Flask RESTplus is an amazing library for REST API development with features like automatic live documentation, input payload validation, neat code organization, automatic response marshaling and a lot of extensibility. You can easily extend it to include other features like response pagination, ETag caching, rate limiting, custom authentication and authorization system and basically anything else you can imagine. In this talk, I will share my hard gained knowledge with code snippets on how to quickly get started and do all these amazing things in Flask RESTplus.\n\n\n\n--------\n\nAvi is a full-stack web engineer at Toptal with four years of professional experience. He has worked with most of the popular stack used on the web today including Python, JavaScript, and Go. He is also a multiple-time Google Summer of Code participant, where he mentors budding developers to contribute to open-source projects. These days he is working on his Blockchain based social media startup called HapRamp which aims to revolutionalize the social media ecosystem in India.",
  "duration": 2013,
  "language": "eng",
  "recorded": "2018-06-16",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://th.pycon.org/en/schedule/"
    }
  ],
  "speakers": [
    "Avi Aryan"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/hftiDvdCh4c/maxresdefault.jpg",
  "title": "Creating amazing APIs in Flask with Flask RESTplus",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hftiDvdCh4c"
    }
  ]
}
