{
  "abstract": "This talk discusses Multi-Agent Systems with Blockchain Energy Trading. Python is selected to be the language for the IoT integration and backend, whereas Hyperledger and React Native are chosen to be the Blockchain platform and mobile frontend respectively. Real-life demo is also demonstrated.",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Enabling Blockchain Energy Trading among Smart Buildings through the Use of Multi-Agent Systems and Internet of Things Devices\nDue to the proliferation and continuously improvement of solar PV, energy storage, electric vehicles, Internet of things (IoT) devices, these open up new opportunities and change the ways how end-use customers (smart homes and smart buildings) engage in the electricity market. Rather than passively consume energy by purchasing electricity with a fixed tariff from an electric utility, in the near future they can become prosumers who are able to generate revenue on their excess energy and able to obtain transparently-source, reliable energy. This talk discusses the development of a Multi-Agent System Platform, so called PEA HiVE, with Blockchain Energy Trading application.  Python is selected to be the development language for the IoT integration and backend, whereas Hyperledger and React Native are chosen to be the Blockchain development platform and our mobile frontend respectively.\n\n\n\n--------\n\nDr. Khamphanchai received his PhD from the Department of Electrical and Computer Engineering at Virginia Polytechnic Institute and State University, USA. His research interests are home/building energy management systems, Internet of things, multi-agent systems, machine learning, data analytics, demand response, cyber-physical systems, and power system operation and control. His research focus is to develop building energy management open source software (BEMOSS) for energy savings and peak demand reduction in small- and medium-sized commercial buildings. The current released version of BEMOSS is made available on the Github repository (URL: https://github.com/bemoss/bemoss_os) and on the United States Department of Energy (DOE) website (URL: http://energy.gov/eere/buildings/downloads/building-energy-management-open-source-software-development-bemoss)\nDr. Khamphanchai was a full stack Python developer focusing on developing applications for building energy management and multi-agent systems development, which is the foundation of the BEMOSS platform. He is also the active member of the IEEE Power and Energy Society, the IEEE Internet of Things Society, the IEEE Computer Society, TechShop DC/Arlington, Google Developer Group (GDG) Washington D.C., Modev Washington D.C., as well as DC robotics group. He received his Masters degrees in Electric Power System Management Field of Study from the School of Environment, Resources and Development (SERD), Asian Institute of Technology (AIT), Thailand in 2011 and the B.Eng. degree in Electrical Engineering from Chulalongkorn University, Thailand in 2009.\nHis dissertation topic is: \"An Agent-based Platform for Demand Response Implementation in Smart Buildings\"\nFor more info, please visit : kwarodom.wordpress.com or contact: kwarodom@vt.edu",
  "duration": 2641,
  "language": "eng",
  "recorded": "2018-06-17",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://th.pycon.org/en/schedule/"
    }
  ],
  "speakers": [
    "Dr. Warodom Khamphanchai"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Q3KyLEaX3rk/maxresdefault.jpg",
  "title": "Enabling Blockchain Energy Trading among Smart Buildings through the Use of Multi-Agent Systems and Internet of Things Devices",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Q3KyLEaX3rk"
    }
  ]
}
