{
  "abstract": "Data scientists increasingly encounter problems whereby data objects exhibit network-like inter-connectivity. Graph-theoretic computation enables feature extraction from relationship graphs. This talk shows how easy it is to leverage readily available Python libraries/functions to perform such tasks",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Playing with Social Network, Geo-Spatial, Financial Flow, and Banking System Data: Graph-Theoretic Computation in Python\nMuch of 'Big Data' revolution has to do with dealing with non-traditional datatypes and feeding machine learning engines with non-numerical variables. Just as Convolutional Neural Networks excel at object recognition task precisely because the convolution layers expressly capture grid-array information embedded in the 2-dimensional visual field, analysis involving network-patterned objects (individuals in an online social network, transportation nodes, banking accounts with payment network, etc.) stands to benefit from the ability to extract graph-theoretic properties from the network connectivity patterns, either to provide insights in and of themselves, or as pre-processing to further machine learning task down the line.\n\n\n\n--------\n\n- (Bachelor's) Physics & Economics (double major), Case Western Reserve University\n- (Master's) Operations Research (minor in Finance), Weatherhead School of Management\n- (Doctorate's) Computational Intelligence & Operational Research, Imperial College, London\n- (Bank of Thailand) Head of Quantitative Models & Financial Engineering, Financial Supervision Group\n- (SCB - current) FSVP, Quantitative Models & Enterprise Analytics, Business Intelligence, Transformation Group",
  "duration": 2478,
  "language": "eng",
  "recorded": "2018-06-17",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://th.pycon.org/en/schedule/"
    }
  ],
  "speakers": [
    "Poomjai Nacaskul"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/1-aSxYDiyZM/maxresdefault.jpg",
  "title": "Playing with Social Network, Geo-Spatial, Financial Flow, and Banking System Data: Graph-Theoretic Computation in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1-aSxYDiyZM"
    }
  ]
}
