{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "Python is so much more than just a readable language: It's also a *powerful platform* with an amazing standard library and tons of libraries! Let's use that platform to run another language, *a LISP*.\nHy http://hylang.org is a LISP running on the Python platform. In this Lightning Talk I'll demo a small Flask webapp written in Hy, and show how Hy macros allow us to express our intention clearly.\n\n\n\n--------\n\n*You are smart, motivated and have a unique perspective* -- that's my premise as CTO of engageSPARK http://engagespark.com. Originally I'm from Berlin, and have worked there for a couple of years, but for the past three years I've served at engageSPARK in Cebu, Philippines, and enjoy almost every minute of it. CTO means being team lead, architect, coder and coach. I find challenge and joy in all these roles.\nOn the tech-side, I work mostly with Python and Golang, but secretly enjoy languages with the odd super power like LISP. I use Emacs, and highly respect Vim power-users, because they're so incredibly fast.\nI try to live purposefully and deliberately. That's why I joined engageSPARK as the first opportunity Labs http://opplabs.org company. Let me know how I can help you live your life well.\nOh, and if ever **you find yourself in Cebu, do say Hi!** (For example on LinkedIn https://www.linkedin.com/in/murat-knecht/ or at muratk[@my company's name.com] . We have a desk and Internet for you, if you're willing to share some of your knowledge and uniqueness. :) In any case, always glad to help out with sightseeing tips and a cold beverage.",
  "duration": 285,
  "language": "eng",
  "recorded": "2018-06-16",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://th.pycon.org/en/schedule/"
    }
  ],
  "speakers": [
    "Murat Knecht"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Bwmz-Z2SQeo/maxresdefault.jpg",
  "title": "Hy: Running a webapp with LISP on Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Bwmz-Z2SQeo"
    }
  ]
}
