{
  "abstract": "\"Ad Tech\" is the use of digital technologies by vendors, brands,  and their agencies to target potential clients. One popular case is mining the Web to identify their logos.  I will show you how to do this by using PyTorch -- a popular deep learning framework in Python.",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "In this talk. We will walk through the one significant use of deep learning for digital marketing and ad tech, the image recognition, which brands use to identify their potential clients, deliver personalized offerings and analyze the spending in the world of social media. The easiest way to identify the brand is by its logo.\nThe logo detection can be done by object detection models.  We will use PyTorch, a popular deep learning framework in Python, to build the model to identify a brand by its logo in an image.  Along the talk, we'll see the relative value of deep learning architectures-Deep Neural Network (DNN) and Convolutional Neural Network (CNN) , learn the effect of data size, augment the data when we don't have much, and use the transfer learning technique to improve the model.\n\n\n\n--------\n\n*Lifelong learner, tech lover, and deep learning enthusiast.*\n**My work**\n- iOS apps https://itunes.apple.com/th/developer/nithiroj-tripatarasit/id704045425\n- Android apps https://play.google.com/store/apps/developer?id=Neo+Edutainment\n**Experiences:**\n- fast.ai International Fellowship Program (Mar 19 - Apr 30, 2018) http://www.fast.ai/2018/01/17/international-spring-2018/\n- Deep Learning, a 5-course specialization by deeplearning.ai on Coursera. Specialization Certificate earned on March 9, 2018 https://www.coursera.org/account/accomplishments/specialization/X7TVC4FK8J82\n- Machine Learning https://www.coursera.org/account/accomplishments/certificate/3DJQGJEUN2ZH\n- Deep Learning Workshops by Google Developer Experts https://drive.google.com/file/d/197ONJWkT6qgf5CzEL1UJlxr9P9gW5Rbz/view?usp=sharing",
  "duration": 1383,
  "language": "eng",
  "recorded": "2018-06-17",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://th.pycon.org/en/schedule/"
    }
  ],
  "speakers": [
    "Nithiroj Tripatarasit"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/TIRe2nFobxE/maxresdefault.jpg",
  "title": "Logo Detection Using PyTorch",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=TIRe2nFobxE"
    }
  ]
}
