{
  "abstract": "Can personal data help us become more productive, healthier, and happier? It’s easy to track with a smartphone, wearable, or sensor. But can data help us become a better self? I’ll show you how to track, and, with python, how to engage with your data to become a data-driven you!",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "It’s easier than ever to track our lives, work and bodies with a smartphone, wearable, home sensor or computer. But what can we do with all this data? Can it help you become a better version of yourself?\nWhile we often hear about data in terms of data leaks and surveillance, personal data and self-tracking can be empowering too.  With smartphones, wearables, tracking apps, home sensors, and many other methods, it’s easier than ever to collect a lot of data on our lives. But we are still struggling to engage and find meaning in all of the data we collect.\nPython and its data science toolset can help transform personal data into a personal dashboard of data visualizations and predictive models. How can python help us better collect, visualize, understand and find patterns in our personal data and self-tracking?\nIn this talk, I’ll show you how to track your life in different ways, and, with python’s data science toolkit, how to engage and understand that data. The stated goal of the quantified self and self-tracking is to “measure or document something about your self such that it gains meaning.” I think we can go one step further and use data to become better; use data to become data-driven!\n\n\n\n--------\n\nMark Koester (@markwkoester) is a self-tracker, writer, and web and mobile app developer.\nCreator: - PhotoStatsApp www.photostats.io, a photo tracking app without the cloud,\n- PodcastTracker www.podcasttracker.com, a web app to log your podcast listening, and\n- Biomarker Tracker www.biomarkertracker.com, a health analytics service to better understand your blood test results.\nHe currently runs a boutique dev shop (Int3c.com) and is an active open source contributor.  Former Regional Lead in Greater China at Techstars, a seed-stage accelerator. He regularly writes about self-tracking, quantified self and data-driven life at www.markwk.com.\nSocial Media:\n* https://www.linkedin.com/in/markwkoester\n* https://twitter.com/markwkoester\n* https://www.facebook.com/markwkoester",
  "duration": 2991,
  "language": "eng",
  "recorded": "2018-06-16",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://th.pycon.org/en/schedule/"
    }
  ],
  "speakers": [
    "Mark Koester"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/wHuHC1VflZ8/maxresdefault.jpg",
  "title": "Python for Self-Trackers: How to Visualize and Better Understand Your Life in Data",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wHuHC1VflZ8"
    }
  ]
}
