{
  "abstract": "Writing functional-style Python can be challenging ranging from minor nuisance such as verbose lambda syntax to more serious problems such as iterator chaining and pattern matching. Coconut is a functional superset of Python that aims to enable elegant and Pythonic functional-style code.",
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "With functions being first-class citizens, Python allows us to build programmes with higher-order functions. However, it is often cumbersome to do something that would be bread-and-butter in a typical functional language. The lack of concise syntax for lambdas, currying and function compositions is a nuisance. The lack of boilerplate-less pattern matching and pattern matching could be a deal breaker. This talk presents Coconut, a functional superset of Python, which aims to enable writing elegant functional code, whilst staying with the familiar Python environment and libraries. We will identify various pain points of writing functional code in Python, and demonstrates how Coconut addresses the problems. In particular, we will start with a basic coding problem, and move on to designing a machine-learning pipeline with a functional approach.\n\n\n\n--------\n\nI am a data scientist in Agoda, an innovative accommodation website that places a huge emphasis in machine learning algorithms. I have been using Python on a daily basis since 2013 as a freelance data scientist and algorithmic trader. I am also a functional programming enthusiast, and my experience mainly comes from writing Scala code in Agoda and using Haskell for scripting. I enjoy writing functional-style code in Python, and have been actively trying to marry the two for years. My other passion include high-performance computing, Bayesian statistics and Vim.",
  "duration": 1763,
  "language": "eng",
  "recorded": "2018-06-16",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://th.pycon.org/en/schedule/"
    }
  ],
  "speakers": [
    "Anthony Khong"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/24DWw6Ozkvo/maxresdefault.jpg",
  "title": "Pythonic Functional Programming with Coconut",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=24DWw6Ozkvo"
    }
  ]
}
