{
  "copyright_text": "Creative Commons Attribution license (reuse allowed)",
  "description": "By Jupyter! I'm gonna show you the power of Jupyter!\nBy that I mean I'm going to do a live demo of Jupyter notebooks.\nWhen I was a kid I grew up with the BBC Model B. When you switched this thing on, you got a prompt. You could launch into BASIC and write programs. Suddenly you felt powerful. The possibilities were endless. 30 years later, Jupyter again gives me that same feeling of being able to explore, solve problems, and that awesome power was right there at your fingertips.\nThe exciting thing about this talk is that people will be able to interact with it as I go, and even write some code.\nI'll explain what Jupyter is, what it's used for, and then I'll do a demo using Jupyter to mess around with some data and make some plots. Then wow the crowd with an animation.\nI'll set up a sandboxed notebook that the audience can access, such that they can follow along and try out the code on their mobile phones or laptops. For Android users, I'll then show them what they need to do to install jupyter running under termux, a debian-like environment for Android (no rooting required). Then I'll show them the awesome power of being able to write Python on a mobile device, by writing a script to log my phone's location and take photos, and show them by SSHing into a jupyter session on my phone and walking around with it.\nLive demos galore!! What can possibly go wrong?? But the nice thing is, because the jupyter notebooks will be running locally, I don't have to depend on the internet.\nMy hope is that this talk will inspire people that programming is fun and exciting, and to remove the barrier to entry of it being hard to set up an environment.\n\n\n\n--------\n\nThese days I pretend I'm a lazy layabout but actually I am always working on some kind of weird software projects. In a previous life I helped save the world at the UN. I'm also helping to (dis)organise this event.",
  "duration": 2150,
  "language": "eng",
  "recorded": "2018-06-16",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://th.pycon.org/en/schedule/"
    }
  ],
  "speakers": [
    "Mike Amy"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ZQcmEqnkDXY/maxresdefault.jpg",
  "title": "The power of Jupyter notebooks",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZQcmEqnkDXY"
    }
  ]
}
