{
  "description": "How do you use data from 15 years of observations to predict the magnitude of a “once in 50 years” storm? How can we build a network infrastructure that can handle the maximum traffic over a decade, using just one year of data?\nExtreme value Analysis (EVA) provides a statistical and technical framework for the analysis of extreme deviation from the median of probability distributions. It is used in multiple fields to predict the probability of the recurrence of extreme outliers in data or even of the occurrence of heretofore unobserved phenomena.\nThis talk aims to provide the listener with a basic understanding of the analysis framework and the mathematical justification for its correctness. Numerous alternative routes, pitfalls and decision points encountered during analysis will be presented.\nCurrently, available libraries in Python allow only very rudimentary EVA, and many useful and sometimes necessary operations lack implementations. So while this talk is aimed at people hearing about EVA for the first time, it is also a call for contributors to implement those necessary features.\n\nSlides: https://docs.google.com/presentation/d/1KB2F2Q-8y8SNyDCWZNZnGcJEJI1oRf5x\n\nFollow PyData Tel Aviv on:\nhttps://www.meetup.com/PyData-Tel-Aviv/\nhttps://www.linkedin.com/company/17907513\nhttps://www.facebook.com/PyDataTLV\nhttps://twitter.com/PyDataTLV\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 1914,
  "language": "eng",
  "recorded": "2022-12-13",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/telaviv2022/"
    },
    {
      "label": "https://www.linkedin.com/company/17907513",
      "url": "https://www.linkedin.com/company/17907513"
    },
    {
      "label": "https://www.meetup.com/PyData-Tel-Aviv/",
      "url": "https://www.meetup.com/PyData-Tel-Aviv/"
    },
    {
      "label": "https://twitter.com/PyDataTLV",
      "url": "https://twitter.com/PyDataTLV"
    },
    {
      "label": "https://docs.google.com/presentation/d/1KB2F2Q-8y8SNyDCWZNZnGcJEJI1oRf5x",
      "url": "https://docs.google.com/presentation/d/1KB2F2Q-8y8SNyDCWZNZnGcJEJI1oRf5x"
    },
    {
      "label": "https://www.facebook.com/PyDataTLV",
      "url": "https://www.facebook.com/PyDataTLV"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/7XpZjt8cvgs/maxresdefault.jpg",
  "title": "Dimitry Venger - Extreme Value Analysis | PyData Tel Aviv 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7XpZjt8cvgs"
    }
  ]
}
