{
  "description": "Bio:\nRaymond has been a prolific contributor to the CPython project for over a decade, having implemented and maintained many of Python's great features. He has been instrumental in modules like bisect, collections, decimal, functools, itertools, math, random, with types like namedtuple, sets, dictionaries, and in many other places around the codebase. He has contributed to the modification of nearly 90,000 lines of code in the CPython repository, and has made over 160 changes in the PEP repository.\n\nNotebooks: https://drive.google.com/file/d/1SXtqtQXJj9Pg5Kl9Z2eXGcnDfa7oy89d\n\nRaymond has also served as a director of the Python Software Foundation, and has mentored many people over the years on their contributions to the python-dev community. He's also well known for his contributions to the Python Cookbook, and shares many pieces of Python wisdom on Twitter. He received the Distinguished Service Award at PyCon 2014 for his exceptional contributions to the python community.\n\nFollow PyData Tel Aviv on:\nhttps://www.meetup.com/PyData-Tel-Aviv/\nhttps://www.linkedin.com/company/17907513\nhttps://www.facebook.com/PyDataTLV\nhttps://twitter.com/PyDataTLV\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 2950,
  "language": "eng",
  "recorded": "2022-12-13",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/telaviv2022/"
    },
    {
      "label": "https://www.linkedin.com/company/17907513",
      "url": "https://www.linkedin.com/company/17907513"
    },
    {
      "label": "https://www.meetup.com/PyData-Tel-Aviv/",
      "url": "https://www.meetup.com/PyData-Tel-Aviv/"
    },
    {
      "label": "https://twitter.com/PyDataTLV",
      "url": "https://twitter.com/PyDataTLV"
    },
    {
      "label": "https://drive.google.com/file/d/1SXtqtQXJj9Pg5Kl9Z2eXGcnDfa7oy89d",
      "url": "https://drive.google.com/file/d/1SXtqtQXJj9Pg5Kl9Z2eXGcnDfa7oy89d"
    },
    {
      "label": "https://www.facebook.com/PyDataTLV",
      "url": "https://www.facebook.com/PyDataTLV"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/wiGkV37Kbxk/maxresdefault.jpg",
  "title": "Raymond Hettinger: Numerical Marvels Inside Python - Keynote | PyData Tel Aviv 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wiGkV37Kbxk"
    }
  ]
}
