{
  "description": "https://github.com/Technion-Kishony-lab/quibbler\n\nAn open-source package for interactive, reproducible and efficient data analytics.\n\nInteractivity, reproducibility and efficiency are becoming increasingly important, yet challenging, in today’s data-rich applications. Inevitably, data analysis pipelines are often heavily parametrized, and we lack effective ways to play with parameters and understand how they affect focal downstream results. In the talk, we introduce “Quibbler” - a new open-source, pure-python package for building inherently interactive, yet traceable, transparent and efficient data analysis applications. Founded on a data-flow paradigm, Quibbler allows processing data through any series of analysis steps, while automatically tracking functional relationships between downstream results and upstream parameters. Quibbler facilitates and embraces human interventions as an inherent part of the analysis pipeline: input parameters, as well as algorithmic exceptions, can be specified interactively, and any such interventions are automatically recorded and documented. Changes to upstream parameters propagate downstream, pinpointing which specific data items, or even specific elements thereof, are affected, thereby vastly saving unnecessary recalculations. Quibbler, therefore, facilitates hands-on interactions with data in ways that are not only flexible, fun and interactive, but also traceable, reproducible, and computationally efficient.\n\nAnd most importantly, to get started you do not need to learn any new syntax: with Quibbler your standard Python analysis code is automatically live and interactive!\n\nWe are just launching Quibbler as an open-source project, and are eager to see it being used and integrated within a range of data science applications. We are of course also looking for any feedback, suggestions and help.\n\nHappy quibbling!\n\nFollow PyData Tel Aviv on:\nhttps://www.meetup.com/PyData-Tel-Aviv/\nhttps://www.linkedin.com/company/17907513\nhttps://www.facebook.com/PyDataTLV\nhttps://twitter.com/PyDataTLV\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R.",
  "duration": 2135,
  "language": "eng",
  "recorded": "2022-12-13",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/telaviv2022/"
    },
    {
      "label": "https://www.linkedin.com/company/17907513",
      "url": "https://www.linkedin.com/company/17907513"
    },
    {
      "label": "https://www.meetup.com/PyData-Tel-Aviv/",
      "url": "https://www.meetup.com/PyData-Tel-Aviv/"
    },
    {
      "label": "https://twitter.com/PyDataTLV",
      "url": "https://twitter.com/PyDataTLV"
    },
    {
      "label": "https://github.com/Technion-Kishony-lab/quibbler",
      "url": "https://github.com/Technion-Kishony-lab/quibbler"
    },
    {
      "label": "https://www.facebook.com/PyDataTLV",
      "url": "https://www.facebook.com/PyDataTLV"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/euGnxrmBkEY/maxresdefault.jpg",
  "title": "Roy Kishony: Quibbler: Your Data - Interactive! | PyData Tel Aviv 2022",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=euGnxrmBkEY"
    }
  ]
}
