{
  "copyright_text": "CC BY",
  "description": "Si desea incursionar en la tecnología en la educación, esta charla es para usted. Discutiremos las definiciones de tecnología y sus usos en la educación como un medio para generar conocimiento y el desarrollo de software educativo y sus etapas. Para el desarrollo de esas herramientas es fundamental pensar en las concepciones pedagógicas, que van a orientar todo el proceso de desarrollo. Posteriormente se presentarán más detalles de cada etapa de desarrollo de este tipo de software, que son la concepción, elaboración, finalización y viabilidad. En cada uno de ellos también se discutirán procesos y patrones de buenas prácticas. Se presentará el software educativo que desarrollé durante mi master, que tiene como objetivo ayudar a la alfabetización bilingüe (para lengua de signos brasileña y portugués brasileño escrito) de niños sordos siguiendo los patrones discutidos anteriormente. Terminaremos hablando de cómo la innovación debe estar presente en este tipo de herramientas, considerando la motivación para desarrollar estas aplicaciones y los impactos que puede tener en la educación. Finalmente, también discutiremos la accesibilidad y cómo podría haber problemas considerando nuestros propios prejuicios como desarrolladores de software, entre otras dificultades relacionadas con el proceso de desarrollo de software con fines educativos.",
  "duration": 1655,
  "language": "spa",
  "recorded": "2022-04-27",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2022/schedule/"
    },
    {
      "label": "Slides",
      "url": "https://pycon-assets.s3.amazonaws.com/2022/media/presentation_slides/128/2022-04-26T16%3A10%3A54.189378/PyCon_US_-_Charlas_2022.pdf"
    }
  ],
  "speakers": [
    "Débora Azevedo"
  ],
  "tags": [
    "charla"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/49MuQkgYiBs/hqdefault.jpg",
  "title": "Software educativo: ¿que es? ¿como se hace?",
  "videos": [
    {
      "length": 1655,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=49MuQkgYiBs"
    }
  ]
}
