{
  "copyright_text": "CC BY",
  "description": "El pronóstico de series de tiempo tiene una amplia gama de aplicaciones: finanzas, retail, salud, IoT, etc. Recientemente modelos de deep learning como ESRNN o N-BEATS han demostrado tener performance estado del arte en estas tareas. Nixtlats es una librería de python que hemos desarrollado para facilitar el uso de estos modelos estado del arte a data scientists y developers, para que puedan utilizarlos en ambientes productivos. Escrita en pytorch, su diseño está enfocado en la usabilidad y reproducibilidad de los experimentos. Para ello, nixtlats cuenta con diversos módulos:\n\nData: contiene datasets de diversas competencias de series de tiempo.\nModels: incluye modelos estado del arte.\nEvaluation: posee diversas funciones de pérdida y métricas de evaluación.\n\nObjetivo:\n\n-Introducir a les asistentes a los retos del pronóstico de series de tiempo con deep learning.\n-Aplicaciones comerciales del pronóstico de series de tiempo.\n-Describir nixtlats, sus componentes y las mejores prácticas para entrenamiento y despliegue de modelos estado del arte en productivo.\n-Reproducción de resultados estado del arte usando nixtlats del modelo ganador de la competencia M4 de series de tiempo (ESRNN).",
  "duration": 1703,
  "language": "spa",
  "recorded": "2022-04-27",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2022/schedule/"
    },
    {
      "label": "Repositorio del proyecto",
      "url": "https://github.com/Nixtla/neuralforecast."
    }
  ],
  "speakers": [
    "Federico Garza Ramirez",
    "Kin Gutierrez Olivares"
  ],
  "tags": [
    "charla"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/O50p6ySOnm8/maxresdefault.jpg",
  "title": "Nixtla: Deep Learning para pronóstico de series de tiempo.",
  "videos": [
    {
      "length": 1703,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=O50p6ySOnm8"
    }
  ]
}
