{
  "copyright_text": "CC BY",
  "description": "En época reciente, tuve la oportunidad de desarrollar un proyecto de freelance con una empresa editorial cuyo objetivo es migrar su herramienta de generación de libros de ser un script de Python, lanzado desde un terminal, a convertirse en una herramienta gráfica basada en la web.\n\nEn el proceso, tuve la oportunidad de aplicar las herramientas para la creación de una página web completa que normalmente utilizo en mi trabajo como instructor de Python en una universidad.\n\nOBJETIVO\nEn esta charla, quiero compartir una versión simplificada de dicha experiencia, mostrando la creación de un proyecto nuevo en Django, la implementación de acceso controlado y de un modelo de base de datos en SQL, para finalmente desplegar nuestro proyecto en Heroku y habilitar Integración Continua utilizando GitHub y TravisCI.\n\nEl proceso se desarrolla en su totalidad en el nivel de coste cero de cada servicio, mostrando que es posible crear un prototipo completo de esta manera.\n\nAUDIENCIA META\n\n- Desarrolladores interesados en hacer freelance en Python sin incurrir en altos costos para la creación de un prototipo inicial para clientes potenciales.\n- Instructores interesados en enseñar desarrollo web 100% en Python.\n- Desarrolladores que quieren aprender desarrollo web en Python.\n\nESTRUCTURA DE LA CHARLA\n\n- Cómo terminé de desarrollador freelance? (3 minutos).\n- Las herramientas que utilizaremos (3 minutos).\n- Creando nuestro proyecto en Django (22 minutos).\n       - Configuración inicial.\n       - Modelo de base de datos.\n       - La interfaz de administrador en Django.\n       - Plantillas HTML.\n       - Publicación de nuestra página en Heroku.\n       - Integración Continua con GitHub y TravisCI.\n- Qué más podemos hacer? (2 minutos)",
  "duration": 1779,
  "language": "spa",
  "recorded": "2022-04-27",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2022/schedule/"
    }
  ],
  "speakers": [
    "Luis Conejo"
  ],
  "tags": [
    "charla"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/XBvBabYu_4c/hqdefault.jpg",
  "title": "De cero a 200 OK en 30 minutos: Desarrollo Web con Django, Heroku, TravisCI y GitHub",
  "videos": [
    {
      "length": 1779,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=XBvBabYu_4c"
    }
  ]
}
