{
  "copyright_text": "CC BY",
  "description": "As a large, well-established company, Bloomberg focused on C++ as its primary language several decades ago. Python began as a scripting language for writing small utilities. An intern project several years ago showed that it was possible to integrate some C++ libraries with Python, making it possible to build domain-specific applications. An engineer with an affinity for Python got approval to form a small team to provide better support for the language. Engineers also formed small committees (or Guilds) to help promote Python across the organization by advocating for users, organizing meetups, actively monitoring messaging channels to help those with questions and problems, and writing lots and lots of documentation.\n\nToday, Python is used by more than 3,000 of the company's engineers. We actively support the Python Software Foundation and open source Python projects. Python is used to train new hires on the architectural paradigms used within the company. In less than a decade, we’ve gone from taking our first steps with the language to being one of the leading contributors to its evolution.\n\nSometimes success can \"just happen.\" However, most often changing a cultural dynamic takes a lot of hard work. And it is work that can be very rewarding.",
  "duration": 1536,
  "language": "eng",
  "recorded": "2022-04-27",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2022/schedule/"
    },
    {
      "label": "Slides",
      "url": "https://pycon-assets.s3.amazonaws.com/2022/media/presentation_slides/79/2022-04-28T22%3A02%3A15.039467/How_to_Succeed_with_Python.pdf"
    }
  ],
  "speakers": [
    "Greg Compestine"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/1zRv5vAQCKk/hqdefault.jpg",
  "title": "How to Succeed with Python Across the Enterprise",
  "videos": [
    {
      "length": 1536,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1zRv5vAQCKk"
    }
  ]
}
