{
  "copyright_text": "CC BY",
  "description": "What if you can understand your surroundings with just a click of a picture?\n\nThe speakers have built an intelligent camera app that assists people with visual impairment in understanding their surroundings. This application takes camera input in the form of an image and attempts to answer questions related to the image. Simply put, it's a Visual Question Answering (VQA) app.\n\nThe deep learning based application is built using a transformer based model called Vision Language Transformer (ViLT) which is both computationally fast and efficient, thus providing answers to users’ questions within a fraction of seconds. The application is integrated with speech-to-text and text-to-speech capabilities to enhance accessibility.\n\nThis talk would mainly cover the following: * What is the Vision Language Transformer (ViLT) model? * Advantages of ViLT over traditional vision language pre-trained models * Best practices around modularizing the application into different services * Steps to deploy this deep learning based application on cloud (GCP) * How in-built python libraries helped in implementing and deploying such complex models (viz. ViLT) easily\n\nThe entire code is open-sourced and the talk will provide a walkthrough of the steps to build your own visual question answering application.",
  "duration": 1654,
  "language": "eng",
  "recorded": "2022-04-27",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2022/schedule/"
    },
    {
      "label": "Slides",
      "url": "https://pycon-assets.s3.amazonaws.com/2022/media/presentation_slides/83/2022-04-29T03%3A09%3A38.147066/PyCon2022.pdf"
    },
    {
      "label": "Demo",
      "url": "https://pycon-assets.s3.amazonaws.com/2022/media/presentation_slides/83/2022-04-29T03%3A05%3A47.986467/vignet_demo.mp4"
    }
  ],
  "speakers": [
    "Padmaja Bhagwat",
    "Manisha R"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/f6BWDWpCXug/hqdefault.jpg",
  "title": "VigNET: An intelligent camera app that assists you in understanding your surroundings",
  "videos": [
    {
      "length": 1654,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=f6BWDWpCXug"
    }
  ]
}
