{
  "copyright_text": "CC BY",
  "description": "Open source is the lifeblood of the community, and we all stand on the shoulders of giants. But the responsibility, time commitment, and processes that come with maintaining projects on PyPI can be overwhelming, even for the best of us. With this talk, we'll see how the right tools and automation can cut out the overhead from running open source projects, and let you focus on the fun parts!\n\nWe'll cover a wide range of topics, from packaging, metadata, and dependencies, to code quality, testing, and CI/CD, and finish with documentation, helping new developers, and reviewing contributions from the community. We'll look at high level concepts, modern best practices, and free tools available and how they make it easier than ever for new contributors to get started, while giving you confidence that their changes are safe and ready for production.\n\nRather than just pointing to cookie cutter templates, we'll talk about the \"why\" behind these best practices and how they fit into common developer workflows. We'll also include links to references and popular developer tools, as well as a companion site with slides and a list of everything mentioned in the talk.\n\nDevelopers of all experience levels are welcome. Whether you're new to packaging and need guidance for your first release, or a seasoned package maintainer looking to simplify your workflow, this talk is for you!",
  "duration": 1566,
  "language": "eng",
  "recorded": "2022-04-27",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2022/schedule/"
    },
    {
      "label": "Slides",
      "url": "https://pycon-assets.s3.amazonaws.com/2022/media/presentation_slides/104/2022-04-28T21%3A41%3A15.777027/open-source-easy-mode.pdf"
    }
  ],
  "speakers": [
    "Amethyst Reese"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/lSqyKoPYtr0/maxresdefault.jpg",
  "title": "Open Source on Easy Mode",
  "videos": [
    {
      "length": 1566,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lSqyKoPYtr0"
    }
  ]
}
