{
  "copyright_text": "CC BY",
  "description": "FOR WHOM IS YOUR WORKSHOP\n\nData scientists, engineers and researchers who have no prior experience in knowledge graph data modelling. In this workshop, we will start from the fundamentals - learning how to think in terms of triples to describe relations of different data objects. If your work involves data analysis, data management, data collaboration or anything data-related, this is a workshop for you to have a brand new insight into how data should be represented and stored.\n\nSHORT FORMAT OF YOUR WORKSHOP\n\nOverview-10 min, Lecture - 60 mins, Breaks- 20 minutes, Hands-on training - 80 mins, Closing - 10 mins\n\nWHAT ATTENDEES WILL LEARN\n\nBy the end of the workshop, you will be able to think like a knowledge graph expert and construct a proper schema to store your data in a knowledge graph format. You will acquire the skills that you need to build knowledge graphs in TerminusDB - an open-source graph database that enables revisional control and collaborations.\n\nCOURSE BENEFITS\n\nYou will have learnt a new skill set that may assist you in your project in data science or research. You will have a new tool that you can better model your data and collaborate with others. Also, you gain all the prerequisites to use WOQL - a query language for knowledge graphs and the TerminusDB Python client to manage, manipulate and visualize data in your knowledge graph.",
  "duration": 8814,
  "language": "eng",
  "recorded": "2022-04-27",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://us.pycon.org/2022/schedule/"
    },
    {
      "label": "Slides",
      "url": "https://pycon-assets.s3.amazonaws.com/2022/media/presentation_slides/50/2022-04-26T08%3A51%3A50.741435/Data_Modelling_Workshop.pdf"
    }
  ],
  "speakers": [
    "Cheuk Ting Ho"
  ],
  "tags": [
    "tutorial"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/nHTm-2YvSp8/hqdefault.jpg",
  "title": "Knowledge graph data modelling with TerminusDB",
  "videos": [
    {
      "length": 8814,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nHTm-2YvSp8"
    }
  ]
}
