{
  "category": "DjangoCon 2015",
  "slug": "confident-web-development-with-react-by-julien",
  "title": "Confident web development with React",
  "summary": "Confident web development with React\n\nReact has become increasingly popular over the past year and is already\nused in large-scale products and companies such as Facebook, Instagram,\nKhan Academy, Hipchat and Netflix. This rapid success can in part be\nexplained by React's performance qualities as well as its clean,\npredictable development workflow. To boot, its learning curve is very\nshort despite it introducing a pretty radically different way of\napproaching front-end web development. Overall, React tends to greatly\nappeal to Django developers as both tools share the same philosophies of\nelegance and practicality.\n\nReact can benefit all types of web applications, from single-page apps\nto more conventional websites and can easily be introduced to complement\nexisting web architectures. While React is Javascript-based and is\nprimarily a client-side presentation tool, it remains agnostic about the\nrest of the stack and works really well with backend technologies like\nDjango.\n\nIn this talk I will present how React and Django can work together to\nbuild powerful, easier-to-maintain web applications with confidence. I\nwill start with a brief introduction of React's key concepts: the Flux\narchitecture, the virtual DOM, JSX and the React component life-cyle. I\nwill then explain how React can integrate with Django-powered backends\nand discuss some advanced topics such as server-side rendering,\nisomorphic JS, animations, testing, production environments and\nintegration with asset pipelines. Numerous code samples will illustrate\nthe various concepts presented. By the end of this talk, members of the\naudience who are unfamiliar with React will have a good grasp of its\nfunctioning and of its benefits; those already familiar with React will\nalso have learned several useful tips applicable to their Django\nprojects.\n\nHelp us caption & translate this video!\n\nhttp://amara.org/v/HIYT/\n",
  "description": "",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "",
  "thumbnail_url": "https://i.ytimg.com/vi/ixnoL8N_dd4/maxresdefault.jpg",
  "duration": 2506,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=ixnoL8N_dd4",
      "length": 0,
      "type": "youtube"
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=ixnoL8N_dd4",
  "tags": [],
  "speakers": [
    "Julien Phalip"
  ],
  "recorded": "2015-09-24"
}