{
  "category": "DjangoCon 2015",
  "copyright_text": "",
  "description": "",
  "duration": 1575,
  "language": "English",
  "quality_notes": "",
  "recorded": "2015-09-24",
  "slug": "consequences-of-an-insightful-algorithm-by-carina",
  "source_url": "https://www.youtube.com/watch?v=5e-mZnYAih8",
  "speakers": [
    "Carina C. Zona"
  ],
  "summary": "Consequences of an Insightful Algorithm\n\nWe have ethical responsibilities when coding. We’re able to extract\nremarkably precise intuitions about an individual. But do we have a\nright to know what they didn’t consent to share, even when they\nwillingly shared the data that leads us there? A major retailer’s\ndata-driven marketing accidentially revealed to a teen’s family that she\nwas pregnant. Eek.\n\nWhat are our obligations to people who did not expect themselves to be\nso intimately known without sharing directly? How do we mitigate against\nunintended outcomes? For instance, an activity tracker carelessly\nrevealed users’ sexual activity data to search engines. A social\nnetwork’s algorithm accidentally triggered painful memories for grieving\nfamilies who’d recently experienced death of their child and other loved\nones.\n\nWe design software for humans. Balancing human needs and business specs\ncan be tough. It’s crucial that we learn how to build in systematic\nempathy.\n\nIn this talk, we’ll delve into specific examples of uncritical\nprogramming, and painful results from using insightful data in ways that\nwere benignly intended. You’ll learn ways we can integrate practices for\nexamining how our code might harm individuals. We’ll look at how to flip\nthe paradigm, netting consequences that can be better for everyone.\n\nHelp us caption & translate this video!\n\nhttp://amara.org/v/HIYS/\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/5e-mZnYAih8/maxresdefault.jpg",
  "title": "Consequences of an Insightful Algorithm",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5e-mZnYAih8"
    }
  ]
}