{
  "category": "DjangoCon 2015",
  "copyright_text": "",
  "description": "",
  "duration": 1378,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-09-19",
  "related_urls": [
    "http://amara.org/v/HHB0/"
  ],
  "slug": "how-to-practice-inclusion-and-benefit-django-by",
  "source_url": "https://www.youtube.com/watch?v=7UCw57RcBJo",
  "speakers": [
    "Kojo Idrissa"
  ],
  "summary": "How to Practice Inclusion and Benefit Django by Kojo Idrissa\n\nWHAT: Inclusion Defined\n\nNot about morality Inclusion vs. Diversity vs. Political Correctness\nWHY: Why does this matter?\n\nInherent limits on community membership: not ALL 7 billion humans will\njoin AND contribute Inclusion lets you maximize the number of\ncontributors HOW: How do I DO this better?\n\nCheck your assumptions Zen of Python on Inclusiveness Errors should\nnever pass silently Check for exceptions Discuss errors when they occur\nIn the face of ambiguity, refuse the temptation to guess: how much does\nthe ambiguity matter? Get out of your bubble Flip the Demographics\nUnderstanding The Power of Privilege Your Personal Privilege Matrix\nPrivilege Arbitrage \"Turn Your Sadness Into Kindness\" Closing\n\nWhat if you feel you can't?\n\nIf your heart's not really into it or you feel it's \"too hard\", be\nhonest with yourself and just hang around others like you. An insincere\neffort often does more harm than good.\n\nRecognize that this behavior may leave you isolated from a large (and\ngrowing) portion of the community.\n\nIt's up to all of us\n\nJust as systems tend towards entropy, if you leave a community alone it\ntends towards toxicity. Good communities require continual effort. -\nJacob Kaplan-Moss\n\nHelp us caption & translate this video!\n\nhttp://amara.org/v/HHB0/\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/7UCw57RcBJo/maxresdefault.jpg",
  "title": "How to Practice Inclusion and Benefit Django",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7UCw57RcBJo"
    }
  ]
}