{
  "category": "DjangoCon 2015",
  "copyright_text": "",
  "description": "",
  "duration": 1756,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-09-24",
  "slug": "introduction-to-sphinx-read-the-docs-by-eric",
  "source_url": "https://www.youtube.com/watch?v=eWNiwMwMcr4",
  "speakers": [
    "Eric Holscher"
  ],
  "summary": "Introduction to Sphinx & Read the Docs\n\nThis talk will have four parts:\n\nWhy Write Documentation Semantic Markup Sphinx Read the Docs The\nbeginning of this talk will cover why you should write documentation.\nEvery talk to developers about documentation I feel needs this part,\nbecause when you talk about docs people are inherently skeptical. Once\npeople get on board that docs are important, you can cover more\ninteresting concepts.\n\nThen we will walk through the concepts around semantic documentation\nwriting. Similar to Semantic HTML, this allows you to mark up your\ndocumentation with metadata that gives you a lot more power and\nflexibility around the display and authoring of documentation.\n\nThen we’ll have a basic introduction to Sphinx. This will talk about the\npower that Sphinx gives you to write documentation, and examples of how\nto use it. We will also cover the semantic power of Sphinx, playing on\nthe previous section to understand it in practice.\n\nThen at last we’ll cover how to host your documentation on Read the\nDocs. This will make your documentation beautiful with a custom theme,\nand allow you to host multiple versions and formats of your docs.\n\nThe talk will include a basic demo of creating a basic documentation\nproject, and getting it hosted on Read the Docs during the talk. All of\nthe software will be running locally, so the demo won’t require an\ninternet connection.\n\nHelp us caption & translate this video!\n\nhttp://amara.org/v/HIYQ/\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/eWNiwMwMcr4/maxresdefault.jpg",
  "title": "Introduction to Sphinx & Read the Docs",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eWNiwMwMcr4"
    }
  ]
}