{
  "category": "",
  "slug": "minimum-viable-security-by-jacob-kaplan-moss",
  "title": "Minimum Viable Security",
  "summary": "Minimum Viable Security\n\nWe'll look at creating a full security program for a startup-sized\ncompany, one that can start quite small, but can be iterated on\ncontinually, and grown to match the growth of your business. This talk\nuses the conceit of a five day program, to be completed in a one-week\nsprint, but the steps could easily be scaled down to just a few hours,\nspread out, or otherwise modified to fit your time and organization.\n\nDay 1 - Training: for a security program to work, it needs to be\neverybody's responsibility, not just a select few. So your first step in\ncreating a security program is to establish a minimum bar for secure\ncoding techniques. Luckily, basic secure coding is easily explained and\ntaught, and there are great free guides and resources that can form the\nbackbone of a simple, easy training program. On Day 1, you'll pull\ntogether these guides and create a training manual.\n\nDay 2 - Secure Development Lifecycle: now we know how to write good\ncode, but how do we ensure that best practices are followed? As we learn\nlessons about our own product and its security posture, how do we make\nsure those learnings are captured, retained, and applied in the future?\nThe answer to these questions lies in creating a Secure Development\nLifecycle, which is just a fancy name for procedures and checklists that\ncapture your best practices, and help remind you of them as you ship new\nfeatures. On day 2, you'll write those checklists, adopt some\nlightweight process, and being tracking your product security.\n\nDay 3 - Incident Response: sooner or later, something will go wrong.\nWhen it does, will you be able to respond? Trying to make up an incident\nresponse process when something's already on fire is an unpleasant\nexperience, and you can avoid it with a little bit of preparation. On\nday 3, you'll develop a basic IR plan, run a table-top exercise to try\nit out, and be ready to respond if and when something goes bump in the\nnight.\n\nDay 4 - Governance, Risk, and Compliance: there's an alphabet soup of\nsecurity standards: ISO, SOC, SIG, PCI, HIPAA, FIPS, FISMA, FedRAMP...\noh my! At small scale, most of these are formal attestations probably\naren't worth the investment. However, at larger scale these ways of\nformally proving security standards start to become increasingly\nimportant. Completely ignoring formal risk programs can get you into a\nbind if you decide to pursue them later. Thus, on day 4 you'll lay the\ngroundwork for a formal GRC program, making sure you're ready to start\ndown this path once your business grows to that point.\n\nDay 5: Brag about it! At this point, you've got a security program far\nbetter than most startups (and better than many established businesses).\nThis is great! Security is increasingly a concern even for non-technical\ncustomers, and now that you've got a good story to tell, you should tell\nit! On day 5, you'll lay out that security story, publicly, and make\nsure your customers know about all your hard work.\n",
  "description": "",
  "quality_notes": "",
  "language": "English",
  "copyright_text": "",
  "thumbnail_url": "https://i.ytimg.com/vi/r-fjUVMPidk/maxresdefault.jpg",
  "duration": 2645,
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=r-fjUVMPidk",
      "length": 0,
      "type": "youtube"
    }
  ],
  "source_url": "https://www.youtube.com/watch?v=r-fjUVMPidk",
  "tags": [],
  "speakers": [
    "Jacob Kaplan-Moss"
  ],
  "recorded": "2015-09-18"
}