{
  "category": "DjangoCon 2015",
  "copyright_text": "",
  "description": "",
  "duration": 1316,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-09-16",
  "related_urls": [
    "http://amara.org/v/HGSf/"
  ],
  "slug": "rest-easy-api-security-done-right-by-jeff-schenck",
  "speakers": [
    "Jeff Schenck"
  ],
  "summary": "REST Easy — API Security Done Right by Jeff Schenck\n\nWhy REST More and more of our web development is shifting to frontend\nweb frameworks like Angular, Ember, and Backbone. And this is great!\nThese frameworks can provide an amazing, responsive, beautiful\nexperience to our users — and the only price we pay is having to write\nJavaScript. Well, having to write JavaScript and having to maintain a\nseriously robust, battle-hardened API for the frontend framework to talk\nto.\n\nState of REST Django REST Framework has clearly broken away with a ton\nof momentum, and with good reason. It's a solid framework, and the tools\nit provides right out of the box — serialization, validation, nested\nrelationships — are splendid. It even provides basic authentication and\nauthorization baked right in, which works great in the very simple\ncases.\n\nHowever, when you start encountering slightly more complicated API\npermission setups, things start to get messy.\n\nREST Security There's a big tectonic shift when trading in your\ntraditional request-response-Django site for a\nfrontend-framework-API-Django site. Your application logic used to\nreside almost entirely server-side, but now it's split — half\nserver-side, half browser-side. And the trick with browser-side code is\nit runs in a completely untrusted environment. So we're faced with a\nmuch more complicated security situation to batten down.\n\nYou need different authentication strategies: session auth, JWT token\nauth, API keys, signed URLs, and combinations thereof. You have\ndifferent permission strategies: table-level, row-level, column-level,\nand combinations thereof. It gets real complicated.\n\nREST Easy I'll show how to use the tools at our disposal — Django groups\nand permissions, REST Frameworks's permission classes, third-party\nlibraries — to cobble together a passable security setup for your API.\nYou'll get plenty of code samples, detailing the kinds of setups we put\ntogether for our site and the custom tooling we built to do it.\n\nNext-Level REST We'll end by talking about how our tools can serve us\nbetter in the future. If Django is going to have a strong place in the\nfuture of the web, we need strong tooling for building APIs. This is how\nwe'll get there.\n\nHelp us caption & translate this video!\n\nhttp://amara.org/v/HGSf/\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/2LWheXmsmHg/maxresdefault.jpg",
  "title": "REST Easy — API Security Done Right",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2LWheXmsmHg"
    }
  ]
}