{
  "category": "DjangoCon 2015",
  "copyright_text": "",
  "description": "",
  "duration": 2492,
  "id": 4865,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-09-19",
  "related_urls": [
    "http://amara.org/v/HHB1/"
  ],
  "slug": "the-texas-tribune-making-data-and-state-politics",
  "speakers": [
    "Ryan Murphy"
  ],
  "summary": "The Texas Tribune: Making Data, and State Politics, Public by Ryan\nMurphy\n\nThe goal of everything we do is the same – how can we produce something\nuseful for the citizens of Texas that enable them to be better\nparticipants in their state government?\n\nOur News Apps team is responsible for the building and maintaining of\neditorial-focused data explorers. Django's ease of use has made it\npossible for us to architect both robust back-end systems for managing\nthe government data sets that power these apps, and to build compelling\ninterfaces to the data for our users to find their own stories.\n\nMore details on the three projects we'd discuss:\n\nThe Government Salaries Explorer is our most popular explorer. This\nproject manages the payroll data we've collected of more than 300\nthousand public employees, providing a peak behind the curtains into how\ntax dollars are being spent. It required a system that could standardize\nthe many different formats a public agency may release its payroll\ninformation to us, but also remain easy to use for all members of the\nteam so updates happen in a timely fashion.\n\nThe Texas Legislative Guide was our spin on a legislative bill tracker.\nInstead of placing all the focus on the bills themselves, we instead\ncreated a platform for our reporters to provide context on the many\ntopics and issues that come up during a legislative session. While we\nstill have the capacity for users to search for bills, the site's bigger\nfocus is on the potential changes this session's legislation may have on\nthe state.\n\nAnd finally, our upcoming revamp of our Public Schools Explorer will be\na Django app. This project is currently in it's very early stages, but\nit's on track to be released by DjangoCon so there will be plenty to\nshow by then! The challenge – how can we take Texas Education Agency\ndata and turn it into something usable for the citizens – and parents –\nof Texas? We are building an interface that makes it easy to compare and\ndistricts and campuses to one another, opening up state data that has\nalways been public but frustratingly trapped within complicated web\nforms and paper printouts.\n\nWhile this proposal is more focused on \"what we did with Django\" vs.\n\"how we did it\" – although that will be touched on as well – I believe\nthe work we've produced is a testament to the impact we've been able to\nhave on the state and its citizens thanks to the support of a system\nthat works well for us.\n\nHelp us caption & translate this video!\n\nhttp://amara.org/v/HHB1/\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/9IsGHophknU/maxresdefault.jpg",
  "title": "The Texas Tribune: Making Data, and State Politics, Public",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9IsGHophknU"
    }
  ]
}
