{
  "category": "DjangoCon 2015",
  "copyright_text": "",
  "description": "",
  "duration": 1288,
  "id": 4866,
  "language": "eng",
  "quality_notes": "",
  "recorded": "2015-09-19",
  "related_urls": [
    "http://amara.org/v/HHB2/"
  ],
  "slug": "things-that-are-tired-uggs-segways-and-you-by",
  "speakers": [
    "Barbara Shaurette"
  ],
  "summary": "Things That are Tired: Uggs, Segways and you! Coming Back from Burnout\nby Barbara Shaurette\n\nWhy is burnout such a bad thing?\n\nWhen I see that question on paper, the answer seems obvious. But in\nnearly a decade in this community, I've seen people run themselves into\nthe ground without realizing that they can - and should - take the time\nto rest. Why? Well, the short answer is that, if you don't take a break\nonce in a while, the quality of your work suffers. But the long and more\ninvolved answer? Well, as a wise man once said,\n\n\"Life moves pretty fast. If you don't stop and look around once in a\nwhile, you could miss it.\" Burnout leads to exhaustion, and that leads\nto terrible performance. And no one wants to be known for performing\nterribly - we all have too much pride for that. History is full of\nexamples of times when exhaustion led to disaster - remember the Exxon\nValdez? Imagine your open source project taking a header like that. I'm\nactually going to get a little science-y here and cite a few studies, in\nparticular a recent one from Washington State University that shows how\nsleep-deprived people have an impaired ability to take in new\ninformation.\n\nOf course, you can get plenty of sleep and still be burned out. If your\nwaking hours are consumed with community work, your relationships can\nsuffer, and your sanity will erode pretty quickly.\n\nAfter nearly a decade in the Python and Django communities, I've\nexperienced periods of overwork that have made me hate everything I was\ndoing. I have a lot of good anecdotes, stories that will probably sound\nfamiliar to everyone in the room. Luckily, I've also learned some\ntactics for stepping back and recovering. It can be done, and it's\neasier than people think. What you're going to hear from this talk is\njust plain common sense. But sometimes when you're mired in work with no\nobvious way out, you need to hear it from someone else. So I'm giving\neveryone permission to let go. (And no, I promise, there will be no\n'Frozen' references in my slides.)\n\nBut how do you let go? And when?\n\nBurnout is pretty easy to recognize if you know what to look for. Are\nyou staying up every night reading pull requests ... and is that your\nprimary method of interaction with other human beings? Your user group\nmay only meet once a month, but is that group still responsible for the\nbulk of your email? Do you secretly blame them for your inability to get\nto inbox zero? Is the only travel you're doing for conferences? Have you\ngiven up on vacations and just decided to see the world one PyCon or\nDjangoCon at a time?\n\nThe biggest indicator of burnout in the community is how you feel about\nthe community around you. When you find yourself starting to cringe\nevery time you get a new Twitter follower, it may be time to start\nsaying no to things.\n\nThe most important piece of advice I have is to stop looking at what\nother people are doing. We all know that person who seems to have a hand\nin every project, but you can't judge your own performance by what you\nimagine theirs to be. You don't know how they may be scrambling behind\nthe scenes.\n\nAnd remember that just because you're invited into a conversation\ndoesn't mean that you have to contribute to it - sometimes listening is\nenough. Emails can sometimes go unanswered - so can phone calls! Think\nabout what's most important in your life, and start directing your\nenergy towards those things instead.\n\nDon't write so much code in your free time. Take a few nights off, go\noutside - there's a lot to see out there!\n\nYour collaborators WILL understand. Especially if you announce your\nintentions to the world. Send an email, tweet it out, let people know\nyou need some time off. You'll be surprised how much understanding\nyou'll get and how well people will respect your boundaries (you just\nneed to set them).\n\nHelp us caption & translate this video!\n\nhttp://amara.org/v/HHB2/\n",
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/WnCPT46tt6U/maxresdefault.jpg",
  "title": "Things that are tired: Uggs, Segways and YOU! Coming back from burnout",
  "videos": [
    {
      "length": 0,
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WnCPT46tt6U"
    }
  ]
}