{
  "id": 2736, 
  "category": "SciPy 2014", 
  "slug": "bokeh-interactive-visualizations-in-the-browser", 
  "title": "Bokeh: Interactive Visualizations in the Browser", 
  "summary": "Bokeh is a Python visualization library for large datasets that natively uses the latest web technologies. Its goal is to provide concise construction of novel graphics, while delivering high-performance interactivity over large data to thin clients. This talk will cover the motivation and architecture behind Bokeh, demonstrate interesting uses and capability, and discuss future plans. ", 
  "description": "With support from the DARPA XDATA Initiative, and contributions from community members, the Bokeh visualization library (http://bokeh.pydata.org) has grown into a large, successful open source project with heavy interest and following on GitHub (https://github.com/ContinuumIO/bokeh). The principal goals of Bokeh are to provide capability to developers and domain experts:\r\n\r\n* easily create novel and powerful visualizations\r\n* that extract insight from remote, possibly large data sets\r\n* published to the web for others to explore and interact\r\n\r\nThis talk will describe how the architecture of Bokeh enables these goals, and demonstrate how it can be leveraged by anyone using python for analysis to visualize and present their work. We will talk about current development and future plans, including a brief discussion of Joseph Cottam's exciting academic work on abstract rendering for large data sets that is going into Bokeh (https://github.com/JosephCottam/AbstractRendering).\r\n\r\n\r\n\r\n\r\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/B9NpLOyp-dI/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=B9NpLOyp-dI", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=B9NpLOyp-dI", 
  "tags": [
    "bokeh", 
    "vis"
  ], 
  "speakers": [
    "Bryan Van de Ven"
  ], 
  "recorded": "2014-07-09"
}