{
  "id": 2787, 
  "category": "SciPy 2014", 
  "slug": "campaign-for-it-literacy-through-foss-and-spoken", 
  "title": "Campaign for IT literacy through FOSS and Spoken Tutorials", 
  "summary": "Textbook Companion (TBC) has code for solved problems of textbooks,\r\ncoordinated by FOSSEE (http://fossee.in).\r\nWe explain a collaborative method\r\nthat helped create 500 Scilab TBCs (http://cloud.scilab.in) and over 100\r\nPython TBCs (http://tbc-python.fossee.in/). We also explain a self learning\r\nmethod that trained 250,000 students on FOSS systems using spoken\r\ntutorials (http://spoken-tutorial.org).\r\n", 
  "description": "The FOSSEE team has been promoting the use of FOSS in educational\r\ninstitutions in India. It focuses on the following FOSS systems currently:\r\nScilab, Python, Oscad, OpenFOAM, COIN-OR and OpenFormal\r\n([http://fossee.in](http://fossee.in)).  On each of these systems, the\r\nfollowing three standardised help are provided:\r\n\r\n1. Support to conduct spoken tutorial based workshops, explained below\r\n2. Creation of Textbook Companion (TBC) \r\n3. Support to Lab Migration.\r\n\r\nA TBC is a collection of code for solved examples of standard textbooks.  We\r\nhave completed a large number of TBCs on Scilab and made them available for\r\nonline use at [Scilab](http://cloud.scilab.in/) and offline use at\r\n[Completed Books](http://www.scilab.in/Completed_Books).  Similarly, one may\r\naccess the Python TBC at [Python TBC](http://tbc-python.fossee.in/).  These\r\nTBCs are created by students and teachers from many colleges and each\r\ncreator is paid an honorarium through a project funded by the Government of\r\nIndia.\r\n\r\n[Spoken Tutorial](http://spoken-tutorial.org) is a screencast of ten minute\r\nduration on a FOSS topic, created for self learning.  Using Spoken\r\nTutorials, we conduct two hour long workshops on FOSS topics through\r\nvolunteers, who need not be experts.  We conduct online tests and provide\r\ncertificates for all who pass the tests.  All of these are done completely\r\nfree of cost, thanks to the financial support from the Government of India.\r\nUsing this method, we have trained more than 200K students in the last two\r\nyears in India ([statistics](http://www.spoken-tutorial.org/statistics)).\r\n\r\nThe students love this method, see some testimonials at\r\n[http://www.spoken-tutorial.org/testimonials](http://www.spoken-tutorial.org/testimonials).  It is being increasingly\r\naccepted by colleges and universities, officially.  We expect to\r\nconduct 5K to 10K workshops in 2014, training 200K to 500K students.\r\nAs we dub the spoken part into all 22 languages of India, the FOSS\r\ntopics are accessible also to students who are not fluent in English,\r\nthereby helping us reach out to many students.  Spoken Tutorial, which\r\nstarted as a documentation project for FOSS systems has transformed\r\ninto a massive training programme.  Our methods are scalable and are\r\navailable to the FOSS enthusiasts in the rest of the world.\r\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/rCSoGLjqyyE/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=rCSoGLjqyyE", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=rCSoGLjqyyE", 
  "tags": [], 
  "speakers": [
    "Kannan Moudgalya"
  ], 
  "recorded": "2014-07-13"
}