{
  "id": 2792, 
  "category": "SciPy 2014", 
  "slug": "codalab-a-new-service-for-data-exchange-code-ex", 
  "title": "CodaLab: A New Service for Data Exchange, Code Execution, Benchmarks & Reproducible Research", 
  "summary": "Learn, Share and Collaborate with CodaLab -- A new open source platform which lets communities create and explore experiments together and engage in benchmarking and competitions to enable true reproducibility and advance the state of the art in data-driven research", 
  "description": "CodaLab is a web-based open source platform that allows researchers to share and browse code, data, and create experiments in a truly reproducible manner. CodaLab focuses on accomplishing the following:\r\n\r\n* Serve as a data repository for data sets including large scale data sets that could only be hosted in a cloud computing environment \r\n* Serve as an algorithm repository that researchers can use in their experimentation, to teach and learn from others\r\n* Host the execution of experiments as worksheets, sometimes referred to as \"executable papers\", which are annotated scientific documents that combine textual process descriptions with live data sets and functioning code.\r\n* Enable the creation of benchmarks \r\n\r\nCodaLab is a community-driven effort led by Percy Liang from Stanford University who built the precursor of CodaLab, namely, MLComp. From a development viewpoint CodaLab supports both the Linux and Windows communities with code in GitHub and Python as one of the main language used to support the scientific community.\r\n\r\nAt SciPi, we invite the community to participate in CodaLab by creating experiments as executable papers and by sharing them with the rest of the community at [http://codalab.org](http://codalab.org). These worksheets or \"executable papers\" can then be freely reproduced, appended, and otherwise modified to improve productivity and accelerate the pace of discovery and learning among data-driven scientific professionals.\r\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/vla-EQaPHYU/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=vla-EQaPHYU", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=vla-EQaPHYU", 
  "tags": [], 
  "speakers": [
    "Christophe Poulain"
  ], 
  "recorded": "2014-07-13"
}