{
  "id": 2777, 
  "category": "SciPy 2014", 
  "slug": "enhancements-to-ginga-an-astronomical-image-view", 
  "title": "Enhancements to Ginga: an Astronomical Image Viewer and Toolkit", 
  "summary": "We describe recent developments in the Ginga package, a open-source astronomical image viewer and toolkit written in python and hosted on Github.  The package was introduced to the scientific python community at SciPy 2013 and has received a number of enhancements since then based on user feedback.  The talk includes an image mosaicing demo of a wide-field camera exposure with 116 4Kx2K CCDs.", 
  "description": "Ginga is an open-source astronomical image viewer and toolkit written in python and [hosted on Github](https://github.com/ejeschke/ginga).  It uses and inter-operates with several key scientific python packages: numpy, scipy, astropy and matplotlib.\r\n\r\nIn this talk/poster we describe and illustrate recent enhancements to the package since the introductory talk at SciPy 2013, including:\r\n\r\n\r\n* modular/pluggable interfaces for world coordinate systems, image file I/O and star and image catalogs\r\n* support for rendering into matplotlib figures\r\n* support for image mosaicing\r\n* support for image overlays\r\n* customizable user-interface bindings\r\n* improved documentation\r\n* self contained Mac OS X packages\r\n\r\nDuring the talk we will demonstrate the mosaicing plugin that is being used with several instruments at Subaru Telescope in Hawaii, including the new Hyper Suprime-Cam wide-field camera with 116 separate 4Kx2K CCDs.\r\n\r\nThe talk/poster may be of interest to anyone developing code in python needing to display scientific image (CCD or CMOS) data and astronomers interested in python-based quick look and analysis tools.\r\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/wa_0SuVckGQ/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=wa_0SuVckGQ", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=wa_0SuVckGQ", 
  "tags": [
    "astronomy"
  ], 
  "speakers": [
    "Eric Jeschke"
  ], 
  "recorded": "2014-07-14"
}