{
  "id": 2709, 
  "category": "SciPy 2014", 
  "slug": "geospatial-data-in-python-database-desktop-and", 
  "title": "Geospatial data in Python: Database, Desktop, and the Web part 1", 
  "summary": "Using the wide range of tools and libraries available for working with geospatial data, it is now possible to transport geospatial data from a database to a web-interface in only a few lines of code. In this tutorial, we explore some of these libraries and work through examples which showcase the power of Python for geospatial data.", 
  "description": "Tools and libraries for working with geospatial data in Python are currently undergoing rapid development and expansion. Libraries such as shapely, fiona, rasterio, geopandas, and others now provide Pythonic ways of reading, writing, editing, and manipulating geographic data. In this tutorial, participants will be exposed to a number of new and legacy geospatial libraries in Python, with a focus on simple and rapid interaction with geospatial data.\r\n\r\nWe will utilize Python to interact with geographic data from a database to a web interface, all the while showcasing how Python can be used to access data from online resources, query spatially enabled databases, perform coordinate transformations and geoprocessing functions, and export geospatial data to web-enabled formats for visualizing and sharing with others. Time permitting, we will also briefly explore Python plugin development for the QGIS Desktop GIS environment.\r\n\r\nThis tutorial should be accessible to anyone who has basic Python knowledge (though familiarity with Pandas, NumPy, matplotlib, etc. will be helpful) as well as familiarity with IPython Notebook. We will take some time at the start of the tutorial to go over installation strategies for geospatial libraries (GDAL/OGR, Proj.4, GEOS) and their Python bindings (Shapely, Fiona, GeoPandas) on Windows, Mac, and Linux. Some knowledge of geospatial concepts such as map projections and GIS data formats will also be helpful.\r\n\r\n### Outline\r\n- Introduction to geospatial data\r\n    - Map projections, data formats, and looking at maps\r\n- Introduction to geospatial libraries\r\n    - GDAL/OGR (Fiona); Shapely (GEOS); PostGIS; GeoPandas; and more\r\n- GeoPandas\r\n    - Reading data from various sources\r\n    - Data manipulation and plotting\r\n    - Writing data to various sources\r\n    - Getting data from the web\r\n    - Pushing data to the web (for maps)\r\n- Putting it all together\r\n    - Quick example: From database to web\r\n- Introduction to QGIS Desktop GIS (time permitting)\r\n    - Python interface (PyQGIS)\r\n    - Building a simple plugin\r\n    - Plugin deployment\r\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/ctdjAir4TUg/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=ctdjAir4TUg", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=ctdjAir4TUg", 
  "tags": [
    "geospatial", 
    "gis", 
    "tutorial"
  ], 
  "speakers": [
    "Carson Farmer"
  ], 
  "recorded": "2014-07-09"
}