{
  "id": 2807, 
  "category": "SciPy 2014", 
  "slug": "mapping-networks-of-violence", 
  "title": "Mapping Networks of Violence", 
  "summary": "A novel approach to both violence prevention and the measurement of propensity to violence is presented.  The work is part of the evaluation of Cure Violence's (Ransford, Kane and Slutkin 2009; Slutkin 2012) implementation in NYC. Python libraries such as IPython, PySAL, Numpy, Basemap, Fiona, Shapely, Matplotlib, bNetworkX, Pandas and scikit-learn feature prominently in the work.\r\n", 
  "description": "Violence remains a significant problem in New York City's poor\r\nneighborhoods.  There were more than 9,000 gun homicides in 2008 (FBI,\r\n2009) and the CDC (2012) reports that there were more than 71K\r\nnon-fatal wounds in the US. One novel approach to the problem of\r\nviolence is the Cure Violence Model (Ransford, Kane and Slutkin 2009;\r\nSlutkin 2012).  Cure Violence treats violence as a disease passed\r\nbetween people in a social network.  The program tries to use the same\r\nnetwork to change how people who are prone to and have been the\r\nvictims of violence react to stress and conflict.  Cure Violence is\r\nviewed as having been successful in Chicago and shown promising in\r\nother cities (Skogin 2009, Wilson 2010, Webster 2009).  All of these\r\nstudies have used reported incidents of violence before and after the\r\nprogram to assess the efficacy. The NYC Council and Robert Wood\r\nJohnson Foundation have commited significant resoures to this\r\napproach.  Both have retained the CUNY John Jay Research & Evaluation\r\ncenter to evaluate the efficacy. Our research adds to the literature\r\nby being the first to attempt to measure the change in the propensity\r\nto violence of people in the community. Novel preliminary research is\r\npresented on network cliques of respondents and the demographic,\r\neducation, victimization experiences that constitute greatest risk.\r\nAll of the analysis was conducted in Python libraries including\r\nIPython, PySAL, Numpy, Basemap, Fiona, Shapely, Matplotlib, bNetworkX,\r\nPandas and scikit-learn.\r\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/SDi4TNqaR2s/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=SDi4TNqaR2s", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=SDi4TNqaR2s", 
  "tags": [], 
  "speakers": [
    "Evan Misshula", 
    "Sheyla Delgado"
  ], 
  "recorded": "2014-07-13"
}