{
  "id": 2745, 
  "category": "SciPy 2014", 
  "slug": "multibody-dynamics-and-control-with-python-part-2", 
  "title": "Multibody Dynamics and Control with Python part 2", 
  "summary": "In this tutorial, attendees will learn how to derive, simulate, and visualize\r\nthe motion of a multibody dynamic system with Python tools. These methods and\r\ntechniques play an important role in the design and understanding of robots,\r\nvehicles, spacecraft, manufacturing machines, human motion, etc. Attendees will\r\ndevelop code to simulate the motion of a human or humanoid robot.", 
  "description": "In this tutorial, attendees will learn how to derive, simulate, and visualize\r\nthe motion of a multibody dynamic system with Python tools. The tutorial will\r\ndemonstrate an advanced symbolic and numeric pipeline for a typical multibody\r\nsimulation problem. These methods and techniques play an important role in the\r\ndesign and understanding of robots, vehicles, spacecraft, manufacturing\r\nmachines, human motion, etc. At the end, the attendees will have developed code\r\nto simulate the uncontrolled and controlled motion of a human or humanoid\r\nrobot.\r\n\r\nWe will highlight the derivation of realistic models of motion with the SymPy\r\nMechanics package. We will walk through the derivation of the equations of\r\nmotion of a multibody system (i.e. the model or the plant), simulating and\r\nvisualizing the free motion of the system, and finally we will addfeedback\r\ncontrollers to control the plants that we derive.\r\n\r\nIt is best if the attendees have some background with calculus-based college\r\nlevel physics. They should also be familiar with the SciPy Stack, in particular\r\nIPython, SymPy, NumPy, and SciPy. Our goal is that attendees will come away\r\nwith the ability to model basic multibody systems, simulate and visualize the\r\nmotion, and apply feedback controllers all in a Python framework.\r\n\r\nThe tutorial materials including an outline can be viewed here:\r\n\r\n[https://github.com/pydy/pydy-tutorial-pycon-2014](https://github.com/pydy/pydy-tutorial-pycon-2014)\r\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/1-KqRvNX0po/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=1-KqRvNX0po", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=1-KqRvNX0po", 
  "tags": [
    "robots", 
    "simulation", 
    "sympy"
  ], 
  "speakers": [
    "Jason K. Moore"
  ], 
  "recorded": "2014-07-09"
}