{
  "id": 2769, 
  "category": "SciPy 2014", 
  "slug": "perceptions-of-matplotlib-colormaps", 
  "title": "Perceptions of Matplotlib Colormaps", 
  "summary": "On several issues related to the perception of colormaps...", 
  "description": "The choice of colormap in a scientific figure significantly affects the way the presented information is perceived by the viewer. This follows on Damon McDougall's talk on how to choose a colormap for an application by delving deeper into several important issues and how well many of the available Matplotlib colormaps stand up against the concerns. For example, it is known that the human brain is better able to interpret changes in magnitude of the luminance and saturation of colors in colormaps instead of the hue. Also, some research has shown that logarithmic changes in brightness are perceived as linear changes. Next, being able to print a color plot in black and white from a published paper is sometimes mandatory and often desirable, and is related to the grey scale in a colormap. Finally, it is important to account for various types of color blindness when choosing a divergent colormap for the plot to be as accessible as possible. All of these concerns have implications for the design of colormaps, and will be examined in the context of the properties of the available Matplotlib colormaps in order to make a best choice for a given application.\r\n\r\nAbstract and slides available [on Github.](https://github.com/dmcdougall/scipy14-colormaps)\r\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/rkDgBvT-giw/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=rkDgBvT-giw", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=rkDgBvT-giw", 
  "tags": [
    "vis"
  ], 
  "speakers": [
    "Kristen M. Thyng"
  ], 
  "recorded": "2014-07-14"
}