{
  "id": 2727, 
  "category": "SciPy 2014", 
  "slug": "project-based-introduction-to-scientific-computin", 
  "title": "Project based introduction to scientific computing for physics majors", 
  "summary": "This talk will present an overview of a project-based introductory course in scientific computing using python for physics majors at Cal Poly San Luis Obispo.", 
  "description": "Computational tools and skills are as critical to the training of physics majors as calculus and math, yet they receive much less emphasis in the undergraduate curriculum.  One-off courses that introduce programming and basic numerical problem-solving techniques with commercial software packages for topics that appear in the traditional physics curriculum are insufficient to prepare students for the computing demands of modern technical careers.  Yet tight budgets and rigid degree requirements constrain the ability to expand computational course offerings for physics majors.  \r\n\r\nThis talk will present an overview of a recently revamped course at Cal Poly San Luis Obispo that uses Python and associated scientific computing libraries to introduce the fundamentals of open-source tools, version control systems, programming, numerical problem solving and algorithmic thinking to undergraduate physics majors.  The spirit of the course is similar to the bootcamps organized by [Software Carpentry](http://software-carpentry.org \"Software Carpentry\") for researchers in science but is offered as a ten-week for-credit course.  In addition to having a traditional in-class component, students learn the basics of Python by completing tutorials on [Codecademy]( http://www.codecademy.com \"Codecademy\")'s Python track and practice their algorithmic thinking by tackling [Project Euler]( http://projecteuler.net \"Project Euler\") problems.  This approach of incorporating online training may provide a different way of thinking about the role of MOOCs in higher education.  The early part of the course focuses on skill-building, while the second half is devoted to application of these skills to an independent research-level computational physics project.    Examples of recent projects and their results will be presented.", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/eJhmMf6bHDU/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=eJhmMf6bHDU", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=eJhmMf6bHDU", 
  "tags": [
    "education", 
    "physics"
  ], 
  "speakers": [
    "Jennifer Klay"
  ], 
  "recorded": "2014-07-09"
}