{
  "id": 2770, 
  "category": "SciPy 2014", 
  "slug": "transient-detection-and-image-analysis-pipeline-f", 
  "title": "Transient detection and image analysis pipeline for TOROS project", 
  "summary": "TOROS project will be an astronomical survey of the southern hemisphere in search of optical transients counterparts for aLIGO. This project will make extended use of Machine learning techniques to identify interesting transient candidates to aLIGO alerts. It also uses OpenCV library for image aligning and some of the subsequent processing.", 
  "description": "In preparation for the [TOROS project](http://toros.phys.utb.edu/TOROS/Welcome.html \\\"TOROS project\\\") designed to survey the southern hemisphere sky in search for transients, we develop a pipeline for image analysis and processing based on Python.\r\n\r\nThe code makes extended use of the open source image processing library OpenCV to align the images astrometrically and makes use of other astronomical specific routines like the Astropy package to deal with FITS files. The design will involve integration with SciDB, Astrometry.net, parallelization and other pythonic astronomical tools.\r\n\r\nThis automated optical transients discovery tool will be tested with real (CSTAR and TORITOS telescopes) and simulated data samples as the input for a machine learning classification tool of light-curves based on AstroML and Scikit-Learn libraries.\r\n\r\nThe project is version controlled using git and we will handle future collaboration among scientist from different countries using the open source project manager Trac. It will be available as an open source project in popular web repositories like github or bitbucket.", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/Kq-hd69_1FM/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=Kq-hd69_1FM", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=Kq-hd69_1FM", 
  "tags": [], 
  "speakers": [
    "Martin Beroiz"
  ], 
  "recorded": "2014-07-14"
}