{
  "id": 2715, 
  "category": "SciPy 2014", 
  "slug": "you-win-or-you-scipy", 
  "title": "You Win or You SciPy", 
  "summary": "Reflections on the State of Scientific Python ", 
  "description": "Python is currently one of the most popular programming languages and it seems that that Scientific Python has truly hit its stride in recent years. With fame comes a deluge of users, but not necessarily any more developers. Scientific Python is often held up as one of the core strengths of the Python language. Why is this so? And how much does it actually help us? This talk intends to be a frank discussion on the great parts of the SciPy community and the parts that need work.\r\n\r\nAs a confederation of packages and projects, there are several issues that affect everyone. Sometimes these issues fall through the cracks and other times they are vigorously tackled head on. In either case, I posit that greater communication about these global topics is necessary to support and scale to the next wave of SciPy users and developers.\r\n\r\nPoints of discussion in this talk may include:\r\n\r\n* Packaging,\r\n* Education,\r\n* Matplotlib - aged or awesome,\r\n* Competition from other languages,\r\n* Diversity,\r\n* Employing our own,\r\n* Interfacing with the broader Python community,\r\n* The legal status of projects, and\r\n* Maintaining critical packages in the ecosystem (when devs have moved on).\r\n\r\nHistorically, the SciPy conference has not had many overview talks, talks about the community itself, what we are doing right, and what we are doing wrong.\r\n\r\nThey were often relegated to keynotes if they were present at all. This talk is a boots-on-the-ground attempt to rectify that.", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "http://www.youtube.com/t/terms", 
  "thumbnail_url": "http://i1.ytimg.com/vi/e0Z9-EuZJac/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=e0Z9-EuZJac", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=e0Z9-EuZJac", 
  "tags": [], 
  "speakers": [
    "Andy Terrel", 
    "Anthony Scopatz", 
    "Katy Huff"
  ], 
  "recorded": "2014-07-09"
}