{
  "abstract": "This session is about 3 main things –\n\n1. How to “think” data mining problems and quickly trying out different\n   algorithmic approaches (Fail Cheap, if you should)\n\n2. Three problems in data-mining around disambiguation, Natural language\n   processing & Information Retrieval\n\n3. Measuring your Model performance - developing a near-real time\n   performance aggregation platform\n\nAnd, Putting it all together – Building the problem structure (Think -\ndata structures), analyzing, visualizing and hopefully monetizing .\n\nThe audience will walk away with concrete ideas on building your own\ncustom disambiguation algorithms & distance metrics .",
  "copyright_text": null,
  "description": "This session is for people who would like to move from pure play\nanalytics to heavy data lifting and data engineering applications. With\na background in Computer science and Quantitative economics, I blend\nthese two approaches to bring quick wins(and Fail cheaper) to solve some\nof most interesting problems around us today- for fun and profit.\n\nThe four problems I will discuss are around –\n\n1. Scoring your connections to find your net worth in LinkedIn [Data\n   structures, Algorithms , Data mining & Visualization]\n\n2. Building your custom distance metrics (with Graphs as base\n   data-structure) and finger keying – with applications for\n   hand-collected data-sets, susceptible to entirely different distance\n   metrics, than traditionally explored [Algorithms]\n\n3. Building relevant Job feeds in Linkedin (TF-IDF) and (possibly)\n   hacking around Job applications [Relevance Algorithms, Linguist\n   pre-processing & visualization]\n\n4. Developing a custom batch aggregation platform - with competing\n   system goals [developing scoring metrics, concept of centrality &\n   formal constructs to measure recency]\n\n| Most of all you will learn the why and why not of things, that I will\n  keep coming back to as I discus the problems above. This I feel is the\n  most important differentiator between coding well and coding for\n  scale, and helps build a structured thought process to problem\n  solving.\n| By the end of the session, you will have seen a blend of tools ranging\n  from Python (Algorithms & data mining & Graph Theory) , Python, R &\n  ink space (Graphical representation & visualization)\n\nThe session will be heavy on algorithms, and thinking data structures,\nso to make most of this, you need – a background/Interest in Computer\nscience and Quantitative vigor with some hands-on coding experience, and\na mind that wants to learn more.",
  "duration": 2449,
  "language": "eng",
  "recorded": "2013-09-01",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://in.pycon.org/2013/index.html#schedule"
    }
  ],
  "speakers": [
    "Ekta Grover"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/YZ6TphLj2iY/maxresdefault.jpg",
  "title": "Experiments in data mining, entity disambiguation and how to think data-structures for designing beautiful algorithms",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YZ6TphLj2iY"
    }
  ]
}
