{
  "abstract": "Recent surveys depict that hesitant online consumers get encouraged to\nbuy products from a website if they get a chance to communicate with a\ncustomer service representative or the merchant to know more about the\nproduct and its features. Businesses are missing the opportunity of\nproviding the required information to end users by not providing easy\ncommunication channels and hence losing out on prospective sales.\n\nBut, development of real time communication channels like instant chat\nor media calls has been difficult and integrating it easily in a website\nhas been a bigger concern. This talk describes how instant chat or media\ncalls can be developed & integrated in a rapid way with Python modules\nand demonstrates the concept with a working prototype.",
  "copyright_text": null,
  "description": "| Online shopping or retail industry of the world is worth trillions of\n  dollars. Forrester research estimates that US online industry alone\n  will be worth $279 Billion by 2015!\n| Given the scenario, website customers have an ever-growing need of\n  communicating with customer service representatives in real time with\n  a live chat or media call. Businesses can not only view it as an\n  opportunity to act quickly and be flexible in delivering specific\n  product information to customers but also to prevent or recover from\n  service failures & convert leads to sales!\n\nThough critical, development teams have found it difficult to develop,\nmaintain and integrate instant chat or media calls in their websites.\nUnavailability or shortage of ready-to-use frameworks has contributed to\nlonger development cycles and made the task seam out-of-reach. As a\nresult, real time communication in websites is often considered\n‘good-to-have’ and doesn’t get the due importance.\n\nThis talk discusses about development & integration of real-time\ncommunication applications in websites. Audiences would get an\nopportunity to appreciate the concept with the help of a working\nprototype. The talk also suggests Python modules for getting the task\ndone in a rapid & customised way.",
  "duration": 2216,
  "language": "eng",
  "recorded": "2013-08-31",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://in.pycon.org/2013/index.html#schedule"
    }
  ],
  "speakers": [
    "Chetan Giridhar"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/awa31geO_4M/maxresdefault.jpg",
  "title": "Rapid development & integration of Real Time Communication in Websites",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=awa31geO_4M"
    }
  ]
}
