{
  "abstract": "The Objective of this talk is to introduce you folks to Rapyuta - The\nRoboEarth Cloud Engine. It's the pioneering general purpose public cloud\nrobotics platform. The talk would walk you through with the basics of\ncloud robotics, ROS, setting up and using the engine and give you a\nsneak peak into it and how you could extend and contribute to one of the\nmost exciting projects in robotics and cloud computing today. To much\nexcitement of like minded folks here, it's all happening in our\nfavourite language.",
  "copyright_text": null,
  "description": "Think of Driverless cars, autonomous self learning robots, robots with\nminds in the cloud. In common terms think of Trinity downloading the\nroutine to fly apache in The Matrix. Until now prohibitive costs,\narchitectural limitations , complex network setups and configurations\nand limitations of computing resources have hampered some really cool\nstuff in Robotics, Rapyuta attempts to solve these very issues. Off late\nwe have completely revamped it and added a ton of exciting new features.\n\nRoboEarth is one of the top projects in the EU funded by the FP7\nframework with members including ETH Zurich, Tu Munich, Tu Eindhoven and\nothers and is fully available in Open Source. It draws from the strong\nbase and standards of ROS (www.ros.org) to bring the best of modern\nrobotics algorithms and software to the average developers and uses some\nexciting new tech like lxc and websockets, yet is simple to use and\nconfigure on almost any platform from EC2, Google Compute Engine,\nRackspace or even commodity hardware.\n\nThis is a general purpose talk to introduce you to Rapyuta, briefly\ntouch on how we built it (twisted devs would love this), how you can\neasily use and configure it and what it does for you. I will also try to\nshowcase some breakthrough real world application demos that were\npresented at ROSCON '13 at Stuttgart, that would get the geeks in us\nexcited. There will also be some interesting pointers of how you could\nuse it , extend it and get involved.",
  "duration": 1849,
  "language": "eng",
  "recorded": "2013-08-31",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://in.pycon.org/2013/index.html#schedule"
    }
  ],
  "speakers": [
    "Dhananjay Sathe"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/U98EN8owp4M/maxresdefault.jpg",
  "title": "We're building Skynet and it loves Python!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=U98EN8owp4M"
    }
  ]
}
