{
  "description": "This talk was presented at PyBay2020 Online Edition. It’s the 5th annual Bay Area Regional Python conference. See pybay.com for more details about PyBay and click SHOW MORE for information about this talk.\n\nDESCRIPTION\nPython can be taught line by line but not everyone is comfortable with purely text and logic based explanation of coding. The current status quo is to teach showing lines of code with inputs and outputs though a lot of visual learners aren’t going to easily grasp that. What if there was a way to communicate the code concepts with images? This talk will show how using geometry and modeling can acclimate novices to coding concepts using visual-spatial examples reinforced by coding concepts applicable anywhere.\n\nSPEAKER BIO\nTadeh is a developer and designer in Architecture (buildings not computers). He has been a course author, trainer and open source contributor. Over the years he has taught other designers the value of coding and automation and wants to continue to spread that message to as many people as possible with training seminars and talks. He has been a speaker at national conferences about design, tech and Architecture and loves to talk about new possibilities with innovation and technology.\n\nSPONSOR ACKNOWLEDGEMENT\nThe post production of this and other PyBay2020 videos are made possible by our sponsors:\n- IBM https://community.ibm.com/community/user/datascience/home\n- Rookout https://rookout.com/\n- Anyscale https://anyscale.com\n- Twilio https://twilio.com/\n- JetBrains https://www.jetbrains.com\n- Linode https://linode.com\n- Pearson Informit https://www.informit.com/\n\nEVENT PRODUCER ACKNOWLEDGEMENT\nThis community conference is produced by organizers of SF Python meetup and volunteers from around the SF Bay Area and beyond. See upcoming events here: https://sfpythonmeetup.com",
  "duration": 309,
  "language": "eng",
  "recorded": "2020-08-17",
  "speakers": [
    "Tadeh Hakopian"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi_webp/polU9jf9R5o/maxresdefault.webp",
  "title": "The Importance of Visuals in Teaching Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=polU9jf9R5o"
    }
  ]
}