{
  "id": 488, 
  "category": "PyGotham 2011", 
  "slug": "pygotham-2011--go-go-gadget-python", 
  "title": "PyGotham 2011: Go Go Gadget Python", 
  "summary": "So you know that embedded devices are everywhere. Perhaps you've thought how\nnice it would be to make a Linux USB driver for some Windows-only device, or\nyou've got something proprietary you would like to reverse-engineer and\nrepurpose for your next big scheme. We know Python can do pretty much anything\ninside the computer--but how does a software person enter the world of\ncircuits? And once you have some circuits, how can you bring the data back\ninto your box? Bridging the worlds of hardware and software, I will show the\npower of PyUSB and Pyserial to pwn some sweet hardware and charm it over the\nUSB port. From my own trials and tribulations building and hacking real\ndevices, from a simple HID-class USB missile launcher to the custom protocol\nused in a complex biomedical data acquisition system, you will learn about USB\npacket sniffing, rapid-prototyping device drivers in python, and deciphering\ncircuit boards and data sheets for fun & profit. I aim to leave you armed and\nready to take on hardware of your own.\n\n", 
  "description": "", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "", 
  "thumbnail_url": "http://a.images.blip.tv/Gloriajw-GoGoGadgetPython896-758.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pygotham-2011/488_pygotham-2011-go-go-gadget-python.m4v", 
      "length": null, 
      "type": "mp4"
    }, 
    {
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pygotham-2011/488_pygotham-2011-go-go-gadget-python.ogv", 
      "length": 209351340, 
      "type": "ogv"
    }
  ], 
  "source_url": "", 
  "tags": [
    "drivers", 
    "pygotham", 
    "pygotham2011", 
    "pyserial", 
    "pyusb", 
    "usb"
  ], 
  "speakers": [
    "Nicholas Waite"
  ], 
  "recorded": null
}