{
  "description": "www.pydata.org\n\nThe AI revolution is rapidly changing the landscape, leading to an unexpected shift in roles. Developers, are now finding themselves outpaced by the speed of technological advancements—especially in AI, where time for research is scarce. Join Tim Faulkes as he shares his journey through this challenge and delves into vector databases: their applications, limitations, and key factors to consider when selecting one.\n\nhttps://github.com/aerospike-examples/create-a-vector-database\n\nhttps://create-a-vector-db.netlify.app\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 5006,
  "language": "eng",
  "recorded": "2024-11-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/nyc2024"
    },
    {
      "label": "https://create-a-vector-db.netlify.app",
      "url": "https://create-a-vector-db.netlify.app"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://github.com/aerospike-examples/create-a-vector-database",
      "url": "https://github.com/aerospike-examples/create-a-vector-database"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/OM1CHD89jqw/maxresdefault.jpg",
  "title": "Art Anderson & Tim Faulkes - Vector Databases Demystified: Discover how they work | PyData NYC 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OM1CHD89jqw"
    }
  ]
}
