{
  "description": "www.pydata.org\n\nLearn how Plotnine, a Python package inspired by R's ggplot2, enables the creation of sophisticated and effective data visualizations with minimal effort. This tutorial will explain how Plotnine's grammar of graphics approach provides a flexible, intuitive way to visualize data, either as ad-hoc plots or fine-tuned graphs suited for communication.\n\nQuick links\nPresentation: https://bit.ly/plotnine-tutorial\nGitHub repository: https://bit.ly/plotnine-repo\nSlideshow about what to expect: https://bit.ly/expect-plotnine\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 5162,
  "language": "eng",
  "recorded": "2024-11-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/nyc2024"
    },
    {
      "label": "https://bit.ly/plotnine-tutorial",
      "url": "https://bit.ly/plotnine-tutorial"
    },
    {
      "label": "https://bit.ly/expect-plotnine",
      "url": "https://bit.ly/expect-plotnine"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://bit.ly/plotnine-repo",
      "url": "https://bit.ly/plotnine-repo"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/PuNWrd170_k/maxresdefault.jpg",
  "title": "Janssens, Chow & Nieuwdorp - Turning DataFrames into Pretty Pictures with Plotnine | PyData NYC 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PuNWrd170_k"
    }
  ]
}
