{
  "description": "www.pydata.org\n\nAccelerating Python using the GPU is much easier than you might think. We will explore the powerful CUDA-enabled Python ecosystem in this tutorial through hands-on examples using some of the most popular accelerated scientific computing libraries.\n\nTopics include:\n- Introduction to General Purpose GPU Computing\n- GPU vs CPU - Which processor is best for which tasks\n- Introduction to CUDA\n- How to use CUDA with Python\n- Using Numba to write kernel functions\n- CuPy\n- cuDF\n\nNo prior experience with GPU's is necessary, but attendees should be familiar with Python.\n\nTo get the most from your hands-on learning experience, please complete these steps prior to getting started:\n- Review the agenda, prerequisites, and suggested material for full-day workshops (as detailed in the course datasheet below). This is an important step to properly prepare for the workshop.\n- Create or log into your NVIDIA Developer Program account - https://courses.nvidia.com/join. You will receive an email letting you know when your account is ready. This account will provide you with access to all of the DLI training materials during and after the workshop. You will have three months of access to all course materials.\n- Visit websocketstest.courses.nvidia.com and make sure all three test steps are checked “Yes.” This will test the ability for your system to access and deliver the training contents. If you encounter issues, try updating your browser. Note: Only Chrome and Firefox are supported.\n- Check your bandwidth. 1 Mbps downstream is required and 5 Mbps is recommended. This will ensure consistent streaming of audio/video during the workshop to avoid glitches and delays.\n\nNow you’re ready to get started with the tutorial!\n\nSimply enter the code NVIDIA_XLAB_NV24 at courses.nvidia.com/dli-event\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 8905,
  "language": "eng",
  "recorded": "2024-11-06",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/nyc2024"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://courses.nvidia.com/join.",
      "url": "https://courses.nvidia.com/join."
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Aumh3evLSKc/maxresdefault.jpg",
  "title": "McCarty, Riehl, & Tomlinson - GPU Accelerated Python | PyData NYC 2024",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Aumh3evLSKc"
    }
  ]
}
