{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "How to effectively mimick most of Django features with Flask, apps included.\n\nWith Python, when thinking of web frameworks, two that come into mind are Django and Flask. Instead of having to choose one of the two, this session shows how you can engineer Flask to achieve a simili-Django app. It's a dive into the internal components of Django and the idea behind. The session covers different Flask development patterns to finally finish with an app that's functionally similar to Django with some extra features in for free. It also lists some caveats identified with such a pattern. This session requires attendees to know Flask and having used Django for building at least one project. At the very least it assumes the knowledge of models, views, controller, templates and migrations. It discusses along the way the educational and pedagogical aspect of learning web frameworks and proposes a syllabus. It discusses the benefits of learning Flask and the necessity of learning the two as a Pythonista. Django is the go-to framework for web development and it's no surprise that most freelancing jobs require Django. Flask is appreciated for the flexibility it gives. The session also touches about how we can better promote Flask through education. The session finishes with the hurdles identified when getting started with web development in Python, pulled from personal teaching experience.",
  "duration": 2625.0,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2020.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "Talk URL",
      "url": "https://ep2020.europython.eu/schedule/23-july?selected=9go44rC-django-clone-from-scratch-with-flask"
    },
    {
      "label": "Slides",
      "url": "https://drive.google.com/file/d/1O1ZuN5qiqt-4j0JMcI_5UjLDNscVLSrg/view"
    }
  ],
  "speakers": [
    "Abdur-Rahmaan Janhangeer"
  ],
  "tags": [
    "europython",
    "europython-2020",
    "europython-online",
    "Web Servers and MicroFWs (Flask/Tornado/Nginx/...)"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/rkzXQOC1T0Q/hqdefault.jpg?sqp=-oaymwEZCNACELwBSFXyq4qpAwsIARUAAIhCGAFwAQ==&rs=AOn4CLDz5t11xamxxKgPxFlg8_wObhOolw",
  "title": "Django Clone From Scratch With Flask",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rkzXQOC1T0Q"
    }
  ]
}
