{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "Get started coding on a quantum computer using D-Wave's Python-based Leap cloud service.\n\nIn the past, quantum computing was largely reserved for researchers, physicists, and scientists with direct access to physical quantum computing systems. But the game has changed, thanks to the cloud. Barriers to quantum computing are coming down quickly.\r\n\r\nToday, cloud access (like D-Wave’s Leap 2 quantum application environment) and improvements in quantum computing hardware, software, and developer tools are allowing programmers around the world to code on live quantum computers in real-time. Developers, students, and researchers around the world can now tap into the power of a quantum via their browser — quantum mechanical knowledge not required. Users and private companies have already built over 200 early applications on D-Wave’s computers in industries ranging from automotive to machine learning, aerospace, finance, and beyond. The quantum application era is here, and the growing quantum developer community is making it a reality.\r\n\r\nIn this session, Alex Condello, Manager of Applications Development Technology and Tools at D-Wave Systems, will talk about the burgeoning quantum application development ecosystem, and how developers can start learning to code on a quantum computer today. This includes a walkthrough of Leap 2, D-Wave's new quantum cloud service equipped with hybrid solvers, and D-Wave's Ocean SDK. Alex will also explore some of the early applications that developers and companies have built to-date.",
  "duration": 1663.0,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2020.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "Talk URL",
      "url": "https://ep2020.europython.eu/schedule/24-july?selected=5gg872o-building-quantum-applications-with-d-waves-leap"
    },
    {
      "label": "Slides",
      "url": "/media/conference/slides/5gg872o-building-quantum-applications-with-d-waves-leap.pdf"
    }
  ],
  "speakers": [
    "Alexander Condello"
  ],
  "tags": [
    "europython",
    "europython-2020",
    "europython-online",
    "Community",
    "Jupyter",
    "Machine-Learning",
    "Other Hardware",
    "Python general"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/oovofn0QPno/hqdefault.jpg?sqp=-oaymwEZCNACELwBSFXyq4qpAwsIARUAAIhCGAFwAQ==&rs=AOn4CLDDN_UlakQ3KHEopk3mBNtppKsC4Q",
  "title": "Building quantum applications with D-Wave's Leap",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=oovofn0QPno"
    }
  ]
}
