{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "In my work as a consultant, coach, and organizational leader- I work with amazing companies around the world, helping them craft and implement strategies to build high-performing teams.\r\n\r\nAnd when I work with these teams, I notice that there are two factors that make all the difference between a good organization and one that is changing the world.\r\n\r\nThe first is having a culture of collaboration – and this means collaboration across individuals, across departments, and across teams – really - it’s a culture that’s less about competition and cutthroat political systems.. And more about helping each other achieve the extraordinary.\r\n\r\nThe second quality is organizations that treat and expect their employees to act like owners. Owning not just their behaviors, actions, and responsibilities, but owning outcomes and becoming a voice for the organization.\r\n\r\nNo matter where your organization is at today, the good news is– there are proven strategies to create a culture of collaborative ownership at your organization and that’s what I’m going to teach you in this course.\r\n\r\nI’ll share how you can build momentum from a carefully crafted vision and goals, I’ll help you improve communication and drive ownership, I’ll help you foster creativity, and finally, I’ll help you train up leaders in your organization and help you meet more of your goals.\r\n\r\nSo, if you’re ready to transform your organization. let’s go!\r\n\r\nLEARNING OBJECTIVES:\r\n\r\nAttendees will learn: How to transform a command-obey dynamic to one of creativity and innovation through opportunities for ownership. How to collaborate with opportunities for ownership through proven methods to increase connectivity and engagement in the team. How to foster captainship within your organization. How to apply the ideas of collaborative ownership specifically in individual organizations.\r\n\r\nSESSION OUTLINE: Fostering an Ownership Culture (Creativity and Innovation)- Ownership Activity -Fostering a Collaborative Culture- Collaborative Activity - Fostering Captainship Culture - Captainship activity- The Application of Collaborative Ownership for Personal and Organizational Success- Applying Collaborative Ownership to Organizations and Self Activity -Conclusion Q&A",
  "duration": 1560.0,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2020.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "Talk URL",
      "url": "https://ep2020.europython.eu/schedule/24-july?selected=igfbLHR-cultivating-a-culture-of-creativity-collaboration-and-captainship"
    }
  ],
  "speakers": [
    "Amber Vanderburg"
  ],
  "tags": [
    "europython",
    "europython-2020",
    "europython-online",
    "Agile",
    "Best Practice",
    "Business",
    "Community",
    "DevOps general"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/njg2XmKWD7k/hqdefault.jpg?sqp=-oaymwEZCNACELwBSFXyq4qpAwsIARUAAIhCGAFwAQ==&rs=AOn4CLC8bgtEn5KvTYcdOx1MKEnU5BEERw",
  "title": "Cultivating a Culture of Creativity, Collaboration, and Captainship",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=njg2XmKWD7k"
    }
  ]
}
