{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "\"Painting with GANs: Challenges and Technicalities of Neural Style Transfer\nEuroPython 2020 - Talk - 2020-07-24 - Parrot Data Science\nOnline\n\nBy Anmol Krishan Sachdeva\n\nA lot of advancements are happening in the field of Deep Learning and Generative Adversarial Networks are one of them. We have seen GANs being applied for photo editing and in-painting, generating new image datasets and realistic photographs, increasing resolution of images (Super Resolution), and many more things. Some people have also exploited GANs for generating fake content. All the above-mentioned examples are result of a technique where the focus is to generate uncommon yet original samples from scratch. However, these examples have very less commercial applications and GANs are capable of doing much more. The focus of this talk is a technique called \"\"Neural Style Transfer (NST)\"\" which has numerous commercial applications in the gaming world, fashion/design industry, mobile applications, and many more fields. Challenges and technicalities of NSTs will be covered in great detail. We will teach the machines on how to paint images and utilize Style Transfer networks to generate artistic artefacts.\n\nThe flow of the talk will be as follows:\n~ Self Introduction 1 minute\n~ A Succinct Prelude to GANs 10 minutes\n~ Understanding Style Transfer 5 minutes\n~ Learning about Neural Style Transfer Networks 5 minutes\n~ Loss Functions: Content, Style, Total Variantion 10 minutes\n~ Code Walkthrough and Result Analysis 5 minutes\n~ Challenges and Applications 5 minutes\n~ Questions and Answers Session 3-4 minutes\n\n\n\nLicense: This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n\n    \"",
  "duration": 2621,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/Qd50-uRerZc/sddefault.jpg",
  "title": "Anmol Krishan Sachdeva - Painting with GANs: Challenges and Technicalities of Neural Style Transfer",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Qd50-uRerZc"
    }
  ]
}
