{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "That’s the way to build a Virtual Assistant for your team, the way to boost productivity.\n\nThe technology is to take script written in a high-level language (Python), analyze its inputs/outputs, images or graphs display, other interactions with the user and build connectors to this script from Chat Apps like Slack, Skype, and others. Imagine that you described your skill as a script and gave it to a software robot. And from that moment it is his skill, you and your colleagues can ask him any time to run this skill and give results. As a script author, you don't think about how to connect with different Chat Apps, how to control access, how to monitor that script works fine when colleagues run it, how to save logs, how to balance load if there are too many colleagues running script and so on, our platform does all of this so the author doesn't need to think about what is that software robot, how it works, the platform will understand script by itself. The author just drop script to the platform and tell to the platform which colleagues have the right to run this script.\r\n\r\nFor whom?\r\n \r\nFor teams who are in charge of Servers, Applications, API's, Data Bases, Analytical reports and other information technology items.\r\n\r\nFor tasks like\r\n\r\n - to fetch diagnostic information from multiple data sources into Chat App, gather metrics/logs and analyzing them\r\n - to take an action in case of incident right from a Chat App, rerouting users requests, server rebooting, launching new instances, and many other actions\r\n -  to give easy access via Chat App to APIs for team members and other coleagues\r\n - to provide analytical reports by the request from Chat App, reports with graphs, images, tables, files, etc.\r\n\r\nThese things are trivial to automate and share, you can do much more with Python, Chat App and smart script sharing platform.",
  "duration": 1789.0,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2020.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "Talk URL",
      "url": "https://ep2020.europython.eu/schedule/24-july?selected=6cj892G-automate-your-tasks-with-python-and-publish-with-chat-apps"
    },
    {
      "label": "Slides",
      "url": "/media/conference/slides/6cj892G-automate-your-tasks-with-python-and-publish-with-chat-apps.pdf"
    }
  ],
  "speakers": [
    "Anton Chernikov"
  ],
  "tags": [
    "europython",
    "europython-2020",
    "europython-online",
    "Best Practice",
    "Community",
    "Operations",
    "Workforce",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/UIdKVF37g0o/hqdefault.jpg?sqp=-oaymwEZCNACELwBSFXyq4qpAwsIARUAAIhCGAFwAQ==&rs=AOn4CLCJvfzp_VtebyqL8YDSeOBRCb-0QA",
  "title": "Automate your tasks with Python and publish with Chat Apps",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UIdKVF37g0o"
    }
  ]
}
