{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "COVID-19: An experience of the Comptroller General of the State of Goiás\n\nThe Corona Virus - COVID-19 pandemic caused a significant impact on public services. In particular, it brought a massive digitalization of services that were offered in person. In addition, there was a great deal of pressure on official channels, whether to seek a service or to report a fact. Qualified and official information becomes an element in combating the pandemic. Knowing where to look for information, reporting a fact or getting a qualified response are essential steps to maximize the efficiency of the citizen's decision-making process, especially in a scenario of such uncertainty. The State has a fundamental role, whether as an inducer, executor or provider of the means necessary for information and decision-making to be effective at that time.\r\nConnected by the growing demand, the State of Goiás, through the State's Comptroller General, published a series of technological tools with the objective of bringing information to the citizen, promoting social control and improving public policies to fight the Coronavirus.\r\nThis document seeks to show how technological tools were adopted and implemented in terms of transforming the ombudsman channels in the State of Goiás through the State's Comptroller General in actions to combat the Coronavirus pandemic. The document seeks to show how the transformation of the ombudsman channels occurred through machine learning techniques and data visualization.",
  "duration": 1110.0,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2020.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "Talk URL",
      "url": "https://ep2020.europython.eu/schedule/24-july?selected=8taPNEQ-digital-transformation-in-the-fight-against-coronavirus"
    },
    {
      "label": "Slides",
      "url": "/media/conference/slides/8taPNEQ-digital-transformation-in-the-fight-against-coronavirus.pdf"
    }
  ],
  "speakers": [
    "Bruno Ferreira"
  ],
  "tags": [
    "europython",
    "europython-2020",
    "europython-online",
    "PyPi",
    "PyPy",
    "Python Skills",
    "Python general",
    "R"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/5J_tViVPl3I/hqdefault.jpg?sqp=-oaymwEZCNACELwBSFXyq4qpAwsIARUAAIhCGAFwAQ==&rs=AOn4CLCI-gtkvqIDGCHgwcWvFe8HIr6nQA",
  "title": "Digital Transformation in the fight against Coronavirus",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5J_tViVPl3I"
    }
  ]
}
