{
  "copyright_text": null,
  "description": "\"ScanAPI\nEuroPython 2020 - Talk - 2020-07-24 - Microsoft\nOnline\n\nBy Camila Maia\n\nIn the current IT scenario, the use of APIs is, without question, widely vast, popular, and significant. It seems at least prudent to ensure they are working properly, as expected. To guarantee the quality of the data that is being consumed or used. To ensure that communication between services is occurring as expected. To ensure the system does, in fact, what it should do.\n\nScanAPI is an open-source library that was created to solve all these points. ScanAPI provides an easy way to create integration tests for REST APIs via configuration files.\n\nThe three main reasons that led me to the creation of this library were:\n\nol\nTo be a firefighter in a scenario where most of the reported bugs were directly related to some API contract being broken or some endpoint having a behavior different from that expected by the consumer.\nTo need to deal with APIs with outdated or mistaken documentation.\nTo need to debug an endpoint in the middle of a \"\"chain\"\" of other endpoints. Where I needed to recreate a state that depends on the action of other endpoints.\n/ol\n\nGiven a fictitious example: debug an endpoint to reserve seats on an airplane, which depends directly on the previous call of an endpoint for user registration.\n\nThe ScanAPI is open-source and written in Python. However, it can be used in APIs created in any other programming language, since the tests provided by it are integration tests.\n\nWith ScanAPI you can:\n\n\nUse environment variables\nCreate variables\nChaining requests - making a request from a result of previous responses\nHide sensitive information of the requests and responses in the generated report\nWrite Python code - if you want, it's not necessary :)\n\n\nTopics I intend to address in this talk:\n\n\nMotivation to create the library\nWhat problems the library solves\nHow to test an API using a ScanAPI\nShow the documentation generated by ScanAPI\nAn overview of how it is implemented\nWhere it is currently being used\nNext steps\n\n\nProject Link: https://github.com/scanapi/scanapi\n\nPrerequisites:\n- Python\n- REST APIs\n- Integration tests\n\n\n\nLicense: This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n\n    \"",
  "duration": 1599.0,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2020.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "https://github.com/scanapi/scanapi",
      "url": "https://github.com/scanapi/scanapi"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "europython",
    "europython-2020",
    "europython-online"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/cypeJ3t5Uts/hqdefault.jpg?sqp=-oaymwEZCNACELwBSFXyq4qpAwsIARUAAIhCGAFwAQ==&rs=AOn4CLBtouZWh3svojuLFRkb7CHl9OXeLw",
  "title": "Camila Maia - ScanAPI",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cypeJ3t5Uts"
    }
  ]
}
