{
  "copyright_text": null,
  "description": "\"Accessible Python education for schoolgirls using Avocados, Zombies, and Korean!\nEuroPython 2020 - Talk - 2020-07-24 - Brian\nOnline\n\nBy Chiin-Rui Tan\n\nImagine this school scenario: an entire year group of students aged 11-12, the majority completely new to coding, undergoing 6 hours of compulsory lessons on Python for Scientific Computing.    \n\nNow imagine these outcomes: br /\n•   Students wanting to continue coding from the lessons outside of class in their own time br /\n•   Students asking to replicate the lesson computing environment at home br /\n•   Students disappointed for the lessons to come to an end and asking for more br /\n•   Students struggling in Science discovering intrinsic ability in computing, bringing new enjoyment and confidence     \n\nAnd lastly, imagine that all the students are girls!     \n\nThis talk will share this actual case study of a pioneering Python education initiative implemented at a secondary school for girls in London, UK for a cohort of 120 students.     \n\nThe audience will gain actionable insights of the factors that enabled these children to develop basic but working proficiency of a mainstream scientific data stack using typical school IT resources.    \n\nUltimately, this talk aims to increase awareness of Scientific Computing &amp; Data Science as potentially effective and empowering Python education for young people.\n\n\n\nLicense: This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n\n    \"",
  "duration": 2069.0,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2020.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "europython",
    "europython-2020",
    "europython-online"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/cZlBBGt7GHA/hqdefault.jpg?sqp=-oaymwEZCNACELwBSFXyq4qpAwsIARUAAIhCGAFwAQ==&rs=AOn4CLBSqwuK8fjYQiK2H74ddwR-tmhI3w",
  "title": "Chiin-Rui Tan - Accessible Python education for schoolgirls using Avocados, Zombies, and Korean!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cZlBBGt7GHA"
    }
  ]
}
