{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "Deceiving hackers to protect your resources\n\nImagine you are passing through an unknown street at midnight and you find that some anti-social elements are following you. To save yourself from them you start running and look for a safe place to hide. On the way, you will find a good person and requests him to help you. He hides you in his place to protect you. When these anti-social elements visit a good person’s place and enquire about you, the good person misguides them and redirects them to some other place in order to protect you. This is exactly how deception works. In this analogy, YOU are the resources to be protected, anti-social elements are the hackers who want to gain access to the resources, and a good person is a deception technique that protects the resources from hackers by making them fall in the trap.\r\n\r\nThe talk begins with an introduction to deception technology, deception types, and methods, a deceptive security life cycle. In this talk, we will demonstrate the following deception tools implemented using python language:\r\n•\tWebTrap (https://github.com/IllusiveNetworks-Labs/WebTrap): is designed to create deceptive webpages to deceive and redirect attackers away from real websites. The deceptive webpages are generated by cloning real websites, specifically their login pages.\r\n•\tDemonHunter (https://github.com/RevengeComing/DemonHunter):  is a distributed low interaction honeypot with Agent/Master design\r\nFinally, we will conclude the talk with how built a deception tool and demonstrate its working. \r\n\r\nHow we implemented a deception tool in python using machine learning:\r\nWe designed a deception tool in python language using PyBRAIN package to model and mitigate XPath injection attacks for web services. It is known that XML can be used to store the data and this data can be queried using XPath query language. XPath is a query language, it has injection issues similar to SQL. To handle this issue, we proposed a solution, which uses a count-based validation technique and Long Short-Term Memory (LSTM) modular neural networks to identify and classify atypical behavior in user input. Once the atypical user input is identified, the attacker is redirected to fake resources to protect the critical data. Our experiment resulted in over 90% accuracy in the classification of input vectors. \r\n\r\nOutline\r\n1. Introduction to deception, Deception types, Deception technology applicable methods and Deception Life cycle(08 Minutes)\r\n2. Demonstration of WebTrap deception tool(04 Minutes)\r\n3. Demonstration of DemonHunter deception tool(04 Minutes)\r\n4. Discussion of our deception tool and demonstration(06 Minutes)\r\n5. Conclusion and Questions(03 Minutes)\r\n\r\nAudience\r\nNo experience level of Python is needed. In general, anyone can attend this talk and learn about applying deception techniques and machine learning to application security.",
  "duration": 1232.0,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2020.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://github.com/IllusiveNetworks-Labs/WebTrap",
      "url": "https://github.com/IllusiveNetworks-Labs/WebTrap"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    },
    {
      "label": "https://github.com/RevengeComing/DemonHunter",
      "url": "https://github.com/RevengeComing/DemonHunter"
    },
    {
      "label": "Talk URL",
      "url": "https://ep2020.europython.eu/schedule/24-july?selected=7tSUej2-deceptive-security-using-python"
    },
    {
      "label": "Slides",
      "url": "/media/conference/slides/7tSUej2-deceptive-security-using-python.pdf"
    }
  ],
  "speakers": [
    "Gajendra Deshpande"
  ],
  "tags": [
    "europython",
    "europython-2020",
    "europython-online",
    "Beginners",
    "Machine-Learning",
    "Security",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/nR6hqmJ3GJM/hqdefault.jpg?sqp=-oaymwEZCNACELwBSFXyq4qpAwsIARUAAIhCGAFwAQ==&rs=AOn4CLBQql-rZHiMzzSG0htuaKOkY5X4XA",
  "title": "Deceptive Security using Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nR6hqmJ3GJM"
    }
  ]
}
