{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "What data scientist / ML engineer wants to do while software engineers are busy with CI/CD.\n\nAs software engineers work on CI/CD process as soon as they start a new project, data scientists and ML engineers define a pipeline for data as it flows through a typical workflow. Each step of the pipeline is fed data processed from its preceding step as CI/CD process starts from code changes. \r\n\r\n\"Pipelining ML project\" is sometimes misleading as it implies a large project with a group of engineers working on some large systems , being considered to be hard for an individual and unnecessary for a small project. Regardless of its size, having well organized pipelines for any ML projects is essential to succeed and actually it could be done easily with utilizing a proper tool.\r\n\r\nIn this talk, we will go through a machine learning workflow divided into a few steps composing a ML pipeline from data ingestion to model deployment. Each step depends on data produced by previous step, which are controlled by DVC. DVC is open-source version control system for data scientist and ML engineer helping them to organize data, models and experiments for some ML projects. The presentation will not only introduce how to use the tool but also show how to organize a ML pipeline with some examples. \r\n\r\nThe goal of this talk is to motivate data scientists and ML engineer to start building machine learning pipeline with DVC. Audience might expect a guide to using DVC  for automating the pipeline. Also I will give some explanation about concepts of machine learning related techniques necessary for understanding the pipeline. \r\n\r\nThis session is designed to be accessible to everyone in beginners level. Understandings of basic concepts of machine learning and version control system (preferably, Git) might be helpful but not mandatory for the audience.",
  "duration": 1779.0,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2020.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "Talk URL",
      "url": "https://ep2020.europython.eu/schedule/24-july?selected=CXG7TcM-automating-machine-learning-workflow-with-dvc"
    },
    {
      "label": "Slides",
      "url": "https://midnightradio.github.io/handson-dvc/talks/EP2020/slides.html"
    }
  ],
  "speakers": [
    "Hongjoo Lee"
  ],
  "tags": [
    "europython",
    "europython-2020",
    "europython-online",
    "Big Data",
    "Data",
    "Data Science",
    "Deployment/Continuous Integration and Delivery"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/u3NysDLdCR0/hqdefault.jpg?sqp=-oaymwEZCNACELwBSFXyq4qpAwsIARUAAIhCGAFwAQ==&rs=AOn4CLBJC3f6T5DJMimhdQfyC9hQ-9vKaQ",
  "title": "Automating machine learning workflow with DVC",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=u3NysDLdCR0"
    }
  ]
}
