{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "\"Best practices for production-ready Docker packaging\nEuroPython 2020 - Talk - 2020-07-23 - Brian\nOnline\n\nBy Itamar Turner-Trauring\n\nYou know the basics of packaging your Python application for Docker, but do you know enough to run that image in production? Bad packaging can result in security and production problems, not to mention wasted time try to debug unreproducible errors.\n\nAnd even if you figure out the best practices, there's still a huge number of details to get right, many of which interact with each other in unexpected ways. My personal list includes over 60 Docker packaging best practices, and it keeps growing. So where do you start? What should you do first?\n\nTo help you quickly package your application in a production-ready way, this talk will give you a plan to help you prioritize and iteratively implement these best practices, by starting with the highest priority best practices (security, automation), moving on the correctness and reproducibility, and finally focusing on optimization.\n\nTo make this process more concrete, along the way you'll also learn some of the techniques needed to build production-ready images:\n\n\nRunning as a non-root, for increased security.\nDebugging C crashes with faulthandler.\nFaster startup with pre-compiled .pycs.\nSmaller images by disabling pip caching.\nAvoiding Alpine Linux.\nAnd more!\n\n\nAt the end of the talk you'll also get some resources to teach you even more best practices that can't be fit in a 30-minute talk.\n\nThis talk is for Python programmers who know the basics of Docker packaging, and need to run the resulting images in a production environment.\n\n\n\nLicense: This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n\n\"",
  "duration": 1926,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    }
  ],
  "speakers": [
    "Itamar Turner-Trauring"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/H0UPw-ILiz4/sddefault.jpg",
  "title": "Best practices for production-ready Docker packaging",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=H0UPw-ILiz4"
    }
  ]
}
