{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "Lockdown Online Education for Children with Python Programming\n\nIn the last few weeks, one of the largest and most exciting experiments in the history of mankind has taken place, with over  900 million children in over 190 countries being the recipients of online (virtual) education. \r\n\r\nAnd in one corner of the globe in a high school in the UK,  Python Programming lessons in an entirely online medium were delivered for the 1st time as opposed to the then normal face-to-face mode of delivery. \r\n\r\nWe will see in this poster how the teaching of Python Programming in this online fashion was both delivered and received, for a group of children aged 11-14.\r\n\r\nWe will discuss how great efforts were made to ensure that the online sessions were fit-for-purpose, educational and at the same time exciting and fun. \r\n\r\nWe will discuss how we discovered the pleasant surprises and advantages of teaching on an online forum. \r\n\r\nWe will look at some of the  Python Programs, such as currency converters, modelling graphs using libraries, random password generaters, etc. produced by the children.\r\n\r\nTo conclude, it was a surprisingly pleasant experience for all concerned (i.e educators, students, parents, etc.) and we believe going forward the education system should also seriously  incorporate this medium of online learning, not just for adults but also for children.",
  "duration": 1613.0,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2020.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "Talk URL",
      "url": "https://ep2020.europython.eu/schedule/23-july?selected=taking-part-greatest-experiment-history"
    },
    {
      "label": "Slides",
      "url": "/media/conference/slides/taking-part-greatest-experiment-history.pdf"
    }
  ],
  "speakers": [
    "lil anonymous"
  ],
  "tags": [
    "europython",
    "europython-2020",
    "europython-online",
    "Education"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Nyypj0KYXaU/hqdefault.jpg?sqp=-oaymwEZCNACELwBSFXyq4qpAwsIARUAAIhCGAFwAQ==&rs=AOn4CLB5EmuZ2vZ7OZ8l69z2PzrjT2ByBw",
  "title": "Taking Part in the Greatest Experiment in History",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Nyypj0KYXaU"
    }
  ]
}
