{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "\"Everything You Know About MongoDB is Wrong!\nEuroPython 2020 - Talk - 2020-07-24 - Microsoft\nOnline\n\nBy Mark Smith\n\nMongoDB is webscale, right? It's a JSON database, it's eventually consistent, and you use map-reduce to query it. Oh, and it's insecure.\n\nLet me clear up some things: MongoDB is an ACID-compliant database with transactions, schemas &amp; relationships. It includes a powerful aggregation query language; map-reduce has been deprecated for some time now. MongoDB doesn't speak or store JSON, and nowadays it comes with pretty good security defaults (we think).\n\nThere are many myths around about MongoDB - what it is, how it works, and what it does wrong. Like any database product, you need to know its capabilities and how to get the best out of it. On top of this, the product has changed ema lot/em over the years, but lots of information out there hasn't caught up.\n\nI'll cover 8 myths around MongoDB, explain how they're wrong, why the myth originated in the first place (some of them weren't originally myths).\n\n\nWhat exactly emis/em MongoDB?\nWhat is the current release of MongoDB?\nMongoDB is emnot/em a JSON database.\nMongoDB emhas/em transactions.\nMongoDB allows relationships.\nYou should only consider sharding if you emmust/em.\nMongoDB emis secure/em.\nMongoDB stores your data reliably.\nMongoDB is a big product, with lots to learn.\n\n\nAlong the way, I'll explain some of MongoDB's best-kept secrets, and provide practical tips and tricks for using it. The audience will leave with a good idea of what MongoDB is, what it isn't, and how to best develop with it.\n\n\n\nLicense: This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n\n    \"",
  "duration": 1500,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ISfzI7LTDL4/sddefault.jpg",
  "title": "Mark Smith - Everything You Know About MongoDB is Wrong!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ISfzI7LTDL4"
    }
  ]
}
