{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "Develop your code effectively with well chosen tools\n\nIn this presentation I will show different packages that are used in Python. I will point out differences and explain the prons and cons of using them during code development. \r\n\tAfter that we will jump to the topic of virtualenvs and  popular tools that are used for managing them. I will explain what is purpose of the virtualenvs in Python and why we should use them.\r\n\tFinally we will focus on the most important topic without which development is not possible – package mangers. Package managers it is wide topic in Python world. There is many package mangers and  currently we have tools like pip, pipenv or poetry but it is not obvious which of them we should use in first place. Which of them are recommended to use? What are prons and cons of certain package mangers? Is there any other not well known packages mangers? How package mangers are packaging Python code? Which of the package mangers are good for data scientists? Is your package manger is resolving dependencies? \r\n\tThis questions can appear especially when you are beginner and just to want start working with Python. Unfortunately form the beginning you must face the problem which of the package manger you should use. In this presentation I will answer all of this questions. I will list popular package mangers and some not known. I will show differences and which of them are best for which case. Also I will explain differences between packages that are used by different packages mangers. If you are interested in code development and package mangers or you are just confused which of them you should use this presentation is definitely for you. During this presentation I will answer all questions and I will wipe out all doubts about packages, package mangers and virtualenvs.",
  "duration": 2692.0,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2020.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "Talk URL",
      "url": "https://ep2020.europython.eu/schedule/23-july?selected=AtuZz52-difficulties-of-python-code-developmentpackagesvirtualenvs-and-package-mangers"
    },
    {
      "label": "Slides",
      "url": "/media/conference/slides/AtuZz52-difficulties-of-python-code-developmentpackagesvirtualenvs-and_TgeSF5J.pdf"
    }
  ],
  "speakers": [
    "Michał Wodyński"
  ],
  "tags": [
    "europython",
    "europython-2020",
    "europython-online",
    "Beginners",
    "Conda / conda forge",
    "Development",
    "Packaging",
    "Virtual Env"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/NZ8K1GXI94M/hqdefault.jpg?sqp=-oaymwEZCNACELwBSFXyq4qpAwsIARUAAIhCGAFwAQ==&rs=AOn4CLCz64hJTHUoySRoAXKaqOwyxEVLzQ",
  "title": "Difficulties of Python code development:packages,virtualenvs and package mangers",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NZ8K1GXI94M"
    }
  ]
}
