{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "How hard can it be..? Let's find out..!\n\nOne of the best aspects of any conference, and EuroPython in particular, is the corridor track. It's when you walk around the physical conference venue and bump into an old buddy, find yourself striking up a conversation with a friendly co-attendee in the coffee queue, or join a huddle of welcoming folks discussing something interesting. The corridor track is where the community comes alive.\r\n\r\nHow do we remotely recreate the opportunity for chance encounters, unexpected conversation and exploration of a venue and new city with friends?\r\n\r\nWe already have a template for a solution: MUDs (multi-user dungeons/dimensions), back in the day, were hugely popular virtual worlds of text. I asked myself, \"what would a MUD written in 2020 look like?\". Then, rather foolishly, \"how hard can this be?\". Happily, I'd written a MUD in Python as a recent entry to PyWeek.\r\n\r\nThis talk describes how I initially created, extended and then refined my very own MUD, written in Python using asyncio, structlog, sly, redis and other fun technology. What's more, this MUD is special because it's a programmable MUD: it's really a multi-user development platform for on-the-fly coding of interactive virtual worlds.\r\n\r\nWhat could possibly go wrong..? Let's find out..!",
  "duration": 2690.0,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2020.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "Talk URL",
      "url": "https://ep2020.europython.eu/schedule/23-july?selected=AGaSaW8-how-to-run-a-corridor-track-in-a-remote-conference-with-python"
    },
    {
      "label": "Slides",
      "url": "https://ntoll.org/static/presentations/textsmith_ep2020/index.html#/"
    }
  ],
  "speakers": [
    "Nicholas Tollervey"
  ],
  "tags": [
    "europython",
    "europython-2020",
    "europython-online",
    "Conferences and Meet-Ups",
    "Fun and Humor",
    "Game-Development",
    "Python general"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/0FC5T396NVk/hqdefault.jpg?sqp=-oaymwEZCNACELwBSFXyq4qpAwsIARUAAIhCGAFwAQ==&rs=AOn4CLBzDSah8lXXT1Slw8R0BmNGusCsIg",
  "title": "How to Run a Corridor Track in a Remote Conference with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0FC5T396NVk"
    }
  ]
}
