{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "With PySimpleGUI everyone can build powerful GUI applications without a steep learning curve.\n\nIn the Python landscape, there are several high-end GUI packages. Of course, there’s tkinter which is part of the standard library. And there is wxPython and several versions of Qt. What they share is that they are very flexible but not only have a steep learning curve but also take considerable development effort to realize even a simple user interface.\r\nAt the other of the spectrum, there are several design tools that either generate code of a layout structure. In many cases, the functionality is rather limited, though.\r\nRelatively recent, an independent open-source developer (not me) has made a product that tries to bridge the gap between these two worlds: PySimpleGUI. This package runs on top of tkinter, QT for Windows, wxPython and Remi.\r\nIn this talk, I want to show the design methodology behind this fascinating product that might change the way people look at GUIs.\r\nI will start with live coding a simple yet not evident program that shows the basic concepts. With this, I will demonstrate the design philosophy.\r\nPySimpleGUI can also be used to implement a user-friendly interface as opposed to command-line interfaces.\r\nFrom there, I will give an overview of some more elements present in this package.\r\nFinally, I will show a full-featured GUI program with several bells and whistles.",
  "duration": 1661.0,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2020.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "Talk URL",
      "url": "https://ep2020.europython.eu/schedule/23-july?selected=6r2HrP8-attractive-guis-with-pysimplegui"
    },
    {
      "label": "Slides",
      "url": "/media/conference/slides/6r2HrP8-attractive-guis-with-pysimplegui.pdf"
    }
  ],
  "speakers": [
    "Ruud van der Ham"
  ],
  "tags": [
    "europython",
    "europython-2020",
    "europython-online",
    "Beginners",
    "General",
    "Human-Machine-Interaction",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/YIIlqIVBMek/hqdefault.jpg?sqp=-oaymwEZCNACELwBSFXyq4qpAwsIARUAAIhCGAFwAQ==&rs=AOn4CLBbSqQKQE3F_LFefQ53AUurR2bLkg",
  "title": "Attractive GUIs with PySimpleGUI",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YIIlqIVBMek"
    }
  ]
}
