{
  "copyright_text": "This video is licensed under the CC BY-NC-SA 3.0 license: https://creativecommons.org/licenses/by-nc-sa/3.0/\nPlease see our speaker release agreement for details: https://ep2020.europython.eu/events/speaker-release-agreement/\n",
  "description": "How to get your Data Scientists and Data Engineers to play nice, both now and in the future.\n\nThe goal of this talk is to introduce data pipeline developers to QuantumBlack's approach for keeping data pipelines healthy and sustainable and facilitating collaboration between data scientists and data engineers by using our open source framework, Kedro. Attendees need between novice and intermediate knowledge of Python (enough to understand syntactic sugar and funargs) in order to appreciate this talk.\r\n\r\nAs data continues to inform more and more business strategy, high quality, fully featured data pipelines have never been more critical. Small data scripts and single-coder science projects are not enough to keep up with the pace of day-to-day business and their ever-growing list of requirements. Now, more than ever, we need data engineers and data scientists to collaborate effectively. Yet, these two parties come with inherently competing needs.\r\n\r\nData scientists need high data volatility and parameterization, for experimentation, and data engineers, on the other hand, need stability and performance, to deliver data. Furthermore, as pipelines grow, the cost of knowledge transfer and training new team members also increases. How can we get scientists and engineers to work well together, and sustain pipeline growth as the team also grows?\r\n\r\nFor this, QuantumBlack created Kedro, a framework for writing data pipelines that addresses both the needs for flexibility and stability in its features and patterns of use. By using Kedro’s tools and operating model, we have enabled our teams to scale our single-developer, micro-pipes to industrial sized data processors with dozens of developers; all without sacrificing readability, quality, or stability. This talk will show you how.",
  "duration": 2011.0,
  "language": "eng",
  "recorded": "2020-07-23",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://ep2020.europython.eu/schedule/"
    },
    {
      "label": "Conference Website",
      "url": "https://ep2020.europython.eu/"
    },
    {
      "label": "https://creativecommons.org/licenses/by-nc-sa/3.0/",
      "url": "https://creativecommons.org/licenses/by-nc-sa/3.0/"
    },
    {
      "label": "https://ep2020.europython.eu/events/speaker-release-agreement/",
      "url": "https://ep2020.europython.eu/events/speaker-release-agreement/"
    },
    {
      "label": "Talk URL",
      "url": "https://ep2020.europython.eu/schedule/24-july?selected=45GhXwE-writing-and-scaling-collaborative-data-pipelines-with-kedro"
    },
    {
      "label": "Slides",
      "url": "/media/conference/slides/45GhXwE-writing-and-scaling-collaborative-data-pipelines-with-kedro.pdf"
    }
  ],
  "speakers": [
    "Tam-Sanh Nguyen"
  ],
  "tags": [
    "europython",
    "europython-2020",
    "europython-online",
    "Best Practice",
    "Data",
    "Development",
    "Open-Source",
    "python"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/4sCpfCiJLgs/hqdefault.jpg?sqp=-oaymwEZCNACELwBSFXyq4qpAwsIARUAAIhCGAFwAQ==&rs=AOn4CLB6Fyg8F83aKXGbPBStuQ8VIN2pEg",
  "title": "Writing and Scaling Collaborative Data Pipelines with Kedro",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4sCpfCiJLgs"
    }
  ]
}
