{
  "alias": "video/201/pycon-2009--python-for-teachers--and-teachers-of-",
  "category": "PyCon US 2009",
  "copyright_text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0",
  "description": "As a geek with Python kung fu, you have fun skills to share with others,\nincluding those still in high school and seeking to master mathematical\nconcepts that will serve them for a life time. In taking this tutorial,\nyou're opening a communications channel between yourself, and other\neager learners hoping to partake more deeply of open source culture and\nthe opportunities it offers. We know from last year that many PyCon\ndelegates are broadly interested in education track. This proposal\nattempts to support this demand by developing some publicly-accessible\nPython-related material that demonstrates how object-oriented\nprogramming be learned by using them to implement concepts from the\nmathematical domain. Learning can take place at multiple levels: Python\nand object-oriented concepts. Mathematical concepts, which will be\ndemonstrated in ways readily accessible to anyone who understands\nPython. Presentation of programming topics in the educational\nenvironment. From this latter point of view the pair teaching format can\nbe considered experimental. Its success or otherwise will be determined\nlargely by group dynamics, and our goal is to make the outcome in and of\nitself provide useful empirical data helpful to others planning\nworkshops.\n",
  "duration": null,
  "id": 201,
  "language": "eng",
  "quality_notes": "",
  "recorded": null,
  "slug": "pycon-2009--python-for-teachers--and-teachers-of-",
  "speakers": [],
  "summary": "",
  "tags": [
    "pycon",
    "pycon2009",
    "teaching"
  ],
  "thumbnail_url": "https://archive.org/services/img/pyvideo_201___pycon-2009-python-for-teachers-and-teachers-of-teachers-part-1-of-2",
  "title": "PyCon 2009: Python for Teachers (and Teachers of Teachers) (Part 1 of 2)",
  "videos": [
    {
      "type": "archive.org",
      "url": "https://archive.org/details/pyvideo_201___pycon-2009-python-for-teachers-and-teachers-of-teachers-part-1-of-2"
    },
    {
      "length": 1040201736,
      "type": "mp4",
      "url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pycon-us-2009/201_pycon-2009-python-for-teachers-and-teachers-of-teachers-part-1-of-2.mp4"
    }
  ]
}
