{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Amsterdam 2016\n\nThis talk is about two things: natural language processing (NLP) and statistical dependance. We will walk through the ins and outs of sentiment analysis in Python (mostly using NLTK) and a swift introduction to the statistics of dependence. We'll put these techniques to use on a dataset of every reddit public comment, perhaps the best data source for exploring the behavior of shouty Web comments.\n\nThis talk is about two things: natural language processing (NLP) and statistical dependence. We will embark on a data science workflow using various python scientific computing tools to better understand the behavior of commenters on Reddit. To do this we'll go through an introduction to sentiment analysis in Python (mostly using NLTK) and a swift explanation of the statistics of variable dependence.\n\nWe'll couple these freshly learned methods with an excellent dataset for this domain: every public reddit comment. We'll talk a bit about handling and preprocessing data of this size and character. Then we'll compile scores for both sentiment and spelling/grammar. In the end we may just discover if angry comment are also grammatically poor comments. And the audience will walk away a few more tools in scientific computing toolbelt.\n\nSlides available here:  https://speakerdeck.com/bfields/do-angry-people-have-poor-grammar-an-exploration-of-language-processing-and-statistics-in-python",
  "duration": 2442,
  "language": "eng",
  "recorded": "2016-03-26",
  "related_urls": [
    "https://speakerdeck.com/bfields/do-angry-people-have-poor-grammar-an-exploration-of-language-processing-and-statistics-in-python"
  ],
  "speakers": [
    "Ben Fields"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/EavxN5Iqjjw/maxresdefault.jpg",
  "title": "Do Angry People Have Poor Grammar?",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EavxN5Iqjjw"
    }
  ]
}
