{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Amsterdam 2016\n\nDescription\n\nIEPY is an open source tool to identify relations between entities described in natural language documents. This talk will show you what can you use it for, what it can and can not do, and describe some real world examples of its use. You should come if you're dealing with information extraction problems on text, and after the talk you'll know if IEPY is the tool for you and what you need to do.\n\nAbstract\n\nIEPY is an open source tool to identify entities and relations between them, as described in natural language documents. In other words, it is a tool for extracting structured information from unstructured sources. It was developed as a joint project between Machinalis and the Natural Language Processing research group of the University at Cordoba, Argentina. It recently won the 2015 Sadosky Award for \"Industry and Academy Collaboration Project\". IEPY is developed in python and can apply and mix rule based approaches, machine learning approaches, and manual tagging. It is actually designed to allow a hybrid approach (starting for rules, machine learning from that, using a human to clarify uncertain cases, and then integrate human answers in the machine learning model, etc). It includes the document store, learning engine, and a user interface to make it practical to provide manually tagged inputs by non-technical people. This talk will give an overview of what IEPY does (and general details on how it does it), but will be strongly focused on what kind of problems it is best applied to, what are the main situations where it can be challenging to implement it. I will support that description showcasing two of our main success cases: one analysis that was done over the techcrunch news articles to detect funding events, and one analysis done over military files from the last dictatorship in Argentina to help track people involved in human rights violations.",
  "duration": 1816,
  "language": "eng",
  "recorded": "2016-03-26",
  "related_urls": [],
  "speakers": [
    "Daniel F Moisset"
  ],
  "tags": [
    "iepy"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/w4P2N6Ybo7E/maxresdefault.jpg",
  "title": "Finding relations in documents with IEPY",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=w4P2N6Ybo7E"
    }
  ]
}
