{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Amsterdam 2016\n\nImagine that you are sitting in the operator room of a medium-size oil & gas production facility, such as at an offshore platform or an onshore gas plant, refinery, or chemical plant. This can include units like pipelines, compressors, pumps, heat exchangers etc. For each unit of this network several measured quantities (like pressure, temperature, flow, liquid levels, etc.) might be available (\n\nThis presentation is focused on the role of python for the design of new projects in the oil & gas world as well as for data processing for existing oil & gas production systems. During the design phase of a project, the key words are “uncertainty” and “risk management”. A reliable project must sustain difficult conditions (both internal and external) at an affordable cost. Sensitivities and statistics are the two most important arrows on the engineer’s quiver; these two tasks than can be massively automatized in python to increase the robustness and efficiency of the design.\n\nFor existing assets the difficult role of the engineers is to translate a raw mix of measured and simulated information, often with errors and missing data points, into decisions in a short time. A Jupyter notebook can be an excellent solution for a quick evaluation of the status, data processing and sharing of information.\n\nThis presentation gives an overview of the strategy in using python in our design and operations, as illustrated by a number of application examples.\n\nSlides available here: https://github.com/gpagliuca/pydata",
  "duration": 2210,
  "language": "eng",
  "recorded": "2016-03-26",
  "related_urls": [
    "https://github.com/gpagliuca/pydata"
  ],
  "speakers": [
    "Giuseppe Pagliuca"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/COpKs4w8y-Y/maxresdefault.jpg",
  "title": "The Role of Python in the Oil & Gas Industry",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=COpKs4w8y-Y"
    }
  ]
}
