{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Amsterdam 2016\n\nDescription\n\nWhat enables an effective data visualization to deliver insight at a glance? This talk presents practical techniques for how information visualization design can take better account of the fundamental limitations of visual perception, exploring the design choices that determine whether a picture can meaningfully convey the data set it is meant to represent.\n\nAbstract\n\nData deserves to be seen. In an information economy, there is no shortage of information; only genuine understanding is in short supply. Knowledge workers are continually asked to make sense of more information than they could possibly have time to read and assimilate. Users have come to demand insight at a glance: the whole picture, not just an endless list of results. After all, as information becomes ever more abundant, attention remains as scarce as ever. Visualization, animation, and interaction can be gainfully employed to develop information systems that are both useful, enabling users to get the job done well, and usable, empowering users to do job with ease. Effective information visualization should be immediately appealing to the eye and directly relevant to the task, routinely enjoyable to the user and uniquely valuable to the business. By integrating the power of computational analysis with the expertise of human judgment, visualization serves to turn aggregated information into actionable insight, illustrating the way numbers can tell a story compelling enough for people to make decisions they can trust.\n\nThis presentation explores practical techniques for information visualization design to take better account of the fundamental limitations of visual perception. It includes examples of innovative visualizations used in a variety of applications, including a research project for Grapeshot and IBM to create an online news analysis service that tracks the relative influence of different news sources on shaping how news coverage evolves over time.",
  "duration": 2457,
  "language": "eng",
  "recorded": "2016-03-26",
  "related_urls": [],
  "speakers": [
    "Mark Grundland"
  ],
  "tags": [
    "data visualization"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/nXMIi2k5qlk/maxresdefault.jpg",
  "title": "Winning Ways for Your Visualization Plays",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=nXMIi2k5qlk"
    }
  ]
}
