{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Amsterdam 2016\n\nDescription\n\nI will talk about network models in finance, and walk through real data and very visual examples using the pydata toolset - pandas, bokeh, pandas, networkx, ipywidgets. Special focus will be given to correlation networks, with applications to market characterization and portfolio risk management (as done in Pozzi 2013) using the latest available market data.\n\nAbstract\n\nIn the course of the 2008 Lehman and the subsequent European debt crisis, it became clear that both financial industry and regulators had underestimated the degree of interconnectedness and interdependency across financial assets and institutions. This type of information is especially well represented by network models, which had first gained popularity in computer science, biology and social sciences.\n\nThe study of network models in finance is already providing insight into the structure of the financial world and the economy. Network models are proving to be useful tools for providing early-warning signals of systemic risk (e.g. Squartini 2013), measuring liquidity and concentration risk, identifying sectors from time-series correlations (e.g. Fenn 2011) as well as insights into finding diversified baskets of assets in the classical investment framework (e.g. Pozzi 2013).\n\nI will provide an overview of some of the aforementioned work, and walk through (real data) examples using the pydata toolset. Special focus will be given to the study of correlation networks, with applications to portfolio risk management as in (Pozzi 2013) using the latest available market data. The examples make heavy use of pandas, bokeh, pandas, networkx, ipywidgets.",
  "duration": 1681,
  "language": "eng",
  "recorded": "2016-03-26",
  "related_urls": [],
  "speakers": [
    "Miguel Vaz"
  ],
  "tags": [
    "pandas",
    "bokeh",
    "networkx",
    "ipywidgets"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/pmWJlD-4gIc/maxresdefault.jpg",
  "title": "Networks meet Finance in Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pmWJlD-4gIc"
    }
  ]
}
