{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Amsterdam 2016\n\nDescription\n\nData cleaning is the first step of every Data Science project. Next one does Data Science. The talk covers a missing step of deployment and scaling Data Applications in production. We will go through all major steps of the process like Dockerizing application, Continuous Deployment with further AWS stack creation and rolling deploys although also covering new trends in Serverless architecture.\n\nAbstract\n\nData Science is quite a young field. One of the definitions of Data Scientist: Person who is better at statistics than any software engineer and better at software engineering than any statistician. Hence, it's quite important to talk not only about best practices of feature generation and not overfitting but also about more of software engineering topics.\n\nThe talk is based on our experience of Data Science developments at Stylight, an international fashion e-commerce company, that operates in 15 countries worldwide. We refer to our Data Applications written in R and Python, Scala; but the content is not limited to mentioned languages and applicable others.\n\nThe talk consists three main parts. A first part introduces best practices of development. How to structure your development, make deployment easy and reproducible, how to make Continuous Integration and commit triggered deployments. The second part covers production deployment to AWS stack, in particular focusing on concepts of immutable infrastructure and infrastructure as code. The last part about using serverless architecture for data applications. We introduce an example of our outlier detection system, that automatically scales based on such approach.",
  "duration": 2368,
  "language": "eng",
  "recorded": "2016-03-26",
  "related_urls": [],
  "speakers": [
    "Sergii Khomenko"
  ],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/48WchucU8UY/maxresdefault.jpg",
  "title": "From Data Science to Production - deploy, scale, enjoy!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=48WchucU8UY"
    }
  ]
}