{
  "copyright_text": "Standard YouTube License",
  "description": "PyData Amsterdam 2016\n\nWe'll talk about how the Jupyter Notebook has evolved from a Python specific tool to a general data science tool that supports many different languages, and about our own experiences in supporting a wide variety of languages for data science. We'll also demonstrate some of the new features and ideas being developed in and around the project.\n\nJupyter notebooks have become an invaluable tool for all kinds of data science. Originally developed as part of the IPython project, notebooks have evolved from a Python specific tool to support many programming languages; more than 50 different execution kernels have now been published. For all of these languages, notebooks are a way to record and describe a data science workflow, and then share it, publicly or privately, allowing the recipients to easily modify and execute the code.\n\nWe’ll describe the architectural changes and decisions involved in the transition to supporting multiple languages, as well as our own experience in supporting data science languages ranging from C++ to R to Bash. You’ll also get a high-level understanding of how to create a new kernel, if a language you’re excited about is not yet supported.\n\nWe’ll also highlight some of the current development work taking place in and around Jupyter, including redesigned UI, mechanisms for collaboration on notebooks, ways to share live, executable notebooks online, and projects that reuse the Jupyter machinery in different user interfaces.\n\nSlides available here: https://docs.google.com/presentation/d/1PHnnkKYgjq1lcSDaVyhZP0Fs7qC70iA07b2Jv0uisUE/edit?usp=sharing",
  "duration": 2559,
  "language": "eng",
  "recorded": "2016-03-26",
  "related_urls": [
    "https://docs.google.com/presentation/d/1PHnnkKYgjq1lcSDaVyhZP0Fs7qC70iA07b2Jv0uisUE/edit?usp=sharing"
  ],
  "speakers": [
    "Thomas Kluyver",
    "Min Ragan Kelley"
  ],
  "tags": [
    "jupyter notebook"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/T385txAYSt8/maxresdefault.jpg",
  "title": "Jupyter: Notebooks in Multiple Languages for Data Science",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=T385txAYSt8"
    }
  ]
}