{
  "description": "Motivacion Python es un excelente lenguaje para empezar a programar, una gran herramienta para empezar tu carrera profesional como software developer, data scientist, o machine learning engineer. Pero, después de que aprendiste la sintaxis básica y querés empezar a construir tus propios proyectos, seguramente te encontraste con el \"virtualenv dilema\". ¿Qué es un virtualenv? ¿Cómo encaja conmigo? ¿Por qué necesito un virtualenv? Hoy el ecosistema Python tiene varias herramientas para resolver este \"dilema\". Voy a hacer un breve repaso por las herramientas actuales que los devs, científicos de datos, e ingenieros de Machine Learning están usando actualmente. Table of contents Introduction: 2’ About me: 2’ What is a virtualenv?: 3’ Why do I need a virtualenv?: 3’ Tools: 1’ venv module: 5’ pipenv: 5’ poetry: 5’ pyenv: 5’ docker: 5’ Other tools: 4’ Q&A: 5’\n\nDisertante: LeCoVi\nI’m a python user since 2013. I’m a Python Argentina NGO founder and treasurer. I’ve been PyConAR co-organizer since 2016. I’m currently working at Mercado Libre as a Manager, one of my Teams are the Python Ecosystem team, who are responsible to maintain the internal Python tools used mainly with security and machine learning. I’m an IT professional and teacher with more than 15 years of experience.\n\nhttps://eventos.python.org.ar/events/pyconar2021/activity/465/",
  "duration": 1686,
  "language": "eng",
  "recorded": "2021-10-25",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://eventos.python.org.ar/events/pyconar2021/"
    },
    {
      "label": "https://eventos.python.org.ar/events/pyconar2021/activity/465/",
      "url": "https://eventos.python.org.ar/events/pyconar2021/activity/465/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "pyar",
    "pycon",
    "pyconar",
    "pyconar2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/EKFe6HtcBa8/maxresdefault.jpg",
  "title": "PyConAr 2021 - Understanding Python virtualenvs.",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EKFe6HtcBa8"
    }
  ]
}
