{
  "description": "Actualmente existen diversas técnicas en el área de deep learning que nos aportan un grado de comprensión distinto de las imágenes. En este caso, hablaremos de Segmentación semántica: Está técnica nos permitirá etiquetar cada pixel de la imagen con con la clase que está representando. Durante esta charla repasaremos el estado del arte dentro de este campo, desde los modelos tradicionales como U-Net hasta la utilización de Vision-Transformers. A continuación, mostraremos como podemos entrenar nuestro modelo con Pytorch para que reconozca órganos en imágenes médicas. Finalmente, comentaremos distintas técnicas de optimización que aplicaremos a nuestro modelo para que sea capaz de realizar predicciones en dispositivos IoT como Jetson-nano, raspberry-pi y Azure Percept.\n\nDisertante: Rodrigo Cabello Malagón\nResearch Engineer en Plain Concepts y Microsoft MVP en la categoría de Inteligencia Artificial. Apasionado de las últimas tecnologías y todo lo que tenga relación con el área de la inteligencia artificial. Actualmente me encuentro desarrollando proyectos de Visión por computación que hacen uso de técnicas de Deep Learning.\n\nhttps://eventos.python.org.ar/events/pyconar2021/activity/479/",
  "duration": 1569,
  "language": "eng",
  "recorded": "2021-10-27",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://eventos.python.org.ar/events/pyconar2021/"
    },
    {
      "label": "https://eventos.python.org.ar/events/pyconar2021/activity/479/",
      "url": "https://eventos.python.org.ar/events/pyconar2021/activity/479/"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "pyar",
    "pycon",
    "pyconar",
    "pyconar2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/_FUuqRtdwWY/maxresdefault.jpg",
  "title": "PyConAr 2021 - Segmentación de imágenes médicas en dispositivos IoT",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_FUuqRtdwWY"
    }
  ]
}
