{
  "description": "Todos conocemos la gran variedad de formatos utilizados hoy en día: el predominante Adobe PDF (una extensión de PostScript), los formatos Microsoft Office tan populares (Word, Excel, PowerPoint), páginas web HTML, archivos XML (que, aún estando bien estructurados, contienen etiquetas arbitrarias por diseño), entre decenas más. El problema está en que la gran mayoría de estos formatos no fueron diseñados para facilitar la extracción de texto, o más precisamente, de texto estructurado. Y, aunque todo el mundo está de acuerdo en que la inteligencia artificial puede transformar el texto procesado en conocimiento a grandes escalas, todavía no fuimos capaces de resolver el problema de cómo lograr alimentar este texto a los modelos de inteligencia artificial de forma robusta. (¡El primer paso, y uno fundamental!) Lógicamente, uno podría escribir un script aislado para, por ejemplo, extraer el texto de PDFs similares (facturas de un mismo proveedor), o de una página HTML, o incluso de redes sociales. Pero eso es ineficiente y no escala. ¿Qué ocurriría si existiese una forma de modelar el proceso de ingestión tal que nuevos modelos puedan ser agregados y los existentes puedan ser actualizados con gran facilidad? Mejor aún, ¿qué pasaría si dicho framework estuviese disponible para todo aquel que necesite extraer texto de documentos desestructurados? Con esto en mente, Ingestum fue diseñado para enfrentar tres desafíos: * Facilitar la escritura de scripts para extraer contenido desestructurado de fuentes y formatos arbitrarios * Proveer un framework para extraer contenido de el diverso universo de formatos fuente existente * Permitir la integración con scripts y servicios de Python con distintos niveles de granularidad.\n\nErnestina Plate y Martin Abente Lahaye\nErnestina es estudiante de tercer año de Ingeniería Informática [1]. Fue medallista de oro de la Olimpiada Nacional de Matemática de Paraguay, y participó en la Olimpiada Internacional de Matemática y la Olimpiada Iberoamericana de Matemática. Mentora en talleres de programación con Python. Actualmente, es desarrolladora de Ingestum en Sorcero [2]. \nMartín es miembro de la Fundación GNOME y de Sugar Labs [3], donde contribuye con el desarrollo de aplicaciones de escritorio para educación y privacidad. Previamente, fue Ingeniero en Software para One Laptop Per Child, Líder del desarrollo del escritorio Sugar para Linux, Mentor en los programas Summer of Code y Code-in de Google, Ingeniero en Software para el sistema operativo Endless, entre otras cosas. Actualmente, lidera el desarrollo de Ingestum en Sorcero. \n[1] https://www.linkedin.com/in/ernestinaplate\n[2] https://www.sorcero.com\n[3] https://www.linkedin.com/in/tchx84\n\nhttps://eventos.python.org.ar/events/pyconar2021/activity/459/",
  "duration": 1645,
  "language": "eng",
  "recorded": "2021-10-27",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://eventos.python.org.ar/events/pyconar2021/"
    },
    {
      "label": "https://eventos.python.org.ar/events/pyconar2021/activity/459/",
      "url": "https://eventos.python.org.ar/events/pyconar2021/activity/459/"
    },
    {
      "label": "https://www.sorcero.com",
      "url": "https://www.sorcero.com"
    },
    {
      "label": "https://www.linkedin.com/in/ernestinaplate",
      "url": "https://www.linkedin.com/in/ernestinaplate"
    },
    {
      "label": "https://www.linkedin.com/in/tchx84",
      "url": "https://www.linkedin.com/in/tchx84"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "pyar",
    "pycon",
    "pyconar",
    "pyconar2021"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/ivJmQ8YREac/maxresdefault.jpg",
  "title": "PyConAr 2021 - Ingestum: Tu ingesta sana de datos con Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ivJmQ8YREac"
    }
  ]
}
