{
  "id": 1327, 
  "category": "EuroPython 2012", 
  "slug": "complex-and-social-network-analysis-in-python", 
  "title": "Complex and social network analysis in Python", 
  "summary": "[EuroPython 2012] E Franchi - 3 JULY 2012 in \"Track Ravioli\"\n\n", 
  "description": "A complex network is a network that has non trivial topological properties,\ni.e., properties hinting the presence of elaborate relationships among the\nactors, opposed to simple networks such as regular lattices or random graphs.\nExamples of complex networks are most social, technological or biological\nnetworks, such as the internet, the web, a professional network, the nervous\nsystem of an animal or the contact network of any social networking system.\nNetwork analysis has many practical applications, e.g., ranking or grouping\nitems on the basis of their position in the network, and is also the basis of\nsome collective intelligence and data mining techniques. Recently network\nanalysis is also applied to security problems in the form of trust networks.\nAlong with the basic concepts, working Python code is presented, both using\nexisting network analysis Python tools and numeric packages. The focus is\nmainly placed on code, which will be shown and discussed together with the\ntheory, with the idea that running code and simulations are easier to\nunderstand that formal maths. Since complex network datasets are typically\nhuge, some high-level optimization techniques are also discussed. Although\nformulas are kept at the minimum, some maths skills are required along with\nbasic knowledge of the Python programming language.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Standard YouTube License", 
  "thumbnail_url": "http://i.ytimg.com/vi/m4OHUDsNrLo/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=m4OHUDsNrLo", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=m4OHUDsNrLo", 
  "tags": [], 
  "speakers": [
    "E Franchi"
  ], 
  "recorded": "2012-07-04"
}