{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2012", "speakers": ["R Dopieralski"], "title": "Hands on with Pygame", "quality_notes": "", "video_flv_length": null, "recorded": "2012-07-04", "video_mp4_length": null, "description": "PyGame continues to be Python’s most popular 2D game library, even though\nthere is growing competition from more modern OpenGL-based libraries. It is\nstill an excellent way to learn how our favorite games work internally and to\nwrite similar games ourselves. During this tutorial I want to introduce the\nbasics of using PyGame to create interactive, animated graphical applications\n(such as games), and then help the participants make their own start at a\nsimple adventure game, which they can later develop further into projects of\ntheir own. I want to concentrate on commonly used techniques and patterns in\ngame development, which are useful no matter what library is used in the\nimplementation. In particular I will be discussing animations, tile-based\nmaps, collision detection, event systems, internal representation of game\nstate and different approaches to code organisation and internal structure of\ngames. I have previously created a (much simpler) tutorial for creating a\nturn-based tile-based PyGame game and a couple of games, such as Z-Day and\nJelly . I will be using the materials and experiences from those projects in\nthe tutorial. Please bring your laptop with Python 2.7 and PyGame installed.\n\n", "video_mp4_url": null, "tags": [], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=fm78gjYkYKc", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2012] R Dopieralski - 3 JULY 2012 in \"Track Pizza Napoli\"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/fm78gjYkYKc/hqdefault.jpg", "video_flv_url": null}