{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2012", "speakers": ["Alex Martelli"], "title": "Permission or forgiveness?", "quality_notes": "", "video_flv_length": null, "recorded": "2012-07-04", "video_mp4_length": null, "description": "Grace Murray Hopper’s famous motto, “It’s easier to ask forgiveness than\npermission”, has many useful applications – in Python, in concurrency, in\nnetworking, as well of course as in real life. However, it’s not universally\nvalid. This talk explores both useful and damaging applications of this\nprinciple. I start by introducing the motto “It’s easier to ask forgiveness\nthan permission” and the woman who used it, Rear Admiral Grace Murray Hopper,\nalso known as the “mother of Cobol” and the author of the first ever\nprogramming-language compiler. I then move on to the Python context, where the\nmotto supports the proper usage of exception-catching rather than preliminary\nchecks; and the “rule that proves the exception” introduced by abstract base\nclasses. Expanding the subject, I show how “optimistic concurrency” applies\nthat motto (while locking would “ask permission”, in essence, STM “asks\nforgiveness\"), and how collision-detection focused networking protocols have\nsimilarly triumphed over more highly structured, “ask permission” ones like\ntoken-ring. Moving to the fuzzier context of real life, I then show how this\ndaring approach does not work quite as well as in the technical realm – except\nwhen applied correctly, in the right circumstances… and I try to evince a\ngeneral law describing what the right circumstances for its application are,\ncomparing and contrasting with the similar issue of “do it right the first\ntime” versus “launch and iterate” (and the latter’s cognate “fail, but fail\nfast” principle).\n\n", "video_mp4_url": null, "tags": [], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=9gbUFyPltDs", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2012 ] Alex Martelli - 2 JULY 2012 in \"Track Spaghetti\"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/9gbUFyPltDs/hqdefault.jpg", "video_flv_url": null}