{
  "id": 1309, 
  "category": "EuroPython 2012", 
  "slug": "pypedia-a-python-development-environment-on-a-wi", 
  "title": "Pypedia: a python development environment on a wiki", 
  "summary": "[EuroPython 2012] A Kanterakis - 4 JULY 2012 in \"Track Tagliatelle\"\n\n", 
  "description": "In this talk we present PyPedia. PyPedia is an effort to host a Python\nprogramming environment in a MediaWiki content management system. The concept\nis similar to any wiki except that each article contains the documentation,\npython source code and unit tests for a known and well defined computational\nproblem. Through an article, a user can edit the source code, download it,\nexecute it locally, in a remote computer through SSH, or in Google App Engine\n(GAE). Moreover, through a python package users can import PyPedia methods in\ntheir local python environment. In the source code, a developer can simply\ncall a function or instantiate a class that is defined in another article. In\nevery code edit, the article’s unit-tests are evaluated in GAE before saving.\nA special parameters section allows editors to build an HTML form within the\narticle that help fellow users to execute the method as a simple online\nservice. Articles are divided in two categories: User and Main. In User\narticles, the creator of the article manages the edit privileges of each\nsection. Any non-deliberately malicious content is allowed. Main articles are\nselected from the pool of User articles that exhibit highly qualitative\ncontent and can be edited only by trusted users. All content is under the\nsimplified BSD license. The vision of this project is to create an\nencyclopedia of documented, executable and verifiable python implementation of\ncommon algorithms or computational problems through the development of a vivid\ncommunity. Specialized or user aware content is also encouraged in the User\nnamespace. The source code of PyPedia is available under the GPL v.3 license.\nAvailability: [http://www.pypedia.com](http://www.pypedia.com) Video\ndemonstration: [http://www.youtube.com/watch?v=25jMEivICD8](http://www.youtube\n.com/watch?v=25jMEivICD8)\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Standard YouTube License", 
  "thumbnail_url": "http://i.ytimg.com/vi/di3csK0Wsik/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=di3csK0Wsik", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=di3csK0Wsik", 
  "tags": [], 
  "speakers": [
    "A Kanterakis"
  ], 
  "recorded": "2012-07-04"
}