{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2012", "speakers": ["Antonio Cuni"], "title": "Python white magic", "quality_notes": "", "video_flv_length": null, "recorded": "2012-07-04", "video_mp4_length": null, "description": "Python is a powerful language. Beginners appreciate its surface of simplicity\nand ease to use, where (almost) everything “just works” (TM) as expected.\nHowever, under the hood, there is a whole world of rules and layers which can\nbe (ab)used by experienced programmers to tweak the language in unexpected\nways. Often, these techniques are labeled as “hacks” or “black magic”, to\nindicate that they should not used in production or that you should not look\nat it unless you are “initiated” to some not better specified sorcery.\nHowever, if used with care and in the right places, these techniques can lead\nto better, faster and/or more readable code, or can be extremely useful during\ndebugging, and thus deserve the definition of “white magic” which programmers\ncan use to improve their code. Moreover, looking at how they are implemented\nis a good way to learn about some of the deep corners of the language. This\ntalk presents some of these advanced techniques which I have seen in use in\nreal code, e.g. in PyPy or pdb++. Including, but not limited to: creating new\nfunctions by reusing existing code objects, instantiating multiple copies of\nthe same module, playing with metaclasses in various ways, changing the\n__class__ of an object on the fly to get specialized behavior, automatically\nentering the debugger when a certain event occur, etc.\n\n", "video_mp4_url": null, "tags": [], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=WqVMZnefnO8", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2012] Antonio Cuni - 3 JULY 2012 in \"Track Spaghetti\"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/WqVMZnefnO8/hqdefault.jpg", "video_flv_url": null}