{
  "id": 1319, 
  "category": "EuroPython 2012", 
  "slug": "tornado-in-depth", 
  "title": "Tornado in Depth", 
  "summary": "[EuroPython 2012] O Vilaplana - 3 JULY 2012 in \"Track Tagliatelle\"\n\n", 
  "description": "Tornado is a non-blocking light-weight web server and framework. There’s been\nmany introductory talks about it, and it’s time to look deeper into it: not\njust what Tornado does, but how it does it and what can we learn from it when\ndesigning our own concurrent systems. We’ll cover each topic in two parts:\nfirst we’ll see how to use a certain feature in our applications; then, we’ll\ndig into Tornado’s source code to see how it really works. How much time we’ll\nspend in the “how to use” will depend on the audience’s knowledge of Tornado.\nGetting Started: quickly get a simple Tornado application up and running.\nWe’ll keep digging into, changing and poking this Application for most of the\ntalk. An Application Listens: what an Application is, how does Tornado start\nit and how does it process its requests. Application and IOLoop: we’ll look at\nhow the IOLoop receives the connections from the users and passes them on to\nthe Applications. Scheduled Tasks: we’ll see how to schedule tasks and how the\nIOLoop will run them. Generators: we’ll learn to use generators to handle the\nresponses of our asynchronous calls, and how they work with the IOLoop.\nWebsockets: how to use them and how they work. IOStream: how do Tornado’s non-\nblocking sockets work. Database: how to use non-blocking sockets to connect to\na MySQL or MongoDB database.\n\n", 
  "quality_notes": "", 
  "language": "English", 
  "copyright_text": "Standard YouTube License", 
  "thumbnail_url": "http://i.ytimg.com/vi/4Ztq-Yz1ero/hqdefault.jpg", 
  "duration": null, 
  "videos": [
    {
      "url": "http://www.youtube.com/watch?v=4Ztq-Yz1ero", 
      "length": 0, 
      "type": "youtube"
    }
  ], 
  "source_url": "http://www.youtube.com/watch?v=4Ztq-Yz1ero", 
  "tags": [], 
  "speakers": [
    "O Vilaplana"
  ], 
  "recorded": "2012-07-04"
}