{"whiteboard": "", "video_mp4_download_only": false, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "EuroPython 2012", "speakers": ["Christian Theune"], "title": "What i learned from big web app deployments", "quality_notes": "", "video_flv_length": null, "recorded": "2012-07-04", "video_mp4_length": null, "description": "The requirements and expectations towards deployment and operations are\nadvancing at an incredible pace. Especially the DevOps community encourages\nand demonstrates how system administrators can leverage methods from other\nareas of expertise to achieve classical goals: fewer outages, more\nflexibility, lower cost, higher security standards, improved reproducability\nand overall increased quality. The hosting of complex, traffic-intensive web\napplications nowadays requires a solid and flexible infrastructure: you need\nto take care of all the homework first before going into the nitty gritty\ndetails of your specific application. My talk shall demonstrate the aspects we\nmeet on the infrastructure and service level when deploying and operating\ncomplex services. I’ll show-case how we approach the problems we face to\nprepare for an ever-improving future. As many people and companies are\nexperimenting with different approaches today, I’d love to spawn a separate\ndiscussion, maybe in an open space, to talk about why you do something\ndifferent from us and what your experiences are. The topics will specifically\ninclude: infrastructure versus service, data center operations, make-or-buy,\nautomation, virtualisation, monitoring, help desk, SLAs, deployment checklist,\nstaging, secrets, HTTP/S termination, load balancing, reporting As you can\nsee, the talk’s topics are mainly focused on methods and lines of thought.\nHowever, if you’re interest in tools - I will also mention the following on a\nvarying level of detail: puppet,\n\n    haproxy, nginx, apache, varnish, supervisor, cron, Linux, DELL, ProCurve, KVM, Nagios, RT, fabric, zc.buildout, batou\n\n", "video_mp4_url": null, "tags": [], "copyright_text": "Standard YouTube License", "related_urls": [], "video_flv_download_only": false, "source_url": "http://www.youtube.com/watch?v=ENnI2FU3EV4", "video_webm_url": null, "video_ogv_length": null, "video_ogv_url": null, "language": "English", "video_webm_length": null, "summary": "[EuroPython 2012] Christian Theune - 3 JULY 2012 in \"Track Lasagne\"\n\n", "thumbnail_url": "http://i.ytimg.com/vi/ENnI2FU3EV4/hqdefault.jpg", "video_flv_url": null}