{"whiteboard": "", "video_mp4_download_only": true, "video_webm_download_only": false, "duration": null, "video_ogv_download_only": false, "category": "PyCon US 2013", "speakers": ["Tavis Rudd"], "title": "Using Python to Code by Voice", "quality_notes": "", "video_flv_length": null, "recorded": "2013-03-17", "video_mp4_length": null, "description": "Two years ago I developed a case of Emacs Pinkie (RSI) so severe my hands went numb and I could no longer type or work. Desperate, I tried voice recognition. At first programming with it was painfully slow but, as I couldn’t type, I persevered. After several months of vocab tweaking and duct-tape coding in Python and Emacs Lisp, I had a system that enabled me to code faster and more efficiently by voice than I ever had by hand.\r\n\r\nIn a fast-paced live demo, I will create a small system using Python, plus a few other languages for good measure, and deploy it without touching the keyboard. The demo gods will make a scheduled appearance. I hope to convince you that voice recognition is no longer a crutch for the disabled or limited to plain prose. It’s now a highly effective tool that could benefit all programmers. ", "video_mp4_url": "http://s3.us.archive.org/nextdayvideo/psf/pycon2013/Using_Python_to_Code_by_Voice.mp4?Signature=8iV87JN7k7IweE10nJanN%2FAUdVY%3D&Expires=1363825863&AWSAccessKeyId=FEWGReWX3QbNk0h3", "tags": ["talk"], "copyright_text": "CC", "related_urls": [{"url": "https://github.com/tavisrudd", "description": "Tavis's github account"}], "video_flv_download_only": false, "source_url": "https://www.youtube.com/watch?v=8SkdfdXWYaI", "video_webm_url": "", "video_ogv_length": null, "video_ogv_url": "", "language": "English", "video_webm_length": null, "summary": "I dictate my code using a voice recognition system with Python embedded in it.  In a fast paced live demo, I will code a small system and deploy it without touching the keyboard. I hope to convince you that voice recognition is no longer a crutch for the disabled or limited to plain prose.", "thumbnail_url": "http://i1.ytimg.com/vi/8SkdfdXWYaI/hqdefault.jpg", "video_flv_url": ""}