{
  "copyright_text": null,
  "description": "My brain is different. The regions involved in concentration, impulse\ncontrol, inhibition, and motor activity are smaller than usual; Like\nsomewhere between 5% and 12% of adults I have ADHD. Even if you do not\nhave the disorder yourself you probably work, live or know someone who\ndoes. But the world is not designed for people with ADHD, so to be\nsuccessful I’ve had to develop techniques to keep my concentration and\nprocrastination in check.\n\n-  What is ADHD?\n-  How can we change our workspaces to help focus\n-  Being more productive without burning out\n-  Communicating as a team without interrupting flow\n\n    This talk is not just for those people with ADHD, although they will\n    benefit as well. It is for anyone whose job requires long bouts of\n    focus or “flow”. The primary audience of the talk will be\n    programmers, but it will also benefit team leads, product managers,\n    and technical writers.\n\n    There is no specialist knowledge required to understand this talk. I\n    do give a brief overview of the start of what ADHD is to establish\n    context, but the talk focuses on productivity, not psychiatry.\n\n    I hope people will leave with ideas about how they can make their\n    workplace, their team and themselves more productive, less stressed\n    and distracted, and ultimately more happy in their jobs.\n\nin \\_\\_on **Friday 20 April** at 16:45 `**See\nschedule** </en/sprints/schedule/pycon9/>`__\n",
  "duration": 2556,
  "language": "eng",
  "recorded": "2018-04-20",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Aaron Bassett"
  ],
  "tags": [
    "process",
    "wetware",
    "mental health",
    "productivity"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/RhtXHI5KRzw/maxresdefault.jpg",
  "title": "When your wetware has too many threads - Tips from an ADHDer on how to improve your focus",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RhtXHI5KRzw"
    }
  ]
}
