{
  "copyright_text": null,
  "description": "Data Visualization charts are supposed to be our map to information.\nHowever, when making charts, customarily we are just re-sizing lines and\ncircles based on metrics instead of creating data-driven version of\nreality. The contemporary charting techniques have a few shortcomings\n(especially when dealing with high-dimensional dataset):\n\n-  Context Reduction: in order to fit a high-dimensional dataset into a\n   chart one needs to filter/ aggregate/ flatten data which results in\n   reduction of full context of information. Without context most of the\n   charts show only a part of the story, that can potentially lead to\n   data misinterpretation/misunderstanding.\n-  Numeric Thinking: naturally humans have hard time perceiving big\n   numbers. While data visualization is suppose to help us to\n   conceptualize large volumes, unless the dataset is carefully\n   prepared, 2D charts rarely give us the intuitive grasp of magnitude.\n-  Perceptual de-humanization: when examining charts it is easy to\n   forget that we are dealing with activity in real world instead of\n   lines/bars.\n\nAugmented/Mixed Reality can potentially solve all of the issues listed\nabove by presenting an intuitive and interactive environment for data\nexploration. Three dimensional space provides conditions to create\ncomplex data stories with more “realistic assets” (beyond lines and\nbars). The talk would present the architecture required to create MR\ndata visualization story with Python (70% of architecture), starting\nwith drawing 3D assets in a data-driven way and finishing with\ndeployment on MR devices.\n\nin \\_\\_on **venerdì 20 aprile** at 17:30 `**See\nschedule** </p3/schedule/pycon9/>`__\n",
  "duration": 1148,
  "language": "eng",
  "recorded": "2018-04-20",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Anna Nicanorova"
  ],
  "tags": [
    "DataExploration",
    "DataAnalysis",
    "DataVisualization"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/MhNcE7jXrcY/maxresdefault.jpg",
  "title": "Data Visualization in Mixed Reality with Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MhNcE7jXrcY"
    }
  ]
}
