{
  "copyright_text": null,
  "description": "Il Talk è rivolto a sviluppatori Python intermedi. Non è richiesta\nnessuna conoscenza su Elasticsearch.\n\nNell’introduzione presenteremo le librerie elasticsearch-py e\nelasticsearch- dsl introducendo i concetti base di ElasticSearch.\nSaranno prima presentate le metodologie di indicizzazione per\nottimizzare la ricerca su grandi quantità di dati, mostrando come\ninserire i propri dati nel motore di ricerca.\n\nDopo passeremo alle query (dal text search alle geo queries ) e relative\naggregazioni, facendo vedere come estrarre informazioni dai dati in\nmaniera veloce e migliorare così la user experience.\n\nIn seguito saranno presentate funzionalità di ricerca avanzate,\nspiegando come arricchire le proprie webapp con le funzionalità\ndinamiche di “search as you type”, autocompletamento e suggerimento.\n\nInfine mostreremo come utilizzare tecniche di Data Analytics avanzate\ncome il NLP: analizzando i testi sarà possibile fare “language\ndetection”, “text classification” e “keyword extraction”. In tal modo\nnon solo si può trovare velocemente cosa si sta cercando, ma analizzare\ncommenti e recensioni per capire se i clienti sono soddisfatti.\n\nin \\_\\_on **domenica 22 aprile** at 14:45 `**See\nschedule** </p3/schedule/pycon9/>`__\n",
  "duration": 1880,
  "language": "ita",
  "recorded": "2018-04-22",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Dario Balinzo"
  ],
  "tags": [
    "nlp",
    "nosql",
    "Python",
    "bigdata",
    "elasticsearch",
    "Full Text Search"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/t39lnVSROpQ/maxresdefault.jpg",
  "title": "Python e Elasticsearch: dal Text Search a NLP e oltre",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=t39lnVSROpQ"
    }
  ]
}
