{
  "copyright_text": null,
  "description": "TL;DR\n\nWhen you go full Big Data at public data and become a citzen.\n-------------------------------------------------------------\n\nAudience type: developers, data scientists of any level of expertise.\n\nAfter a political coup Brazil drowned in scandals and political\ndisbelief. That was the final straw for us.\n\nWe created a bot persona who uses Machine Learning to analyze public\nspending, launching our own data journalism investigations. As expected\nwe use the internet publicize our findings and icing on it was to use\nTwitter to directly engage the public and politicians under the topic of\nsuspicious expenses.\n\nCome with me and I’ll show some figures from Brazilian corruption, share\nsome code and cherry-pick the best of our toolbox to deal with public\ndata and machine learning. I’ll introduce our public dashboard that\nmakes visualization and browsing government data easy peasy. And surely\nwe can take a look in some tweets from Rosie, the robot, and how some\npoliticians are now vociferating with a ROBOT on social media.\n\nAnd you guessed it right: everything is open-source and our mission is\nto create a global community to bring democracy to the A.I. age.\n\nin \\_\\_on **sabato 21 aprile** at 18:30 `**See\nschedule** </p3/schedule/pycon9/>`__\n",
  "duration": 2246,
  "language": "eng",
  "recorded": "2018-04-21",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Felipe Cabral"
  ],
  "tags": [
    "machine-learning",
    "Python",
    "agile",
    "Data Mining",
    "bigdata",
    "data-visualization",
    "OpenSource",
    "data-analysis",
    "e-gov",
    "data"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/JiJ5a4CXRF8/maxresdefault.jpg",
  "title": "Using Python to bring democracy to the A.I. age",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JiJ5a4CXRF8"
    }
  ]
}
