{
  "copyright_text": null,
  "description": "**Slides:**\n\n`Using votes to combine\nrankings <https://slides.com/ferranmuinos/deck#/>`__\n\n**Abstract:**\n\nHow to best combine the outcome of several ranked data into a single,\nmeaningful consensus ranking is a recurrent problem in scientific data\nanalysis. Particularly, in genome data analysis we are often bound to\nmerge ranked data arising from separate statistical analyses.\n\nTraditional blending strategies applied in the field rely on techniques\nto combine statistical significance, but this approach on its own has\nbeen associated with a number of caveats.\n\nWe hereto present a voting-based heuristics implemented in Python which\nleverages both Schulze’s voting algorithm and optimization techniques to\ncombine rankings upon credibility scores inferred from prior knowledge.\nThis rationale can be used alongside state-of-the-art methods to\nsystematically incorporate prior knowledge, thereby leading to more\ninterpretable outcomes. The scope of the method is quite general and may\nbe of use in other data analysis contexts.\n\n**Contributors:**\n\nPresenter: `Ferran Muiños <https://goo.gl/QDCMf3>`__\n\nAuthors of the work: `Ferran Muiños <https://goo.gl/QDCMf3>`__,\n`Francisco Martínez-Jiménez <https://goo.gl/weg7Nh>`__\n\n**Focus:**\n\nTo showcase a scientific data analysis problem arising from the study of\ncancer biology and how we approached it by implementing our own tool in\nPython.\n\n**Target Audience:**\n\nThe talk aims to a broad Python audience. Minimum Python fluency is\nrequired. Acquaintance with basic notions of data analysis may be\nhelpful to best follow the talk.\n\nin \\_\\_on **venerdì 20 aprile** at 16:45 `**See\nschedule** </p3/schedule/pycon9/>`__\n",
  "duration": 2315,
  "language": "eng",
  "recorded": "2018-04-20",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Ferran Muiños"
  ],
  "tags": [
    "Python",
    "statistics",
    "genetics",
    "bio-informatics",
    "data-analysis"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/Y759HZI7JJo/maxresdefault.jpg",
  "title": "Voting-based Ranking Combination using Python",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Y759HZI7JJo"
    }
  ]
}
