{
  "copyright_text": null,
  "description": "The Max Planck Computing and Data Facility is engaged in the development\nand optimization of algorithms and applications for high performance\ncomputing as well as for data-intensive projects. As programming\nlanguage in data science, Python is now used at MPCDF in the scientific\narea of “atom probe crystallography” (APT): a Fourier analysis in 3D\nspace can be simulated in order to reveal composition and\ncrystallographic structure at the atomic scale of billions APT\nexperimental data sets.\n\nThe Python data ecosystem has proved to be well suited to this, as it\nhas grown beyond the confines of single machines to embrace scalability.\nThe talk aims to describe our approach to scaling across multiple GPUs,\nand the role of visualization methods too.\n\nOur data workflow analysis relies on the GPU-accelerated Python software\npackage PyNX, an open source library which provides fast parallel\ncomputation scattering. The code takes advantage of the high throughput\nof GPUs, using the pyCUDA library.\n\nExploratory data analysis, high productivity and rapid prototyping with\nhigh performance are enabled through Jupyter Notebooks and Python\npackages e.g., pandas, matplotlib/plotly. In production stage,\ninteractive visualization is realized by using standard scientific tool,\ne.g. Paraview, an open-source 3D visualization program which requires\nPython modules to generate visualization components within VTK files.\n\nin \\_\\_on **sabato 21 aprile** at 14:45 `**See\nschedule** </p3/schedule/pycon9/>`__\n",
  "duration": 2043,
  "language": "eng",
  "recorded": "2018-04-21",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Giuseppe Di Bernardo"
  ],
  "tags": [
    "GPUComputing",
    "visualization",
    "mathematical-modelling",
    "image-processing",
    "bigdata",
    "matplotlib",
    "analytics",
    "data-visualization",
    "data-analysis",
    "Data Mining",
    "scientific-computing",
    "physics",
    "python3"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/wSHdhJc165s/maxresdefault.jpg",
  "title": "GPU-accelerated data analysis in Python: a study case in Material Sciences",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wSHdhJc165s"
    }
  ]
}
