{
  "copyright_text": null,
  "description": "Genropy è il framework che Softwell ha realizzato per scrivere le\nproprie applicazioni gestionali e che è offerto in licenza LGPL agli\nsviluppatori che cercano un robusto ambiente per portare in tecnologia\nweb SPA (Single Page Application) procedure complesse e, in particolare,\nprocedure legacy.\n\nCon Genropy è stato poi creato Erpy, un moderno ERP che offre agli\nutenti un’esperienza d’uso analoga a quella desktop ma con tutti i\nbenefici di un ambiente web.\n\nErpy mette a disposizione una contabilità completa, la contabilità\nindustriale, fatturazione, magazzino e, soprattutto, offre la base\nideale per scrivere gestionali su misura.\n\nNel corso del Talk vedremo il casi d’uso di CUSL, una realtà che opera\ncon punti vendita nelle università milanesi per offrire agli studenti la\npossibilità di acquistare a prezzi scontati i testi scolastici e il\nmateriale ausiliario.\n\nBasandoci su Erpy sono state personalizzate le procedure ERPY per\nadeguarsi alle necessità specifiche e sono state create numerose\nprocedure ex novo. In particolare la procedure per effettuare la vendita\ne le prenotazioni da più sedi, gestire la richiesta merce alla sede\ncentrale, gestire le caparre per le prenotaioni, stampare gli scontrini\nfiscali, gli scontrini di reso, utilizzare come metodi di pagamento i\ncontanti, i pos, satispay e 18App.\n\nIl sistema consente inoltre di gestire gli ordini delle sedi periferiche\nal magazzino centrale, il raggruppamento degli ordini dalle sedi per\ncreare gli ordini a fornitori, la gestione dell’arrivo merce da\nfornitore e il successivo invio alle sedi periferiche. Il sistema\nprovvede inoltre a inviare automaticamente le mail a chi ha delle\nprenotazioni in corso per procedere al ritiro. Il tutto è completato poi\ncon numerose procedure ausiliarie e statistiche. Le operazioni di\nvendita, sia per corrispettivi che per fattura, rientrano\nautomaticamente nel sistema contabile e danno luogo a tutti gli\nadempimenti di legge.\n\nNel corso del talk vedremo i dettagli della procedura e mostreremo\nalcuni snippet di codice per dar modo di capire come sia semplice ed\nimmediato creare questo tipo di applicazioni con Genropy.\n\nin \\_\\_on **venerdì 20 aprile** at 14:30 `**See\nschedule** </p3/schedule/pycon9/>`__\n",
  "duration": 2289,
  "language": "ita",
  "recorded": "2018-04-20",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Giovanni Porcari"
  ],
  "tags": [
    "Erpy",
    "genropy",
    "gestionali"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/JMus67jDSCg/maxresdefault.jpg",
  "title": "Erpy e Genropy. Gestione punti vendita",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JMus67jDSCg"
    }
  ]
}
