{
  "copyright_text": null,
  "description": "You might have heard of Machine Learning from your co-worker or in a local meetup and are enticed to get started but not sure how to take that first step. Confused between different sources, where to start from or how to proceed given a particular problem statement or dataset, then this talk is for you. It is aimed at complete beginners ( maybe you? ) who are just starting in machine learning and are ready to commit.\nThe talk will go something like this - each of the following items will be explained how it’s useful and why we should use it. Then alongside showcase, that same step applied to the real example(dataset) of that particular item so that the audience will be able to grasp the idea. It will add to around 35 minutes leaving us with 10 minutes for Q&A.\n1) Context ( 5 mins ):\nDiscuss why we need Machine Learning and how we can use Machine Learning in different domains.\n2) Resources ( 3 mins):\nTalks about the dataset availability, online competitions, and Open Source libraries such as Scikit-learn, Matplotlib, Keras.\n3) Jupyter Notebook (25 mins):\nThis Jupyter notebook will be a great starting point for most Supervised Machine Learning projects that involve common tasks: a) Imports and data loading (2 mins )\nb) Data Exploration (5 mins)\nc) Data Cleaning (3 mins)\nd) Feature Engineering (4 mins)\ne) Model Exploration (6 mins)\nf) Final Model Building and Prediction ( 5 mins)\n4) Wrap up ( 2 mins ):\nFinalizing my talk, sharing some tips etc.\n5) Q&A ( 10 mins ):\nQuestion and Answering with the Audience.\nHope to inspire the audience to get started with machine learning, explore different domains, to learn, to create and engage with the Machine Learning Community.",
  "duration": 1629,
  "language": "eng",
  "recorded": "2018-04-21",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Laksh Arora"
  ],
  "tags": [
    "data-analysis",
    "data-visualization",
    "Python",
    "scikit-learn",
    "matplotlib",
    "analytics",
    "scipy",
    "machine-learning",
    "data",
    "Statistical Learning"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/60ZLDsUEehM/maxresdefault.jpg",
  "title": "Hacking Your Way Into Machine Learning",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=60ZLDsUEehM"
    }
  ]
}
