{
  "copyright_text": null,
  "description": "Parlare di inclusività e tematiche di genere è ormai una moda.\nAffrontare il tema donne che lavorano nell’industria IT con toni\ntragici, come si trattasse di esseri mitologici, lo è ancora di più.\nCome passare oltre il “velo di Maya” e bypassare la disinformazione?\n\nNel 2015 insieme alla community Python Italiana abbiamo gettato le basi\nper portare in Italia Django Girls, workshop nato per contribuire a\ncolmare quel gender gap di cui si parla tanto. In tre anni di “duro\nlavoro” come organizzatrice di laboratori in Italia, sono entrata in\ncontatto con oltre 400 donne appassionate di tecnologia: studentesse di\ningegneria informatica, architetti, insegnanti, casalinghe, web\ndesinger. E anche con sviluppatori pronti a supportare la causa ( sì,\npotete essere una “Django Girl” anche se avete la barba) che hanno\ncontribuito a far crescere la community con il loro entusiasmo.\n\n45 minuti per conoscere la mission Django Girls, entrare in contatto con\nla community italiana e per sfatare i falsi miti. Un talk entry level\nper tutti, per chi è interessato a portare il progetto nella propria\ncittà, per chi vorrebbe fare il coach e per chi semplicemente vorrebbe\nsapere di più sull’iniziativa.\n\nin \\_\\_on **sabato 21 aprile** at 12:00 `**See\nschedule** </p3/schedule/pycon9/>`__\n",
  "duration": 1434,
  "language": "ita",
  "recorded": "2018-04-21",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Laura Bartoli"
  ],
  "tags": [
    "women",
    "inclusion",
    "diversity",
    "django"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/33n-Wb1bpzU/maxresdefault.jpg",
  "title": "Django Girls Italia: entrare in contatto con le donne tecnologiche, davvero",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=33n-Wb1bpzU"
    }
  ]
}
