{
  "copyright_text": null,
  "description": "L’istruzione tecnica è stata introdotta ai tempi della rivoluzione\nindustriale anche in funzione della necessità di avere operai\nspecializzati, una volta formato l’operaio svolgeva pressoché la stessa\nmansione per tutta la vita. Dalla Rivoluzione Industriale a oggi, il\nlavoro si è evoluto in modo considerevole. Tuttavia, queste grandi\ntrasformazioni del passato sono state graduali, mentre oggi i\ncambiamenti sono repentini, trasversali e dirompenti. La formazione\nscolastica è rimasta ancorata a schemi tradizionali. Il fine ultimo\ndella scuola dovrebbe essere quello di fare uscire ragazzi\nintraprendenti e capaci di trarre soddisfazione dallo stesso\napprendimento, e le esperienze di alternanza scuola-lavoro nelle aziende\nassumono un ruolo importante per la loro formazione, per le soft skill,\nper mantenere alto l’interesse, per rendere lo studente protagonista e\nconsapevole.\n\nQuesta è la storia di un gruppo di studenti di un istituto tecnico\nsuperiore, appassionati di Python e provenienti da esperienze di\nalternanza e di partecipazione alle conferenze di comunità, che hanno\nimmaginato di sviluppare autonomamente Panino Digitale, un’applicazione\nbasata sul framework Django, con cui gli studenti possano prenotare il\npanino al bar della scuola. Per realizzarla concretamente, hanno\ncoinvolto i loro docenti, condiviso l’idea con la loro comunità\nscolastica, raccolto nuovi contributori tra i loro compagni, e chiesto\nsupporto, affiancamento e strumenti alla community Python e ai suoi\nmembri.\n\nin \\_\\_on **sabato 21 aprile** at 12:45 `**See\nschedule** </p3/schedule/pycon9/>`__\n",
  "duration": 2724,
  "language": "ita",
  "recorded": "2018-04-21",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Mauro Angioni"
  ],
  "tags": [
    "Python",
    "istruzione",
    "community",
    "django"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/iLCQO9huLPA/maxresdefault.jpg",
  "title": "Panino Digitale: una applicazione pratica di educazione creativa",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iLCQO9huLPA"
    }
  ]
}
