{
  "copyright_text": null,
  "description": "Python è presente da alcuni anni nella scuola italiana. Alcuni licei\nscientifici e alcuni istituti tecnici lo utilizzano come linguaggio di\nintroduzione alla programmazione grazie alla sua immediatezza e\nsemplicità sintattica, utile in una fase in cui l’attenzione è\nconcentrata sugli algoritmi e sui fondamenti di un linguaggio di\nprogrammazione.\n\nIl passo successivo potrebbe essere quello di insegnare con Python anche\nil secondo livello classico della programmazione: la programmazione ad\noggetti. La programmazione di videogiochi e la libreria Pygame offrono\nla possibilità di rendere questo passaggio relativamente semplice e\nsicuramente interessante. Inoltre, la possibilità di affrontare\ntematiche concrete e reali come quelle legate alla programmazione di\nvideogiochi 2D permette di capire la “logica” e l’importanza di un\napproccio object oriented. In particolare, il concetto di sprite ben si\npresta ad essere preso come “modello” di classe.\n\nL’intervento presenta i risultati di una sperimentazione didattica\nsvolta presso l’ITI Marconi di Verona. Il talk parte dalle basi della\nprogrammazione di videogiochi 2D (game loop, immagini, suoni, double\nbuffering, sprite…) e dei moduli principali di Pygame per arrivare a\ncostruire un semplice ma non banale videogioco in stile “arcade”.\n\nLink slides:\nhttps://docs.google.com/presentation/d/13HSMniO6ttSIN1-NdBcjo9Kez-B7-5szl-\ngT8gYOO5U/edit?usp=sharing\n\nin \\_\\_on **Friday 20 April** at 15:15 `**See\nschedule** </en/sprints/schedule/pycon9/>`__\n",
  "duration": 3273,
  "language": "ita",
  "recorded": "2018-04-20",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Maurizio Boscaini",
    "Alessandro Marchioro"
  ],
  "tags": [
    "game-development",
    "programming-paradigms",
    "Python",
    "libraries",
    "games",
    "Pedagogical learning"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/bzcRoFx4gKg/maxresdefault.jpg",
  "title": "Pygame torna a scuola",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bzcRoFx4gKg"
    }
  ]
}
