{
  "copyright_text": null,
  "description": "Continuous Delivery is the automation of our deployment and QA, isn’t\nit? The industrialized software production chain that solves all our\nproblems. Well, kind of. It’s more than that. Because: You still have\npain when …\n\n-  You bring new developers on board (e.g. for installing Docker and\n   friends, IDEs and command line tools).\n-  Your development machine behaves weird or needs an upgrade. (Can you\n   simply re-install it and continue working without losing a day or a\n   week of productivity?)\n-  You need to explain to your colleagues, or even convince them, how to\n   configure which of their tools?\n-  Everyone turns to you (or your admin wizard) when there are troubles\n   to get some tools or projects running.\n\nThis talks explains how to bootstrap a super-efficient startup, SMB, or\njust any development team that needs a development infrastructure.\nYou’ll see a demo of The Foreman, Puppet, Ansible and optionally FreeIPA\nand virtualization technology, which gets you from zero to 100 in just a\nfew hours. This talk explains how you do infrastructure like software\ndevelopment. Everything under control. Everything under version control.\n\nCome join the show, and take home the recipe that tells you how to step\nup the next level of Continuous Delivery! - If you’re a beginner fear\nnot: this talk starts with an introduction to CI/CD and brings you up to\nspeed quickly.\n\nin \\_\\_on **Sunday 22 April** at 15:30 `**See\nschedule** </en/sprints/schedule/pycon9/>`__\n",
  "duration": 2279,
  "language": "eng",
  "recorded": "2018-04-22",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Peter Bittner"
  ],
  "tags": [
    "infrastructure",
    "continuous-delivery",
    "agile",
    "ansible",
    "puppet",
    "free-software",
    "FreeIPA",
    "infrastructure-as-code"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/31-sNh7llJ8/maxresdefault.jpg",
  "title": "Continuous Delivery starts at your Development Environment",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=31-sNh7llJ8"
    }
  ]
}
