{
  "copyright_text": null,
  "description": "Audience Level Data Scientists and Data Science Practitioners with basic\nto intermediate level experience in image recognition/object detection\ndeep learning applications, basic Python programming skills.\n\nBrief Description Deep Learning is revolutionizing both Data Science and\nArtificial Intelligence real-world applications. Yet, being the\ndiscipline so young, it’s not straightforward to understand both the\nreasoning at its core and its countless use cases. In this talk we will\nreview the basics of Neural Networks, from the classical CNNs to the\ncurrent state of the art, comparing them through real industry\napplications and highlighting pros and cons in a business setting.\n\nAbstract / Summary Deep Learning has been on a hype roll for a few\nyears. Being such a young discipline makes deep learning interesting,\nbut also subject to misunderstandings. Every year, brand new\narchitectures rise, taking over old ones and outperforming state of the\nart benchmarks for accuracy. Further, the applications of deep learning\nare at the core of some of the most advanced technologies like\nautonomous driving, personal assistants, and customer profiling. In such\na context it is not straightforward to grasp what is at the core of deep\nlearning itself, and what is common to all the architectures, neither to\nrealize how concrete use cases can be tackled. Using Python, we’ll take\nthe audience from the simplest neuron, the atom of the deep learning\nworld, to the most recent architectures. We’ll achieve this using a\nsimple Convolutional Neural Network as a building block and comparing\nthat to the latest breakthroughs in image recognition. In doing this\nwe’ll try to give an answer to the following questions: • Is deep\nlearning actually useful in a business setting? • What about state of\nthe art techniques in the Computer Vision field: are we just stacking\nmore and more convolutional and pooling layers? We will then address\nreal industry applications (e.g. the insurance sector) using analyzed\ntechniques. This will include opening some of these so- called black box\nmodels and retraining them, at least partially, on our datasets, or\nbuilding a complete brand new network from scratch, tailoring it\naccording to the application needs and datasets characteristics.\n\nin \\_\\_on **sabato 21 aprile** at 17:45 `**See\nschedule** </p3/schedule/pycon9/>`__\n",
  "duration": 1953,
  "language": "eng",
  "recorded": "2018-04-21",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Rocco Michele Lancellotti",
    "Gennaro Di Brino"
  ],
  "tags": [
    "image-recognition",
    "transfer-learning",
    "industry applications",
    "deep learning",
    "Deep-Learning",
    "ComputerVision",
    "computer vision",
    "image recognition",
    "transfer learning",
    "industry-applications"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/8gl4No490gQ/maxresdefault.jpg",
  "title": "Deep Learning in Computer Vision: state of the art techniques and applications in industry",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8gl4No490gQ"
    }
  ]
}
