{
  "copyright_text": null,
  "description": "A primer on the Ethereum Blockchain and Smart Contracts using Python and\nSerpent\n\nThe Blockchain technology is an ingenious invention that has gained a\nlot of momentum and public attention in the recent years. In this talk\nwe are going to quickly review the basic concepts behind this\ntechnology, starting from its very first implementation: The Bitcoin\nBlockchain. We will look into the core technology components the base of\nBitcoin, which are its strengths and limitations. We will then discuss\nhow the Ethereum project tries to overcome these limitations introducing\nthe Turing complete Ethereum Virtual Machine and advanced Smart\nContracts, giving developers the power to build any kind of applications\non top of the Ethereum blockchain.\n\nAfter this small theoretical introduction, we will explore what are the\nPython tools that you need to use to interact with the Ethereum\nblockchain and develop Smart Contracts. Many of the tools to interact\nand develop with the Ethereum blockchain are built with Python. We will\nlearn which are the basic tools used to run a blockchain locally on our\nlaptops going through the installation and preparation process to get a\nfull Ethereum node up and running on our local machine. Serpent is one\nof the languages of choice when building Smart Contracts in Ethereum and\nit is heavily inspired by Python. We will learn how to write a simple\nSmart Contract, test it and deploy it to our local running blockchain.\n\nFor this talk it is required just basic Python knowledge. Some basic\ntheoretic blockchain foundations are preferred to get a clear\nunderstanding of the second part of the talk, but not strictly\nnecessary.\n\nin \\_\\_on **domenica 22 aprile** at 14:45 `**See\nschedule** </p3/schedule/pycon9/>`__\n",
  "duration": 2650,
  "language": "eng",
  "recorded": "2018-04-22",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Stefano Fioravanzo"
  ],
  "tags": [
    "blockchain"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/_qElFSQA1KE/maxresdefault.jpg",
  "title": "A primer on the Ethereum Blockchain and Smart Contracts using Python and Serpent",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_qElFSQA1KE"
    }
  ]
}
