{
  "copyright_text": null,
  "description": "Empathy is a fundamental part of human interaction. When we communicate\nby email or at conferences, or indirectly, when we create products,\nevents, or do a talk. However, our understanding of other people is full\nof error, and worse, bias. This can lead us to make communities and\nproducts that work poorly for people that are different from ourselves,\nintroduce confusion and misunderstanding, exclude people\nunintentionally, and sometimes even cause harm.\n\nHowever, our communities are an opportunity to learn as well. To embrace\nour diversity, and expand our understanding of other people’s worlds. To\ngain understanding of other people’s situations, experiences and\nemotions, which can be dramatically different to ours. And how we can\nuse this to create both products and communities which work great not\nonly for ourselves, but also those that we more easily forget about. As\ncreators in tech we have such tremendous power to create change, but\nmerely our best intentions will not be enough for that.\n\nThis talk will explore how and why we sometimes have such difficulty to\nunderstand others, and how others can have difficulty to understand us.\nWe’ll talk about why other people’s experiences, emotion and perceptions\ncan be so different. Both for the world as a whole, but also with the\nspeaker’s personal experiences. Finally, we’ll cover specific ways for\nus to understand others better, and associated pitfalls, to make our\ncommunities and products happy, inviting and supportive places.\n\nin \\_\\_on **sabato 21 aprile** at 15:30 `**See\nschedule** </p3/schedule/pycon9/>`__\n",
  "duration": 3054,
  "language": "eng",
  "recorded": "2018-04-21",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Sasha Romijn"
  ],
  "tags": [
    "empathy",
    "diversity",
    "community"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/FU688R_1Th4/maxresdefault.jpg",
  "title": "Helping communities & products thrive by fostering empathy",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FU688R_1Th4"
    }
  ]
}
