{
  "copyright_text": null,
  "description": "*Reproducibility* - the ability to recompute results — and\n*replicability* — the chances other experimenters will achieve a\nconsistent result[1]- are among the main important beliefs of the\n*scientific method*.\n\nSurprisingly, these two aspects are often underestimated or not even\nconsidered when setting up scientific experimental pipelines. In this,\none of the main threat to replicability is the *selection bias* , that\nis the error in choosing the individuals or groups to take part in a\nstudy. Selection bias may come in different flavours: the selection of\nthe population of samples in the dataset ( *sample bias* ); the\nselection of features used by the learning models, particularly sensible\nin case of high dimensionality; the selection of hyper parameter best\nperforming on specific dataset(s). If not properly considered, the\nselection bias may strongly affect the validity of derived conclusions,\nas well as the reliability of the learning model.\n\nIn this talk I will provide a solid introduction to the topics of\nreproducibility and selection bias, with examples taken from the\nbiomedical research, in which reliability is paramount.\n\nFrom a more technological perspective, to date the scientific Python\necosystem still misses tools to consolidate the experimental pipelines\nin in research, that can be used together with Machine and Deep learning\nframeworks (e.g. ``sklearn`` and ``keras``). In this talk, I will\npresent ``reproducible-learn``, a new Python frameworks for reproducible\nresearch to be used for machine and deep learning.\n\nDuring the talk, the main features of the framework will be presented,\nalong with several examples, technical insights and implementation\nchoices to be discussed with the audience.\n\nThe talk is intended for *intermediate* PyData researchers and\npractitioners. Basic prior knowledge of the main Machine Learning\nconcepts is assumed for the first part of the talk. On the other hand,\ngood proficiency with the Python language and with scientific python\nlibraries (e.g. ``numpy``, ``sklearn``) are required for the second\npart.\n\n– `1 <http://www.pnas.org/content/112/6/1645.full>`__ *Reproducible\nresearch can still be wrong: Adopting a prevention approach* by Jeffrey\nT. Leek, and Roger D. Peng\n\n`2 <https://www.cancer.gov/publications/dictionaries/cancer-terms?CdrID=44087>`__\nDictionary of Cancer Terms -> “selection bias”\n\nin \\_\\_on **sabato 21 aprile** at 18:30 `**See\nschedule** </p3/schedule/pycon9/>`__\n",
  "duration": 2497,
  "language": "eng",
  "recorded": "2018-04-21",
  "related_urls": [
    {
      "label": "Conference schedule",
      "url": "https://www.pycon.it/p3/schedule/pycon9/"
    }
  ],
  "speakers": [
    "Valerio Maggio"
  ],
  "tags": [
    "Deep-Learning",
    "Reproducibility",
    "Machine Learning"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/x4qNIQKtxVo/maxresdefault.jpg",
  "title": "Reproducibility, and Selection Bias in Learning: when just Cross Validation is not enough!",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=x4qNIQKtxVo"
    }
  ]
}
