{
  "description": "[Aladin](https://aladin.cds.unistra.fr/aladin.gml) allows to visualize images of the sky or planetary surfaces just as an astronomical \"\"openstreetmap\"\" app. The view can be panned and explored interactively. In the [ipyaladin widget](https://github.com/cds-astro/ipyaladin) -- that brings Aladin in the Jupyter Notebook environnement -- these abilities are extended with a python API. The users can send astronomical data in standard formats back and forth the viewer and their Python code. Such data can be images of the sky in different wavelengths, but also tabular data, complex shapes that characterize telescope observation regions, or even special sky features (such as probability region for the provenance of a gravitational event).\n\nWith these already existing features, and current work we are doing with the new development framework `anywidget`, `ipyaladin` is really close to a version 1.0.0. It is already used in its beta version in different experimental science platforms, for example in the ESCAPE [European Science Cluster of Astronomy & Particle Physics](https://projectescape.eu/) project and in the experimental [SKA](https://www.skao.int/en/science-users) (Square Kilometre Array, a telescope for radio astronomy) analysis platform.\n\nIn this presentation, we will share our feedback on the development of a widget thanks to `anywidget` compared to the bare `ipywidget` framework. And we will demonstrate the functionalities of the widget through scientific use cases.\n\nhttps://github.com/ManonMarchand/pydata2024\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1813,
  "language": "eng",
  "recorded": "2024-09-25",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/paris2024"
    },
    {
      "label": "https://github.com/cds-astro/ipyaladin",
      "url": "https://github.com/cds-astro/ipyaladin"
    },
    {
      "label": "https://github.com/ManonMarchand/pydata2024",
      "url": "https://github.com/ManonMarchand/pydata2024"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://projectescape.eu/",
      "url": "https://projectescape.eu/"
    },
    {
      "label": "https://www.skao.int/en/science-users",
      "url": "https://www.skao.int/en/science-users"
    },
    {
      "label": "https://aladin.cds.unistra.fr/aladin.gml",
      "url": "https://aladin.cds.unistra.fr/aladin.gml"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/L8TUCZlku00/sddefault.jpg",
  "title": "Baumann & Marchand - Visualization of the sky in Notebooks: the ipyaladin widget extension",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=L8TUCZlku00"
    }
  ]
}
