{
  "description": "Embark on a journey to explore how Quarto Dashboard can enhance the narrative of your analysis from your Jupyter Notebook. This talk will show how to create cool interactive charts and graphs that bring your data to life, by using Quarto - an open-source scientific and technical publishing system. \n\nLearn how to make your data communications more engaging and dynamic using Quarto Dashboard. Practical examples and simple explanations will guide you through the process, making it easy to understand and apply to your projects.\n\nhttps://cderv.github.io/pydata-paris-2024-quarto-dashboard/#/title-slide\n\nwww.pydata.org\n\nPyData is an educational program of NumFOCUS, a 501(c)3 non-profit organization in the United States. PyData provides a forum for the international community of users and developers of data analysis tools to share ideas and learn from each other. The global PyData network promotes discussion of best practices, new approaches, and emerging technologies for data management, processing, analytics, and visualization. PyData communities approach data science using many languages, including (but not limited to) Python, Julia, and R. \n\nPyData conferences aim to be accessible and community-driven, with novice to advanced level presentations. PyData tutorials and talks bring attendees the latest project features along with cutting-edge use cases.\n\n00:00 Welcome!\n00:10 Help us add time stamps or captions to this video! See the description for details.\n\nWant to help add timestamps to our YouTube videos to help with discoverability? Find out more here: https://github.com/numfocus/YouTubeVideoTimestamps",
  "duration": 1781,
  "language": "eng",
  "recorded": "2024-09-25",
  "related_urls": [
    {
      "label": "Conference Website",
      "url": "https://pydata.org/paris2024"
    },
    {
      "label": "https://github.com/numfocus/YouTubeVideoTimestamps",
      "url": "https://github.com/numfocus/YouTubeVideoTimestamps"
    },
    {
      "label": "https://cderv.github.io/pydata-paris-2024-quarto-dashboard/#/title-slide",
      "url": "https://cderv.github.io/pydata-paris-2024-quarto-dashboard/#/title-slide"
    }
  ],
  "speakers": [
    "TODO"
  ],
  "tags": [
    "Education",
    "Julia",
    "NumFOCUS",
    "Opensource",
    "PyData",
    "Python",
    "Tutorial",
    "coding",
    "how to program",
    "learn",
    "learn to code",
    "python 3",
    "scientific programming",
    "software"
  ],
  "thumbnail_url": "https://i.ytimg.com/vi/7Bw-Dg_xAos/sddefault.jpg",
  "title": "Christophe Dervieux - Exploring Quarto Dashboard for impactful and visual communication",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7Bw-Dg_xAos"
    }
  ]
}
